#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AkAudio

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "WwiseResourceLoader_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class AkAudio.AkPortalComponent
// 0x0200 (0x0450 - 0x0250)
class UAkPortalComponent final : public USceneComponent
{
public:
	bool                                          bDynamic;                                          // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAkAcousticPortalState                        InitialState;                                      // 0x0251(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_252[0x2];                                      // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InitialOcclusion;                                  // 0x0254(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ObstructionRefreshInterval;                        // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             ObstructionCollisionChannel;                       // 0x025C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25D[0x1F3];                                    // 0x025D(0x01F3)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DisablePortal();
	void EnablePortal();
	void SetDynamic(bool bInDynamic);
	void SetPortalOcclusion(float InPortalOcclusion);

	EAkAcousticPortalState GetCurrentState() const;
	float GetPortalOcclusion() const;
	class UPrimitiveComponent* GetPrimitiveParent() const;
	bool PortalPlacementValid() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AkPortalComponent">();
	}
	static class UAkPortalComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkPortalComponent>();
	}
};
static_assert(alignof(UAkPortalComponent) == 0x000008, "Wrong alignment on UAkPortalComponent");
static_assert(sizeof(UAkPortalComponent) == 0x000450, "Wrong size on UAkPortalComponent");
static_assert(offsetof(UAkPortalComponent, bDynamic) == 0x000250, "Member 'UAkPortalComponent::bDynamic' has a wrong offset!");
static_assert(offsetof(UAkPortalComponent, InitialState) == 0x000251, "Member 'UAkPortalComponent::InitialState' has a wrong offset!");
static_assert(offsetof(UAkPortalComponent, InitialOcclusion) == 0x000254, "Member 'UAkPortalComponent::InitialOcclusion' has a wrong offset!");
static_assert(offsetof(UAkPortalComponent, ObstructionRefreshInterval) == 0x000258, "Member 'UAkPortalComponent::ObstructionRefreshInterval' has a wrong offset!");
static_assert(offsetof(UAkPortalComponent, ObstructionCollisionChannel) == 0x00025C, "Member 'UAkPortalComponent::ObstructionCollisionChannel' has a wrong offset!");

// Class AkAudio.AkAcousticPortal
// 0x0010 (0x0310 - 0x0300)
class AAkAcousticPortal final : public AVolume
{
public:
	class UAkPortalComponent*                     Portal;                                            // 0x0300(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAkAcousticPortalState                        InitialState;                                      // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bRequiresStateMigration;                           // 0x0309(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30A[0x6];                                      // 0x030A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DisablePortal();
	void EnablePortal();

	EAkAcousticPortalState GetCurrentState() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AkAcousticPortal">();
	}
	static class AAkAcousticPortal* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAkAcousticPortal>();
	}
};
static_assert(alignof(AAkAcousticPortal) == 0x000008, "Wrong alignment on AAkAcousticPortal");
static_assert(sizeof(AAkAcousticPortal) == 0x000310, "Wrong size on AAkAcousticPortal");
static_assert(offsetof(AAkAcousticPortal, Portal) == 0x000300, "Member 'AAkAcousticPortal::Portal' has a wrong offset!");
static_assert(offsetof(AAkAcousticPortal, InitialState) == 0x000308, "Member 'AAkAcousticPortal::InitialState' has a wrong offset!");
static_assert(offsetof(AAkAcousticPortal, bRequiresStateMigration) == 0x000309, "Member 'AAkAcousticPortal::bRequiresStateMigration' has a wrong offset!");

// Class AkAudio.AkPlatformInitializationSettingsBase
// 0x0000 (0x0028 - 0x0028)
class UAkPlatformInitializationSettingsBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AkPlatformInitializationSettingsBase">();
	}
	static class UAkPlatformInitializationSettingsBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkPlatformInitializationSettingsBase>();
	}
};
static_assert(alignof(UAkPlatformInitializationSettingsBase) == 0x000008, "Wrong alignment on UAkPlatformInitializationSettingsBase");
static_assert(sizeof(UAkPlatformInitializationSettingsBase) == 0x000028, "Wrong size on UAkPlatformInitializationSettingsBase");

// Class AkAudio.AkPS5InitializationSettings
// 0x0118 (0x0140 - 0x0028)
class UAkPS5InitializationSettings : public UAkPlatformInitializationSettingsBase
{
public:
	struct FAkCommonInitializationSettings        CommonSettings;                                    // 0x0028(0x00A8)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkCommunicationSettingsWithSystemInitialization CommunicationSettings;                   // 0x00D0(0x0020)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkPS5AdvancedInitializationSettings   AdvancedSettings;                                  // 0x00F0(0x004C)(Edit, Config, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AkPS5InitializationSettings">();
	}
	static class UAkPS5InitializationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkPS5InitializationSettings>();
	}
};
static_assert(alignof(UAkPS5InitializationSettings) == 0x000008, "Wrong alignment on UAkPS5InitializationSettings");
static_assert(sizeof(UAkPS5InitializationSettings) == 0x000140, "Wrong size on UAkPS5InitializationSettings");
static_assert(offsetof(UAkPS5InitializationSettings, CommonSettings) == 0x000028, "Member 'UAkPS5InitializationSettings::CommonSettings' has a wrong offset!");
static_assert(offsetof(UAkPS5InitializationSettings, CommunicationSettings) == 0x0000D0, "Member 'UAkPS5InitializationSettings::CommunicationSettings' has a wrong offset!");
static_assert(offsetof(UAkPS5InitializationSettings, AdvancedSettings) == 0x0000F0, "Member 'UAkPS5InitializationSettings::AdvancedSettings' has a wrong offset!");

// Class AkAudio.AkDPXInitializationSettings
// 0x0000 (0x0140 - 0x0140)
class UAkDPXInitializationSettings final : public UAkPS5InitializationSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AkDPXInitializationSettings">();
	}
	static class UAkDPXInitializationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkDPXInitializationSettings>();
	}
};
static_assert(alignof(UAkDPXInitializationSettings) == 0x000008, "Wrong alignment on UAkDPXInitializationSettings");
static_assert(sizeof(UAkDPXInitializationSettings) == 0x000140, "Wrong size on UAkDPXInitializationSettings");

// Class AkAudio.AkAudioType
// 0x0028 (0x0050 - 0x0028)
class UAkAudioType : public UObject
{
public:
	bool                                          bAutoLoad;                                         // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        UserData;                                          // 0x0030(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void LoadData();
	void UnloadData(bool bAsync);

	int32 GetWwiseShortId() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AkAudioType">();
	}
	static class UAkAudioType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioType>();
	}
};
static_assert(alignof(UAkAudioType) == 0x000008, "Wrong alignment on UAkAudioType");
static_assert(sizeof(UAkAudioType) == 0x000050, "Wrong size on UAkAudioType");
static_assert(offsetof(UAkAudioType, bAutoLoad) == 0x000028, "Member 'UAkAudioType::bAutoLoad' has a wrong offset!");
static_assert(offsetof(UAkAudioType, UserData) == 0x000030, "Member 'UAkAudioType::UserData' has a wrong offset!");

// Class AkAudio.AkSettings
// 0x0400 (0x0428 - 0x0028)
class UAkSettings final : public UObject
{
public:
	uint8                                         MaxSimultaneousReverbVolumes;                      // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFilePath                              WwiseProjectPath;                                  // 0x0030(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         WwiseSoundDataFolder;                              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         RootOutputPath;                                    // 0x0050(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         GeneratedSoundBanksFolder;                         // 0x0060(0x0010)(ZeroConstructor, Config, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         WwiseStagingDirectory;                             // 0x0070(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSoundBanksTransfered;                             // 0x0080(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAssetsMigrated;                                   // 0x0081(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProjectMigrated;                                  // 0x0082(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoConnectToWAAPI;                               // 0x0083(0x0001)(ZeroConstructor, Config, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             DefaultOcclusionCollisionChannel;                  // 0x0084(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             DefaultFitToGeometryCollisionChannel;              // 0x0085(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<TSoftObjectPtr<class UPhysicalMaterial>, struct FAkGeometrySurfacePropertiesToMap> AkGeometryMap; // 0x0088(0x0050)(Config, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAkAcousticTexture>      DefaultAcousticTexture;                            // 0x00D8(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultTransmissionLoss;                           // 0x0100(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UDataTable>              GeometrySurfacePropertiesTable;                    // 0x0108(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GlobalDecayAbsorption;                             // 0x0130(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAkAuxBus>               DefaultReverbAuxBus;                               // 0x0138(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<float, TSoftObjectPtr<class UAkAuxBus>>  EnvironmentDecayAuxBusMap;                         // 0x0160(0x0050)(Config, UObjectWrapper, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDataTable>              ReverbAssignmentTable;                             // 0x01B0(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HFDampingName;                                     // 0x01D8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DecayEstimateName;                                 // 0x01E8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TimeToFirstReflectionName;                         // 0x01F8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAkRtpc>                 HFDampingRTPC;                                     // 0x0208(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAkRtpc>                 DecayEstimateRTPC;                                 // 0x0230(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAkRtpc>                 TimeToFirstReflectionRTPC;                         // 0x0258(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAkAudioEvent>           AudioInputEvent;                                   // 0x0280(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGuid, struct FAkAcousticTextureParams> AcousticTextureParamsMap;                    // 0x02A8(0x0050)(Config, Deprecated, NativeAccessSpecifierPublic)
	bool                                          SplitSwitchContainerMedia;                         // 0x02F8(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SplitMediaPerFolder;                               // 0x02F9(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseEventBasedPackaging;                            // 0x02FA(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2FB[0x5];                                      // 0x02FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CommandletCommitMessage;                           // 0x0300(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            UnrealCultureToWwiseCulture;                       // 0x0310(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	class FString                                 DefaultAssetCreationPath;                          // 0x0360(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAkInitBank>             InitBank;                                          // 0x0370(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAkUnrealAudioRouting                         AudioRouting;                                      // 0x0398(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWwiseSoundEngineEnabled;                          // 0x039C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWwiseAudioLinkEnabled;                            // 0x039D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAkAudioMixerEnabled;                              // 0x039E(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39F[0x1];                                      // 0x039F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultListenerScalingFactor;                      // 0x03A0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AskedToUseNewAssetManagement;                      // 0x03A4(0x0001)(ZeroConstructor, Config, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableMultiCoreRendering;                         // 0x03A5(0x0001)(ZeroConstructor, Config, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MigratedEnableMultiCoreRendering;                  // 0x03A6(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FixupRedirectorsDuringMigration;                   // 0x03A7(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         WwiseWindowsInstallationPath;                      // 0x03A8(0x0010)(ZeroConstructor, Config, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFilePath                              WwiseMacInstallationPath;                          // 0x03B8(0x0010)(ZeroConstructor, Config, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C8[0x50];                                     // 0x03C8(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             GeometrySurfacePropertiesKeepAlive;                // 0x0418(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_420[0x8];                                      // 0x0420(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AkSettings">();
	}
	static class UAkSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkSettings>();
	}
};
static_assert(alignof(UAkSettings) == 0x000008, "Wrong alignment on UAkSettings");
static_assert(sizeof(UAkSettings) == 0x000428, "Wrong size on UAkSettings");
static_assert(offsetof(UAkSettings, MaxSimultaneousReverbVolumes) == 0x000028, "Member 'UAkSettings::MaxSimultaneousReverbVolumes' has a wrong offset!");
static_assert(offsetof(UAkSettings, WwiseProjectPath) == 0x000030, "Member 'UAkSettings::WwiseProjectPath' has a wrong offset!");
static_assert(offsetof(UAkSettings, WwiseSoundDataFolder) == 0x000040, "Member 'UAkSettings::WwiseSoundDataFolder' has a wrong offset!");
static_assert(offsetof(UAkSettings, RootOutputPath) == 0x000050, "Member 'UAkSettings::RootOutputPath' has a wrong offset!");
static_assert(offsetof(UAkSettings, GeneratedSoundBanksFolder) == 0x000060, "Member 'UAkSettings::GeneratedSoundBanksFolder' has a wrong offset!");
static_assert(offsetof(UAkSettings, WwiseStagingDirectory) == 0x000070, "Member 'UAkSettings::WwiseStagingDirectory' has a wrong offset!");
static_assert(offsetof(UAkSettings, bSoundBanksTransfered) == 0x000080, "Member 'UAkSettings::bSoundBanksTransfered' has a wrong offset!");
static_assert(offsetof(UAkSettings, bAssetsMigrated) == 0x000081, "Member 'UAkSettings::bAssetsMigrated' has a wrong offset!");
static_assert(offsetof(UAkSettings, bProjectMigrated) == 0x000082, "Member 'UAkSettings::bProjectMigrated' has a wrong offset!");
static_assert(offsetof(UAkSettings, bAutoConnectToWAAPI) == 0x000083, "Member 'UAkSettings::bAutoConnectToWAAPI' has a wrong offset!");
static_assert(offsetof(UAkSettings, DefaultOcclusionCollisionChannel) == 0x000084, "Member 'UAkSettings::DefaultOcclusionCollisionChannel' has a wrong offset!");
static_assert(offsetof(UAkSettings, DefaultFitToGeometryCollisionChannel) == 0x000085, "Member 'UAkSettings::DefaultFitToGeometryCollisionChannel' has a wrong offset!");
static_assert(offsetof(UAkSettings, AkGeometryMap) == 0x000088, "Member 'UAkSettings::AkGeometryMap' has a wrong offset!");
static_assert(offsetof(UAkSettings, DefaultAcousticTexture) == 0x0000D8, "Member 'UAkSettings::DefaultAcousticTexture' has a wrong offset!");
static_assert(offsetof(UAkSettings, DefaultTransmissionLoss) == 0x000100, "Member 'UAkSettings::DefaultTransmissionLoss' has a wrong offset!");
static_assert(offsetof(UAkSettings, GeometrySurfacePropertiesTable) == 0x000108, "Member 'UAkSettings::GeometrySurfacePropertiesTable' has a wrong offset!");
static_assert(offsetof(UAkSettings, GlobalDecayAbsorption) == 0x000130, "Member 'UAkSettings::GlobalDecayAbsorption' has a wrong offset!");
static_assert(offsetof(UAkSettings, DefaultReverbAuxBus) == 0x000138, "Member 'UAkSettings::DefaultReverbAuxBus' has a wrong offset!");
static_assert(offsetof(UAkSettings, EnvironmentDecayAuxBusMap) == 0x000160, "Member 'UAkSettings::EnvironmentDecayAuxBusMap' has a wrong offset!");
static_assert(offsetof(UAkSettings, ReverbAssignmentTable) == 0x0001B0, "Member 'UAkSettings::ReverbAssignmentTable' has a wrong offset!");
static_assert(offsetof(UAkSettings, HFDampingName) == 0x0001D8, "Member 'UAkSettings::HFDampingName' has a wrong offset!");
static_assert(offsetof(UAkSettings, DecayEstimateName) == 0x0001E8, "Member 'UAkSettings::DecayEstimateName' has a wrong offset!");
static_assert(offsetof(UAkSettings, TimeToFirstReflectionName) == 0x0001F8, "Member 'UAkSettings::TimeToFirstReflectionName' has a wrong offset!");
static_assert(offsetof(UAkSettings, HFDampingRTPC) == 0x000208, "Member 'UAkSettings::HFDampingRTPC' has a wrong offset!");
static_assert(offsetof(UAkSettings, DecayEstimateRTPC) == 0x000230, "Member 'UAkSettings::DecayEstimateRTPC' has a wrong offset!");
static_assert(offsetof(UAkSettings, TimeToFirstReflectionRTPC) == 0x000258, "Member 'UAkSettings::TimeToFirstReflectionRTPC' has a wrong offset!");
static_assert(offsetof(UAkSettings, AudioInputEvent) == 0x000280, "Member 'UAkSettings::AudioInputEvent' has a wrong offset!");
static_assert(offsetof(UAkSettings, AcousticTextureParamsMap) == 0x0002A8, "Member 'UAkSettings::AcousticTextureParamsMap' has a wrong offset!");
static_assert(offsetof(UAkSettings, SplitSwitchContainerMedia) == 0x0002F8, "Member 'UAkSettings::SplitSwitchContainerMedia' has a wrong offset!");
static_assert(offsetof(UAkSettings, SplitMediaPerFolder) == 0x0002F9, "Member 'UAkSettings::SplitMediaPerFolder' has a wrong offset!");
static_assert(offsetof(UAkSettings, UseEventBasedPackaging) == 0x0002FA, "Member 'UAkSettings::UseEventBasedPackaging' has a wrong offset!");
static_assert(offsetof(UAkSettings, CommandletCommitMessage) == 0x000300, "Member 'UAkSettings::CommandletCommitMessage' has a wrong offset!");
static_assert(offsetof(UAkSettings, UnrealCultureToWwiseCulture) == 0x000310, "Member 'UAkSettings::UnrealCultureToWwiseCulture' has a wrong offset!");
static_assert(offsetof(UAkSettings, DefaultAssetCreationPath) == 0x000360, "Member 'UAkSettings::DefaultAssetCreationPath' has a wrong offset!");
static_assert(offsetof(UAkSettings, InitBank) == 0x000370, "Member 'UAkSettings::InitBank' has a wrong offset!");
static_assert(offsetof(UAkSettings, AudioRouting) == 0x000398, "Member 'UAkSettings::AudioRouting' has a wrong offset!");
static_assert(offsetof(UAkSettings, bWwiseSoundEngineEnabled) == 0x00039C, "Member 'UAkSettings::bWwiseSoundEngineEnabled' has a wrong offset!");
static_assert(offsetof(UAkSettings, bWwiseAudioLinkEnabled) == 0x00039D, "Member 'UAkSettings::bWwiseAudioLinkEnabled' has a wrong offset!");
static_assert(offsetof(UAkSettings, bAkAudioMixerEnabled) == 0x00039E, "Member 'UAkSettings::bAkAudioMixerEnabled' has a wrong offset!");
static_assert(offsetof(UAkSettings, DefaultListenerScalingFactor) == 0x0003A0, "Member 'UAkSettings::DefaultListenerScalingFactor' has a wrong offset!");
static_assert(offsetof(UAkSettings, AskedToUseNewAssetManagement) == 0x0003A4, "Member 'UAkSettings::AskedToUseNewAssetManagement' has a wrong offset!");
static_assert(offsetof(UAkSettings, bEnableMultiCoreRendering) == 0x0003A5, "Member 'UAkSettings::bEnableMultiCoreRendering' has a wrong offset!");
static_assert(offsetof(UAkSettings, MigratedEnableMultiCoreRendering) == 0x0003A6, "Member 'UAkSettings::MigratedEnableMultiCoreRendering' has a wrong offset!");
static_assert(offsetof(UAkSettings, FixupRedirectorsDuringMigration) == 0x0003A7, "Member 'UAkSettings::FixupRedirectorsDuringMigration' has a wrong offset!");
static_assert(offsetof(UAkSettings, WwiseWindowsInstallationPath) == 0x0003A8, "Member 'UAkSettings::WwiseWindowsInstallationPath' has a wrong offset!");
static_assert(offsetof(UAkSettings, WwiseMacInstallationPath) == 0x0003B8, "Member 'UAkSettings::WwiseMacInstallationPath' has a wrong offset!");
static_assert(offsetof(UAkSettings, GeometrySurfacePropertiesKeepAlive) == 0x000418, "Member 'UAkSettings::GeometrySurfacePropertiesKeepAlive' has a wrong offset!");

// Class AkAudio.AkAcousticTexture
// 0x0020 (0x0070 - 0x0050)
class UAkAcousticTexture final : public UAkAudioType
{
public:
	struct FWwiseAcousticTextureCookedData        AcousticTextureCookedData;                         // 0x0050(0x001C)(Edit, Transient, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AkAcousticTexture">();
	}
	static class UAkAcousticTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAcousticTexture>();
	}
};
static_assert(alignof(UAkAcousticTexture) == 0x000008, "Wrong alignment on UAkAcousticTexture");
static_assert(sizeof(UAkAcousticTexture) == 0x000070, "Wrong size on UAkAcousticTexture");
static_assert(offsetof(UAkAcousticTexture, AcousticTextureCookedData) == 0x000050, "Member 'UAkAcousticTexture::AcousticTextureCookedData' has a wrong offset!");

// Class AkAudio.AkTrigger
// 0x0010 (0x0060 - 0x0050)
class UAkTrigger final : public UAkAudioType
{
public:
	struct FWwiseTriggerCookedData                TriggerCookedData;                                 // 0x0050(0x000C)(Edit, Transient, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AkTrigger">();
	}
	static class UAkTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkTrigger>();
	}
};
static_assert(alignof(UAkTrigger) == 0x000008, "Wrong alignment on UAkTrigger");
static_assert(sizeof(UAkTrigger) == 0x000060, "Wrong size on UAkTrigger");
static_assert(offsetof(UAkTrigger, TriggerCookedData) == 0x000050, "Member 'UAkTrigger::TriggerCookedData' has a wrong offset!");

// Class AkAudio.AkAcousticTextureSetComponent
// 0x0018 (0x0268 - 0x0250)
#pragma pack(push, 0x1)
class alignas(0x08) UAkAcousticTextureSetComponent : public USceneComponent
{
public:
	uint8                                         Pad_250[0x18];                                     // 0x0250(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AkAcousticTextureSetComponent">();
	}
	static class UAkAcousticTextureSetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAcousticTextureSetComponent>();
	}
};
#pragma pack(pop)
static_assert(alignof(UAkAcousticTextureSetComponent) == 0x000008, "Wrong alignment on UAkAcousticTextureSetComponent");
static_assert(sizeof(UAkAcousticTextureSetComponent) == 0x000268, "Wrong size on UAkAcousticTextureSetComponent");

// Class AkAudio.AkAmbientSound
// 0x0040 (0x0308 - 0x02C8)
class AAkAmbientSound final : public AActor
{
public:
	class UAkAudioEvent*                          AkAudioEvent;                                      // 0x02C8(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkComponent*                           AkComponent;                                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StopWhenOwnerIsDestroyed;                          // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoPost;                                          // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2DA[0x2E];                                     // 0x02DA(0x002E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void StartAmbientSound();
	void StopAmbientSound();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AkAmbientSound">();
	}
	static class AAkAmbientSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAkAmbientSound>();
	}
};
static_assert(alignof(AAkAmbientSound) == 0x000008, "Wrong alignment on AAkAmbientSound");
static_assert(sizeof(AAkAmbientSound) == 0x000308, "Wrong size on AAkAmbientSound");
static_assert(offsetof(AAkAmbientSound, AkAudioEvent) == 0x0002C8, "Member 'AAkAmbientSound::AkAudioEvent' has a wrong offset!");
static_assert(offsetof(AAkAmbientSound, AkComponent) == 0x0002D0, "Member 'AAkAmbientSound::AkComponent' has a wrong offset!");
static_assert(offsetof(AAkAmbientSound, StopWhenOwnerIsDestroyed) == 0x0002D8, "Member 'AAkAmbientSound::StopWhenOwnerIsDestroyed' has a wrong offset!");
static_assert(offsetof(AAkAmbientSound, AutoPost) == 0x0002D9, "Member 'AAkAmbientSound::AutoPost' has a wrong offset!");

// Class AkAudio.AkSpatialAudioVolume
// 0x0018 (0x0318 - 0x0300)
class AAkSpatialAudioVolume : public AVolume
{
public:
	class UAkSurfaceReflectorSetComponent*        SurfaceReflectorSet;                               // 0x0300(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkLateReverbComponent*                 LateReverb;                                        // 0x0308(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkRoomComponent*                       Room;                                              // 0x0310(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AkSpatialAudioVolume">();
	}
	static class AAkSpatialAudioVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAkSpatialAudioVolume>();
	}
};
static_assert(alignof(AAkSpatialAudioVolume) == 0x000008, "Wrong alignment on AAkSpatialAudioVolume");
static_assert(sizeof(AAkSpatialAudioVolume) == 0x000318, "Wrong size on AAkSpatialAudioVolume");
static_assert(offsetof(AAkSpatialAudioVolume, SurfaceReflectorSet) == 0x000300, "Member 'AAkSpatialAudioVolume::SurfaceReflectorSet' has a wrong offset!");
static_assert(offsetof(AAkSpatialAudioVolume, LateReverb) == 0x000308, "Member 'AAkSpatialAudioVolume::LateReverb' has a wrong offset!");
static_assert(offsetof(AAkSpatialAudioVolume, Room) == 0x000310, "Member 'AAkSpatialAudioVolume::Room' has a wrong offset!");

// Class AkAudio.AkReverbZone
// 0x0000 (0x0318 - 0x0318)
class AAkReverbZone final : public AAkSpatialAudioVolume
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AkReverbZone">();
	}
	static class AAkReverbZone* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAkReverbZone>();
	}
};
static_assert(alignof(AAkReverbZone) == 0x000008, "Wrong alignment on AAkReverbZone");
static_assert(sizeof(AAkReverbZone) == 0x000318, "Wrong size on AAkReverbZone");

// Class AkAudio.AkAndroidInitializationSettings
// 0x0110 (0x0138 - 0x0028)
class UAkAndroidInitializationSettings final : public UAkPlatformInitializationSettingsBase
{
public:
	struct FAkCommonInitializationSettingsWithSampleRate CommonSettings;                             // 0x0028(0x00B0)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkCommunicationSettingsWithSystemInitialization CommunicationSettings;                   // 0x00D8(0x0020)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkAndroidAdvancedInitializationSettings AdvancedSettings;                                // 0x00F8(0x0040)(Edit, Config, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)

public:
	void MigrateMultiCoreRendering(bool NewValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AkAndroidInitializationSettings">();
	}
	static class UAkAndroidInitializationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAndroidInitializationSettings>();
	}
};
static_assert(alignof(UAkAndroidInitializationSettings) == 0x000008, "Wrong alignment on UAkAndroidInitializationSettings");
static_assert(sizeof(UAkAndroidInitializationSettings) == 0x000138, "Wrong size on UAkAndroidInitializationSettings");
static_assert(offsetof(UAkAndroidInitializationSettings, CommonSettings) == 0x000028, "Member 'UAkAndroidInitializationSettings::CommonSettings' has a wrong offset!");
static_assert(offsetof(UAkAndroidInitializationSettings, CommunicationSettings) == 0x0000D8, "Member 'UAkAndroidInitializationSettings::CommunicationSettings' has a wrong offset!");
static_assert(offsetof(UAkAndroidInitializationSettings, AdvancedSettings) == 0x0000F8, "Member 'UAkAndroidInitializationSettings::AdvancedSettings' has a wrong offset!");

// Class AkAudio.AkPlatformInfo
// 0x0048 (0x0070 - 0x0028)
class UAkPlatformInfo : public UObject
{
public:
	uint8                                         Pad_28[0x48];                                      // 0x0028(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AkPlatformInfo">();
	}
	static class UAkPlatformInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkPlatformInfo>();
	}
};
static_assert(alignof(UAkPlatformInfo) == 0x000008, "Wrong alignment on UAkPlatformInfo");
static_assert(sizeof(UAkPlatformInfo) == 0x000070, "Wrong size on UAkPlatformInfo");

// Class AkAudio.AkAndroidPlatformInfo
// 0x0000 (0x0070 - 0x0070)
class UAkAndroidPlatformInfo final : public UAkPlatformInfo
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AkAndroidPlatformInfo">();
	}
	static class UAkAndroidPlatformInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAndroidPlatformInfo>();
	}
};
static_assert(alignof(UAkAndroidPlatformInfo) == 0x000008, "Wrong alignment on UAkAndroidPlatformInfo");
static_assert(sizeof(UAkAndroidPlatformInfo) == 0x000070, "Wrong size on UAkAndroidPlatformInfo");

// Class AkAudio.AkSettingsPerUser
// 0x0068 (0x0090 - 0x0028)
class UAkSettingsPerUser final : public UObject
{
public:
	struct FDirectoryPath                         WwiseWindowsInstallationPath;                      // 0x0028(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFilePath                              WwiseMacInstallationPath;                          // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         RootOutputPathOverride;                            // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         GeneratedSoundBanksFolderOverride;                 // 0x0058(0x0010)(ZeroConstructor, Config, Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WaapiIPAddress;                                    // 0x0068(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        WaapiPort;                                         // 0x0078(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoConnectToWAAPI;                               // 0x007C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoSyncSelection;                                 // 0x007D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WaapiCallsTimeout;                                 // 0x0080(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        WaapiTranslatorTimeout;                            // 0x0084(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SuppressGeneratedSoundBanksPathWarnings;           // 0x0088(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SoundDataGenerationSkipLanguage;                   // 0x0089(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AskForWwiseAssetReload;                            // 0x008A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AkSettingsPerUser">();
	}
	static class UAkSettingsPerUser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkSettingsPerUser>();
	}
};
static_assert(alignof(UAkSettingsPerUser) == 0x000008, "Wrong alignment on UAkSettingsPerUser");
static_assert(sizeof(UAkSettingsPerUser) == 0x000090, "Wrong size on UAkSettingsPerUser");
static_assert(offsetof(UAkSettingsPerUser, WwiseWindowsInstallationPath) == 0x000028, "Member 'UAkSettingsPerUser::WwiseWindowsInstallationPath' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, WwiseMacInstallationPath) == 0x000038, "Member 'UAkSettingsPerUser::WwiseMacInstallationPath' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, RootOutputPathOverride) == 0x000048, "Member 'UAkSettingsPerUser::RootOutputPathOverride' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, GeneratedSoundBanksFolderOverride) == 0x000058, "Member 'UAkSettingsPerUser::GeneratedSoundBanksFolderOverride' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, WaapiIPAddress) == 0x000068, "Member 'UAkSettingsPerUser::WaapiIPAddress' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, WaapiPort) == 0x000078, "Member 'UAkSettingsPerUser::WaapiPort' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, bAutoConnectToWAAPI) == 0x00007C, "Member 'UAkSettingsPerUser::bAutoConnectToWAAPI' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, AutoSyncSelection) == 0x00007D, "Member 'UAkSettingsPerUser::AutoSyncSelection' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, WaapiCallsTimeout) == 0x000080, "Member 'UAkSettingsPerUser::WaapiCallsTimeout' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, WaapiTranslatorTimeout) == 0x000084, "Member 'UAkSettingsPerUser::WaapiTranslatorTimeout' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, SuppressGeneratedSoundBanksPathWarnings) == 0x000088, "Member 'UAkSettingsPerUser::SuppressGeneratedSoundBanksPathWarnings' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, SoundDataGenerationSkipLanguage) == 0x000089, "Member 'UAkSettingsPerUser::SoundDataGenerationSkipLanguage' has a wrong offset!");
static_assert(offsetof(UAkSettingsPerUser, AskForWwiseAssetReload) == 0x00008A, "Member 'UAkSettingsPerUser::AskForWwiseAssetReload' has a wrong offset!");

// Class AkAudio.AkAudioBank
// 0x0008 (0x0058 - 0x0050)
class UAkAudioBank final : public UAkAudioType
{
public:
	bool                                          AutoLoad;                                          // 0x0050(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AkAudioBank">();
	}
	static class UAkAudioBank* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioBank>();
	}
};
static_assert(alignof(UAkAudioBank) == 0x000008, "Wrong alignment on UAkAudioBank");
static_assert(sizeof(UAkAudioBank) == 0x000058, "Wrong size on UAkAudioBank");
static_assert(offsetof(UAkAudioBank, AutoLoad) == 0x000050, "Member 'UAkAudioBank::AutoLoad' has a wrong offset!");

// Class AkAudio.AkAudioDeviceShareSet
// 0x0010 (0x0060 - 0x0050)
class UAkAudioDeviceShareSet final : public UAkAudioType
{
public:
	struct FWwiseAudioDeviceShareSetCookedData    AudioDeviceShareSetCookedData;                     // 0x0050(0x000C)(Edit, Transient, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AkAudioDeviceShareSet">();
	}
	static class UAkAudioDeviceShareSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioDeviceShareSet>();
	}
};
static_assert(alignof(UAkAudioDeviceShareSet) == 0x000008, "Wrong alignment on UAkAudioDeviceShareSet");
static_assert(sizeof(UAkAudioDeviceShareSet) == 0x000060, "Wrong size on UAkAudioDeviceShareSet");
static_assert(offsetof(UAkAudioDeviceShareSet, AudioDeviceShareSetCookedData) == 0x000050, "Member 'UAkAudioDeviceShareSet::AudioDeviceShareSetCookedData' has a wrong offset!");

// Class AkAudio.AkAudioEvent
// 0x0080 (0x00D0 - 0x0050)
class UAkAudioEvent final : public UAkAudioType
{
public:
	float                                         MaxAttenuationRadius;                              // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsInfinite;                                        // 0x0054(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinimumDuration;                                   // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaximumDuration;                                   // 0x005C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWwiseLocalizedEventCookedData         EventCookedData;                                   // 0x0060(0x0060)(Edit, Transient, EditConst, NativeAccessSpecifierPublic)
	class UAkAudioBank*                           RequiredBank;                                      // 0x00C0(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 ExecuteAction(const EAkActionOnEventType ActionType, const class AActor* Actor, const int32 PlayingID, const int32 TransitionDuration, const EAkCurveInterpolation FadeCurve);
	int32 PostAtLocation(const struct FVector& Location, const struct FRotator& orientation, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& Callback, const int32 CallbackMask, const class UObject* WorldContextObject);
	int32 PostOnActor(const class AActor* Actor, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& Delegate, const int32 CallbackMask, const bool bStopWhenAttachedObjectDestroyed);
	int32 PostOnActorAndWait(const class AActor* Actor, const bool bStopWhenAttachedObjectDestroyed, const struct FLatentActionInfo& LatentActionInfo);
	int32 PostOnComponent(class UAkComponent* Component, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& Delegate, const int32 CallbackMask, const bool bStopWhenAttachedObjectDestroyed);
	int32 PostOnComponentAndWait(class UAkComponent* Component, const bool bStopWhenAttachedObjectDestroyed, const struct FLatentActionInfo& LatentActionInfo);
	int32 PostOnGameObject(class UAkGameObject* GameObject, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& Delegate, const int32 CallbackMask);
	int32 PostOnGameObjectAndWait(class UAkGameObject* GameObject, const struct FLatentActionInfo& LatentActionInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AkAudioEvent">();
	}
	static class UAkAudioEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioEvent>();
	}
};
static_assert(alignof(UAkAudioEvent) == 0x000008, "Wrong alignment on UAkAudioEvent");
static_assert(sizeof(UAkAudioEvent) == 0x0000D0, "Wrong size on UAkAudioEvent");
static_assert(offsetof(UAkAudioEvent, MaxAttenuationRadius) == 0x000050, "Member 'UAkAudioEvent::MaxAttenuationRadius' has a wrong offset!");
static_assert(offsetof(UAkAudioEvent, IsInfinite) == 0x000054, "Member 'UAkAudioEvent::IsInfinite' has a wrong offset!");
static_assert(offsetof(UAkAudioEvent, MinimumDuration) == 0x000058, "Member 'UAkAudioEvent::MinimumDuration' has a wrong offset!");
static_assert(offsetof(UAkAudioEvent, MaximumDuration) == 0x00005C, "Member 'UAkAudioEvent::MaximumDuration' has a wrong offset!");
static_assert(offsetof(UAkAudioEvent, EventCookedData) == 0x000060, "Member 'UAkAudioEvent::EventCookedData' has a wrong offset!");
static_assert(offsetof(UAkAudioEvent, RequiredBank) == 0x0000C0, "Member 'UAkAudioEvent::RequiredBank' has a wrong offset!");

// Class AkAudio.AkGameObject
// 0x0018 (0x0268 - 0x0250)
#pragma pack(push, 0x1)
class alignas(0x08) UAkGameObject : public USceneComponent
{
public:
	float                                         AttenuationScalingFactor;                          // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          AkAudioEvent;                                      // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_260[0x2];                                      // 0x0260(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAttenuationScalingMigrated;                       // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_263[0x5];                                      // 0x0263(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 PostAkEvent(class UAkAudioEvent* AkEvent, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback);
	void PostAkEventAsync(const class UObject* WorldContextObject, class UAkAudioEvent* AkEvent, int32* PlayingID, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback, const struct FLatentActionInfo& LatentInfo);
	int32 PostAssociatedAkEvent(int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback);
	void PostAssociatedAkEventAsync(const class UObject* WorldContextObject, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback, const struct FLatentActionInfo& LatentInfo, int32* PlayingID);
	void SetAttenuationScalingFactor(float InAttenuationScalingFactor);
	void Stop();

	float GetAttenuationScalingFactor() const;
	void GetRTPCValue(class UAkRtpc* RTPCValue, ERTPCValueType InputValueType, float* Value, ERTPCValueType* OutputValueType, const class FString& RTPC, int32 PlayingID) const;
	void SetRTPCValue(class UAkRtpc* RTPCValue, float Value, int32 InterpolationTimeMs, const class FString& RTPC) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AkGameObject">();
	}
	static class UAkGameObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkGameObject>();
	}
};
#pragma pack(pop)
static_assert(alignof(UAkGameObject) == 0x000008, "Wrong alignment on UAkGameObject");
static_assert(sizeof(UAkGameObject) == 0x000268, "Wrong size on UAkGameObject");
static_assert(offsetof(UAkGameObject, AttenuationScalingFactor) == 0x000250, "Member 'UAkGameObject::AttenuationScalingFactor' has a wrong offset!");
static_assert(offsetof(UAkGameObject, AkAudioEvent) == 0x000258, "Member 'UAkGameObject::AkAudioEvent' has a wrong offset!");
static_assert(offsetof(UAkGameObject, bAttenuationScalingMigrated) == 0x000262, "Member 'UAkGameObject::bAttenuationScalingMigrated' has a wrong offset!");

// Class AkAudio.AkSurfaceReflectorSetComponent
// 0x0038 (0x02A0 - 0x0268)
class UAkSurfaceReflectorSetComponent final : public UAkAcousticTextureSetComponent
{
public:
	bool                                          bEnableSurfaceReflectors;                          // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkSurfacePoly>                 AcousticPolys;                                     // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bEnableDiffraction;                                // 0x0280(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableDiffractionOnBoundaryEdges;                 // 0x0281(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBypassPortalSubtraction;                          // 0x0282(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSolid;                                            // 0x0283(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_284[0x1C];                                     // 0x0284(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RemoveSurfaceReflectorSet();
	void SendSurfaceReflectorSet();
	void SetAcousticTexture(TArray<int32>& InSurfaceIndexesToEdit, class UAkAcousticTexture* InAcousticTexture, bool bInEnableSurface);
	void SetEnable(bool bInEnable);
	void SetEnableDiffraction(bool bInEnableDiffraction, bool bInEnableDiffractionOnBoundaryEdges);
	void SetEnableSurface(TArray<int32>& InSurfaceIndexesToEdit, bool bInEnableSurface);
	void SetSurfaceProperties(TArray<int32>& InSurfaceIndexesToEdit, const struct FAkSurfacePoly& InSurfaceProperties);
	void SetTransmissionLoss(TArray<int32>& InSurfaceIndexesToEdit, float InTransmissionLoss, bool bInEnableSurface);
	void UpdateAcousticProperties(const TArray<struct FAkSurfacePoly>& in_AcousticPolys);
	void UpdateSurfaceReflectorSet();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AkSurfaceReflectorSetComponent">();
	}
	static class UAkSurfaceReflectorSetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkSurfaceReflectorSetComponent>();
	}
};
static_assert(alignof(UAkSurfaceReflectorSetComponent) == 0x000008, "Wrong alignment on UAkSurfaceReflectorSetComponent");
static_assert(sizeof(UAkSurfaceReflectorSetComponent) == 0x0002A0, "Wrong size on UAkSurfaceReflectorSetComponent");
static_assert(offsetof(UAkSurfaceReflectorSetComponent, bEnableSurfaceReflectors) == 0x000268, "Member 'UAkSurfaceReflectorSetComponent::bEnableSurfaceReflectors' has a wrong offset!");
static_assert(offsetof(UAkSurfaceReflectorSetComponent, AcousticPolys) == 0x000270, "Member 'UAkSurfaceReflectorSetComponent::AcousticPolys' has a wrong offset!");
static_assert(offsetof(UAkSurfaceReflectorSetComponent, bEnableDiffraction) == 0x000280, "Member 'UAkSurfaceReflectorSetComponent::bEnableDiffraction' has a wrong offset!");
static_assert(offsetof(UAkSurfaceReflectorSetComponent, bEnableDiffractionOnBoundaryEdges) == 0x000281, "Member 'UAkSurfaceReflectorSetComponent::bEnableDiffractionOnBoundaryEdges' has a wrong offset!");
static_assert(offsetof(UAkSurfaceReflectorSetComponent, bBypassPortalSubtraction) == 0x000282, "Member 'UAkSurfaceReflectorSetComponent::bBypassPortalSubtraction' has a wrong offset!");
static_assert(offsetof(UAkSurfaceReflectorSetComponent, bSolid) == 0x000283, "Member 'UAkSurfaceReflectorSetComponent::bSolid' has a wrong offset!");

// Class AkAudio.AkComponent
// 0x01F0 (0x0458 - 0x0268)
#pragma pack(push, 0x1)
class alignas(0x08) UAkComponent : public UAkGameObject
{
public:
	bool                                          bUseSpatialAudio;                                  // 0x0268(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	EAkCollisionChannel                           OcclusionCollisionChannel;                         // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OcclusionRefreshInterval;                          // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
