#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AkAudio

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "WwiseObjectUtils_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AkAudio.AkPortalComponent.SetDynamic
// 0x0001 (0x0001 - 0x0000)
struct AkPortalComponent_SetDynamic final
{
public:
	bool                                          bInDynamic;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkPortalComponent_SetDynamic) == 0x000001, "Wrong alignment on AkPortalComponent_SetDynamic");
static_assert(sizeof(AkPortalComponent_SetDynamic) == 0x000001, "Wrong size on AkPortalComponent_SetDynamic");
static_assert(offsetof(AkPortalComponent_SetDynamic, bInDynamic) == 0x000000, "Member 'AkPortalComponent_SetDynamic::bInDynamic' has a wrong offset!");

// Function AkAudio.AkPortalComponent.SetPortalOcclusion
// 0x0004 (0x0004 - 0x0000)
struct AkPortalComponent_SetPortalOcclusion final
{
public:
	float                                         InPortalOcclusion;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkPortalComponent_SetPortalOcclusion) == 0x000004, "Wrong alignment on AkPortalComponent_SetPortalOcclusion");
static_assert(sizeof(AkPortalComponent_SetPortalOcclusion) == 0x000004, "Wrong size on AkPortalComponent_SetPortalOcclusion");
static_assert(offsetof(AkPortalComponent_SetPortalOcclusion, InPortalOcclusion) == 0x000000, "Member 'AkPortalComponent_SetPortalOcclusion::InPortalOcclusion' has a wrong offset!");

// Function AkAudio.AkPortalComponent.GetCurrentState
// 0x0001 (0x0001 - 0x0000)
struct AkPortalComponent_GetCurrentState final
{
public:
	EAkAcousticPortalState                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkPortalComponent_GetCurrentState) == 0x000001, "Wrong alignment on AkPortalComponent_GetCurrentState");
static_assert(sizeof(AkPortalComponent_GetCurrentState) == 0x000001, "Wrong size on AkPortalComponent_GetCurrentState");
static_assert(offsetof(AkPortalComponent_GetCurrentState, ReturnValue) == 0x000000, "Member 'AkPortalComponent_GetCurrentState::ReturnValue' has a wrong offset!");

// Function AkAudio.AkPortalComponent.GetPortalOcclusion
// 0x0004 (0x0004 - 0x0000)
struct AkPortalComponent_GetPortalOcclusion final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkPortalComponent_GetPortalOcclusion) == 0x000004, "Wrong alignment on AkPortalComponent_GetPortalOcclusion");
static_assert(sizeof(AkPortalComponent_GetPortalOcclusion) == 0x000004, "Wrong size on AkPortalComponent_GetPortalOcclusion");
static_assert(offsetof(AkPortalComponent_GetPortalOcclusion, ReturnValue) == 0x000000, "Member 'AkPortalComponent_GetPortalOcclusion::ReturnValue' has a wrong offset!");

// Function AkAudio.AkPortalComponent.GetPrimitiveParent
// 0x0008 (0x0008 - 0x0000)
struct AkPortalComponent_GetPrimitiveParent final
{
public:
	class UPrimitiveComponent*                    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkPortalComponent_GetPrimitiveParent) == 0x000008, "Wrong alignment on AkPortalComponent_GetPrimitiveParent");
static_assert(sizeof(AkPortalComponent_GetPrimitiveParent) == 0x000008, "Wrong size on AkPortalComponent_GetPrimitiveParent");
static_assert(offsetof(AkPortalComponent_GetPrimitiveParent, ReturnValue) == 0x000000, "Member 'AkPortalComponent_GetPrimitiveParent::ReturnValue' has a wrong offset!");

// Function AkAudio.AkPortalComponent.PortalPlacementValid
// 0x0001 (0x0001 - 0x0000)
struct AkPortalComponent_PortalPlacementValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkPortalComponent_PortalPlacementValid) == 0x000001, "Wrong alignment on AkPortalComponent_PortalPlacementValid");
static_assert(sizeof(AkPortalComponent_PortalPlacementValid) == 0x000001, "Wrong size on AkPortalComponent_PortalPlacementValid");
static_assert(offsetof(AkPortalComponent_PortalPlacementValid, ReturnValue) == 0x000000, "Member 'AkPortalComponent_PortalPlacementValid::ReturnValue' has a wrong offset!");

// Function AkAudio.AkAcousticPortal.GetCurrentState
// 0x0001 (0x0001 - 0x0000)
struct AkAcousticPortal_GetCurrentState final
{
public:
	EAkAcousticPortalState                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkAcousticPortal_GetCurrentState) == 0x000001, "Wrong alignment on AkAcousticPortal_GetCurrentState");
static_assert(sizeof(AkAcousticPortal_GetCurrentState) == 0x000001, "Wrong size on AkAcousticPortal_GetCurrentState");
static_assert(offsetof(AkAcousticPortal_GetCurrentState, ReturnValue) == 0x000000, "Member 'AkAcousticPortal_GetCurrentState::ReturnValue' has a wrong offset!");

// Function AkAudio.AkAudioType.UnloadData
// 0x0001 (0x0001 - 0x0000)
struct AkAudioType_UnloadData final
{
public:
	bool                                          bAsync;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkAudioType_UnloadData) == 0x000001, "Wrong alignment on AkAudioType_UnloadData");
static_assert(sizeof(AkAudioType_UnloadData) == 0x000001, "Wrong size on AkAudioType_UnloadData");
static_assert(offsetof(AkAudioType_UnloadData, bAsync) == 0x000000, "Member 'AkAudioType_UnloadData::bAsync' has a wrong offset!");

// Function AkAudio.AkAudioType.GetWwiseShortId
// 0x0004 (0x0004 - 0x0000)
struct AkAudioType_GetWwiseShortId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkAudioType_GetWwiseShortId) == 0x000004, "Wrong alignment on AkAudioType_GetWwiseShortId");
static_assert(sizeof(AkAudioType_GetWwiseShortId) == 0x000004, "Wrong size on AkAudioType_GetWwiseShortId");
static_assert(offsetof(AkAudioType_GetWwiseShortId, ReturnValue) == 0x000000, "Member 'AkAudioType_GetWwiseShortId::ReturnValue' has a wrong offset!");

// Function AkAudio.AkAndroidInitializationSettings.MigrateMultiCoreRendering
// 0x0001 (0x0001 - 0x0000)
struct AkAndroidInitializationSettings_MigrateMultiCoreRendering final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkAndroidInitializationSettings_MigrateMultiCoreRendering) == 0x000001, "Wrong alignment on AkAndroidInitializationSettings_MigrateMultiCoreRendering");
static_assert(sizeof(AkAndroidInitializationSettings_MigrateMultiCoreRendering) == 0x000001, "Wrong size on AkAndroidInitializationSettings_MigrateMultiCoreRendering");
static_assert(offsetof(AkAndroidInitializationSettings_MigrateMultiCoreRendering, NewValue) == 0x000000, "Member 'AkAndroidInitializationSettings_MigrateMultiCoreRendering::NewValue' has a wrong offset!");

// Function AkAudio.AkAudioEvent.ExecuteAction
// 0x0020 (0x0020 - 0x0000)
struct AkAudioEvent_ExecuteAction final
{
public:
	EAkActionOnEventType                          ActionType;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           Actor;                                             // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayingID;                                         // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TransitionDuration;                                // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAkCurveInterpolation                         FadeCurve;                                         // 0x0018(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkAudioEvent_ExecuteAction) == 0x000008, "Wrong alignment on AkAudioEvent_ExecuteAction");
static_assert(sizeof(AkAudioEvent_ExecuteAction) == 0x000020, "Wrong size on AkAudioEvent_ExecuteAction");
static_assert(offsetof(AkAudioEvent_ExecuteAction, ActionType) == 0x000000, "Member 'AkAudioEvent_ExecuteAction::ActionType' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_ExecuteAction, Actor) == 0x000008, "Member 'AkAudioEvent_ExecuteAction::Actor' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_ExecuteAction, PlayingID) == 0x000010, "Member 'AkAudioEvent_ExecuteAction::PlayingID' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_ExecuteAction, TransitionDuration) == 0x000014, "Member 'AkAudioEvent_ExecuteAction::TransitionDuration' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_ExecuteAction, FadeCurve) == 0x000018, "Member 'AkAudioEvent_ExecuteAction::FadeCurve' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_ExecuteAction, ReturnValue) == 0x00001C, "Member 'AkAudioEvent_ExecuteAction::ReturnValue' has a wrong offset!");

// Function AkAudio.AkAudioEvent.PostAtLocation
// 0x0058 (0x0058 - 0x0000)
struct AkAudioEvent_PostAtLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               orientation;                                       // 0x0018(0x0018)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Callback;     // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CallbackMask;                                      // 0x0040(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UObject*                          WorldContextObject;                                // 0x0048(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0050(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AkAudioEvent_PostAtLocation) == 0x000008, "Wrong alignment on AkAudioEvent_PostAtLocation");
static_assert(sizeof(AkAudioEvent_PostAtLocation) == 0x000058, "Wrong size on AkAudioEvent_PostAtLocation");
static_assert(offsetof(AkAudioEvent_PostAtLocation, Location) == 0x000000, "Member 'AkAudioEvent_PostAtLocation::Location' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostAtLocation, orientation) == 0x000018, "Member 'AkAudioEvent_PostAtLocation::orientation' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostAtLocation, Callback) == 0x000030, "Member 'AkAudioEvent_PostAtLocation::Callback' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostAtLocation, CallbackMask) == 0x000040, "Member 'AkAudioEvent_PostAtLocation::CallbackMask' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostAtLocation, WorldContextObject) == 0x000048, "Member 'AkAudioEvent_PostAtLocation::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostAtLocation, ReturnValue) == 0x000050, "Member 'AkAudioEvent_PostAtLocation::ReturnValue' has a wrong offset!");

// Function AkAudio.AkAudioEvent.PostOnActor
// 0x0028 (0x0028 - 0x0000)
struct AkAudioEvent_PostOnActor final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Delegate;     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CallbackMask;                                      // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopWhenAttachedObjectDestroyed;                  // 0x001C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AkAudioEvent_PostOnActor) == 0x000008, "Wrong alignment on AkAudioEvent_PostOnActor");
static_assert(sizeof(AkAudioEvent_PostOnActor) == 0x000028, "Wrong size on AkAudioEvent_PostOnActor");
static_assert(offsetof(AkAudioEvent_PostOnActor, Actor) == 0x000000, "Member 'AkAudioEvent_PostOnActor::Actor' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostOnActor, Delegate) == 0x000008, "Member 'AkAudioEvent_PostOnActor::Delegate' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostOnActor, CallbackMask) == 0x000018, "Member 'AkAudioEvent_PostOnActor::CallbackMask' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostOnActor, bStopWhenAttachedObjectDestroyed) == 0x00001C, "Member 'AkAudioEvent_PostOnActor::bStopWhenAttachedObjectDestroyed' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostOnActor, ReturnValue) == 0x000020, "Member 'AkAudioEvent_PostOnActor::ReturnValue' has a wrong offset!");

// Function AkAudio.AkAudioEvent.PostOnActorAndWait
// 0x0030 (0x0030 - 0x0000)
struct AkAudioEvent_PostOnActorAndWait final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopWhenAttachedObjectDestroyed;                  // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLatentActionInfo                      LatentActionInfo;                                  // 0x0010(0x0018)(ConstParm, Parm, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AkAudioEvent_PostOnActorAndWait) == 0x000008, "Wrong alignment on AkAudioEvent_PostOnActorAndWait");
static_assert(sizeof(AkAudioEvent_PostOnActorAndWait) == 0x000030, "Wrong size on AkAudioEvent_PostOnActorAndWait");
static_assert(offsetof(AkAudioEvent_PostOnActorAndWait, Actor) == 0x000000, "Member 'AkAudioEvent_PostOnActorAndWait::Actor' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostOnActorAndWait, bStopWhenAttachedObjectDestroyed) == 0x000008, "Member 'AkAudioEvent_PostOnActorAndWait::bStopWhenAttachedObjectDestroyed' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostOnActorAndWait, LatentActionInfo) == 0x000010, "Member 'AkAudioEvent_PostOnActorAndWait::LatentActionInfo' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostOnActorAndWait, ReturnValue) == 0x000028, "Member 'AkAudioEvent_PostOnActorAndWait::ReturnValue' has a wrong offset!");

// Function AkAudio.AkAudioEvent.PostOnComponent
// 0x0028 (0x0028 - 0x0000)
struct AkAudioEvent_PostOnComponent final
{
public:
	class UAkComponent*                           Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Delegate;     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CallbackMask;                                      // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopWhenAttachedObjectDestroyed;                  // 0x001C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AkAudioEvent_PostOnComponent) == 0x000008, "Wrong alignment on AkAudioEvent_PostOnComponent");
static_assert(sizeof(AkAudioEvent_PostOnComponent) == 0x000028, "Wrong size on AkAudioEvent_PostOnComponent");
static_assert(offsetof(AkAudioEvent_PostOnComponent, Component) == 0x000000, "Member 'AkAudioEvent_PostOnComponent::Component' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostOnComponent, Delegate) == 0x000008, "Member 'AkAudioEvent_PostOnComponent::Delegate' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostOnComponent, CallbackMask) == 0x000018, "Member 'AkAudioEvent_PostOnComponent::CallbackMask' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostOnComponent, bStopWhenAttachedObjectDestroyed) == 0x00001C, "Member 'AkAudioEvent_PostOnComponent::bStopWhenAttachedObjectDestroyed' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostOnComponent, ReturnValue) == 0x000020, "Member 'AkAudioEvent_PostOnComponent::ReturnValue' has a wrong offset!");

// Function AkAudio.AkAudioEvent.PostOnComponentAndWait
// 0x0030 (0x0030 - 0x0000)
struct AkAudioEvent_PostOnComponentAndWait final
{
public:
	class UAkComponent*                           Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopWhenAttachedObjectDestroyed;                  // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLatentActionInfo                      LatentActionInfo;                                  // 0x0010(0x0018)(ConstParm, Parm, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AkAudioEvent_PostOnComponentAndWait) == 0x000008, "Wrong alignment on AkAudioEvent_PostOnComponentAndWait");
static_assert(sizeof(AkAudioEvent_PostOnComponentAndWait) == 0x000030, "Wrong size on AkAudioEvent_PostOnComponentAndWait");
static_assert(offsetof(AkAudioEvent_PostOnComponentAndWait, Component) == 0x000000, "Member 'AkAudioEvent_PostOnComponentAndWait::Component' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostOnComponentAndWait, bStopWhenAttachedObjectDestroyed) == 0x000008, "Member 'AkAudioEvent_PostOnComponentAndWait::bStopWhenAttachedObjectDestroyed' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostOnComponentAndWait, LatentActionInfo) == 0x000010, "Member 'AkAudioEvent_PostOnComponentAndWait::LatentActionInfo' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostOnComponentAndWait, ReturnValue) == 0x000028, "Member 'AkAudioEvent_PostOnComponentAndWait::ReturnValue' has a wrong offset!");

// Function AkAudio.AkAudioEvent.PostOnGameObject
// 0x0020 (0x0020 - 0x0000)
struct AkAudioEvent_PostOnGameObject final
{
public:
	class UAkGameObject*                          GameObject;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Delegate;     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CallbackMask;                                      // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkAudioEvent_PostOnGameObject) == 0x000008, "Wrong alignment on AkAudioEvent_PostOnGameObject");
static_assert(sizeof(AkAudioEvent_PostOnGameObject) == 0x000020, "Wrong size on AkAudioEvent_PostOnGameObject");
static_assert(offsetof(AkAudioEvent_PostOnGameObject, GameObject) == 0x000000, "Member 'AkAudioEvent_PostOnGameObject::GameObject' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostOnGameObject, Delegate) == 0x000008, "Member 'AkAudioEvent_PostOnGameObject::Delegate' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostOnGameObject, CallbackMask) == 0x000018, "Member 'AkAudioEvent_PostOnGameObject::CallbackMask' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostOnGameObject, ReturnValue) == 0x00001C, "Member 'AkAudioEvent_PostOnGameObject::ReturnValue' has a wrong offset!");

// Function AkAudio.AkAudioEvent.PostOnGameObjectAndWait
// 0x0028 (0x0028 - 0x0000)
struct AkAudioEvent_PostOnGameObjectAndWait final
{
public:
	class UAkGameObject*                          GameObject;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentActionInfo;                                  // 0x0008(0x0018)(ConstParm, Parm, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AkAudioEvent_PostOnGameObjectAndWait) == 0x000008, "Wrong alignment on AkAudioEvent_PostOnGameObjectAndWait");
static_assert(sizeof(AkAudioEvent_PostOnGameObjectAndWait) == 0x000028, "Wrong size on AkAudioEvent_PostOnGameObjectAndWait");
static_assert(offsetof(AkAudioEvent_PostOnGameObjectAndWait, GameObject) == 0x000000, "Member 'AkAudioEvent_PostOnGameObjectAndWait::GameObject' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostOnGameObjectAndWait, LatentActionInfo) == 0x000008, "Member 'AkAudioEvent_PostOnGameObjectAndWait::LatentActionInfo' has a wrong offset!");
static_assert(offsetof(AkAudioEvent_PostOnGameObjectAndWait, ReturnValue) == 0x000020, "Member 'AkAudioEvent_PostOnGameObjectAndWait::ReturnValue' has a wrong offset!");

// Function AkAudio.AkGameObject.PostAkEvent
// 0x0020 (0x0020 - 0x0000)
struct AkGameObject_PostAkEvent final
{
public:
	class UAkAudioEvent*                          AkEvent;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CallbackMask;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> PostEventCallback; // 0x000C(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkGameObject_PostAkEvent) == 0x000008, "Wrong alignment on AkGameObject_PostAkEvent");
static_assert(sizeof(AkGameObject_PostAkEvent) == 0x000020, "Wrong size on AkGameObject_PostAkEvent");
static_assert(offsetof(AkGameObject_PostAkEvent, AkEvent) == 0x000000, "Member 'AkGameObject_PostAkEvent::AkEvent' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAkEvent, CallbackMask) == 0x000008, "Member 'AkGameObject_PostAkEvent::CallbackMask' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAkEvent, PostEventCallback) == 0x00000C, "Member 'AkGameObject_PostAkEvent::PostEventCallback' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAkEvent, ReturnValue) == 0x00001C, "Member 'AkGameObject_PostAkEvent::ReturnValue' has a wrong offset!");

// Function AkAudio.AkGameObject.PostAkEventAsync
// 0x0040 (0x0040 - 0x0000)
struct AkGameObject_PostAkEventAsync final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          AkEvent;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayingID;                                         // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CallbackMask;                                      // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> PostEventCallback; // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0028(0x0018)(Parm, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkGameObject_PostAkEventAsync) == 0x000008, "Wrong alignment on AkGameObject_PostAkEventAsync");
static_assert(sizeof(AkGameObject_PostAkEventAsync) == 0x000040, "Wrong size on AkGameObject_PostAkEventAsync");
static_assert(offsetof(AkGameObject_PostAkEventAsync, WorldContextObject) == 0x000000, "Member 'AkGameObject_PostAkEventAsync::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAkEventAsync, AkEvent) == 0x000008, "Member 'AkGameObject_PostAkEventAsync::AkEvent' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAkEventAsync, PlayingID) == 0x000010, "Member 'AkGameObject_PostAkEventAsync::PlayingID' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAkEventAsync, CallbackMask) == 0x000014, "Member 'AkGameObject_PostAkEventAsync::CallbackMask' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAkEventAsync, PostEventCallback) == 0x000018, "Member 'AkGameObject_PostAkEventAsync::PostEventCallback' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAkEventAsync, LatentInfo) == 0x000028, "Member 'AkGameObject_PostAkEventAsync::LatentInfo' has a wrong offset!");

// Function AkAudio.AkGameObject.PostAssociatedAkEvent
// 0x0018 (0x0018 - 0x0000)
struct AkGameObject_PostAssociatedAkEvent final
{
public:
	int32                                         CallbackMask;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> PostEventCallback; // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkGameObject_PostAssociatedAkEvent) == 0x000004, "Wrong alignment on AkGameObject_PostAssociatedAkEvent");
static_assert(sizeof(AkGameObject_PostAssociatedAkEvent) == 0x000018, "Wrong size on AkGameObject_PostAssociatedAkEvent");
static_assert(offsetof(AkGameObject_PostAssociatedAkEvent, CallbackMask) == 0x000000, "Member 'AkGameObject_PostAssociatedAkEvent::CallbackMask' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAssociatedAkEvent, PostEventCallback) == 0x000004, "Member 'AkGameObject_PostAssociatedAkEvent::PostEventCallback' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAssociatedAkEvent, ReturnValue) == 0x000014, "Member 'AkGameObject_PostAssociatedAkEvent::ReturnValue' has a wrong offset!");

// Function AkAudio.AkGameObject.PostAssociatedAkEventAsync
// 0x0040 (0x0040 - 0x0000)
struct AkGameObject_PostAssociatedAkEventAsync final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CallbackMask;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> PostEventCallback; // 0x000C(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0020(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         PlayingID;                                         // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AkGameObject_PostAssociatedAkEventAsync) == 0x000008, "Wrong alignment on AkGameObject_PostAssociatedAkEventAsync");
static_assert(sizeof(AkGameObject_PostAssociatedAkEventAsync) == 0x000040, "Wrong size on AkGameObject_PostAssociatedAkEventAsync");
static_assert(offsetof(AkGameObject_PostAssociatedAkEventAsync, WorldContextObject) == 0x000000, "Member 'AkGameObject_PostAssociatedAkEventAsync::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAssociatedAkEventAsync, CallbackMask) == 0x000008, "Member 'AkGameObject_PostAssociatedAkEventAsync::CallbackMask' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAssociatedAkEventAsync, PostEventCallback) == 0x00000C, "Member 'AkGameObject_PostAssociatedAkEventAsync::PostEventCallback' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAssociatedAkEventAsync, LatentInfo) == 0x000020, "Member 'AkGameObject_PostAssociatedAkEventAsync::LatentInfo' has a wrong offset!");
static_assert(offsetof(AkGameObject_PostAssociatedAkEventAsync, PlayingID) == 0x000038, "Member 'AkGameObject_PostAssociatedAkEventAsync::PlayingID' has a wrong offset!");

// Function AkAudio.AkGameObject.SetAttenuationScalingFactor
// 0x0004 (0x0004 - 0x0000)
struct AkGameObject_SetAttenuationScalingFactor final
{
public:
	float                                         InAttenuationScalingFactor;                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkGameObject_SetAttenuationScalingFactor) == 0x000004, "Wrong alignment on AkGameObject_SetAttenuationScalingFactor");
static_assert(sizeof(AkGameObject_SetAttenuationScalingFactor) == 0x000004, "Wrong size on AkGameObject_SetAttenuationScalingFactor");
static_assert(offsetof(AkGameObject_SetAttenuationScalingFactor, InAttenuationScalingFactor) == 0x000000, "Member 'AkGameObject_SetAttenuationScalingFactor::InAttenuationScalingFactor' has a wrong offset!");

// Function AkAudio.AkGameObject.GetAttenuationScalingFactor
// 0x0004 (0x0004 - 0x0000)
struct AkGameObject_GetAttenuationScalingFactor final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkGameObject_GetAttenuationScalingFactor) == 0x000004, "Wrong alignment on AkGameObject_GetAttenuationScalingFactor");
static_assert(sizeof(AkGameObject_GetAttenuationScalingFactor) == 0x000004, "Wrong size on AkGameObject_GetAttenuationScalingFactor");
static_assert(offsetof(AkGameObject_GetAttenuationScalingFactor, ReturnValue) == 0x000000, "Member 'AkGameObject_GetAttenuationScalingFactor::ReturnValue' has a wrong offset!");

// Function AkAudio.AkGameObject.GetRTPCValue
// 0x0030 (0x0030 - 0x0000)
struct AkGameObject_GetRTPCValue final
{
public:
	class UAkRtpc*                                RTPCValue;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERTPCValueType                                InputValueType;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERTPCValueType                                OutputValueType;                                   // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RTPC;                                              // 0x0018(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayingID;                                         // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AkGameObject_GetRTPCValue) == 0x000008, "Wrong alignment on AkGameObject_GetRTPCValue");
static_assert(sizeof(AkGameObject_GetRTPCValue) == 0x000030, "Wrong size on AkGameObject_GetRTPCValue");
static_assert(offsetof(AkGameObject_GetRTPCValue, RTPCValue) == 0x000000, "Member 'AkGameObject_GetRTPCValue::RTPCValue' has a wrong offset!");
static_assert(offsetof(AkGameObject_GetRTPCValue, InputValueType) == 0x000008, "Member 'AkGameObject_GetRTPCValue::InputValueType' has a wrong offset!");
static_assert(offsetof(AkGameObject_GetRTPCValue, Value) == 0x00000C, "Member 'AkGameObject_GetRTPCValue::Value' has a wrong offset!");
static_assert(offsetof(AkGameObject_GetRTPCValue, OutputValueType) == 0x000010, "Member 'AkGameObject_GetRTPCValue::OutputValueType' has a wrong offset!");
static_assert(offsetof(AkGameObject_GetRTPCValue, RTPC) == 0x000018, "Member 'AkGameObject_GetRTPCValue::RTPC' has a wrong offset!");
static_assert(offsetof(AkGameObject_GetRTPCValue, PlayingID) == 0x000028, "Member 'AkGameObject_GetRTPCValue::PlayingID' has a wrong offset!");

// Function AkAudio.AkGameObject.SetRTPCValue
// 0x0020 (0x0020 - 0x0000)
struct AkGameObject_SetRTPCValue final
{
public:
	class UAkRtpc*                                RTPCValue;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InterpolationTimeMs;                               // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RTPC;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkGameObject_SetRTPCValue) == 0x000008, "Wrong alignment on AkGameObject_SetRTPCValue");
static_assert(sizeof(AkGameObject_SetRTPCValue) == 0x000020, "Wrong size on AkGameObject_SetRTPCValue");
static_assert(offsetof(AkGameObject_SetRTPCValue, RTPCValue) == 0x000000, "Member 'AkGameObject_SetRTPCValue::RTPCValue' has a wrong offset!");
static_assert(offsetof(AkGameObject_SetRTPCValue, Value) == 0x000008, "Member 'AkGameObject_SetRTPCValue::Value' has a wrong offset!");
static_assert(offsetof(AkGameObject_SetRTPCValue, InterpolationTimeMs) == 0x00000C, "Member 'AkGameObject_SetRTPCValue::InterpolationTimeMs' has a wrong offset!");
static_assert(offsetof(AkGameObject_SetRTPCValue, RTPC) == 0x000010, "Member 'AkGameObject_SetRTPCValue::RTPC' has a wrong offset!");

// Function AkAudio.AkSurfaceReflectorSetComponent.SetAcousticTexture
// 0x0020 (0x0020 - 0x0000)
struct AkSurfaceReflectorSetComponent_SetAcousticTexture final
{
public:
	TArray<int32>                                 InSurfaceIndexesToEdit;                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UAkAcousticTexture*                     InAcousticTexture;                                 // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInEnableSurface;                                  // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AkSurfaceReflectorSetComponent_SetAcousticTexture) == 0x000008, "Wrong alignment on AkSurfaceReflectorSetComponent_SetAcousticTexture");
static_assert(sizeof(AkSurfaceReflectorSetComponent_SetAcousticTexture) == 0x000020, "Wrong size on AkSurfaceReflectorSetComponent_SetAcousticTexture");
static_assert(offsetof(AkSurfaceReflectorSetComponent_SetAcousticTexture, InSurfaceIndexesToEdit) == 0x000000, "Member 'AkSurfaceReflectorSetComponent_SetAcousticTexture::InSurfaceIndexesToEdit' has a wrong offset!");
static_assert(offsetof(AkSurfaceReflectorSetComponent_SetAcousticTexture, InAcousticTexture) == 0x000010, "Member 'AkSurfaceReflectorSetComponent_SetAcousticTexture::InAcousticTexture' has a wrong offset!");
static_assert(offsetof(AkSurfaceReflectorSetComponent_SetAcousticTexture, bInEnableSurface) == 0x000018, "Member 'AkSurfaceReflectorSetComponent_SetAcousticTexture::bInEnableSurface' has a wrong offset!");

// Function AkAudio.AkSurfaceReflectorSetComponent.SetEnable
// 0x0001 (0x0001 - 0x0000)
struct AkSurfaceReflectorSetComponent_SetEnable final
{
public:
	bool                                          bInEnable;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkSurfaceReflectorSetComponent_SetEnable) == 0x000001, "Wrong alignment on AkSurfaceReflectorSetComponent_SetEnable");
static_assert(sizeof(AkSurfaceReflectorSetComponent_SetEnable) == 0x000001, "Wrong size on AkSurfaceReflectorSetComponent_SetEnable");
static_assert(offsetof(AkSurfaceReflectorSetComponent_SetEnable, bInEnable) == 0x000000, "Member 'AkSurfaceReflectorSetComponent_SetEnable::bInEnable' has a wrong offset!");

// Function AkAudio.AkSurfaceReflectorSetComponent.SetEnableDiffraction
// 0x0002 (0x0002 - 0x0000)
struct AkSurfaceReflectorSetComponent_SetEnableDiffraction final
{
public:
	bool                                          bInEnableDiffraction;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInEnableDiffractionOnBoundaryEdges;               // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkSurfaceReflectorSetComponent_SetEnableDiffraction) == 0x000001, "Wrong alignment on AkSurfaceReflectorSetComponent_SetEnableDiffraction");
static_assert(sizeof(AkSurfaceReflectorSetComponent_SetEnableDiffraction) == 0x000002, "Wrong size on AkSurfaceReflectorSetComponent_SetEnableDiffraction");
static_assert(offsetof(AkSurfaceReflectorSetComponent_SetEnableDiffraction, bInEnableDiffraction) == 0x000000, "Member 'AkSurfaceReflectorSetComponent_SetEnableDiffraction::bInEnableDiffraction' has a wrong offset!");
static_assert(offsetof(AkSurfaceReflectorSetComponent_SetEnableDiffraction, bInEnableDiffractionOnBoundaryEdges) == 0x000001, "Member 'AkSurfaceReflectorSetComponent_SetEnableDiffraction::bInEnableDiffractionOnBoundaryEdges' has a wrong offset!");

// Function AkAudio.AkSurfaceReflectorSetComponent.SetEnableSurface
// 0x0018 (0x0018 - 0x0000)
struct AkSurfaceReflectorSetComponent_SetEnableSurface final
{
public:
	TArray<int32>                                 InSurfaceIndexesToEdit;                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bInEnableSurface;                                  // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AkSurfaceReflectorSetComponent_SetEnableSurface) == 0x000008, "Wrong alignment on AkSurfaceReflectorSetComponent_SetEnableSurface");
static_assert(sizeof(AkSurfaceReflectorSetComponent_SetEnableSurface) == 0x000018, "Wrong size on AkSurfaceReflectorSetComponent_SetEnableSurface");
static_assert(offsetof(AkSurfaceReflectorSetComponent_SetEnableSurface, InSurfaceIndexesToEdit) == 0x000000, "Member 'AkSurfaceReflectorSetComponent_SetEnableSurface::InSurfaceIndexesToEdit' has a wrong offset!");
static_assert(offsetof(AkSurfaceReflectorSetComponent_SetEnableSurface, bInEnableSurface) == 0x000010, "Member 'AkSurfaceReflectorSetComponent_SetEnableSurface::bInEnableSurface' has a wrong offset!");

// Function AkAudio.AkSurfaceReflectorSetComponent.SetSurfaceProperties
// 0x0028 (0x0028 - 0x0000)
struct AkSurfaceReflectorSetComponent_SetSurfaceProperties final
{
public:
	TArray<int32>                                 InSurfaceIndexesToEdit;                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAkSurfacePoly                         InSurfaceProperties;                               // 0x0010(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkSurfaceReflectorSetComponent_SetSurfaceProperties) == 0x000008, "Wrong alignment on AkSurfaceReflectorSetComponent_SetSurfaceProperties");
static_assert(sizeof(AkSurfaceReflectorSetComponent_SetSurfaceProperties) == 0x000028, "Wrong size on AkSurfaceReflectorSetComponent_SetSurfaceProperties");
static_assert(offsetof(AkSurfaceReflectorSetComponent_SetSurfaceProperties, InSurfaceIndexesToEdit) == 0x000000, "Member 'AkSurfaceReflectorSetComponent_SetSurfaceProperties::InSurfaceIndexesToEdit' has a wrong offset!");
static_assert(offsetof(AkSurfaceReflectorSetComponent_SetSurfaceProperties, InSurfaceProperties) == 0x000010, "Member 'AkSurfaceReflectorSetComponent_SetSurfaceProperties::InSurfaceProperties' has a wrong offset!");

// Function AkAudio.AkSurfaceReflectorSetComponent.SetTransmissionLoss
// 0x0018 (0x0018 - 0x0000)
struct AkSurfaceReflectorSetComponent_SetTransmissionLoss final
{
public:
	TArray<int32>                                 InSurfaceIndexesToEdit;                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         InTransmissionLoss;                                // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInEnableSurface;                                  // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AkSurfaceReflectorSetComponent_SetTransmissionLoss) == 0x000008, "Wrong alignment on AkSurfaceReflectorSetComponent_SetTransmissionLoss");
static_assert(sizeof(AkSurfaceReflectorSetComponent_SetTransmissionLoss) == 0x000018, "Wrong size on AkSurfaceReflectorSetComponent_SetTransmissionLoss");
static_assert(offsetof(AkSurfaceReflectorSetComponent_SetTransmissionLoss, InSurfaceIndexesToEdit) == 0x000000, "Member 'AkSurfaceReflectorSetComponent_SetTransmissionLoss::InSurfaceIndexesToEdit' has a wrong offset!");
static_assert(offsetof(AkSurfaceReflectorSetComponent_SetTransmissionLoss, InTransmissionLoss) == 0x000010, "Member 'AkSurfaceReflectorSetComponent_SetTransmissionLoss::InTransmissionLoss' has a wrong offset!");
static_assert(offsetof(AkSurfaceReflectorSetComponent_SetTransmissionLoss, bInEnableSurface) == 0x000014, "Member 'AkSurfaceReflectorSetComponent_SetTransmissionLoss::bInEnableSurface' has a wrong offset!");

// Function AkAudio.AkSurfaceReflectorSetComponent.UpdateAcousticProperties
// 0x0010 (0x0010 - 0x0000)
struct AkSurfaceReflectorSetComponent_UpdateAcousticProperties final
{
public:
	TArray<struct FAkSurfacePoly>                 in_AcousticPolys;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkSurfaceReflectorSetComponent_UpdateAcousticProperties) == 0x000008, "Wrong alignment on AkSurfaceReflectorSetComponent_UpdateAcousticProperties");
static_assert(sizeof(AkSurfaceReflectorSetComponent_UpdateAcousticProperties) == 0x000010, "Wrong size on AkSurfaceReflectorSetComponent_UpdateAcousticProperties");
static_assert(offsetof(AkSurfaceReflectorSetComponent_UpdateAcousticProperties, in_AcousticPolys) == 0x000000, "Member 'AkSurfaceReflectorSetComponent_UpdateAcousticProperties::in_AcousticPolys' has a wrong offset!");

// Function AkAudio.AkComponent.GetOcclusionCollisionChannel
// 0x0001 (0x0001 - 0x0000)
struct AkComponent_GetOcclusionCollisionChannel final
{
public:
	ECollisionChannel                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkComponent_GetOcclusionCollisionChannel) == 0x000001, "Wrong alignment on AkComponent_GetOcclusionCollisionChannel");
static_assert(sizeof(AkComponent_GetOcclusionCollisionChannel) == 0x000001, "Wrong size on AkComponent_GetOcclusionCollisionChannel");
static_assert(offsetof(AkComponent_GetOcclusionCollisionChannel, ReturnValue) == 0x000000, "Member 'AkComponent_GetOcclusionCollisionChannel::ReturnValue' has a wrong offset!");

// Function AkAudio.AkComponent.PostAkEventAndWaitForEnd
// 0x0028 (0x0028 - 0x0000)
struct AkComponent_PostAkEventAndWaitForEnd final
{
public:
	class UAkAudioEvent*                          AkEvent;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AkComponent_PostAkEventAndWaitForEnd) == 0x000008, "Wrong alignment on AkComponent_PostAkEventAndWaitForEnd");
static_assert(sizeof(AkComponent_PostAkEventAndWaitForEnd) == 0x000028, "Wrong size on AkComponent_PostAkEventAndWaitForEnd");
static_assert(offsetof(AkComponent_PostAkEventAndWaitForEnd, AkEvent) == 0x000000, "Member 'AkComponent_PostAkEventAndWaitForEnd::AkEvent' has a wrong offset!");
static_assert(offsetof(AkComponent_PostAkEventAndWaitForEnd, LatentInfo) == 0x000008, "Member 'AkComponent_PostAkEventAndWaitForEnd::LatentInfo' has a wrong offset!");
static_assert(offsetof(AkComponent_PostAkEventAndWaitForEnd, ReturnValue) == 0x000020, "Member 'AkComponent_PostAkEventAndWaitForEnd::ReturnValue' has a wrong offset!");

// Function AkAudio.AkComponent.PostAssociatedAkEventAndWaitForEnd
// 0x0020 (0x0020 - 0x0000)
struct AkComponent_PostAssociatedAkEventAndWaitForEnd final
{
public:
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0000(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AkComponent_PostAssociatedAkEventAndWaitForEnd) == 0x000004, "Wrong alignment on AkComponent_PostAssociatedAkEventAndWaitForEnd");
static_assert(sizeof(AkComponent_PostAssociatedAkEventAndWaitForEnd) == 0x000020, "Wrong size on AkComponent_PostAssociatedAkEventAndWaitForEnd");
static_assert(offsetof(AkComponent_PostAssociatedAkEventAndWaitForEnd, LatentInfo) == 0x000000, "Member 'AkComponent_PostAssociatedAkEventAndWaitForEnd::LatentInfo' has a wrong offset!");
static_assert(offsetof(AkComponent_PostAssociatedAkEventAndWaitForEnd, ReturnValue) == 0x000018, "Member 'AkComponent_PostAssociatedAkEventAndWaitForEnd::ReturnValue' has a wrong offset!");

// Function AkAudio.AkComponent.PostTrigger
// 0x0008 (0x0008 - 0x0000)
struct AkComponent_PostTrigger final
{
public:
	class UAkTrigger*                             TriggerValue;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkComponent_PostTrigger) == 0x000008, "Wrong alignment on AkComponent_PostTrigger");
static_assert(sizeof(AkComponent_PostTrigger) == 0x000008, "Wrong size on AkComponent_PostTrigger");
static_assert(offsetof(AkComponent_PostTrigger, TriggerValue) == 0x000000, "Member 'AkComponent_PostTrigger::TriggerValue' has a wrong offset!");

// Function AkAudio.AkComponent.SetEarlyReflectionsAuxBus
// 0x0010 (0x0010 - 0x0000)
struct AkComponent_SetEarlyReflectionsAuxBus final
{
public:
	class FString                                 AuxBusName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkComponent_SetEarlyReflectionsAuxBus) == 0x000008, "Wrong alignment on AkComponent_SetEarlyReflectionsAuxBus");
static_assert(sizeof(AkComponent_SetEarlyReflectionsAuxBus) == 0x000010, "Wrong size on AkComponent_SetEarlyReflectionsAuxBus");
static_assert(offsetof(AkComponent_SetEarlyReflectionsAuxBus, AuxBusName) == 0x000000, "Member 'AkComponent_SetEarlyReflectionsAuxBus::AuxBusName' has a wrong offset!");

// Function AkAudio.AkComponent.SetEarlyReflectionsVolume
// 0x0004 (0x0004 - 0x0000)
struct AkComponent_SetEarlyReflectionsVolume final
{
public:
	float                                         SendVolume;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkComponent_SetEarlyReflectionsVolume) == 0x000004, "Wrong alignment on AkComponent_SetEarlyReflectionsVolume");
static_assert(sizeof(AkComponent_SetEarlyReflectionsVolume) == 0x000004, "Wrong size on AkComponent_SetEarlyReflectionsVolume");
static_assert(offsetof(AkComponent_SetEarlyReflectionsVolume, SendVolume) == 0x000000, "Member 'AkComponent_SetEarlyReflectionsVolume::SendVolume' has a wrong offset!");

// Function AkAudio.AkComponent.SetEnableSpotReflectors
// 0x0001 (0x0001 - 0x0000)
struct AkComponent_SetEnableSpotReflectors final
{
public:
	bool                                          in_enable;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AkComponent_SetEnableSpotReflectors) == 0x000001, "Wrong alignment on AkComponent_SetEnableSpotReflectors");
static_assert(sizeof(AkComponent_SetEnableSpotReflectors) == 0x000001, "Wrong size on AkComponent_SetEnableSpotReflectors");
