#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimToTexture

#include "Basic.hpp"

#include "AnimToTexture_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class AnimToTexture.AnimToTextureDataAsset
// 0x0250 (0x0280 - 0x0030)
class UAnimToTextureDataAsset final : public UPrimaryDataAsset
{
public:
	TSoftObjectPtr<class USkeletalMesh>           SkeletalMesh;                                      // 0x0030(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UMaterialInstance>> OverrideMaterials;                               // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UMaterialInstance>> StaticMeshOverrideMaterials;                     // 0x0068(0x0010)(Edit, ZeroConstructor, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
	int32                                         SkeletalLODIndex;                                  // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             StaticMesh;                                        // 0x0080(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StaticLODIndex;                                    // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UVChannel;                                         // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumDriverTriangles;                                // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Sigma;                                             // 0x00B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxHeight;                                         // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxWidth;                                          // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnforcePowerOfTwo;                                // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnimToTexturePrecision                       Precision;                                         // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnimToTextureMode                            Mode;                                              // 0x00C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              VertexPositionTexture;                             // 0x00C8(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              VertexNormalTexture;                               // 0x00F0(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              BonePositionTexture;                               // 0x0118(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              BoneRotationTexture;                               // 0x0140(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              BoneWeightTexture;                                 // 0x0168(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             RootTransform;                                     // 0x0190(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttachToSocket;                                    // 0x01F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SampleRate;                                        // 0x01F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAnimToTextureAnimSequenceInfo> AnimSequences;                                     // 0x0200(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bAutoPlay;                                         // 0x0210(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AnimationIndex;                                    // 0x0214(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Frame;                                             // 0x0218(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnimToTextureNumBoneInfluences               NumBoneInfluences;                                 // 0x021C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumFrames;                                         // 0x0220(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumBones;                                          // 0x0224(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VertexRowsPerFrame;                                // 0x0228(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              VertexMinBBox;                                     // 0x022C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              VertexSizeBBox;                                    // 0x0238(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BoneWeightRowsPerFrame;                            // 0x0244(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BoneRowsPerFrame;                                  // 0x0248(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              BoneMinBBox;                                       // 0x024C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              BoneSizeBBox;                                      // 0x0258(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAnimToTextureAnimInfo>         Animations;                                        // 0x0268(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UTexture2D* BP_GetBonePositionTexture();
	class UTexture2D* BP_GetBoneRotationTexture();
	class UTexture2D* BP_GetBoneWeightTexture();
	class USkeletalMesh* BP_GetSkeletalMesh();
	class UStaticMesh* BP_GetStaticMesh();
	int32 GetIndexFromAnimSequence(const class UAnimSequence* Sequence);
	void ResetInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimToTextureDataAsset">();
	}
	static class UAnimToTextureDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimToTextureDataAsset>();
	}
};
static_assert(alignof(UAnimToTextureDataAsset) == 0x000008, "Wrong alignment on UAnimToTextureDataAsset");
static_assert(sizeof(UAnimToTextureDataAsset) == 0x000280, "Wrong size on UAnimToTextureDataAsset");
static_assert(offsetof(UAnimToTextureDataAsset, SkeletalMesh) == 0x000030, "Member 'UAnimToTextureDataAsset::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, OverrideMaterials) == 0x000058, "Member 'UAnimToTextureDataAsset::OverrideMaterials' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, StaticMeshOverrideMaterials) == 0x000068, "Member 'UAnimToTextureDataAsset::StaticMeshOverrideMaterials' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, SkeletalLODIndex) == 0x000078, "Member 'UAnimToTextureDataAsset::SkeletalLODIndex' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, StaticMesh) == 0x000080, "Member 'UAnimToTextureDataAsset::StaticMesh' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, StaticLODIndex) == 0x0000A8, "Member 'UAnimToTextureDataAsset::StaticLODIndex' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, UVChannel) == 0x0000AC, "Member 'UAnimToTextureDataAsset::UVChannel' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, NumDriverTriangles) == 0x0000B0, "Member 'UAnimToTextureDataAsset::NumDriverTriangles' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, Sigma) == 0x0000B4, "Member 'UAnimToTextureDataAsset::Sigma' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, MaxHeight) == 0x0000B8, "Member 'UAnimToTextureDataAsset::MaxHeight' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, MaxWidth) == 0x0000BC, "Member 'UAnimToTextureDataAsset::MaxWidth' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, bEnforcePowerOfTwo) == 0x0000C0, "Member 'UAnimToTextureDataAsset::bEnforcePowerOfTwo' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, Precision) == 0x0000C1, "Member 'UAnimToTextureDataAsset::Precision' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, Mode) == 0x0000C2, "Member 'UAnimToTextureDataAsset::Mode' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, VertexPositionTexture) == 0x0000C8, "Member 'UAnimToTextureDataAsset::VertexPositionTexture' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, VertexNormalTexture) == 0x0000F0, "Member 'UAnimToTextureDataAsset::VertexNormalTexture' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, BonePositionTexture) == 0x000118, "Member 'UAnimToTextureDataAsset::BonePositionTexture' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, BoneRotationTexture) == 0x000140, "Member 'UAnimToTextureDataAsset::BoneRotationTexture' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, BoneWeightTexture) == 0x000168, "Member 'UAnimToTextureDataAsset::BoneWeightTexture' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, RootTransform) == 0x000190, "Member 'UAnimToTextureDataAsset::RootTransform' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, AttachToSocket) == 0x0001F0, "Member 'UAnimToTextureDataAsset::AttachToSocket' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, SampleRate) == 0x0001F8, "Member 'UAnimToTextureDataAsset::SampleRate' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, AnimSequences) == 0x000200, "Member 'UAnimToTextureDataAsset::AnimSequences' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, bAutoPlay) == 0x000210, "Member 'UAnimToTextureDataAsset::bAutoPlay' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, AnimationIndex) == 0x000214, "Member 'UAnimToTextureDataAsset::AnimationIndex' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, Frame) == 0x000218, "Member 'UAnimToTextureDataAsset::Frame' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, NumBoneInfluences) == 0x00021C, "Member 'UAnimToTextureDataAsset::NumBoneInfluences' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, NumFrames) == 0x000220, "Member 'UAnimToTextureDataAsset::NumFrames' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, NumBones) == 0x000224, "Member 'UAnimToTextureDataAsset::NumBones' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, VertexRowsPerFrame) == 0x000228, "Member 'UAnimToTextureDataAsset::VertexRowsPerFrame' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, VertexMinBBox) == 0x00022C, "Member 'UAnimToTextureDataAsset::VertexMinBBox' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, VertexSizeBBox) == 0x000238, "Member 'UAnimToTextureDataAsset::VertexSizeBBox' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, BoneWeightRowsPerFrame) == 0x000244, "Member 'UAnimToTextureDataAsset::BoneWeightRowsPerFrame' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, BoneRowsPerFrame) == 0x000248, "Member 'UAnimToTextureDataAsset::BoneRowsPerFrame' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, BoneMinBBox) == 0x00024C, "Member 'UAnimToTextureDataAsset::BoneMinBBox' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, BoneSizeBBox) == 0x000258, "Member 'UAnimToTextureDataAsset::BoneSizeBBox' has a wrong offset!");
static_assert(offsetof(UAnimToTextureDataAsset, Animations) == 0x000268, "Member 'UAnimToTextureDataAsset::Animations' has a wrong offset!");

// Class AnimToTexture.AnimToTextureInstancePlaybackLibrary
// 0x0000 (0x0028 - 0x0028)
class UAnimToTextureInstancePlaybackLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool BatchUpdateInstancesAutoPlayData(class UInstancedStaticMeshComponent* InstancedMeshComponent, const TArray<struct FAnimToTextureAutoPlayData>& AutoPlayData, const TArray<struct FMatrix>& Transforms, bool bMarkRenderStateDirty);
	static bool BatchUpdateInstancesFrameData(class UInstancedStaticMeshComponent* InstancedMeshComponent, const TArray<struct FAnimToTextureFrameData>& FrameData, const TArray<struct FMatrix>& Transforms, bool bMarkRenderStateDirty);
	static bool GetAutoPlayDataFromDataAsset(const class UAnimToTextureDataAsset* DataAsset, int32 AnimationIndex, struct FAnimToTextureAutoPlayData* AutoPlayData, float TimeOffset, float PlayRate);
	static float GetFrame(float Time, float StartFrame, float EndFrame, float TimeOffset, float PlayRate, float SampleRate);
	static bool GetFrameDataFromDataAsset(const class UAnimToTextureDataAsset* DataAsset, int32 AnimationIndex, float Time, struct FAnimToTextureFrameData* AutoPlayData, float TimeOffset, float PlayRate);
	static bool SetupInstancedMeshComponent(class UInstancedStaticMeshComponent* InstancedMeshComponent, int32 NumInstances, bool bAutoPlay);
	static bool UpdateInstanceAutoPlayData(class UInstancedStaticMeshComponent* InstancedMeshComponent, int32 InstanceIndex, const struct FAnimToTextureAutoPlayData& AutoPlayData, bool bMarkRenderStateDirty);
	static bool UpdateInstanceFrameData(class UInstancedStaticMeshComponent* InstancedMeshComponent, int32 InstanceIndex, const struct FAnimToTextureFrameData& FrameData, bool bMarkRenderStateDirty);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimToTextureInstancePlaybackLibrary">();
	}
	static class UAnimToTextureInstancePlaybackLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimToTextureInstancePlaybackLibrary>();
	}
};
static_assert(alignof(UAnimToTextureInstancePlaybackLibrary) == 0x000008, "Wrong alignment on UAnimToTextureInstancePlaybackLibrary");
static_assert(sizeof(UAnimToTextureInstancePlaybackLibrary) == 0x000028, "Wrong size on UAnimToTextureInstancePlaybackLibrary");

}

