#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CreatePlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CreatePlayer.BP_CreatePlayer_C
// 0x39BD94D0 (0x39BD9800 - 0x0330)
#pragma pack(push, 0x1)
class alignas(0x39BD9800) ABP_CreatePlayer_C : public AHTCreatePlayerActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnSelectEvent;                                     // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnselectEvent;                                   // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAsyncAction_ListenForGameplayMessageWithSimpleMessage* Listener_Object;                   // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BPOnSelect();
	void BPOnUnselect();
	void ExecuteUbergraph_BP_CreatePlayer(int32 EntryPoint);
	class USkeletalMeshComponent* GetMesh();
	void OnMessageReceived_0136FA7E458F1197528BAD93F7E31078(class FName Channel, const struct FGameplayMessageSimpleMessage& Message);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CreatePlayer_C">();
	}
	static class ABP_CreatePlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CreatePlayer_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(ABP_CreatePlayer_C) == 0x39BD9800, "Wrong alignment on ABP_CreatePlayer_C");
static_assert(sizeof(ABP_CreatePlayer_C) == 0x39BD9800, "Wrong size on ABP_CreatePlayer_C");
static_assert(offsetof(ABP_CreatePlayer_C, UberGraphFrame) == 0x000330, "Member 'ABP_CreatePlayer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CreatePlayer_C, SkeletalMesh) == 0x000338, "Member 'ABP_CreatePlayer_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_CreatePlayer_C, Camera) == 0x000340, "Member 'ABP_CreatePlayer_C::Camera' has a wrong offset!");
static_assert(offsetof(ABP_CreatePlayer_C, Capsule) == 0x000348, "Member 'ABP_CreatePlayer_C::Capsule' has a wrong offset!");
static_assert(offsetof(ABP_CreatePlayer_C, OnSelectEvent) == 0x000350, "Member 'ABP_CreatePlayer_C::OnSelectEvent' has a wrong offset!");
static_assert(offsetof(ABP_CreatePlayer_C, OnUnselectEvent) == 0x000360, "Member 'ABP_CreatePlayer_C::OnUnselectEvent' has a wrong offset!");
static_assert(offsetof(ABP_CreatePlayer_C, Listener_Object) == 0x000370, "Member 'ABP_CreatePlayer_C::Listener_Object' has a wrong offset!");

}

