#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CreatePlayer_Male

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CreatePlayer_Male.BP_CreatePlayer_Male_C.ExecuteUbergraph_BP_CreatePlayer_Male
// 0x0020 (0x0020 - 0x0000)
struct BP_CreatePlayer_Male_C_ExecuteUbergraph_BP_CreatePlayer_Male final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULoginPlayerAnimBlueprint_C*            K2Node_DynamicCast_AsLogin_Player_Anim_Blueprint;  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreatePlayer_Male_C_ExecuteUbergraph_BP_CreatePlayer_Male) == 0x000008, "Wrong alignment on BP_CreatePlayer_Male_C_ExecuteUbergraph_BP_CreatePlayer_Male");
static_assert(sizeof(BP_CreatePlayer_Male_C_ExecuteUbergraph_BP_CreatePlayer_Male) == 0x000020, "Wrong size on BP_CreatePlayer_Male_C_ExecuteUbergraph_BP_CreatePlayer_Male");
static_assert(offsetof(BP_CreatePlayer_Male_C_ExecuteUbergraph_BP_CreatePlayer_Male, EntryPoint) == 0x000000, "Member 'BP_CreatePlayer_Male_C_ExecuteUbergraph_BP_CreatePlayer_Male::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_Male_C_ExecuteUbergraph_BP_CreatePlayer_Male, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'BP_CreatePlayer_Male_C_ExecuteUbergraph_BP_CreatePlayer_Male::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_Male_C_ExecuteUbergraph_BP_CreatePlayer_Male, K2Node_DynamicCast_AsLogin_Player_Anim_Blueprint) == 0x000010, "Member 'BP_CreatePlayer_Male_C_ExecuteUbergraph_BP_CreatePlayer_Male::K2Node_DynamicCast_AsLogin_Player_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_Male_C_ExecuteUbergraph_BP_CreatePlayer_Male, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_CreatePlayer_Male_C_ExecuteUbergraph_BP_CreatePlayer_Male::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

