#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CreatePlayer

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_CreatePlayer.BP_CreatePlayer_C.ExecuteUbergraph_BP_CreatePlayer
// 0x00C8 (0x00C8 - 0x0000)
struct BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Channel;                        // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayMessageSimpleMessage          K2Node_CustomEvent_Message;                        // 0x0010(0x0020)(ConstParm)
	TDelegate<void(class FName Channel, const struct FGameplayMessageSimpleMessage& Message)> K2Node_CreateDelegate_OutputDelegate; // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayMessageSimpleMessage          Temp_struct_Variable;                              // 0x0040(0x0020)()
	class FName                                   Temp_name_Variable;                                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSimpleMessageIntValue_ReturnValue;     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ListenForGameplayMessageWithSimpleMessage* CallFunc_ListenForGameplayMessagesWithSimpleMessage_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTHUD*                                 K2Node_DynamicCast_AsHTHUD;                        // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               CallFunc_BP_GetUIByClass_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHTUI_CreateRole*                       K2Node_DynamicCast_AsHTUI_Create_Role;             // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer) == 0x000008, "Wrong alignment on BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer");
static_assert(sizeof(BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer) == 0x0000C8, "Wrong size on BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer");
static_assert(offsetof(BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer, EntryPoint) == 0x000000, "Member 'BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer, K2Node_CustomEvent_Channel) == 0x000004, "Member 'BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer::K2Node_CustomEvent_Channel' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer, K2Node_CustomEvent_Message) == 0x000010, "Member 'BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer, Temp_struct_Variable) == 0x000040, "Member 'BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer, Temp_name_Variable) == 0x000060, "Member 'BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer, CallFunc_GetSimpleMessageIntValue_ReturnValue) == 0x000068, "Member 'BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer::CallFunc_GetSimpleMessageIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer, CallFunc_ListenForGameplayMessagesWithSimpleMessage_ReturnValue) == 0x000070, "Member 'BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer::CallFunc_ListenForGameplayMessagesWithSimpleMessage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer, CallFunc_IsValid_ReturnValue_1) == 0x000079, "Member 'BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer, K2Node_Event_EndPlayReason) == 0x00007A, "Member 'BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer, CallFunc_GetPlayerController_ReturnValue) == 0x000080, "Member 'BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000088, "Member 'BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer, CallFunc_GetHUD_ReturnValue) == 0x000090, "Member 'BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000098, "Member 'BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer, K2Node_DynamicCast_AsHTHUD) == 0x0000A0, "Member 'BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer::K2Node_DynamicCast_AsHTHUD' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer, CallFunc_BP_GetUIByClass_ReturnValue) == 0x0000B0, "Member 'BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer::CallFunc_BP_GetUIByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer, K2Node_DynamicCast_AsHTUI_Create_Role) == 0x0000B8, "Member 'BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer::K2Node_DynamicCast_AsHTUI_Create_Role' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'BP_CreatePlayer_C_ExecuteUbergraph_BP_CreatePlayer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_CreatePlayer.BP_CreatePlayer_C.GetMesh
// 0x0008 (0x0008 - 0x0000)
struct BP_CreatePlayer_C_GetMesh final
{
public:
	class USkeletalMeshComponent*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreatePlayer_C_GetMesh) == 0x000008, "Wrong alignment on BP_CreatePlayer_C_GetMesh");
static_assert(sizeof(BP_CreatePlayer_C_GetMesh) == 0x000008, "Wrong size on BP_CreatePlayer_C_GetMesh");
static_assert(offsetof(BP_CreatePlayer_C_GetMesh, ReturnValue) == 0x000000, "Member 'BP_CreatePlayer_C_GetMesh::ReturnValue' has a wrong offset!");

// Function BP_CreatePlayer.BP_CreatePlayer_C.OnMessageReceived_0136FA7E458F1197528BAD93F7E31078
// 0x0028 (0x0028 - 0x0000)
struct BP_CreatePlayer_C_OnMessageReceived_0136FA7E458F1197528BAD93F7E31078 final
{
public:
	class FName                                   Channel;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayMessageSimpleMessage          Message;                                           // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_CreatePlayer_C_OnMessageReceived_0136FA7E458F1197528BAD93F7E31078) == 0x000004, "Wrong alignment on BP_CreatePlayer_C_OnMessageReceived_0136FA7E458F1197528BAD93F7E31078");
static_assert(sizeof(BP_CreatePlayer_C_OnMessageReceived_0136FA7E458F1197528BAD93F7E31078) == 0x000028, "Wrong size on BP_CreatePlayer_C_OnMessageReceived_0136FA7E458F1197528BAD93F7E31078");
static_assert(offsetof(BP_CreatePlayer_C_OnMessageReceived_0136FA7E458F1197528BAD93F7E31078, Channel) == 0x000000, "Member 'BP_CreatePlayer_C_OnMessageReceived_0136FA7E458F1197528BAD93F7E31078::Channel' has a wrong offset!");
static_assert(offsetof(BP_CreatePlayer_C_OnMessageReceived_0136FA7E458F1197528BAD93F7E31078, Message) == 0x000008, "Member 'BP_CreatePlayer_C_OnMessageReceived_0136FA7E458F1197528BAD93F7E31078::Message' has a wrong offset!");

// Function BP_CreatePlayer.BP_CreatePlayer_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_CreatePlayer_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CreatePlayer_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_CreatePlayer_C_ReceiveEndPlay");
static_assert(sizeof(BP_CreatePlayer_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_CreatePlayer_C_ReceiveEndPlay");
static_assert(offsetof(BP_CreatePlayer_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_CreatePlayer_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

