#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpawnClientActorNS

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SpawnClientActorNS.BP_SpawnClientActorNS_C.Received_NotifyEnd
// 0x0048 (0x0048 - 0x0000)
struct BP_SpawnClientActorNS_C_Received_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Received_NotifyEnd_ReturnValue;           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpawnClientActorNS_C_Received_NotifyEnd) == 0x000008, "Wrong alignment on BP_SpawnClientActorNS_C_Received_NotifyEnd");
static_assert(sizeof(BP_SpawnClientActorNS_C_Received_NotifyEnd) == 0x000048, "Wrong size on BP_SpawnClientActorNS_C_Received_NotifyEnd");
static_assert(offsetof(BP_SpawnClientActorNS_C_Received_NotifyEnd, MeshComp) == 0x000000, "Member 'BP_SpawnClientActorNS_C_Received_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(BP_SpawnClientActorNS_C_Received_NotifyEnd, Animation) == 0x000008, "Member 'BP_SpawnClientActorNS_C_Received_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(BP_SpawnClientActorNS_C_Received_NotifyEnd, EventReference) == 0x000010, "Member 'BP_SpawnClientActorNS_C_Received_NotifyEnd::EventReference' has a wrong offset!");
static_assert(offsetof(BP_SpawnClientActorNS_C_Received_NotifyEnd, ReturnValue) == 0x000040, "Member 'BP_SpawnClientActorNS_C_Received_NotifyEnd::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpawnClientActorNS_C_Received_NotifyEnd, CallFunc_Received_NotifyEnd_ReturnValue) == 0x000041, "Member 'BP_SpawnClientActorNS_C_Received_NotifyEnd::CallFunc_Received_NotifyEnd_ReturnValue' has a wrong offset!");

}

