#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_SupplyShortcut

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BPUI_SupplyShortcut.BPUI_SupplyShortcut_C.BP_QuickFoodMenuShow
// 0x0001 (0x0001 - 0x0000)
struct BPUI_SupplyShortcut_C_BP_QuickFoodMenuShow final
{
public:
	bool                                          bInShow;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_SupplyShortcut_C_BP_QuickFoodMenuShow) == 0x000001, "Wrong alignment on BPUI_SupplyShortcut_C_BP_QuickFoodMenuShow");
static_assert(sizeof(BPUI_SupplyShortcut_C_BP_QuickFoodMenuShow) == 0x000001, "Wrong size on BPUI_SupplyShortcut_C_BP_QuickFoodMenuShow");
static_assert(offsetof(BPUI_SupplyShortcut_C_BP_QuickFoodMenuShow, bInShow) == 0x000000, "Member 'BPUI_SupplyShortcut_C_BP_QuickFoodMenuShow::bInShow' has a wrong offset!");

// Function BPUI_SupplyShortcut.BPUI_SupplyShortcut_C.BP_UpdateMusicPlayState
// 0x0001 (0x0001 - 0x0000)
struct BPUI_SupplyShortcut_C_BP_UpdateMusicPlayState final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_SupplyShortcut_C_BP_UpdateMusicPlayState) == 0x000001, "Wrong alignment on BPUI_SupplyShortcut_C_BP_UpdateMusicPlayState");
static_assert(sizeof(BPUI_SupplyShortcut_C_BP_UpdateMusicPlayState) == 0x000001, "Wrong size on BPUI_SupplyShortcut_C_BP_UpdateMusicPlayState");
static_assert(offsetof(BPUI_SupplyShortcut_C_BP_UpdateMusicPlayState, bPlay) == 0x000000, "Member 'BPUI_SupplyShortcut_C_BP_UpdateMusicPlayState::bPlay' has a wrong offset!");

// Function BPUI_SupplyShortcut.BPUI_SupplyShortcut_C.CloseQuickFoodMenu
// 0x0010 (0x0010 - 0x0000)
struct BPUI_SupplyShortcut_C_CloseQuickFoodMenu final
{
public:
	class UHTUINavigationSubsystem*               CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ReleaseCommandMenus_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_SupplyShortcut_C_CloseQuickFoodMenu) == 0x000008, "Wrong alignment on BPUI_SupplyShortcut_C_CloseQuickFoodMenu");
static_assert(sizeof(BPUI_SupplyShortcut_C_CloseQuickFoodMenu) == 0x000010, "Wrong size on BPUI_SupplyShortcut_C_CloseQuickFoodMenu");
static_assert(offsetof(BPUI_SupplyShortcut_C_CloseQuickFoodMenu, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000000, "Member 'BPUI_SupplyShortcut_C_CloseQuickFoodMenu::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_SupplyShortcut_C_CloseQuickFoodMenu, CallFunc_ReleaseCommandMenus_ReturnValue) == 0x000008, "Member 'BPUI_SupplyShortcut_C_CloseQuickFoodMenu::CallFunc_ReleaseCommandMenus_ReturnValue' has a wrong offset!");

// Function BPUI_SupplyShortcut.BPUI_SupplyShortcut_C.ExecuteUbergraph_BPUI_SupplyShortcut
// 0x003C (0x003C - 0x0000)
struct BPUI_SupplyShortcut_C_ExecuteUbergraph_BPUI_SupplyShortcut final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamepadInputType_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInShow;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPlay;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue_1;              // 0x001C(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue_2;              // 0x002C(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_SupplyShortcut_C_ExecuteUbergraph_BPUI_SupplyShortcut) == 0x000004, "Wrong alignment on BPUI_SupplyShortcut_C_ExecuteUbergraph_BPUI_SupplyShortcut");
static_assert(sizeof(BPUI_SupplyShortcut_C_ExecuteUbergraph_BPUI_SupplyShortcut) == 0x00003C, "Wrong size on BPUI_SupplyShortcut_C_ExecuteUbergraph_BPUI_SupplyShortcut");
static_assert(offsetof(BPUI_SupplyShortcut_C_ExecuteUbergraph_BPUI_SupplyShortcut, EntryPoint) == 0x000000, "Member 'BPUI_SupplyShortcut_C_ExecuteUbergraph_BPUI_SupplyShortcut::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_SupplyShortcut_C_ExecuteUbergraph_BPUI_SupplyShortcut, CallFunc_IsMobilePlatform_ReturnValue) == 0x000004, "Member 'BPUI_SupplyShortcut_C_ExecuteUbergraph_BPUI_SupplyShortcut::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_SupplyShortcut_C_ExecuteUbergraph_BPUI_SupplyShortcut, CallFunc_IsGamepadInputType_ReturnValue) == 0x000005, "Member 'BPUI_SupplyShortcut_C_ExecuteUbergraph_BPUI_SupplyShortcut::CallFunc_IsGamepadInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_SupplyShortcut_C_ExecuteUbergraph_BPUI_SupplyShortcut, K2Node_Event_bInShow) == 0x000006, "Member 'BPUI_SupplyShortcut_C_ExecuteUbergraph_BPUI_SupplyShortcut::K2Node_Event_bInShow' has a wrong offset!");
static_assert(offsetof(BPUI_SupplyShortcut_C_ExecuteUbergraph_BPUI_SupplyShortcut, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BPUI_SupplyShortcut_C_ExecuteUbergraph_BPUI_SupplyShortcut::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_SupplyShortcut_C_ExecuteUbergraph_BPUI_SupplyShortcut, K2Node_Event_bPlay) == 0x000018, "Member 'BPUI_SupplyShortcut_C_ExecuteUbergraph_BPUI_SupplyShortcut::K2Node_Event_bPlay' has a wrong offset!");
static_assert(offsetof(BPUI_SupplyShortcut_C_ExecuteUbergraph_BPUI_SupplyShortcut, CallFunc_PlayAnimation_ReturnValue_1) == 0x00001C, "Member 'BPUI_SupplyShortcut_C_ExecuteUbergraph_BPUI_SupplyShortcut::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_SupplyShortcut_C_ExecuteUbergraph_BPUI_SupplyShortcut, CallFunc_PlayAnimation_ReturnValue_2) == 0x00002C, "Member 'BPUI_SupplyShortcut_C_ExecuteUbergraph_BPUI_SupplyShortcut::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

// Function BPUI_SupplyShortcut.BPUI_SupplyShortcut_C.OpenQuickFoodMenu
// 0x0020 (0x0020 - 0x0000)
struct BPUI_SupplyShortcut_C_OpenQuickFoodMenu final
{
public:
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamepadInputType_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTUINavigationSubsystem*               CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTUINavigationSubsystem*               CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_SupplyShortcut_C_OpenQuickFoodMenu) == 0x000008, "Wrong alignment on BPUI_SupplyShortcut_C_OpenQuickFoodMenu");
static_assert(sizeof(BPUI_SupplyShortcut_C_OpenQuickFoodMenu) == 0x000020, "Wrong size on BPUI_SupplyShortcut_C_OpenQuickFoodMenu");
static_assert(offsetof(BPUI_SupplyShortcut_C_OpenQuickFoodMenu, CallFunc_IsMobilePlatform_ReturnValue) == 0x000000, "Member 'BPUI_SupplyShortcut_C_OpenQuickFoodMenu::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_SupplyShortcut_C_OpenQuickFoodMenu, CallFunc_IsGamepadInputType_ReturnValue) == 0x000001, "Member 'BPUI_SupplyShortcut_C_OpenQuickFoodMenu::CallFunc_IsGamepadInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_SupplyShortcut_C_OpenQuickFoodMenu, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'BPUI_SupplyShortcut_C_OpenQuickFoodMenu::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_SupplyShortcut_C_OpenQuickFoodMenu, CallFunc_BooleanOR_ReturnValue) == 0x000010, "Member 'BPUI_SupplyShortcut_C_OpenQuickFoodMenu::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_SupplyShortcut_C_OpenQuickFoodMenu, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000018, "Member 'BPUI_SupplyShortcut_C_OpenQuickFoodMenu::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");

}

