#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_HeterochromeSlot

#include "Basic.hpp"

#include "HTGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_HeterochromeSlot.BPUI_HeterochromeSlot_C
// 0x159DE080 (0x159DF000 - 0x0F80)
class alignas(0x159DF000) UBPUI_HeterochromeSlot_C final : public UHTUI_HeterochromeSlot
{
public:
	class UImage*                                 Image_Fx_2_Huan;                                   // 0x0F80(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Fx_5;                                        // 0x0F88(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Fx_4;                                        // 0x0F90(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Fx_3;                                        // 0x0F98(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Fx_1;                                        // 0x0FA0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Fx;                                          // 0x0FA8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_126;                                         // 0x0FB0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ElementIcon_3;                                     // 0x0FB8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ElementIcon_1;                                     // 0x0FC0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CP_YS;                                             // 0x0FC8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_HeterochromeSlot_C">();
	}
	static class UBPUI_HeterochromeSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_HeterochromeSlot_C>();
	}
};
static_assert(alignof(UBPUI_HeterochromeSlot_C) == 0x159DF000, "Wrong alignment on UBPUI_HeterochromeSlot_C");
static_assert(sizeof(UBPUI_HeterochromeSlot_C) == 0x159DF000, "Wrong size on UBPUI_HeterochromeSlot_C");
static_assert(offsetof(UBPUI_HeterochromeSlot_C, Image_Fx_2_Huan) == 0x000F80, "Member 'UBPUI_HeterochromeSlot_C::Image_Fx_2_Huan' has a wrong offset!");
static_assert(offsetof(UBPUI_HeterochromeSlot_C, Image_Fx_5) == 0x000F88, "Member 'UBPUI_HeterochromeSlot_C::Image_Fx_5' has a wrong offset!");
static_assert(offsetof(UBPUI_HeterochromeSlot_C, Image_Fx_4) == 0x000F90, "Member 'UBPUI_HeterochromeSlot_C::Image_Fx_4' has a wrong offset!");
static_assert(offsetof(UBPUI_HeterochromeSlot_C, Image_Fx_3) == 0x000F98, "Member 'UBPUI_HeterochromeSlot_C::Image_Fx_3' has a wrong offset!");
static_assert(offsetof(UBPUI_HeterochromeSlot_C, Image_Fx_1) == 0x000FA0, "Member 'UBPUI_HeterochromeSlot_C::Image_Fx_1' has a wrong offset!");
static_assert(offsetof(UBPUI_HeterochromeSlot_C, Image_Fx) == 0x000FA8, "Member 'UBPUI_HeterochromeSlot_C::Image_Fx' has a wrong offset!");
static_assert(offsetof(UBPUI_HeterochromeSlot_C, Image_126) == 0x000FB0, "Member 'UBPUI_HeterochromeSlot_C::Image_126' has a wrong offset!");
static_assert(offsetof(UBPUI_HeterochromeSlot_C, ElementIcon_3) == 0x000FB8, "Member 'UBPUI_HeterochromeSlot_C::ElementIcon_3' has a wrong offset!");
static_assert(offsetof(UBPUI_HeterochromeSlot_C, ElementIcon_1) == 0x000FC0, "Member 'UBPUI_HeterochromeSlot_C::ElementIcon_1' has a wrong offset!");
static_assert(offsetof(UBPUI_HeterochromeSlot_C, CP_YS) == 0x000FC8, "Member 'UBPUI_HeterochromeSlot_C::CP_YS' has a wrong offset!");

}

