#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_SkillInput_SubUlrSkill

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BPUI_SkillInput_SubUlrSkill.BPUI_SkillInput_SubUlrSkill_C.ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill
// 0x01C0 (0x01C0 - 0x0000)
struct BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 TriggerCount)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As__2D;                         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAbilitySpec& AbilitySpec)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTPlayerCharacter*                     CallFunc_GetPlayer_ReturnValue;                    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_TriggerCount;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTAbilitySystemComponent*              CallFunc_GetHTAbilitySystemComponent_ReturnValue;  // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHTPlayerLogicObjBase*                  CallFunc_GetPlayerCustomLogicObjByClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UJinRecordSkillLogicObj*                K2Node_DynamicCast_AsJin_Record_Skill_Logic_Obj;   // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0098(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FGameplayAbilitySpec                   K2Node_CustomEvent_AbilitySpec;                    // 0x00A8(0x00F0)(ConstParm)
	bool                                          CallFunc_GetGameplayAbilityFromSpec_bIsInstance;   // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UGameplayAbility*                 CallFunc_GetGameplayAbilityFromSpec_ReturnValue;   // 0x01A0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill) == 0x000008, "Wrong alignment on BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill");
static_assert(sizeof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill) == 0x0001C0, "Wrong size on BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill, EntryPoint) == 0x000000, "Member 'BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill, K2Node_CustomEvent_Loaded) == 0x000018, "Member 'BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill, Temp_object_Variable) == 0x000020, "Member 'BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill, K2Node_DynamicCast_As__2D) == 0x000028, "Member 'BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill::K2Node_DynamicCast_As__2D' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill, CallFunc_GetPlayer_ReturnValue) == 0x000058, "Member 'BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill, K2Node_CustomEvent_TriggerCount) == 0x000060, "Member 'BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill::K2Node_CustomEvent_TriggerCount' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill, CallFunc_GetHTAbilitySystemComponent_ReturnValue) == 0x000068, "Member 'BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill::CallFunc_GetHTAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill, CallFunc_GetPlayerCustomLogicObjByClass_ReturnValue) == 0x000070, "Member 'BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill::CallFunc_GetPlayerCustomLogicObjByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill, K2Node_DynamicCast_AsJin_Record_Skill_Logic_Obj) == 0x000078, "Member 'BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill::K2Node_DynamicCast_AsJin_Record_Skill_Logic_Obj' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill, K2Node_CreateDelegate_OutputDelegate_3) == 0x000084, "Member 'BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000094, "Member 'BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill, CallFunc_PlayAnimation_ReturnValue) == 0x000098, "Member 'BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill, K2Node_CustomEvent_AbilitySpec) == 0x0000A8, "Member 'BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill::K2Node_CustomEvent_AbilitySpec' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill, CallFunc_GetGameplayAbilityFromSpec_bIsInstance) == 0x000198, "Member 'BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill::CallFunc_GetGameplayAbilityFromSpec_bIsInstance' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill, CallFunc_GetGameplayAbilityFromSpec_ReturnValue) == 0x0001A0, "Member 'BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill::CallFunc_GetGameplayAbilityFromSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill, CallFunc_GetDisplayName_ReturnValue) == 0x0001A8, "Member 'BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill, CallFunc_Contains_ReturnValue) == 0x0001B8, "Member 'BPUI_SkillInput_SubUlrSkill_C_ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill::CallFunc_Contains_ReturnValue' has a wrong offset!");

// Function BPUI_SkillInput_SubUlrSkill.BPUI_SkillInput_SubUlrSkill_C.OnLoaded_10F311BB48529E80E532CD8D3EFA2A75
// 0x0008 (0x0008 - 0x0000)
struct BPUI_SkillInput_SubUlrSkill_C_OnLoaded_10F311BB48529E80E532CD8D3EFA2A75 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_SkillInput_SubUlrSkill_C_OnLoaded_10F311BB48529E80E532CD8D3EFA2A75) == 0x000008, "Wrong alignment on BPUI_SkillInput_SubUlrSkill_C_OnLoaded_10F311BB48529E80E532CD8D3EFA2A75");
static_assert(sizeof(BPUI_SkillInput_SubUlrSkill_C_OnLoaded_10F311BB48529E80E532CD8D3EFA2A75) == 0x000008, "Wrong size on BPUI_SkillInput_SubUlrSkill_C_OnLoaded_10F311BB48529E80E532CD8D3EFA2A75");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_OnLoaded_10F311BB48529E80E532CD8D3EFA2A75, Loaded) == 0x000000, "Member 'BPUI_SkillInput_SubUlrSkill_C_OnLoaded_10F311BB48529E80E532CD8D3EFA2A75::Loaded' has a wrong offset!");

// Function BPUI_SkillInput_SubUlrSkill.BPUI_SkillInput_SubUlrSkill_C.RemoveAbility
// 0x00F0 (0x00F0 - 0x0000)
struct BPUI_SkillInput_SubUlrSkill_C_RemoveAbility final
{
public:
	struct FGameplayAbilitySpec                   AbilitySpec;                                       // 0x0000(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BPUI_SkillInput_SubUlrSkill_C_RemoveAbility) == 0x000001, "Wrong alignment on BPUI_SkillInput_SubUlrSkill_C_RemoveAbility");
static_assert(sizeof(BPUI_SkillInput_SubUlrSkill_C_RemoveAbility) == 0x0000F0, "Wrong size on BPUI_SkillInput_SubUlrSkill_C_RemoveAbility");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_RemoveAbility, AbilitySpec) == 0x000000, "Member 'BPUI_SkillInput_SubUlrSkill_C_RemoveAbility::AbilitySpec' has a wrong offset!");

// Function BPUI_SkillInput_SubUlrSkill.BPUI_SkillInput_SubUlrSkill_C.TriggerCountInfo
// 0x0004 (0x0004 - 0x0000)
struct BPUI_SkillInput_SubUlrSkill_C_TriggerCountInfo final
{
public:
	int32                                         TriggerCount;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_SkillInput_SubUlrSkill_C_TriggerCountInfo) == 0x000004, "Wrong alignment on BPUI_SkillInput_SubUlrSkill_C_TriggerCountInfo");
static_assert(sizeof(BPUI_SkillInput_SubUlrSkill_C_TriggerCountInfo) == 0x000004, "Wrong size on BPUI_SkillInput_SubUlrSkill_C_TriggerCountInfo");
static_assert(offsetof(BPUI_SkillInput_SubUlrSkill_C_TriggerCountInfo, TriggerCount) == 0x000000, "Member 'BPUI_SkillInput_SubUlrSkill_C_TriggerCountInfo::TriggerCount' has a wrong offset!");

}

