#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_SkillInput_SubUlrSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BPUI_SkillInput_Ultra_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_SkillInput_SubUlrSkill.BPUI_SkillInput_SubUlrSkill_C
// 0x0000 (0x159DF000 - 0x159DF000)
class UBPUI_SkillInput_SubUlrSkill_C final : public UBPUI_SkillInput_Ultra_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BPUI_SkillInput_SubUlrSkill_C;      // 0x1A60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class UTexture2D>              ReplaceIcon;                                       // 0x1A68(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         TempTriggerMaxCount;                               // 0x1A90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_BPUI_SkillInput_SubUlrSkill(int32 EntryPoint);
	void OnLoaded_10F311BB48529E80E532CD8D3EFA2A75(class UObject* Loaded);
	void RemoveAbility(const struct FGameplayAbilitySpec& AbilitySpec);
	void TriggerCountInfo(int32 TriggerCount);
	void TriggerUltraMelee();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_SkillInput_SubUlrSkill_C">();
	}
	static class UBPUI_SkillInput_SubUlrSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_SkillInput_SubUlrSkill_C>();
	}
};
static_assert(alignof(UBPUI_SkillInput_SubUlrSkill_C) == 0x159DF000, "Wrong alignment on UBPUI_SkillInput_SubUlrSkill_C");
static_assert(sizeof(UBPUI_SkillInput_SubUlrSkill_C) == 0x159DF000, "Wrong size on UBPUI_SkillInput_SubUlrSkill_C");
static_assert(offsetof(UBPUI_SkillInput_SubUlrSkill_C, UberGraphFrame_BPUI_SkillInput_SubUlrSkill_C) == 0x001A60, "Member 'UBPUI_SkillInput_SubUlrSkill_C::UberGraphFrame_BPUI_SkillInput_SubUlrSkill_C' has a wrong offset!");
static_assert(offsetof(UBPUI_SkillInput_SubUlrSkill_C, ReplaceIcon) == 0x001A68, "Member 'UBPUI_SkillInput_SubUlrSkill_C::ReplaceIcon' has a wrong offset!");
static_assert(offsetof(UBPUI_SkillInput_SubUlrSkill_C, TempTriggerMaxCount) == 0x001A90, "Member 'UBPUI_SkillInput_SubUlrSkill_C::TempTriggerMaxCount' has a wrong offset!");

}

