#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_Interation

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPUI_Interation.BPUI_Interation_C.ExecuteUbergraph_BPUI_Interation
// 0x0060 (0x0060 - 0x0000)
struct BPUI_Interation_C_ExecuteUbergraph_BPUI_Interation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayMessageSimpleMessage          CallFunc_MakeLiteralSimpleMessageWithInt_ReturnValue; // 0x0010(0x0020)()
	struct FGameplayMessageSimpleMessage          CallFunc_MakeLiteralSimpleMessageWithInt_ReturnValue_1; // 0x0030(0x0020)()
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UGameplayMessageSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_Interation_C_ExecuteUbergraph_BPUI_Interation) == 0x000008, "Wrong alignment on BPUI_Interation_C_ExecuteUbergraph_BPUI_Interation");
static_assert(sizeof(BPUI_Interation_C_ExecuteUbergraph_BPUI_Interation) == 0x000060, "Wrong size on BPUI_Interation_C_ExecuteUbergraph_BPUI_Interation");
static_assert(offsetof(BPUI_Interation_C_ExecuteUbergraph_BPUI_Interation, EntryPoint) == 0x000000, "Member 'BPUI_Interation_C_ExecuteUbergraph_BPUI_Interation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_Interation_C_ExecuteUbergraph_BPUI_Interation, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BPUI_Interation_C_ExecuteUbergraph_BPUI_Interation::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_Interation_C_ExecuteUbergraph_BPUI_Interation, CallFunc_MakeLiteralSimpleMessageWithInt_ReturnValue) == 0x000010, "Member 'BPUI_Interation_C_ExecuteUbergraph_BPUI_Interation::CallFunc_MakeLiteralSimpleMessageWithInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_Interation_C_ExecuteUbergraph_BPUI_Interation, CallFunc_MakeLiteralSimpleMessageWithInt_ReturnValue_1) == 0x000030, "Member 'BPUI_Interation_C_ExecuteUbergraph_BPUI_Interation::CallFunc_MakeLiteralSimpleMessageWithInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_Interation_C_ExecuteUbergraph_BPUI_Interation, CallFunc_K2_SetTimer_ReturnValue) == 0x000050, "Member 'BPUI_Interation_C_ExecuteUbergraph_BPUI_Interation::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_Interation_C_ExecuteUbergraph_BPUI_Interation, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000058, "Member 'BPUI_Interation_C_ExecuteUbergraph_BPUI_Interation::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");

// Function BPUI_Interation.BPUI_Interation_C.OnTimerCountCallBack
// 0x0008 (0x0008 - 0x0000)
struct BPUI_Interation_C_OnTimerCountCallBack final
{
public:
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_Interation_C_OnTimerCountCallBack) == 0x000004, "Wrong alignment on BPUI_Interation_C_OnTimerCountCallBack");
static_assert(sizeof(BPUI_Interation_C_OnTimerCountCallBack) == 0x000008, "Wrong size on BPUI_Interation_C_OnTimerCountCallBack");
static_assert(offsetof(BPUI_Interation_C_OnTimerCountCallBack, CallFunc_GetChildrenCount_ReturnValue) == 0x000000, "Member 'BPUI_Interation_C_OnTimerCountCallBack::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_Interation_C_OnTimerCountCallBack, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'BPUI_Interation_C_OnTimerCountCallBack::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

