#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_SkillInput_Ultra

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPUI_SkillInput_Ultra.BPUI_SkillInput_Ultra_C.BP_SkillInputBtnColorAndOpacity
// 0x0001 (0x0001 - 0x0000)
struct BPUI_SkillInput_Ultra_C_BP_SkillInputBtnColorAndOpacity final
{
public:
	bool                                          bIsColorAndOpacity;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_SkillInput_Ultra_C_BP_SkillInputBtnColorAndOpacity) == 0x000001, "Wrong alignment on BPUI_SkillInput_Ultra_C_BP_SkillInputBtnColorAndOpacity");
static_assert(sizeof(BPUI_SkillInput_Ultra_C_BP_SkillInputBtnColorAndOpacity) == 0x000001, "Wrong size on BPUI_SkillInput_Ultra_C_BP_SkillInputBtnColorAndOpacity");
static_assert(offsetof(BPUI_SkillInput_Ultra_C_BP_SkillInputBtnColorAndOpacity, bIsColorAndOpacity) == 0x000000, "Member 'BPUI_SkillInput_Ultra_C_BP_SkillInputBtnColorAndOpacity::bIsColorAndOpacity' has a wrong offset!");

// Function BPUI_SkillInput_Ultra.BPUI_SkillInput_Ultra_C.ExecuteUbergraph_BPUI_SkillInput_Ultra
// 0x0008 (0x0008 - 0x0000)
struct BPUI_SkillInput_Ultra_C_ExecuteUbergraph_BPUI_SkillInput_Ultra final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsColorAndOpacity;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_SkillInput_Ultra_C_ExecuteUbergraph_BPUI_SkillInput_Ultra) == 0x000004, "Wrong alignment on BPUI_SkillInput_Ultra_C_ExecuteUbergraph_BPUI_SkillInput_Ultra");
static_assert(sizeof(BPUI_SkillInput_Ultra_C_ExecuteUbergraph_BPUI_SkillInput_Ultra) == 0x000008, "Wrong size on BPUI_SkillInput_Ultra_C_ExecuteUbergraph_BPUI_SkillInput_Ultra");
static_assert(offsetof(BPUI_SkillInput_Ultra_C_ExecuteUbergraph_BPUI_SkillInput_Ultra, EntryPoint) == 0x000000, "Member 'BPUI_SkillInput_Ultra_C_ExecuteUbergraph_BPUI_SkillInput_Ultra::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_Ultra_C_ExecuteUbergraph_BPUI_SkillInput_Ultra, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BPUI_SkillInput_Ultra_C_ExecuteUbergraph_BPUI_SkillInput_Ultra::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_Ultra_C_ExecuteUbergraph_BPUI_SkillInput_Ultra, K2Node_Event_bIsColorAndOpacity) == 0x000005, "Member 'BPUI_SkillInput_Ultra_C_ExecuteUbergraph_BPUI_SkillInput_Ultra::K2Node_Event_bIsColorAndOpacity' has a wrong offset!");

// Function BPUI_SkillInput_Ultra.BPUI_SkillInput_Ultra_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BPUI_SkillInput_Ultra_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_SkillInput_Ultra_C_PreConstruct) == 0x000001, "Wrong alignment on BPUI_SkillInput_Ultra_C_PreConstruct");
static_assert(sizeof(BPUI_SkillInput_Ultra_C_PreConstruct) == 0x000001, "Wrong size on BPUI_SkillInput_Ultra_C_PreConstruct");
static_assert(offsetof(BPUI_SkillInput_Ultra_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BPUI_SkillInput_Ultra_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BPUI_SkillInput_Ultra.BPUI_SkillInput_Ultra_C.SetSkillBg
// 0x0001 (0x0001 - 0x0000)
struct BPUI_SkillInput_Ultra_C_SetSkillBg final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_SkillInput_Ultra_C_SetSkillBg) == 0x000001, "Wrong alignment on BPUI_SkillInput_Ultra_C_SetSkillBg");
static_assert(sizeof(BPUI_SkillInput_Ultra_C_SetSkillBg) == 0x000001, "Wrong size on BPUI_SkillInput_Ultra_C_SetSkillBg");
static_assert(offsetof(BPUI_SkillInput_Ultra_C_SetSkillBg, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BPUI_SkillInput_Ultra_C_SetSkillBg::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

