#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_MainFormFunctionEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BPUI_MainFormFunctionEntry.BPUI_MainFormFunctionEntry_C.BndEvt__BPUI_MainFormFunctionEntry_W_HTButton_CityTycoon_K2Node_ComponentBoundEvent_1_OnUIButtonPressedDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPUI_MainFormFunctionEntry_C_BndEvt__BPUI_MainFormFunctionEntry_W_HTButton_CityTycoon_K2Node_ComponentBoundEvent_1_OnUIButtonPressedDelegate__DelegateSignature final
{
public:
	class UHTUI_Button*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_MainFormFunctionEntry_C_BndEvt__BPUI_MainFormFunctionEntry_W_HTButton_CityTycoon_K2Node_ComponentBoundEvent_1_OnUIButtonPressedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BPUI_MainFormFunctionEntry_C_BndEvt__BPUI_MainFormFunctionEntry_W_HTButton_CityTycoon_K2Node_ComponentBoundEvent_1_OnUIButtonPressedDelegate__DelegateSignature");
static_assert(sizeof(BPUI_MainFormFunctionEntry_C_BndEvt__BPUI_MainFormFunctionEntry_W_HTButton_CityTycoon_K2Node_ComponentBoundEvent_1_OnUIButtonPressedDelegate__DelegateSignature) == 0x000008, "Wrong size on BPUI_MainFormFunctionEntry_C_BndEvt__BPUI_MainFormFunctionEntry_W_HTButton_CityTycoon_K2Node_ComponentBoundEvent_1_OnUIButtonPressedDelegate__DelegateSignature");
static_assert(offsetof(BPUI_MainFormFunctionEntry_C_BndEvt__BPUI_MainFormFunctionEntry_W_HTButton_CityTycoon_K2Node_ComponentBoundEvent_1_OnUIButtonPressedDelegate__DelegateSignature, Button) == 0x000000, "Member 'BPUI_MainFormFunctionEntry_C_BndEvt__BPUI_MainFormFunctionEntry_W_HTButton_CityTycoon_K2Node_ComponentBoundEvent_1_OnUIButtonPressedDelegate__DelegateSignature::Button' has a wrong offset!");

// Function BPUI_MainFormFunctionEntry.BPUI_MainFormFunctionEntry_C.BP_UpdateTriggeringEnhancedInputAction
// 0x0001 (0x0001 - 0x0000)
struct BPUI_MainFormFunctionEntry_C_BP_UpdateTriggeringEnhancedInputAction final
{
public:
	bool                                          bRevert;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_MainFormFunctionEntry_C_BP_UpdateTriggeringEnhancedInputAction) == 0x000001, "Wrong alignment on BPUI_MainFormFunctionEntry_C_BP_UpdateTriggeringEnhancedInputAction");
static_assert(sizeof(BPUI_MainFormFunctionEntry_C_BP_UpdateTriggeringEnhancedInputAction) == 0x000001, "Wrong size on BPUI_MainFormFunctionEntry_C_BP_UpdateTriggeringEnhancedInputAction");
static_assert(offsetof(BPUI_MainFormFunctionEntry_C_BP_UpdateTriggeringEnhancedInputAction, bRevert) == 0x000000, "Member 'BPUI_MainFormFunctionEntry_C_BP_UpdateTriggeringEnhancedInputAction::bRevert' has a wrong offset!");

// Function BPUI_MainFormFunctionEntry.BPUI_MainFormFunctionEntry_C.ExecuteUbergraph_BPUI_MainFormFunctionEntry
// 0x0058 (0x0058 - 0x0000)
struct BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTPlayerState*                         CallFunc_GetPS_ReturnValue;                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHTUI_Button*                           K2Node_ComponentBoundEvent_Button;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsQuestSubmitted_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          K2Node_Event_bRevert;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue_1;              // 0x0040(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsFinalTowerScene_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry) == 0x000008, "Wrong alignment on BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry");
static_assert(sizeof(BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry) == 0x000058, "Wrong size on BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry");
static_assert(offsetof(BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry, EntryPoint) == 0x000000, "Member 'BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry, CallFunc_GetPS_ReturnValue) == 0x000008, "Member 'BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry::CallFunc_GetPS_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry, CallFunc_MakeLiteralName_ReturnValue) == 0x000010, "Member 'BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry, K2Node_ComponentBoundEvent_Button) == 0x000018, "Member 'BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry, CallFunc_IsQuestSubmitted_ReturnValue) == 0x000020, "Member 'BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry::CallFunc_IsQuestSubmitted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry, K2Node_Event_IsDesignTime) == 0x000022, "Member 'BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry, CallFunc_GetEndTime_ReturnValue) == 0x000024, "Member 'BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry, K2Node_Event_bRevert) == 0x000038, "Member 'BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry::K2Node_Event_bRevert' has a wrong offset!");
static_assert(offsetof(BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry, CallFunc_GetEndTime_ReturnValue_1) == 0x00003C, "Member 'BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry, CallFunc_PlayAnimation_ReturnValue_1) == 0x000040, "Member 'BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry, CallFunc_IsFinalTowerScene_ReturnValue) == 0x000050, "Member 'BPUI_MainFormFunctionEntry_C_ExecuteUbergraph_BPUI_MainFormFunctionEntry::CallFunc_IsFinalTowerScene_ReturnValue' has a wrong offset!");

// Function BPUI_MainFormFunctionEntry.BPUI_MainFormFunctionEntry_C.On_W_HTButton_Pather_Load_CanUseSpecialBrush
// 0x0018 (0x0018 - 0x0000)
struct BPUI_MainFormFunctionEntry_C_On_W_HTButton_Pather_Load_CanUseSpecialBrush final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTPatcherUtil*                         CallFunc_GetInstance_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDownloadingOthers_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_MainFormFunctionEntry_C_On_W_HTButton_Pather_Load_CanUseSpecialBrush) == 0x000008, "Wrong alignment on BPUI_MainFormFunctionEntry_C_On_W_HTButton_Pather_Load_CanUseSpecialBrush");
static_assert(sizeof(BPUI_MainFormFunctionEntry_C_On_W_HTButton_Pather_Load_CanUseSpecialBrush) == 0x000018, "Wrong size on BPUI_MainFormFunctionEntry_C_On_W_HTButton_Pather_Load_CanUseSpecialBrush");
static_assert(offsetof(BPUI_MainFormFunctionEntry_C_On_W_HTButton_Pather_Load_CanUseSpecialBrush, ReturnValue) == 0x000000, "Member 'BPUI_MainFormFunctionEntry_C_On_W_HTButton_Pather_Load_CanUseSpecialBrush::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_MainFormFunctionEntry_C_On_W_HTButton_Pather_Load_CanUseSpecialBrush, CallFunc_GetInstance_ReturnValue) == 0x000008, "Member 'BPUI_MainFormFunctionEntry_C_On_W_HTButton_Pather_Load_CanUseSpecialBrush::CallFunc_GetInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_MainFormFunctionEntry_C_On_W_HTButton_Pather_Load_CanUseSpecialBrush, CallFunc_IsDownloadingOthers_ReturnValue) == 0x000010, "Member 'BPUI_MainFormFunctionEntry_C_On_W_HTButton_Pather_Load_CanUseSpecialBrush::CallFunc_IsDownloadingOthers_ReturnValue' has a wrong offset!");

// Function BPUI_MainFormFunctionEntry.BPUI_MainFormFunctionEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BPUI_MainFormFunctionEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_MainFormFunctionEntry_C_PreConstruct) == 0x000001, "Wrong alignment on BPUI_MainFormFunctionEntry_C_PreConstruct");
static_assert(sizeof(BPUI_MainFormFunctionEntry_C_PreConstruct) == 0x000001, "Wrong size on BPUI_MainFormFunctionEntry_C_PreConstruct");
static_assert(offsetof(BPUI_MainFormFunctionEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BPUI_MainFormFunctionEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

