#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_SkillInput_Jump

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPUI_SkillInput_Jump.BPUI_SkillInput_Jump_C.ExecuteUbergraph_BPUI_SkillInput_Jump
// 0x0020 (0x0020 - 0x0000)
struct BPUI_SkillInput_Jump_C_ExecuteUbergraph_BPUI_SkillInput_Jump final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLanguage_ReturnValue;           // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_SkillInput_Jump_C_ExecuteUbergraph_BPUI_SkillInput_Jump) == 0x000008, "Wrong alignment on BPUI_SkillInput_Jump_C_ExecuteUbergraph_BPUI_SkillInput_Jump");
static_assert(sizeof(BPUI_SkillInput_Jump_C_ExecuteUbergraph_BPUI_SkillInput_Jump) == 0x000020, "Wrong size on BPUI_SkillInput_Jump_C_ExecuteUbergraph_BPUI_SkillInput_Jump");
static_assert(offsetof(BPUI_SkillInput_Jump_C_ExecuteUbergraph_BPUI_SkillInput_Jump, EntryPoint) == 0x000000, "Member 'BPUI_SkillInput_Jump_C_ExecuteUbergraph_BPUI_SkillInput_Jump::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_Jump_C_ExecuteUbergraph_BPUI_SkillInput_Jump, CallFunc_GetCurrentLanguage_ReturnValue) == 0x000008, "Member 'BPUI_SkillInput_Jump_C_ExecuteUbergraph_BPUI_SkillInput_Jump::CallFunc_GetCurrentLanguage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_Jump_C_ExecuteUbergraph_BPUI_SkillInput_Jump, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000018, "Member 'BPUI_SkillInput_Jump_C_ExecuteUbergraph_BPUI_SkillInput_Jump::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_SkillInput_Jump_C_ExecuteUbergraph_BPUI_SkillInput_Jump, K2Node_Event_IsDesignTime) == 0x000019, "Member 'BPUI_SkillInput_Jump_C_ExecuteUbergraph_BPUI_SkillInput_Jump::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function BPUI_SkillInput_Jump.BPUI_SkillInput_Jump_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BPUI_SkillInput_Jump_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_SkillInput_Jump_C_PreConstruct) == 0x000001, "Wrong alignment on BPUI_SkillInput_Jump_C_PreConstruct");
static_assert(sizeof(BPUI_SkillInput_Jump_C_PreConstruct) == 0x000001, "Wrong size on BPUI_SkillInput_Jump_C_PreConstruct");
static_assert(offsetof(BPUI_SkillInput_Jump_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BPUI_SkillInput_Jump_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BPUI_SkillInput_Jump.BPUI_SkillInput_Jump_C.SetSkillBg
// 0x0001 (0x0001 - 0x0000)
struct BPUI_SkillInput_Jump_C_SetSkillBg final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_SkillInput_Jump_C_SetSkillBg) == 0x000001, "Wrong alignment on BPUI_SkillInput_Jump_C_SetSkillBg");
static_assert(sizeof(BPUI_SkillInput_Jump_C_SetSkillBg) == 0x000001, "Wrong size on BPUI_SkillInput_Jump_C_SetSkillBg");
static_assert(offsetof(BPUI_SkillInput_Jump_C_SetSkillBg, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BPUI_SkillInput_Jump_C_SetSkillBg::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

