#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_SkillController

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BPUI_SkillController.BPUI_SkillController_C.BndEvt__BPUI_SkillController_ButtonUltimateSubSkill_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BPUI_SkillController_C_BndEvt__BPUI_SkillController_ButtonUltimateSubSkill_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_SkillController_C_BndEvt__BPUI_SkillController_ButtonUltimateSubSkill_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on BPUI_SkillController_C_BndEvt__BPUI_SkillController_ButtonUltimateSubSkill_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature");
static_assert(sizeof(BPUI_SkillController_C_BndEvt__BPUI_SkillController_ButtonUltimateSubSkill_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong size on BPUI_SkillController_C_BndEvt__BPUI_SkillController_ButtonUltimateSubSkill_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature");
static_assert(offsetof(BPUI_SkillController_C_BndEvt__BPUI_SkillController_ButtonUltimateSubSkill_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature, InVisibility) == 0x000000, "Member 'BPUI_SkillController_C_BndEvt__BPUI_SkillController_ButtonUltimateSubSkill_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature::InVisibility' has a wrong offset!");

// Function BPUI_SkillController.BPUI_SkillController_C.ExecuteUbergraph_BPUI_SkillController
// 0x0018 (0x0018 - 0x0000)
struct BPUI_SkillController_C_ExecuteUbergraph_BPUI_SkillController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTHUD*                                 CallFunc_GetHTHUD_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_AddWidgetByTag_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InVisibility;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_SkillController_C_ExecuteUbergraph_BPUI_SkillController) == 0x000008, "Wrong alignment on BPUI_SkillController_C_ExecuteUbergraph_BPUI_SkillController");
static_assert(sizeof(BPUI_SkillController_C_ExecuteUbergraph_BPUI_SkillController) == 0x000018, "Wrong size on BPUI_SkillController_C_ExecuteUbergraph_BPUI_SkillController");
static_assert(offsetof(BPUI_SkillController_C_ExecuteUbergraph_BPUI_SkillController, EntryPoint) == 0x000000, "Member 'BPUI_SkillController_C_ExecuteUbergraph_BPUI_SkillController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_SkillController_C_ExecuteUbergraph_BPUI_SkillController, CallFunc_GetHTHUD_ReturnValue) == 0x000008, "Member 'BPUI_SkillController_C_ExecuteUbergraph_BPUI_SkillController::CallFunc_GetHTHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_SkillController_C_ExecuteUbergraph_BPUI_SkillController, CallFunc_BP_AddWidgetByTag_ReturnValue) == 0x000010, "Member 'BPUI_SkillController_C_ExecuteUbergraph_BPUI_SkillController::CallFunc_BP_AddWidgetByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_SkillController_C_ExecuteUbergraph_BPUI_SkillController, K2Node_ComponentBoundEvent_InVisibility) == 0x000011, "Member 'BPUI_SkillController_C_ExecuteUbergraph_BPUI_SkillController::K2Node_ComponentBoundEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(BPUI_SkillController_C_ExecuteUbergraph_BPUI_SkillController, K2Node_SwitchEnum_CmpSuccess) == 0x000012, "Member 'BPUI_SkillController_C_ExecuteUbergraph_BPUI_SkillController::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

