#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_Aiming

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_Aiming.BPUI_Aiming_C
// 0x159DE0F8 (0x159DF000 - 0x0F08)
class alignas(0x159DF000) UBPUI_Aiming_C final : public UHTUI_Aiming
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 miaozhun_Yuan_1;                                   // 0x0F10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 miaozhun_Yuan;                                     // 0x0F18(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 miaozhun2_4;                                       // 0x0F20(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 miaozhun2_3;                                       // 0x0F28(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 miaozhun2_2;                                       // 0x0F30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 miaozhun2_1;                                       // 0x0F38(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 miaozhun1_4;                                       // 0x0F40(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 miaozhun1_3;                                       // 0x0F48(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 miaozhun1_2;                                       // 0x0F50(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 miaozhun1_1;                                       // 0x0F58(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_jinyong;                                     // 0x0F60(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Wing_R_Noise;                                   // 0x0F68(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Wing_R_Glow;                                    // 0x0F70(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Wing_R;                                         // 0x0F78(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Wing_L_Noise;                                   // 0x0F80(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Wing_L_Glow;                                    // 0x0F88(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Wing_L;                                         // 0x0F90(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Fx_Wing;                                           // 0x0F98(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           AimPointPanel_yy;                                  // 0x0FA0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       WingAnim;                                          // 0x0FA8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_buketou;                                     // 0x0FB0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_ketou;                                       // 0x0FC0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_yy_buketou;                                  // 0x0FD0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_yy_ketou;                                    // 0x0FE0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_ShowCantStealAbilityPanel(bool bShow);
	void ExecuteUbergraph_BPUI_Aiming(int32 EntryPoint);
	void miaozhun_buketou();
	void miaozhun_ketou();
	void miaozhun_yy_buketou();
	void miaozhun_yy_ketou();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_Aiming_C">();
	}
	static class UBPUI_Aiming_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_Aiming_C>();
	}
};
static_assert(alignof(UBPUI_Aiming_C) == 0x159DF000, "Wrong alignment on UBPUI_Aiming_C");
static_assert(sizeof(UBPUI_Aiming_C) == 0x159DF000, "Wrong size on UBPUI_Aiming_C");
static_assert(offsetof(UBPUI_Aiming_C, UberGraphFrame) == 0x000F08, "Member 'UBPUI_Aiming_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, miaozhun_Yuan_1) == 0x000F10, "Member 'UBPUI_Aiming_C::miaozhun_Yuan_1' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, miaozhun_Yuan) == 0x000F18, "Member 'UBPUI_Aiming_C::miaozhun_Yuan' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, miaozhun2_4) == 0x000F20, "Member 'UBPUI_Aiming_C::miaozhun2_4' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, miaozhun2_3) == 0x000F28, "Member 'UBPUI_Aiming_C::miaozhun2_3' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, miaozhun2_2) == 0x000F30, "Member 'UBPUI_Aiming_C::miaozhun2_2' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, miaozhun2_1) == 0x000F38, "Member 'UBPUI_Aiming_C::miaozhun2_1' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, miaozhun1_4) == 0x000F40, "Member 'UBPUI_Aiming_C::miaozhun1_4' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, miaozhun1_3) == 0x000F48, "Member 'UBPUI_Aiming_C::miaozhun1_3' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, miaozhun1_2) == 0x000F50, "Member 'UBPUI_Aiming_C::miaozhun1_2' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, miaozhun1_1) == 0x000F58, "Member 'UBPUI_Aiming_C::miaozhun1_1' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, Image_jinyong) == 0x000F60, "Member 'UBPUI_Aiming_C::Image_jinyong' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, Fx_Wing_R_Noise) == 0x000F68, "Member 'UBPUI_Aiming_C::Fx_Wing_R_Noise' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, Fx_Wing_R_Glow) == 0x000F70, "Member 'UBPUI_Aiming_C::Fx_Wing_R_Glow' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, Fx_Wing_R) == 0x000F78, "Member 'UBPUI_Aiming_C::Fx_Wing_R' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, Fx_Wing_L_Noise) == 0x000F80, "Member 'UBPUI_Aiming_C::Fx_Wing_L_Noise' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, Fx_Wing_L_Glow) == 0x000F88, "Member 'UBPUI_Aiming_C::Fx_Wing_L_Glow' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, Fx_Wing_L) == 0x000F90, "Member 'UBPUI_Aiming_C::Fx_Wing_L' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, Fx_Wing) == 0x000F98, "Member 'UBPUI_Aiming_C::Fx_Wing' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, AimPointPanel_yy) == 0x000FA0, "Member 'UBPUI_Aiming_C::AimPointPanel_yy' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, WingAnim) == 0x000FA8, "Member 'UBPUI_Aiming_C::WingAnim' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, Color_buketou) == 0x000FB0, "Member 'UBPUI_Aiming_C::Color_buketou' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, Color_ketou) == 0x000FC0, "Member 'UBPUI_Aiming_C::Color_ketou' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, Color_yy_buketou) == 0x000FD0, "Member 'UBPUI_Aiming_C::Color_yy_buketou' has a wrong offset!");
static_assert(offsetof(UBPUI_Aiming_C, Color_yy_ketou) == 0x000FE0, "Member 'UBPUI_Aiming_C::Color_yy_ketou' has a wrong offset!");

}

