#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_Login

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "HTGame_structs.hpp"


namespace SDK::Params
{

// Function BPUI_Login.BPUI_Login_C.BndEvt__BPUI_Login_BtnCloseCadpa_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPUI_Login_C_BndEvt__BPUI_Login_BtnCloseCadpa_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_Login_C_BndEvt__BPUI_Login_BtnCloseCadpa_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on BPUI_Login_C_BndEvt__BPUI_Login_BtnCloseCadpa_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(BPUI_Login_C_BndEvt__BPUI_Login_BtnCloseCadpa_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on BPUI_Login_C_BndEvt__BPUI_Login_BtnCloseCadpa_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(BPUI_Login_C_BndEvt__BPUI_Login_BtnCloseCadpa_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'BPUI_Login_C_BndEvt__BPUI_Login_BtnCloseCadpa_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function BPUI_Login.BPUI_Login_C.BndEvt__BPUI_Login_BtnOpenCadpa_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPUI_Login_C_BndEvt__BPUI_Login_BtnOpenCadpa_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_Login_C_BndEvt__BPUI_Login_BtnOpenCadpa_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on BPUI_Login_C_BndEvt__BPUI_Login_BtnOpenCadpa_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(BPUI_Login_C_BndEvt__BPUI_Login_BtnOpenCadpa_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on BPUI_Login_C_BndEvt__BPUI_Login_BtnOpenCadpa_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(BPUI_Login_C_BndEvt__BPUI_Login_BtnOpenCadpa_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'BPUI_Login_C_BndEvt__BPUI_Login_BtnOpenCadpa_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function BPUI_Login.BPUI_Login_C.BndEvt__BPUI_Login_UI_Button_Account_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPUI_Login_C_BndEvt__BPUI_Login_UI_Button_Account_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_Login_C_BndEvt__BPUI_Login_UI_Button_Account_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on BPUI_Login_C_BndEvt__BPUI_Login_UI_Button_Account_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(BPUI_Login_C_BndEvt__BPUI_Login_UI_Button_Account_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on BPUI_Login_C_BndEvt__BPUI_Login_UI_Button_Account_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(BPUI_Login_C_BndEvt__BPUI_Login_UI_Button_Account_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'BPUI_Login_C_BndEvt__BPUI_Login_UI_Button_Account_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function BPUI_Login.BPUI_Login_C.BndEvt__BPUI_Login_UI_Button_AccountClose_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPUI_Login_C_BndEvt__BPUI_Login_UI_Button_AccountClose_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_Login_C_BndEvt__BPUI_Login_UI_Button_AccountClose_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on BPUI_Login_C_BndEvt__BPUI_Login_UI_Button_AccountClose_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(BPUI_Login_C_BndEvt__BPUI_Login_UI_Button_AccountClose_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on BPUI_Login_C_BndEvt__BPUI_Login_UI_Button_AccountClose_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(BPUI_Login_C_BndEvt__BPUI_Login_UI_Button_AccountClose_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'BPUI_Login_C_BndEvt__BPUI_Login_UI_Button_AccountClose_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function BPUI_Login.BPUI_Login_C.BndEvt__BPUI_Login_UI_Button_Feedback_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPUI_Login_C_BndEvt__BPUI_Login_UI_Button_Feedback_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_Login_C_BndEvt__BPUI_Login_UI_Button_Feedback_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on BPUI_Login_C_BndEvt__BPUI_Login_UI_Button_Feedback_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(BPUI_Login_C_BndEvt__BPUI_Login_UI_Button_Feedback_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on BPUI_Login_C_BndEvt__BPUI_Login_UI_Button_Feedback_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(BPUI_Login_C_BndEvt__BPUI_Login_UI_Button_Feedback_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'BPUI_Login_C_BndEvt__BPUI_Login_UI_Button_Feedback_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function BPUI_Login.BPUI_Login_C.ExecuteUbergraph_BPUI_Login
// 0x0108 (0x0108 - 0x0000)
struct BPUI_Login_C_ExecuteUbergraph_BPUI_Login final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& FailedUrl)> K2Node_CreateDelegate_OutputDelegate;            // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0020(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0038(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue_1;              // 0x0048(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue_2;              // 0x0060(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	EHTPlatformType                               CallFunc_SwitchPlatform_OutPlatformType;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x1];                                       // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_FailedUrl;                      // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOversea_ReturnValue;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetLooping_ReturnValue;                   // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHTPlatformType                               CallFunc_SwitchPlatform_OutPlatformType_1;         // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayStation_ReturnValue;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventGlobal_ReturnValue_1;            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventGlobal_ReturnValue_2;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOversea_ReturnValue_1;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTOneSDKUtil*                          CallFunc_GetInstance_ReturnValue;                  // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTPlayerState*                         CallFunc_GetPS_ReturnValue;                        // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOversea_ReturnValue_2;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 CallFunc_K2_GetWorld_ReturnValue;                  // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenURL_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHTRegionType                                 CallFunc_GetRegionType_ReturnValue;                // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB[0x5];                                       // 0x00DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLanguage_ReturnValue;           // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCountryCode_IP_ReturnValue;            // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHTPlatformType                               CallFunc_SwitchPlatform_OutPlatformType_2;         // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCloudGame_ReturnValue;                  // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login) == 0x000008, "Wrong alignment on BPUI_Login_C_ExecuteUbergraph_BPUI_Login");
static_assert(sizeof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login) == 0x000108, "Wrong size on BPUI_Login_C_ExecuteUbergraph_BPUI_Login");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, EntryPoint) == 0x000000, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, K2Node_ComponentBoundEvent_Button_4) == 0x000018, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000020, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, K2Node_ComponentBoundEvent_Button_3) == 0x000030, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_PlayAnimation_ReturnValue) == 0x000038, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_PlayAnimation_ReturnValue_1) == 0x000048, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, K2Node_ComponentBoundEvent_Button_2) == 0x000058, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_PlayAnimation_ReturnValue_2) == 0x000060, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_SwitchPlatform_OutPlatformType) == 0x000070, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_SwitchPlatform_OutPlatformType' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, K2Node_SwitchEnum_CmpSuccess) == 0x000071, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, K2Node_Event_IsDesignTime) == 0x000072, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_PostEventGlobal_ReturnValue) == 0x000074, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, K2Node_CustomEvent_FailedUrl) == 0x000078, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::K2Node_CustomEvent_FailedUrl' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_IsOversea_ReturnValue) == 0x000088, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_IsOversea_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_Not_PreBool_ReturnValue) == 0x000089, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_SetLooping_ReturnValue) == 0x00008A, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_SetLooping_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_SwitchPlatform_OutPlatformType_1) == 0x00008B, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_SwitchPlatform_OutPlatformType_1' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, K2Node_SwitchEnum_CmpSuccess_1) == 0x00008C, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, K2Node_ComponentBoundEvent_Button_1) == 0x000090, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_IsPlayStation_ReturnValue) == 0x000098, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_IsPlayStation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_PostEventGlobal_ReturnValue_1) == 0x00009C, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_PostEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_PostEventGlobal_ReturnValue_2) == 0x0000A0, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_PostEventGlobal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, K2Node_ComponentBoundEvent_Button) == 0x0000A8, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_IsOversea_ReturnValue_1) == 0x0000B0, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_IsOversea_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_GetInstance_ReturnValue) == 0x0000B8, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_GetInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_GetPS_ReturnValue) == 0x0000C0, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_GetPS_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_IsOversea_ReturnValue_2) == 0x0000C8, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_IsOversea_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_K2_GetWorld_ReturnValue) == 0x0000D0, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_K2_GetWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_OpenURL_ReturnValue) == 0x0000D8, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_OpenURL_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_GetRegionType_ReturnValue) == 0x0000D9, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_GetRegionType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, K2Node_SwitchEnum_CmpSuccess_2) == 0x0000DA, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_GetCurrentLanguage_ReturnValue) == 0x0000E0, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_GetCurrentLanguage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_GetCountryCode_IP_ReturnValue) == 0x0000F0, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_GetCountryCode_IP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_Array_Contains_ReturnValue) == 0x000100, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000101, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_SwitchPlatform_OutPlatformType_2) == 0x000102, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_SwitchPlatform_OutPlatformType_2' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, K2Node_SwitchEnum_CmpSuccess_3) == 0x000103, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_ExecuteUbergraph_BPUI_Login, CallFunc_IsCloudGame_ReturnValue) == 0x000104, "Member 'BPUI_Login_C_ExecuteUbergraph_BPUI_Login::CallFunc_IsCloudGame_ReturnValue' has a wrong offset!");

// Function BPUI_Login.BPUI_Login_C.OnAccountClosed
// 0x0010 (0x0010 - 0x0000)
struct BPUI_Login_C_OnAccountClosed final
{
public:
	bool                                          CallFunc_IsGamepadInputType_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUINavigationSubsystem*                 CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_Login_C_OnAccountClosed) == 0x000008, "Wrong alignment on BPUI_Login_C_OnAccountClosed");
static_assert(sizeof(BPUI_Login_C_OnAccountClosed) == 0x000010, "Wrong size on BPUI_Login_C_OnAccountClosed");
static_assert(offsetof(BPUI_Login_C_OnAccountClosed, CallFunc_IsGamepadInputType_ReturnValue) == 0x000000, "Member 'BPUI_Login_C_OnAccountClosed::CallFunc_IsGamepadInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_OnAccountClosed, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'BPUI_Login_C_OnAccountClosed::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");

// Function BPUI_Login.BPUI_Login_C.OnAccountOpened
// 0x0010 (0x0010 - 0x0000)
struct BPUI_Login_C_OnAccountOpened final
{
public:
	bool                                          CallFunc_IsGamepadInputType_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUINavigationSubsystem*                 CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_Login_C_OnAccountOpened) == 0x000008, "Wrong alignment on BPUI_Login_C_OnAccountOpened");
static_assert(sizeof(BPUI_Login_C_OnAccountOpened) == 0x000010, "Wrong size on BPUI_Login_C_OnAccountOpened");
static_assert(offsetof(BPUI_Login_C_OnAccountOpened, CallFunc_IsGamepadInputType_ReturnValue) == 0x000000, "Member 'BPUI_Login_C_OnAccountOpened::CallFunc_IsGamepadInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_Login_C_OnAccountOpened, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'BPUI_Login_C_OnAccountOpened::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");

// Function BPUI_Login.BPUI_Login_C.openFailed
// 0x0010 (0x0010 - 0x0000)
struct BPUI_Login_C_openFailed final
{
public:
	class FString                                 FailedUrl;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_Login_C_openFailed) == 0x000008, "Wrong alignment on BPUI_Login_C_openFailed");
static_assert(sizeof(BPUI_Login_C_openFailed) == 0x000010, "Wrong size on BPUI_Login_C_openFailed");
static_assert(offsetof(BPUI_Login_C_openFailed, FailedUrl) == 0x000000, "Member 'BPUI_Login_C_openFailed::FailedUrl' has a wrong offset!");

// Function BPUI_Login.BPUI_Login_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BPUI_Login_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_Login_C_PreConstruct) == 0x000001, "Wrong alignment on BPUI_Login_C_PreConstruct");
static_assert(sizeof(BPUI_Login_C_PreConstruct) == 0x000001, "Wrong size on BPUI_Login_C_PreConstruct");
static_assert(offsetof(BPUI_Login_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BPUI_Login_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

