#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_Aiming

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BPUI_Aiming.BPUI_Aiming_C.BP_ShowCantStealAbilityPanel
// 0x0001 (0x0001 - 0x0000)
struct BPUI_Aiming_C_BP_ShowCantStealAbilityPanel final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_Aiming_C_BP_ShowCantStealAbilityPanel) == 0x000001, "Wrong alignment on BPUI_Aiming_C_BP_ShowCantStealAbilityPanel");
static_assert(sizeof(BPUI_Aiming_C_BP_ShowCantStealAbilityPanel) == 0x000001, "Wrong size on BPUI_Aiming_C_BP_ShowCantStealAbilityPanel");
static_assert(offsetof(BPUI_Aiming_C_BP_ShowCantStealAbilityPanel, bShow) == 0x000000, "Member 'BPUI_Aiming_C_BP_ShowCantStealAbilityPanel::bShow' has a wrong offset!");

// Function BPUI_Aiming.BPUI_Aiming_C.ExecuteUbergraph_BPUI_Aiming
// 0x0018 (0x0018 - 0x0000)
struct BPUI_Aiming_C_ExecuteUbergraph_BPUI_Aiming final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShow;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_Aiming_C_ExecuteUbergraph_BPUI_Aiming) == 0x000004, "Wrong alignment on BPUI_Aiming_C_ExecuteUbergraph_BPUI_Aiming");
static_assert(sizeof(BPUI_Aiming_C_ExecuteUbergraph_BPUI_Aiming) == 0x000018, "Wrong size on BPUI_Aiming_C_ExecuteUbergraph_BPUI_Aiming");
static_assert(offsetof(BPUI_Aiming_C_ExecuteUbergraph_BPUI_Aiming, EntryPoint) == 0x000000, "Member 'BPUI_Aiming_C_ExecuteUbergraph_BPUI_Aiming::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_Aiming_C_ExecuteUbergraph_BPUI_Aiming, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BPUI_Aiming_C_ExecuteUbergraph_BPUI_Aiming::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BPUI_Aiming_C_ExecuteUbergraph_BPUI_Aiming, K2Node_Event_bShow) == 0x000005, "Member 'BPUI_Aiming_C_ExecuteUbergraph_BPUI_Aiming::K2Node_Event_bShow' has a wrong offset!");
static_assert(offsetof(BPUI_Aiming_C_ExecuteUbergraph_BPUI_Aiming, K2Node_SwitchEnum_CmpSuccess) == 0x000006, "Member 'BPUI_Aiming_C_ExecuteUbergraph_BPUI_Aiming::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPUI_Aiming_C_ExecuteUbergraph_BPUI_Aiming, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BPUI_Aiming_C_ExecuteUbergraph_BPUI_Aiming::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BPUI_Aiming.BPUI_Aiming_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BPUI_Aiming_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_Aiming_C_PreConstruct) == 0x000001, "Wrong alignment on BPUI_Aiming_C_PreConstruct");
static_assert(sizeof(BPUI_Aiming_C_PreConstruct) == 0x000001, "Wrong size on BPUI_Aiming_C_PreConstruct");
static_assert(offsetof(BPUI_Aiming_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BPUI_Aiming_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

