#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_MessageEx

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_MessageEx.BPUI_MessageEx_C
// 0x159DE128 (0x159DF000 - 0x0ED8)
class alignas(0x159DF000) UBPUI_MessageEx_C final : public UHTUI_MessageEx
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Bg_95;                                       // 0x0EE0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Notice;                                // 0x0EE8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       OpenUI;                                            // 0x0EF0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CloseUI;                                           // 0x0EF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_BPUI_MessageEx(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_MessageEx_C">();
	}
	static class UBPUI_MessageEx_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_MessageEx_C>();
	}
};
static_assert(alignof(UBPUI_MessageEx_C) == 0x159DF000, "Wrong alignment on UBPUI_MessageEx_C");
static_assert(sizeof(UBPUI_MessageEx_C) == 0x159DF000, "Wrong size on UBPUI_MessageEx_C");
static_assert(offsetof(UBPUI_MessageEx_C, UberGraphFrame) == 0x000ED8, "Member 'UBPUI_MessageEx_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_MessageEx_C, Image_Bg_95) == 0x000EE0, "Member 'UBPUI_MessageEx_C::Image_Bg_95' has a wrong offset!");
static_assert(offsetof(UBPUI_MessageEx_C, CanvasPanel_Notice) == 0x000EE8, "Member 'UBPUI_MessageEx_C::CanvasPanel_Notice' has a wrong offset!");
static_assert(offsetof(UBPUI_MessageEx_C, OpenUI) == 0x000EF0, "Member 'UBPUI_MessageEx_C::OpenUI' has a wrong offset!");
static_assert(offsetof(UBPUI_MessageEx_C, CloseUI) == 0x000EF8, "Member 'UBPUI_MessageEx_C::CloseUI' has a wrong offset!");

}

