#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_BufferManager

#include "Basic.hpp"

#include "HTGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_BufferManager.BPUI_BufferManager_C
// 0x159DE098 (0x159DF000 - 0x0F68)
class alignas(0x159DF000) UBPUI_BufferManager_C final : public UHTUI_BufferManager
{
public:
	class URetainerBox*                           RetainerBox_0;                                     // 0x0F68(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_Buffer_C*                         BPUI_Buffer_5;                                     // 0x0F70(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_Buffer_C*                         BPUI_Buffer_4;                                     // 0x0F78(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_Buffer_C*                         BPUI_Buffer_3;                                     // 0x0F80(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_Buffer_C*                         BPUI_Buffer_2;                                     // 0x0F88(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_Buffer_C*                         BPUI_Buffer_1;                                     // 0x0F90(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_Buffer_C*                         BPUI_Buffer;                                       // 0x0F98(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_BufferManager_C">();
	}
	static class UBPUI_BufferManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_BufferManager_C>();
	}
};
static_assert(alignof(UBPUI_BufferManager_C) == 0x159DF000, "Wrong alignment on UBPUI_BufferManager_C");
static_assert(sizeof(UBPUI_BufferManager_C) == 0x159DF000, "Wrong size on UBPUI_BufferManager_C");
static_assert(offsetof(UBPUI_BufferManager_C, RetainerBox_0) == 0x000F68, "Member 'UBPUI_BufferManager_C::RetainerBox_0' has a wrong offset!");
static_assert(offsetof(UBPUI_BufferManager_C, BPUI_Buffer_5) == 0x000F70, "Member 'UBPUI_BufferManager_C::BPUI_Buffer_5' has a wrong offset!");
static_assert(offsetof(UBPUI_BufferManager_C, BPUI_Buffer_4) == 0x000F78, "Member 'UBPUI_BufferManager_C::BPUI_Buffer_4' has a wrong offset!");
static_assert(offsetof(UBPUI_BufferManager_C, BPUI_Buffer_3) == 0x000F80, "Member 'UBPUI_BufferManager_C::BPUI_Buffer_3' has a wrong offset!");
static_assert(offsetof(UBPUI_BufferManager_C, BPUI_Buffer_2) == 0x000F88, "Member 'UBPUI_BufferManager_C::BPUI_Buffer_2' has a wrong offset!");
static_assert(offsetof(UBPUI_BufferManager_C, BPUI_Buffer_1) == 0x000F90, "Member 'UBPUI_BufferManager_C::BPUI_Buffer_1' has a wrong offset!");
static_assert(offsetof(UBPUI_BufferManager_C, BPUI_Buffer) == 0x000F98, "Member 'UBPUI_BufferManager_C::BPUI_Buffer' has a wrong offset!");

}

