#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_MainFormFunctionEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPUI_MainFormFunctionEntry.BPUI_MainFormFunctionEntry_C
// 0x159DE0C8 (0x159DF000 - 0x0F38)
class alignas(0x159DF000) UBPUI_MainFormFunctionEntry_C final : public UHTUI_MainFormFunctionEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F38(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_HTButton_MainFormFunction_C*         W_HTButton_Quest;                                  // 0x0F40(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HTButton_MainFormFunction_C*         W_HTButton_Pather_Load;                            // 0x0F48(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HTButton_MainFormFunction_C*         W_HTButton_FinalTowerCharacter;                    // 0x0F50(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HTButton_MainFormFunction_C*         W_HTButton_FinalTowerBag;                          // 0x0F58(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HTButton_MainFormFunction_C*         W_HTButton_Bag;                                    // 0x0F60(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HTButton_MainFormFunction_C*         W_HTButton_AdventureManual;                        // 0x0F68(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HTButton_MainFormFunction_C*         W_HTButton_Activity;                               // 0x0F70(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_16;                                        // 0x0F78(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0F80(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHTPlayerMappableKey*                   HTPlayerMappableKey_11;                            // 0x0F88(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHTGamepadIcon*                         HTGamepadIcon_105;                                 // 0x0F90(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ExitFinalTower;                                    // 0x0F98(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HTButton_MainFormFunction_C*         ButtonCharacterInfo2;                              // 0x0FA0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_RedPoint_C*                       BPUI_RedPoint_Lottery;                             // 0x0FA8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_RedPoint_C*                       BPUI_RedPoint_CombatAward;                         // 0x0FB0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_RedPoint_C*                       BPUI_RedPoint_AM;                                  // 0x0FB8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_RedPoint_C*                       BPUI_RedPoint_337;                                 // 0x0FC0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_RedPoint_C*                       BPUI_RedPoint_5;                                   // 0x0FC8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_RedPoint_C*                       BPUI_RedPoint_4;                                   // 0x0FD0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_RedPoint_C*                       BPUI_RedPoint_3;                                   // 0x0FD8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_RedPoint_C*                       BPUI_RedPoint_2;                                   // 0x0FE0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_RedPoint_C*                       BPUI_RedPoint_1;                                   // 0x0FE8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPUI_RedPoint_C*                       BPUI_RedPoint;                                     // 0x0FF0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector                                Camera_Location;                                   // 0x0FF8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Camera_Rotator;                                    // 0x1010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         In_Spring_Arm_Length;                              // 0x1028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102C[0x4];                                     // 0x102C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Camera_Rotator_0;                                  // 0x1030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void BndEvt__BPUI_MainFormFunctionEntry_W_HTButton_CityTycoon_K2Node_ComponentBoundEvent_1_OnUIButtonPressedDelegate__DelegateSignature(class UHTUI_Button* Button);
	void BP_UpdateTriggeringEnhancedInputAction(bool bRevert);
	void Construct();
	void ExecuteUbergraph_BPUI_MainFormFunctionEntry(int32 EntryPoint);
	bool On_W_HTButton_Pather_Load_CanUseSpecialBrush();
	void PreConstruct(bool IsDesignTime);
	void SequenceEvent();
	void SequenceEvent_0();
	void SequenceEvent__ENTRYPOINTBPUI_MainFormFunctionEntry();
	void SequenceEvent__ENTRYPOINTBPUI_MainFormFunctionEntry_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPUI_MainFormFunctionEntry_C">();
	}
	static class UBPUI_MainFormFunctionEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPUI_MainFormFunctionEntry_C>();
	}
};
static_assert(alignof(UBPUI_MainFormFunctionEntry_C) == 0x159DF000, "Wrong alignment on UBPUI_MainFormFunctionEntry_C");
static_assert(sizeof(UBPUI_MainFormFunctionEntry_C) == 0x159DF000, "Wrong size on UBPUI_MainFormFunctionEntry_C");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, UberGraphFrame) == 0x000F38, "Member 'UBPUI_MainFormFunctionEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, W_HTButton_Quest) == 0x000F40, "Member 'UBPUI_MainFormFunctionEntry_C::W_HTButton_Quest' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, W_HTButton_Pather_Load) == 0x000F48, "Member 'UBPUI_MainFormFunctionEntry_C::W_HTButton_Pather_Load' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, W_HTButton_FinalTowerCharacter) == 0x000F50, "Member 'UBPUI_MainFormFunctionEntry_C::W_HTButton_FinalTowerCharacter' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, W_HTButton_FinalTowerBag) == 0x000F58, "Member 'UBPUI_MainFormFunctionEntry_C::W_HTButton_FinalTowerBag' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, W_HTButton_Bag) == 0x000F60, "Member 'UBPUI_MainFormFunctionEntry_C::W_HTButton_Bag' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, W_HTButton_AdventureManual) == 0x000F68, "Member 'UBPUI_MainFormFunctionEntry_C::W_HTButton_AdventureManual' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, W_HTButton_Activity) == 0x000F70, "Member 'UBPUI_MainFormFunctionEntry_C::W_HTButton_Activity' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, Overlay_16) == 0x000F78, "Member 'UBPUI_MainFormFunctionEntry_C::Overlay_16' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, InvalidationBox_0) == 0x000F80, "Member 'UBPUI_MainFormFunctionEntry_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, HTPlayerMappableKey_11) == 0x000F88, "Member 'UBPUI_MainFormFunctionEntry_C::HTPlayerMappableKey_11' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, HTGamepadIcon_105) == 0x000F90, "Member 'UBPUI_MainFormFunctionEntry_C::HTGamepadIcon_105' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, ExitFinalTower) == 0x000F98, "Member 'UBPUI_MainFormFunctionEntry_C::ExitFinalTower' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, ButtonCharacterInfo2) == 0x000FA0, "Member 'UBPUI_MainFormFunctionEntry_C::ButtonCharacterInfo2' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, BPUI_RedPoint_Lottery) == 0x000FA8, "Member 'UBPUI_MainFormFunctionEntry_C::BPUI_RedPoint_Lottery' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, BPUI_RedPoint_CombatAward) == 0x000FB0, "Member 'UBPUI_MainFormFunctionEntry_C::BPUI_RedPoint_CombatAward' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, BPUI_RedPoint_AM) == 0x000FB8, "Member 'UBPUI_MainFormFunctionEntry_C::BPUI_RedPoint_AM' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, BPUI_RedPoint_337) == 0x000FC0, "Member 'UBPUI_MainFormFunctionEntry_C::BPUI_RedPoint_337' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, BPUI_RedPoint_5) == 0x000FC8, "Member 'UBPUI_MainFormFunctionEntry_C::BPUI_RedPoint_5' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, BPUI_RedPoint_4) == 0x000FD0, "Member 'UBPUI_MainFormFunctionEntry_C::BPUI_RedPoint_4' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, BPUI_RedPoint_3) == 0x000FD8, "Member 'UBPUI_MainFormFunctionEntry_C::BPUI_RedPoint_3' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, BPUI_RedPoint_2) == 0x000FE0, "Member 'UBPUI_MainFormFunctionEntry_C::BPUI_RedPoint_2' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, BPUI_RedPoint_1) == 0x000FE8, "Member 'UBPUI_MainFormFunctionEntry_C::BPUI_RedPoint_1' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, BPUI_RedPoint) == 0x000FF0, "Member 'UBPUI_MainFormFunctionEntry_C::BPUI_RedPoint' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, Camera_Location) == 0x000FF8, "Member 'UBPUI_MainFormFunctionEntry_C::Camera_Location' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, Camera_Rotator) == 0x001010, "Member 'UBPUI_MainFormFunctionEntry_C::Camera_Rotator' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, In_Spring_Arm_Length) == 0x001028, "Member 'UBPUI_MainFormFunctionEntry_C::In_Spring_Arm_Length' has a wrong offset!");
static_assert(offsetof(UBPUI_MainFormFunctionEntry_C, Camera_Rotator_0) == 0x001030, "Member 'UBPUI_MainFormFunctionEntry_C::Camera_Rotator_0' has a wrong offset!");

}

