#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_UpdaterBG

#include "Basic.hpp"

#include "HTGame_structs.hpp"


namespace SDK::Params
{

// Function BPUI_UpdaterBG.BPUI_UpdaterBG_C.BP_PlayVideo
// 0x0010 (0x0010 - 0x0000)
struct BPUI_UpdaterBG_C_BP_PlayVideo final
{
public:
	class FString                                 VideoUrl;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_UpdaterBG_C_BP_PlayVideo) == 0x000008, "Wrong alignment on BPUI_UpdaterBG_C_BP_PlayVideo");
static_assert(sizeof(BPUI_UpdaterBG_C_BP_PlayVideo) == 0x000010, "Wrong size on BPUI_UpdaterBG_C_BP_PlayVideo");
static_assert(offsetof(BPUI_UpdaterBG_C_BP_PlayVideo, VideoUrl) == 0x000000, "Member 'BPUI_UpdaterBG_C_BP_PlayVideo::VideoUrl' has a wrong offset!");

// Function BPUI_UpdaterBG.BPUI_UpdaterBG_C.BP_PlayVideoBGM
// 0x0004 (0x0004 - 0x0000)
struct BPUI_UpdaterBG_C_BP_PlayVideoBGM final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_UpdaterBG_C_BP_PlayVideoBGM) == 0x000004, "Wrong alignment on BPUI_UpdaterBG_C_BP_PlayVideoBGM");
static_assert(sizeof(BPUI_UpdaterBG_C_BP_PlayVideoBGM) == 0x000004, "Wrong size on BPUI_UpdaterBG_C_BP_PlayVideoBGM");
static_assert(offsetof(BPUI_UpdaterBG_C_BP_PlayVideoBGM, Index_0) == 0x000000, "Member 'BPUI_UpdaterBG_C_BP_PlayVideoBGM::Index_0' has a wrong offset!");

// Function BPUI_UpdaterBG.BPUI_UpdaterBG_C.ExecuteUbergraph_BPUI_UpdaterBG
// 0x0040 (0x0040 - 0x0000)
struct BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHTPlatformType                               CallFunc_SwitchPlatform_OutPlatformType;           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_VideoUrl;                             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventGlobal_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventGlobal_ReturnValue_1;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventGlobal_ReturnValue_2;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG) == 0x000008, "Wrong alignment on BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG");
static_assert(sizeof(BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG) == 0x000040, "Wrong size on BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG");
static_assert(offsetof(BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG, EntryPoint) == 0x000000, "Member 'BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG, K2Node_Event_IsDesignTime) == 0x000014, "Member 'BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG, CallFunc_SwitchPlatform_OutPlatformType) == 0x000015, "Member 'BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG::CallFunc_SwitchPlatform_OutPlatformType' has a wrong offset!");
static_assert(offsetof(BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG, K2Node_SwitchEnum_CmpSuccess) == 0x000016, "Member 'BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG, K2Node_Event_VideoUrl) == 0x000018, "Member 'BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG::K2Node_Event_VideoUrl' has a wrong offset!");
static_assert(offsetof(BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG, K2Node_Event_index) == 0x000028, "Member 'BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG, CallFunc_PostEventGlobal_ReturnValue) == 0x00002C, "Member 'BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG::CallFunc_PostEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG, K2Node_SwitchInteger_CmpSuccess) == 0x000030, "Member 'BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG, CallFunc_PostEventGlobal_ReturnValue_1) == 0x000034, "Member 'BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG::CallFunc_PostEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG, CallFunc_PostEventGlobal_ReturnValue_2) == 0x000038, "Member 'BPUI_UpdaterBG_C_ExecuteUbergraph_BPUI_UpdaterBG::CallFunc_PostEventGlobal_ReturnValue_2' has a wrong offset!");

// Function BPUI_UpdaterBG.BPUI_UpdaterBG_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BPUI_UpdaterBG_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPUI_UpdaterBG_C_PreConstruct) == 0x000001, "Wrong alignment on BPUI_UpdaterBG_C_PreConstruct");
static_assert(sizeof(BPUI_UpdaterBG_C_PreConstruct) == 0x000001, "Wrong size on BPUI_UpdaterBG_C_PreConstruct");
static_assert(offsetof(BPUI_UpdaterBG_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BPUI_UpdaterBG_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

