#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BreakableKit

#include "Basic.hpp"

#include "HTWorldPartition_classes.hpp"


namespace SDK
{

// Class BreakableKit.BreakableWorldPartitionActor
// 0x0000 (0x02D0 - 0x02D0)
class ABreakableWorldPartitionActor final : public AHTPartitionActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BreakableWorldPartitionActor">();
	}
	static class ABreakableWorldPartitionActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABreakableWorldPartitionActor>();
	}
};
static_assert(alignof(ABreakableWorldPartitionActor) == 0x000008, "Wrong alignment on ABreakableWorldPartitionActor");
static_assert(sizeof(ABreakableWorldPartitionActor) == 0x0002D0, "Wrong size on ABreakableWorldPartitionActor");

// Class BreakableKit.EditorBreakableActor
// 0x0008 (0x02D0 - 0x02C8)
class AEditorBreakableActor final : public AHTEditorActor
{
public:
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorBreakableActor">();
	}
	static class AEditorBreakableActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEditorBreakableActor>();
	}
};
static_assert(alignof(AEditorBreakableActor) == 0x000008, "Wrong alignment on AEditorBreakableActor");
static_assert(sizeof(AEditorBreakableActor) == 0x0002D0, "Wrong size on AEditorBreakableActor");
static_assert(offsetof(AEditorBreakableActor, StaticMeshComponent) == 0x0002C8, "Member 'AEditorBreakableActor::StaticMeshComponent' has a wrong offset!");

}

