#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTService_CheckChangeFly

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTService_CheckChangeFly.BTService_CheckChangeFly_C.CheckFly
// 0x0060 (0x0060 - 0x0000)
struct BTService_CheckChangeFly_C_CheckFly final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingSkill_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 CallFunc_K2_GetWorld_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNavPathValid_ReturnValue;               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_As__;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_CheckChangeFly_C_CheckFly) == 0x000008, "Wrong alignment on BTService_CheckChangeFly_C_CheckFly");
static_assert(sizeof(BTService_CheckChangeFly_C_CheckFly) == 0x000060, "Wrong size on BTService_CheckChangeFly_C_CheckFly");
static_assert(offsetof(BTService_CheckChangeFly_C_CheckFly, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BTService_CheckChangeFly_C_CheckFly::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_CheckFly, CallFunc_IsUsingSkill_ReturnValue) == 0x000001, "Member 'BTService_CheckChangeFly_C_CheckFly::CallFunc_IsUsingSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_CheckFly, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'BTService_CheckChangeFly_C_CheckFly::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_CheckFly, CallFunc_K2_GetWorld_ReturnValue) == 0x000008, "Member 'BTService_CheckChangeFly_C_CheckFly::CallFunc_K2_GetWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_CheckFly, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BTService_CheckChangeFly_C_CheckFly::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_CheckFly, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000028, "Member 'BTService_CheckChangeFly_C_CheckFly::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_CheckFly, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000030, "Member 'BTService_CheckChangeFly_C_CheckFly::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_CheckFly, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'BTService_CheckChangeFly_C_CheckFly::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_CheckFly, CallFunc_IsNavPathValid_ReturnValue) == 0x000049, "Member 'BTService_CheckChangeFly_C_CheckFly::CallFunc_IsNavPathValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_CheckFly, K2Node_DynamicCast_As__) == 0x000050, "Member 'BTService_CheckChangeFly_C_CheckFly::K2Node_DynamicCast_As__' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_CheckFly, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BTService_CheckChangeFly_C_CheckFly::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_CheckFly, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000059, "Member 'BTService_CheckChangeFly_C_CheckFly::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function BTService_CheckChangeFly.BTService_CheckChangeFly_C.ExecuteUbergraph_BTService_CheckChangeFly
// 0x0040 (0x0040 - 0x0000)
struct BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTAICharacter*                         K2Node_DynamicCast_AsHTAICharacter;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly) == 0x000008, "Wrong alignment on BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly");
static_assert(sizeof(BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly) == 0x000040, "Wrong size on BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly");
static_assert(offsetof(BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly, EntryPoint) == 0x000000, "Member 'BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly, K2Node_Event_OwnerController_1) == 0x000008, "Member 'BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly, K2Node_Event_ControlledPawn_1) == 0x000010, "Member 'BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly, K2Node_Event_OwnerController) == 0x000018, "Member 'BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly, K2Node_Event_ControlledPawn) == 0x000020, "Member 'BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly, K2Node_DynamicCast_AsHTAICharacter) == 0x000030, "Member 'BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly::K2Node_DynamicCast_AsHTAICharacter' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000039, "Member 'BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly, CallFunc_BooleanAND_ReturnValue) == 0x00003A, "Member 'BTService_CheckChangeFly_C_ExecuteUbergraph_BTService_CheckChangeFly::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BTService_CheckChangeFly.BTService_CheckChangeFly_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTService_CheckChangeFly_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_CheckChangeFly_C_ReceiveActivationAI) == 0x000008, "Wrong alignment on BTService_CheckChangeFly_C_ReceiveActivationAI");
static_assert(sizeof(BTService_CheckChangeFly_C_ReceiveActivationAI) == 0x000010, "Wrong size on BTService_CheckChangeFly_C_ReceiveActivationAI");
static_assert(offsetof(BTService_CheckChangeFly_C_ReceiveActivationAI, OwnerController) == 0x000000, "Member 'BTService_CheckChangeFly_C_ReceiveActivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_ReceiveActivationAI, ControlledPawn) == 0x000008, "Member 'BTService_CheckChangeFly_C_ReceiveActivationAI::ControlledPawn' has a wrong offset!");

// Function BTService_CheckChangeFly.BTService_CheckChangeFly_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTService_CheckChangeFly_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_CheckChangeFly_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTService_CheckChangeFly_C_ReceiveTickAI");
static_assert(sizeof(BTService_CheckChangeFly_C_ReceiveTickAI) == 0x000018, "Wrong size on BTService_CheckChangeFly_C_ReceiveTickAI");
static_assert(offsetof(BTService_CheckChangeFly_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTService_CheckChangeFly_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTService_CheckChangeFly_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTService_CheckChangeFly_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTService_CheckChangeFly_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

