#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_SetFocus

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTTask_SetFocus.BTTask_SetFocus_C.ExecuteUbergraph_BTTask_SetFocus
// 0x0050 (0x0050 - 0x0000)
struct BTTask_SetFocus_C_ExecuteUbergraph_BTTask_SetFocus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTAIController*                        K2Node_DynamicCast_AsHTAIController;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_SetFocus_C_ExecuteUbergraph_BTTask_SetFocus) == 0x000008, "Wrong alignment on BTTask_SetFocus_C_ExecuteUbergraph_BTTask_SetFocus");
static_assert(sizeof(BTTask_SetFocus_C_ExecuteUbergraph_BTTask_SetFocus) == 0x000050, "Wrong size on BTTask_SetFocus_C_ExecuteUbergraph_BTTask_SetFocus");
static_assert(offsetof(BTTask_SetFocus_C_ExecuteUbergraph_BTTask_SetFocus, EntryPoint) == 0x000000, "Member 'BTTask_SetFocus_C_ExecuteUbergraph_BTTask_SetFocus::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_SetFocus_C_ExecuteUbergraph_BTTask_SetFocus, K2Node_Event_OwnerController) == 0x000008, "Member 'BTTask_SetFocus_C_ExecuteUbergraph_BTTask_SetFocus::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_SetFocus_C_ExecuteUbergraph_BTTask_SetFocus, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTTask_SetFocus_C_ExecuteUbergraph_BTTask_SetFocus::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_SetFocus_C_ExecuteUbergraph_BTTask_SetFocus, K2Node_DynamicCast_AsHTAIController) == 0x000018, "Member 'BTTask_SetFocus_C_ExecuteUbergraph_BTTask_SetFocus::K2Node_DynamicCast_AsHTAIController' has a wrong offset!");
static_assert(offsetof(BTTask_SetFocus_C_ExecuteUbergraph_BTTask_SetFocus, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTTask_SetFocus_C_ExecuteUbergraph_BTTask_SetFocus::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTTask_SetFocus_C_ExecuteUbergraph_BTTask_SetFocus, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000028, "Member 'BTTask_SetFocus_C_ExecuteUbergraph_BTTask_SetFocus::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_SetFocus_C_ExecuteUbergraph_BTTask_SetFocus, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x000030, "Member 'BTTask_SetFocus_C_ExecuteUbergraph_BTTask_SetFocus::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_SetFocus_C_ExecuteUbergraph_BTTask_SetFocus, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BTTask_SetFocus_C_ExecuteUbergraph_BTTask_SetFocus::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BTTask_SetFocus.BTTask_SetFocus_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_SetFocus_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_SetFocus_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_SetFocus_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_SetFocus_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_SetFocus_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_SetFocus_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_SetFocus_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_SetFocus_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_SetFocus_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

