#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_SetBoolValue

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTTask_SetBoolValue.BTTask_SetBoolValue_C.ExecuteUbergraph_BTTask_SetBoolValue
// 0x0018 (0x0018 - 0x0000)
struct BTTask_SetBoolValue_C_ExecuteUbergraph_BTTask_SetBoolValue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_SetBoolValue_C_ExecuteUbergraph_BTTask_SetBoolValue) == 0x000008, "Wrong alignment on BTTask_SetBoolValue_C_ExecuteUbergraph_BTTask_SetBoolValue");
static_assert(sizeof(BTTask_SetBoolValue_C_ExecuteUbergraph_BTTask_SetBoolValue) == 0x000018, "Wrong size on BTTask_SetBoolValue_C_ExecuteUbergraph_BTTask_SetBoolValue");
static_assert(offsetof(BTTask_SetBoolValue_C_ExecuteUbergraph_BTTask_SetBoolValue, EntryPoint) == 0x000000, "Member 'BTTask_SetBoolValue_C_ExecuteUbergraph_BTTask_SetBoolValue::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_SetBoolValue_C_ExecuteUbergraph_BTTask_SetBoolValue, K2Node_Event_OwnerController) == 0x000008, "Member 'BTTask_SetBoolValue_C_ExecuteUbergraph_BTTask_SetBoolValue::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_SetBoolValue_C_ExecuteUbergraph_BTTask_SetBoolValue, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTTask_SetBoolValue_C_ExecuteUbergraph_BTTask_SetBoolValue::K2Node_Event_ControlledPawn' has a wrong offset!");

// Function BTTask_SetBoolValue.BTTask_SetBoolValue_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_SetBoolValue_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_SetBoolValue_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_SetBoolValue_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_SetBoolValue_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_SetBoolValue_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_SetBoolValue_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_SetBoolValue_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_SetBoolValue_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_SetBoolValue_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

