#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_Destroy

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTTask_Destroy.BTTask_Destroy_C.ExecuteUbergraph_BTTask_Destroy
// 0x0040 (0x0040 - 0x0000)
struct BTTask_Destroy_C_ExecuteUbergraph_BTTask_Destroy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTAICharacter*                         K2Node_DynamicCast_AsHTAICharacter;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHTAIController*                        K2Node_DynamicCast_AsHTAIController;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_Destroy_C_ExecuteUbergraph_BTTask_Destroy) == 0x000008, "Wrong alignment on BTTask_Destroy_C_ExecuteUbergraph_BTTask_Destroy");
static_assert(sizeof(BTTask_Destroy_C_ExecuteUbergraph_BTTask_Destroy) == 0x000040, "Wrong size on BTTask_Destroy_C_ExecuteUbergraph_BTTask_Destroy");
static_assert(offsetof(BTTask_Destroy_C_ExecuteUbergraph_BTTask_Destroy, EntryPoint) == 0x000000, "Member 'BTTask_Destroy_C_ExecuteUbergraph_BTTask_Destroy::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_Destroy_C_ExecuteUbergraph_BTTask_Destroy, K2Node_Event_OwnerController) == 0x000008, "Member 'BTTask_Destroy_C_ExecuteUbergraph_BTTask_Destroy::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_Destroy_C_ExecuteUbergraph_BTTask_Destroy, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTTask_Destroy_C_ExecuteUbergraph_BTTask_Destroy::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_Destroy_C_ExecuteUbergraph_BTTask_Destroy, K2Node_DynamicCast_AsHTAICharacter) == 0x000018, "Member 'BTTask_Destroy_C_ExecuteUbergraph_BTTask_Destroy::K2Node_DynamicCast_AsHTAICharacter' has a wrong offset!");
static_assert(offsetof(BTTask_Destroy_C_ExecuteUbergraph_BTTask_Destroy, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTTask_Destroy_C_ExecuteUbergraph_BTTask_Destroy::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTTask_Destroy_C_ExecuteUbergraph_BTTask_Destroy, K2Node_DynamicCast_AsHTAIController) == 0x000028, "Member 'BTTask_Destroy_C_ExecuteUbergraph_BTTask_Destroy::K2Node_DynamicCast_AsHTAIController' has a wrong offset!");
static_assert(offsetof(BTTask_Destroy_C_ExecuteUbergraph_BTTask_Destroy, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BTTask_Destroy_C_ExecuteUbergraph_BTTask_Destroy::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BTTask_Destroy_C_ExecuteUbergraph_BTTask_Destroy, CallFunc_GetBlackboard_ReturnValue) == 0x000038, "Member 'BTTask_Destroy_C_ExecuteUbergraph_BTTask_Destroy::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");

// Function BTTask_Destroy.BTTask_Destroy_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_Destroy_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_Destroy_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_Destroy_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_Destroy_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_Destroy_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_Destroy_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_Destroy_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_Destroy_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_Destroy_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

