#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CableLineKit

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct CableLineKit.CableProperties
// 0x0048 (0x0048 - 0x0000)
struct FCableProperties final
{
public:
	bool                                          bGenerateCable;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Seed;                                              // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            CableMesh;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     CableMaterial;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineComponent*                       SplineComponent;                                   // 0x0018(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USplineMeshComponent*>           SplineMeshComponents;                              // 0x0020(0x0010)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class FName                                   StartSocket;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EndSocket;                                         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverridebGenerateCable;                           // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideSeed;                                     // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideCableMesh;                                // 0x0042(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideCableMaterial;                            // 0x0043(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideStartSocket;                              // 0x0044(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideEndSocket;                                // 0x0045(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCableProperties) == 0x000008, "Wrong alignment on FCableProperties");
static_assert(sizeof(FCableProperties) == 0x000048, "Wrong size on FCableProperties");
static_assert(offsetof(FCableProperties, bGenerateCable) == 0x000000, "Member 'FCableProperties::bGenerateCable' has a wrong offset!");
static_assert(offsetof(FCableProperties, Seed) == 0x000004, "Member 'FCableProperties::Seed' has a wrong offset!");
static_assert(offsetof(FCableProperties, CableMesh) == 0x000008, "Member 'FCableProperties::CableMesh' has a wrong offset!");
static_assert(offsetof(FCableProperties, CableMaterial) == 0x000010, "Member 'FCableProperties::CableMaterial' has a wrong offset!");
static_assert(offsetof(FCableProperties, SplineComponent) == 0x000018, "Member 'FCableProperties::SplineComponent' has a wrong offset!");
static_assert(offsetof(FCableProperties, SplineMeshComponents) == 0x000020, "Member 'FCableProperties::SplineMeshComponents' has a wrong offset!");
static_assert(offsetof(FCableProperties, StartSocket) == 0x000030, "Member 'FCableProperties::StartSocket' has a wrong offset!");
static_assert(offsetof(FCableProperties, EndSocket) == 0x000038, "Member 'FCableProperties::EndSocket' has a wrong offset!");
static_assert(offsetof(FCableProperties, bOverridebGenerateCable) == 0x000040, "Member 'FCableProperties::bOverridebGenerateCable' has a wrong offset!");
static_assert(offsetof(FCableProperties, bOverrideSeed) == 0x000041, "Member 'FCableProperties::bOverrideSeed' has a wrong offset!");
static_assert(offsetof(FCableProperties, bOverrideCableMesh) == 0x000042, "Member 'FCableProperties::bOverrideCableMesh' has a wrong offset!");
static_assert(offsetof(FCableProperties, bOverrideCableMaterial) == 0x000043, "Member 'FCableProperties::bOverrideCableMaterial' has a wrong offset!");
static_assert(offsetof(FCableProperties, bOverrideStartSocket) == 0x000044, "Member 'FCableProperties::bOverrideStartSocket' has a wrong offset!");
static_assert(offsetof(FCableProperties, bOverrideEndSocket) == 0x000045, "Member 'FCableProperties::bOverrideEndSocket' has a wrong offset!");

// ScriptStruct CableLineKit.CablePropertiesGroup
// 0x0040 (0x0040 - 0x0000)
struct FCablePropertiesGroup final
{
public:
	TArray<struct FCableProperties>               CablePropertiesArray;                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         UnifiedSeed;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            UnifiedCableMesh;                                  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     UnifiedCableMaterial;                              // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRandomizeCableGeneration;                         // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACableLineActor*                        GroupConnectedActor;                               // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideConnectedActor;                           // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCablePropertiesGroup) == 0x000008, "Wrong alignment on FCablePropertiesGroup");
static_assert(sizeof(FCablePropertiesGroup) == 0x000040, "Wrong size on FCablePropertiesGroup");
static_assert(offsetof(FCablePropertiesGroup, CablePropertiesArray) == 0x000000, "Member 'FCablePropertiesGroup::CablePropertiesArray' has a wrong offset!");
static_assert(offsetof(FCablePropertiesGroup, UnifiedSeed) == 0x000010, "Member 'FCablePropertiesGroup::UnifiedSeed' has a wrong offset!");
static_assert(offsetof(FCablePropertiesGroup, UnifiedCableMesh) == 0x000018, "Member 'FCablePropertiesGroup::UnifiedCableMesh' has a wrong offset!");
static_assert(offsetof(FCablePropertiesGroup, UnifiedCableMaterial) == 0x000020, "Member 'FCablePropertiesGroup::UnifiedCableMaterial' has a wrong offset!");
static_assert(offsetof(FCablePropertiesGroup, bRandomizeCableGeneration) == 0x000028, "Member 'FCablePropertiesGroup::bRandomizeCableGeneration' has a wrong offset!");
static_assert(offsetof(FCablePropertiesGroup, GroupConnectedActor) == 0x000030, "Member 'FCablePropertiesGroup::GroupConnectedActor' has a wrong offset!");
static_assert(offsetof(FCablePropertiesGroup, bOverrideConnectedActor) == 0x000038, "Member 'FCablePropertiesGroup::bOverrideConnectedActor' has a wrong offset!");

// ScriptStruct CableLineKit.PendingReferenceUpdate
// 0x0018 (0x0018 - 0x0000)
struct FPendingReferenceUpdate final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPendingReferenceUpdate) == 0x000001, "Wrong alignment on FPendingReferenceUpdate");
static_assert(sizeof(FPendingReferenceUpdate) == 0x000018, "Wrong size on FPendingReferenceUpdate");

// ScriptStruct CableLineKit.CableGroup
// 0x0018 (0x0018 - 0x0000)
struct FCableGroup final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USplineMeshComponent*>           Cables;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCableGroup) == 0x000008, "Wrong alignment on FCableGroup");
static_assert(sizeof(FCableGroup) == 0x000018, "Wrong size on FCableGroup");
static_assert(offsetof(FCableGroup, StaticMesh) == 0x000000, "Member 'FCableGroup::StaticMesh' has a wrong offset!");
static_assert(offsetof(FCableGroup, Cables) == 0x000008, "Member 'FCableGroup::Cables' has a wrong offset!");

// ScriptStruct CableLineKit.PoleCableInfo
// 0x0080 (0x0080 - 0x0000)
struct FPoleCableInfo final
{
public:
	struct FTransform                             PoleTransform;                                     // 0x0000(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GroupIndex;                                        // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 IndexsInGroup;                                     // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPoleCableInfo) == 0x000008, "Wrong alignment on FPoleCableInfo");
static_assert(sizeof(FPoleCableInfo) == 0x000080, "Wrong size on FPoleCableInfo");
static_assert(offsetof(FPoleCableInfo, PoleTransform) == 0x000000, "Member 'FPoleCableInfo::PoleTransform' has a wrong offset!");
static_assert(offsetof(FPoleCableInfo, GroupIndex) == 0x000060, "Member 'FPoleCableInfo::GroupIndex' has a wrong offset!");
static_assert(offsetof(FPoleCableInfo, IndexsInGroup) == 0x000068, "Member 'FPoleCableInfo::IndexsInGroup' has a wrong offset!");

// ScriptStruct CableLineKit.InstancedComponentRef
// 0x0010 (0x0010 - 0x0000)
struct FInstancedComponentRef final
{
public:
	class UInstancedStaticMeshComponent*          InstancedComponent;                                // 0x0000(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InstanceIndex;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FInstancedComponentRef) == 0x000008, "Wrong alignment on FInstancedComponentRef");
static_assert(sizeof(FInstancedComponentRef) == 0x000010, "Wrong size on FInstancedComponentRef");
static_assert(offsetof(FInstancedComponentRef, InstancedComponent) == 0x000000, "Member 'FInstancedComponentRef::InstancedComponent' has a wrong offset!");
static_assert(offsetof(FInstancedComponentRef, InstanceIndex) == 0x000008, "Member 'FInstancedComponentRef::InstanceIndex' has a wrong offset!");

// ScriptStruct CableLineKit.PoleComponentsInfo
// 0x0080 (0x0080 - 0x0000)
struct FPoleComponentsInfo final
{
public:
	struct FTransform                             PoleTransform;                                     // 0x0000(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FInstancedComponentRef>         InstancedRefs;                                     // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UActorComponent*>                Components;                                        // 0x0070(0x0010)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPoleComponentsInfo) == 0x000008, "Wrong alignment on FPoleComponentsInfo");
static_assert(sizeof(FPoleComponentsInfo) == 0x000080, "Wrong size on FPoleComponentsInfo");
static_assert(offsetof(FPoleComponentsInfo, PoleTransform) == 0x000000, "Member 'FPoleComponentsInfo::PoleTransform' has a wrong offset!");
static_assert(offsetof(FPoleComponentsInfo, InstancedRefs) == 0x000060, "Member 'FPoleComponentsInfo::InstancedRefs' has a wrong offset!");
static_assert(offsetof(FPoleComponentsInfo, Components) == 0x000070, "Member 'FPoleComponentsInfo::Components' has a wrong offset!");

}

