#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CableLineKit

#include "Basic.hpp"

#include "CableLineKit_structs.hpp"
#include "HTWorldPartition_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class CableLineKit.CableLineActor
// 0x0030 (0x02F8 - 0x02C8)
class ACableLineActor final : public AHTEditorActor
{
public:
	class UStaticMeshComponent*                   PoleMesh;                                          // 0x02C8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBillboardComponent*                    Billboard;                                         // 0x02D0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableAutoAttachToGround;                         // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableAutoConnecteToActor;                        // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2DA[0x6];                                      // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACableLineActor*                        ConnectedActor;                                    // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCablePropertiesGroup>          CablePropertiesGroups;                             // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CableLineActor">();
	}
	static class ACableLineActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACableLineActor>();
	}
};
static_assert(alignof(ACableLineActor) == 0x000008, "Wrong alignment on ACableLineActor");
static_assert(sizeof(ACableLineActor) == 0x0002F8, "Wrong size on ACableLineActor");
static_assert(offsetof(ACableLineActor, PoleMesh) == 0x0002C8, "Member 'ACableLineActor::PoleMesh' has a wrong offset!");
static_assert(offsetof(ACableLineActor, Billboard) == 0x0002D0, "Member 'ACableLineActor::Billboard' has a wrong offset!");
static_assert(offsetof(ACableLineActor, bEnableAutoAttachToGround) == 0x0002D8, "Member 'ACableLineActor::bEnableAutoAttachToGround' has a wrong offset!");
static_assert(offsetof(ACableLineActor, bEnableAutoConnecteToActor) == 0x0002D9, "Member 'ACableLineActor::bEnableAutoConnecteToActor' has a wrong offset!");
static_assert(offsetof(ACableLineActor, ConnectedActor) == 0x0002E0, "Member 'ACableLineActor::ConnectedActor' has a wrong offset!");
static_assert(offsetof(ACableLineActor, CablePropertiesGroups) == 0x0002E8, "Member 'ACableLineActor::CablePropertiesGroups' has a wrong offset!");

// Class CableLineKit.CableLineSubsystem
// 0x0060 (0x00A0 - 0x0040)
class UCableLineSubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_40[0x60];                                      // 0x0040(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CableLineSubsystem">();
	}
	static class UCableLineSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCableLineSubsystem>();
	}
};
static_assert(alignof(UCableLineSubsystem) == 0x000008, "Wrong alignment on UCableLineSubsystem");
static_assert(sizeof(UCableLineSubsystem) == 0x0000A0, "Wrong size on UCableLineSubsystem");

// Class CableLineKit.CableLineWorldPartitionActor
// 0x0000 (0x02D0 - 0x02D0)
class ACableLineWorldPartitionActor final : public AHTPartitionActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CableLineWorldPartitionActor">();
	}
	static class ACableLineWorldPartitionActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACableLineWorldPartitionActor>();
	}
};
static_assert(alignof(ACableLineWorldPartitionActor) == 0x000008, "Wrong alignment on ACableLineWorldPartitionActor");
static_assert(sizeof(ACableLineWorldPartitionActor) == 0x0002D0, "Wrong size on ACableLineWorldPartitionActor");

}

