#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraCalibrationCore

#include "Basic.hpp"

#include "CameraCalibrationCore_structs.hpp"
#include "CinematicCamera_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "ProceduralMeshComponent_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class CameraCalibrationCore.LensDistortionModelHandlerBase
// 0x00A8 (0x00D0 - 0x0028)
class ULensDistortionModelHandlerBase : public UObject
{
public:
	TSubclassOf<class ULensModel>                 LensModelClass;                                    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               DistortionPostProcessMID;                          // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLensDistortionState                   CurrentState;                                      // 0x0038(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FCameraFilmbackSettings                CameraFilmback;                                    // 0x0068(0x0014)(Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DisplayName;                                       // 0x0080(0x0010)(Edit, ZeroConstructor, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         OverscanFactor;                                    // 0x0090(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               UndistortionDisplacementMapMID;                    // 0x0098(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               DistortionDisplacementMapMID;                      // 0x00A0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextureRenderTarget2D*                 UndistortionDisplacementMapRT;                     // 0x00A8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextureRenderTarget2D*                 DistortionDisplacementMapRT;                       // 0x00B0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  DistortionProducerID;                              // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetDistortionState(const struct FLensDistortionState& InNewState);

	class UTextureRenderTarget2D* GetDistortionDisplacementMap() const;
	class UTextureRenderTarget2D* GetUndistortionDisplacementMap() const;
	bool IsModelSupported(const TSubclassOf<class ULensModel>& ModelToSupport) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LensDistortionModelHandlerBase">();
	}
	static class ULensDistortionModelHandlerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULensDistortionModelHandlerBase>();
	}
};
static_assert(alignof(ULensDistortionModelHandlerBase) == 0x000008, "Wrong alignment on ULensDistortionModelHandlerBase");
static_assert(sizeof(ULensDistortionModelHandlerBase) == 0x0000D0, "Wrong size on ULensDistortionModelHandlerBase");
static_assert(offsetof(ULensDistortionModelHandlerBase, LensModelClass) == 0x000028, "Member 'ULensDistortionModelHandlerBase::LensModelClass' has a wrong offset!");
static_assert(offsetof(ULensDistortionModelHandlerBase, DistortionPostProcessMID) == 0x000030, "Member 'ULensDistortionModelHandlerBase::DistortionPostProcessMID' has a wrong offset!");
static_assert(offsetof(ULensDistortionModelHandlerBase, CurrentState) == 0x000038, "Member 'ULensDistortionModelHandlerBase::CurrentState' has a wrong offset!");
static_assert(offsetof(ULensDistortionModelHandlerBase, CameraFilmback) == 0x000068, "Member 'ULensDistortionModelHandlerBase::CameraFilmback' has a wrong offset!");
static_assert(offsetof(ULensDistortionModelHandlerBase, DisplayName) == 0x000080, "Member 'ULensDistortionModelHandlerBase::DisplayName' has a wrong offset!");
static_assert(offsetof(ULensDistortionModelHandlerBase, OverscanFactor) == 0x000090, "Member 'ULensDistortionModelHandlerBase::OverscanFactor' has a wrong offset!");
static_assert(offsetof(ULensDistortionModelHandlerBase, UndistortionDisplacementMapMID) == 0x000098, "Member 'ULensDistortionModelHandlerBase::UndistortionDisplacementMapMID' has a wrong offset!");
static_assert(offsetof(ULensDistortionModelHandlerBase, DistortionDisplacementMapMID) == 0x0000A0, "Member 'ULensDistortionModelHandlerBase::DistortionDisplacementMapMID' has a wrong offset!");
static_assert(offsetof(ULensDistortionModelHandlerBase, UndistortionDisplacementMapRT) == 0x0000A8, "Member 'ULensDistortionModelHandlerBase::UndistortionDisplacementMapRT' has a wrong offset!");
static_assert(offsetof(ULensDistortionModelHandlerBase, DistortionDisplacementMapRT) == 0x0000B0, "Member 'ULensDistortionModelHandlerBase::DistortionDisplacementMapRT' has a wrong offset!");
static_assert(offsetof(ULensDistortionModelHandlerBase, DistortionProducerID) == 0x0000B8, "Member 'ULensDistortionModelHandlerBase::DistortionProducerID' has a wrong offset!");

// Class CameraCalibrationCore.AnamorphicLensDistortionModelHandler
// 0x0038 (0x0108 - 0x00D0)
class UAnamorphicLensDistortionModelHandler final : public ULensDistortionModelHandlerBase
{
public:
	uint8                                         Pad_D0[0x38];                                      // 0x00D0(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnamorphicLensDistortionModelHandler">();
	}
	static class UAnamorphicLensDistortionModelHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnamorphicLensDistortionModelHandler>();
	}
};
static_assert(alignof(UAnamorphicLensDistortionModelHandler) == 0x000008, "Wrong alignment on UAnamorphicLensDistortionModelHandler");
static_assert(sizeof(UAnamorphicLensDistortionModelHandler) == 0x000108, "Wrong size on UAnamorphicLensDistortionModelHandler");

// Class CameraCalibrationCore.LensModel
// 0x0000 (0x0028 - 0x0028)
class ULensModel : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LensModel">();
	}
	static class ULensModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULensModel>();
	}
};
static_assert(alignof(ULensModel) == 0x000008, "Wrong alignment on ULensModel");
static_assert(sizeof(ULensModel) == 0x000028, "Wrong size on ULensModel");

// Class CameraCalibrationCore.AnamorphicLensModel
// 0x0000 (0x0028 - 0x0028)
class UAnamorphicLensModel final : public ULensModel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnamorphicLensModel">();
	}
	static class UAnamorphicLensModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnamorphicLensModel>();
	}
};
static_assert(alignof(UAnamorphicLensModel) == 0x000008, "Wrong alignment on UAnamorphicLensModel");
static_assert(sizeof(UAnamorphicLensModel) == 0x000028, "Wrong size on UAnamorphicLensModel");

// Class CameraCalibrationCore.CalibrationPointComponent
// 0x0060 (0x0670 - 0x0610)
class UCalibrationPointComponent final : public UProceduralMeshComponent
{
public:
	TMap<class FString, struct FVector>           SubPoints;                                         // 0x0610(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bVisualizePointsInEditor;                          // 0x0660(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_661[0x3];                                      // 0x0661(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PointVisualizationScale;                           // 0x0664(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECalibrationPointVisualization                VisualizationShape;                                // 0x0668(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_669[0x7];                                      // 0x0669(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RebuildVertices();

	void GetNamespacedPointNames(TArray<class FString>* OutNamespacedNames) const;
	bool GetWorldLocation(const class FString& InPointName, struct FVector* OutLocation) const;
	bool NamespacedSubpointName(const class FString& InSubpointName, class FString* OutNamespacedName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CalibrationPointComponent">();
	}
	static class UCalibrationPointComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCalibrationPointComponent>();
	}
};
static_assert(alignof(UCalibrationPointComponent) == 0x000008, "Wrong alignment on UCalibrationPointComponent");
static_assert(sizeof(UCalibrationPointComponent) == 0x000670, "Wrong size on UCalibrationPointComponent");
static_assert(offsetof(UCalibrationPointComponent, SubPoints) == 0x000610, "Member 'UCalibrationPointComponent::SubPoints' has a wrong offset!");
static_assert(offsetof(UCalibrationPointComponent, bVisualizePointsInEditor) == 0x000660, "Member 'UCalibrationPointComponent::bVisualizePointsInEditor' has a wrong offset!");
static_assert(offsetof(UCalibrationPointComponent, PointVisualizationScale) == 0x000664, "Member 'UCalibrationPointComponent::PointVisualizationScale' has a wrong offset!");
static_assert(offsetof(UCalibrationPointComponent, VisualizationShape) == 0x000668, "Member 'UCalibrationPointComponent::VisualizationShape' has a wrong offset!");

// Class CameraCalibrationCore.CameraCalibrationCheckerboard
// 0x0058 (0x0320 - 0x02C8)
class ACameraCalibrationCheckerboard final : public AActor
{
public:
	class USceneComponent*                        Root;                                              // 0x02C8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCalibrationPointComponent*             TopLeft;                                           // 0x02D0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCalibrationPointComponent*             TopRight;                                          // 0x02D8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCalibrationPointComponent*             BottomLeft;                                        // 0x02E0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCalibrationPointComponent*             BottomRight;                                       // 0x02E8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCalibrationPointComponent*             Center;                                            // 0x02F0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumCornerRows;                                     // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumCornerCols;                                     // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SquareSideLength;                                  // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Thickness;                                         // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            CubeMesh;                                          // 0x0308(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     OddCubeMaterial;                                   // 0x0310(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     EvenCubeMaterial;                                  // 0x0318(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void Rebuild();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraCalibrationCheckerboard">();
	}
	static class ACameraCalibrationCheckerboard* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACameraCalibrationCheckerboard>();
	}
};
static_assert(alignof(ACameraCalibrationCheckerboard) == 0x000008, "Wrong alignment on ACameraCalibrationCheckerboard");
static_assert(sizeof(ACameraCalibrationCheckerboard) == 0x000320, "Wrong size on ACameraCalibrationCheckerboard");
static_assert(offsetof(ACameraCalibrationCheckerboard, Root) == 0x0002C8, "Member 'ACameraCalibrationCheckerboard::Root' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, TopLeft) == 0x0002D0, "Member 'ACameraCalibrationCheckerboard::TopLeft' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, TopRight) == 0x0002D8, "Member 'ACameraCalibrationCheckerboard::TopRight' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, BottomLeft) == 0x0002E0, "Member 'ACameraCalibrationCheckerboard::BottomLeft' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, BottomRight) == 0x0002E8, "Member 'ACameraCalibrationCheckerboard::BottomRight' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, Center) == 0x0002F0, "Member 'ACameraCalibrationCheckerboard::Center' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, NumCornerRows) == 0x0002F8, "Member 'ACameraCalibrationCheckerboard::NumCornerRows' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, NumCornerCols) == 0x0002FC, "Member 'ACameraCalibrationCheckerboard::NumCornerCols' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, SquareSideLength) == 0x000300, "Member 'ACameraCalibrationCheckerboard::SquareSideLength' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, Thickness) == 0x000304, "Member 'ACameraCalibrationCheckerboard::Thickness' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, CubeMesh) == 0x000308, "Member 'ACameraCalibrationCheckerboard::CubeMesh' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, OddCubeMaterial) == 0x000310, "Member 'ACameraCalibrationCheckerboard::OddCubeMaterial' has a wrong offset!");
static_assert(offsetof(ACameraCalibrationCheckerboard, EvenCubeMaterial) == 0x000318, "Member 'ACameraCalibrationCheckerboard::EvenCubeMaterial' has a wrong offset!");

// Class CameraCalibrationCore.CameraCalibrationSettings
// 0x0138 (0x0170 - 0x0038)
class UCameraCalibrationSettings final : public UDeveloperSettings
{
public:
	TSoftObjectPtr<class ULensFile>               StartupLensFile;                                   // 0x0038(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FIntPoint                              DisplacementMapResolution;                         // 0x0060(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CalibrationInputTolerance;                         // 0x0068(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CheckerboardDetectionTimeout;                      // 0x006C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class ULensDistortionModelHandlerBase>, TSoftObjectPtr<class UMaterialInterface>> DefaultUndistortionDisplacementMaterials; // 0x0070(0x0050)(Config, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class ULensDistortionModelHandlerBase>, TSoftObjectPtr<class UMaterialInterface>> DefaultDistortionDisplacementMaterials; // 0x00C0(0x0050)(Config, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class ULensDistortionModelHandlerBase>, TSoftObjectPtr<class UMaterialInterface>> DefaultDistortionMaterials; // 0x0110(0x0050)(Config, UObjectWrapper, NativeAccessSpecifierPrivate)
	bool                                          bEnableCalibrationDatasetImportExport;             // 0x0160(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_161[0xF];                                      // 0x0161(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraCalibrationSettings">();
	}
	static class UCameraCalibrationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraCalibrationSettings>();
	}
};
static_assert(alignof(UCameraCalibrationSettings) == 0x000008, "Wrong alignment on UCameraCalibrationSettings");
static_assert(sizeof(UCameraCalibrationSettings) == 0x000170, "Wrong size on UCameraCalibrationSettings");
static_assert(offsetof(UCameraCalibrationSettings, StartupLensFile) == 0x000038, "Member 'UCameraCalibrationSettings::StartupLensFile' has a wrong offset!");
static_assert(offsetof(UCameraCalibrationSettings, DisplacementMapResolution) == 0x000060, "Member 'UCameraCalibrationSettings::DisplacementMapResolution' has a wrong offset!");
static_assert(offsetof(UCameraCalibrationSettings, CalibrationInputTolerance) == 0x000068, "Member 'UCameraCalibrationSettings::CalibrationInputTolerance' has a wrong offset!");
static_assert(offsetof(UCameraCalibrationSettings, CheckerboardDetectionTimeout) == 0x00006C, "Member 'UCameraCalibrationSettings::CheckerboardDetectionTimeout' has a wrong offset!");
static_assert(offsetof(UCameraCalibrationSettings, DefaultUndistortionDisplacementMaterials) == 0x000070, "Member 'UCameraCalibrationSettings::DefaultUndistortionDisplacementMaterials' has a wrong offset!");
static_assert(offsetof(UCameraCalibrationSettings, DefaultDistortionDisplacementMaterials) == 0x0000C0, "Member 'UCameraCalibrationSettings::DefaultDistortionDisplacementMaterials' has a wrong offset!");
static_assert(offsetof(UCameraCalibrationSettings, DefaultDistortionMaterials) == 0x000110, "Member 'UCameraCalibrationSettings::DefaultDistortionMaterials' has a wrong offset!");
static_assert(offsetof(UCameraCalibrationSettings, bEnableCalibrationDatasetImportExport) == 0x000160, "Member 'UCameraCalibrationSettings::bEnableCalibrationDatasetImportExport' has a wrong offset!");

// Class CameraCalibrationCore.CameraCalibrationEditorSettings
// 0x0000 (0x0038 - 0x0038)
class UCameraCalibrationEditorSettings final : public UDeveloperSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraCalibrationEditorSettings">();
	}
	static class UCameraCalibrationEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraCalibrationEditorSettings>();
	}
};
static_assert(alignof(UCameraCalibrationEditorSettings) == 0x000008, "Wrong alignment on UCameraCalibrationEditorSettings");
static_assert(sizeof(UCameraCalibrationEditorSettings) == 0x000038, "Wrong size on UCameraCalibrationEditorSettings");

// Class CameraCalibrationCore.CameraCalibrationStep
// 0x0000 (0x0028 - 0x0028)
class UCameraCalibrationStep final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraCalibrationStep">();
	}
	static class UCameraCalibrationStep* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraCalibrationStep>();
	}
};
static_assert(alignof(UCameraCalibrationStep) == 0x000008, "Wrong alignment on UCameraCalibrationStep");
static_assert(sizeof(UCameraCalibrationStep) == 0x000028, "Wrong size on UCameraCalibrationStep");

// Class CameraCalibrationCore.CameraCalibrationSubsystem
// 0x0200 (0x0230 - 0x0030)
class UCameraCalibrationSubsystem final : public UEngineSubsystem
{
public:
	class ULensFile*                              DefaultLensFile;                                   // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, TSubclassOf<class ULensModel>> LensModelMap;                                   // 0x0038(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class FName, TSubclassOf<class UCameraNodalOffsetAlgo>> CameraNodalOffsetAlgosMap;          // 0x0088(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class FName, TSubclassOf<class UCameraImageCenterAlgo>> CameraImageCenterAlgosMap;          // 0x00D8(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class FName, TSubclassOf<class UCameraCalibrationStep>> CameraCalibrationStepsMap;          // 0x0128(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_178[0xB8];                                     // 0x0178(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class ULensDistortionModelHandlerBase* FindOrCreateDistortionModelHandler(struct FDistortionHandlerPicker& DistortionHandlerPicker, const TSubclassOf<class ULensModel> LensModelClass);
	TArray<class ULensDistortionModelHandlerBase*> GetDistortionModelHandlers(class UCineCameraComponent* Component);
	void SetDefaultLensFile(class ULensFile* NewDefaultLensFile);
	void UnregisterDistortionModelHandler(class UCineCameraComponent* Component, class ULensDistortionModelHandlerBase* Handler);

	class ULensDistortionModelHandlerBase* FindDistortionModelHandler(struct FDistortionHandlerPicker& DistortionHandlerPicker, bool bUpdatePicker) const;
	TSubclassOf<class UCameraCalibrationStep> GetCameraCalibrationStep(class FName Name_0) const;
	TArray<class FName> GetCameraCalibrationSteps() const;
	TSubclassOf<class UCameraImageCenterAlgo> GetCameraImageCenterAlgo(class FName Name_0) const;
	TArray<class FName> GetCameraImageCenterAlgos() const;
	TSubclassOf<class UCameraNodalOffsetAlgo> GetCameraNodalOffsetAlgo(class FName Name_0) const;
	TArray<class FName> GetCameraNodalOffsetAlgos() const;
	class ULensFile* GetDefaultLensFile() const;
	class ULensFile* GetLensFile(const struct FLensFilePicker& Picker) const;
	class UMaterialInterface* GetOverlayMaterial(const class FName& OverlayName) const;
	TArray<class FName> GetOverlayMaterialNames() const;
	TSubclassOf<class ULensModel> GetRegisteredLensModel(class FName ModelName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraCalibrationSubsystem">();
	}
	static class UCameraCalibrationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraCalibrationSubsystem>();
	}
};
static_assert(alignof(UCameraCalibrationSubsystem) == 0x000008, "Wrong alignment on UCameraCalibrationSubsystem");
static_assert(sizeof(UCameraCalibrationSubsystem) == 0x000230, "Wrong size on UCameraCalibrationSubsystem");
static_assert(offsetof(UCameraCalibrationSubsystem, DefaultLensFile) == 0x000030, "Member 'UCameraCalibrationSubsystem::DefaultLensFile' has a wrong offset!");
static_assert(offsetof(UCameraCalibrationSubsystem, LensModelMap) == 0x000038, "Member 'UCameraCalibrationSubsystem::LensModelMap' has a wrong offset!");
static_assert(offsetof(UCameraCalibrationSubsystem, CameraNodalOffsetAlgosMap) == 0x000088, "Member 'UCameraCalibrationSubsystem::CameraNodalOffsetAlgosMap' has a wrong offset!");
static_assert(offsetof(UCameraCalibrationSubsystem, CameraImageCenterAlgosMap) == 0x0000D8, "Member 'UCameraCalibrationSubsystem::CameraImageCenterAlgosMap' has a wrong offset!");
static_assert(offsetof(UCameraCalibrationSubsystem, CameraCalibrationStepsMap) == 0x000128, "Member 'UCameraCalibrationSubsystem::CameraCalibrationStepsMap' has a wrong offset!");

// Class CameraCalibrationCore.CameraImageCenterAlgo
// 0x0008 (0x0030 - 0x0028)
class UCameraImageCenterAlgo final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraImageCenterAlgo">();
	}
	static class UCameraImageCenterAlgo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraImageCenterAlgo>();
	}
};
static_assert(alignof(UCameraImageCenterAlgo) == 0x000008, "Wrong alignment on UCameraImageCenterAlgo");
static_assert(sizeof(UCameraImageCenterAlgo) == 0x000030, "Wrong size on UCameraImageCenterAlgo");

// Class CameraCalibrationCore.CameraLensDistortionAlgo
// 0x0000 (0x0028 - 0x0028)
class UCameraLensDistortionAlgo final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraLensDistortionAlgo">();
	}
	static class UCameraLensDistortionAlgo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraLensDistortionAlgo>();
	}
};
static_assert(alignof(UCameraLensDistortionAlgo) == 0x000008, "Wrong alignment on UCameraLensDistortionAlgo");
static_assert(sizeof(UCameraLensDistortionAlgo) == 0x000028, "Wrong size on UCameraLensDistortionAlgo");

// Class CameraCalibrationCore.CameraNodalOffsetAlgo
// 0x0000 (0x0028 - 0x0028)
class UCameraNodalOffsetAlgo final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CameraNodalOffsetAlgo">();
	}
	static class UCameraNodalOffsetAlgo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraNodalOffsetAlgo>();
	}
};
static_assert(alignof(UCameraNodalOffsetAlgo) == 0x000008, "Wrong alignment on UCameraNodalOffsetAlgo");
static_assert(sizeof(UCameraNodalOffsetAlgo) == 0x000028, "Wrong size on UCameraNodalOffsetAlgo");

// Class CameraCalibrationCore.LensFile
// 0x02E0 (0x0308 - 0x0028)
class ULensFile final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLensInfo                              LensInfo;                                          // 0x0030(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	ELensDataMode                                 DataMode;                                          // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            UserMetadata;                                      // 0x0080(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FEncodersTable                         EncodersTable;                                     // 0x00D0(0x0100)(NativeAccessSpecifierPublic)
	struct FDistortionTable                       DistortionTable;                                   // 0x01D0(0x0030)(NativeAccessSpecifierPublic)
	struct FFocalLengthTable                      FocalLengthTable;                                  // 0x0200(0x0030)(NativeAccessSpecifierPublic)
	struct FImageCenterTable                      ImageCenterTable;                                  // 0x0230(0x0030)(NativeAccessSpecifierPublic)
	struct FNodalOffsetTable                      NodalOffsetTable;                                  // 0x0260(0x0030)(NativeAccessSpecifierPublic)
	struct FSTMapTable                            STMapTable;                                        // 0x0290(0x0030)(NativeAccessSpecifierPublic)
	uint8                                         Pad_2C0[0x10];                                     // 0x02C0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTextureRenderTarget2D*>         UndistortionDisplacementMapHolders;                // 0x02D0(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UTextureRenderTarget2D*>         DistortionDisplacementMapHolders;                  // 0x02E0(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F0[0x18];                                     // 0x02F0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddDistortionPoint(float NewFocus, float NewZoom, const struct FDistortionInfo& NewPoint, const struct FFocalLengthInfo& NewFocalLength);
	void AddFocalLengthPoint(float NewFocus, float NewZoom, const struct FFocalLengthInfo& NewFocalLength);
	void AddImageCenterPoint(float NewFocus, float NewZoom, const struct FImageCenterInfo& NewPoint);
	void AddNodalOffsetPoint(float NewFocus, float NewZoom, const struct FNodalPointOffset& NewPoint);
	void AddSTMapPoint(float NewFocus, float NewZoom, const struct FSTMapInfo& NewPoint);
	void ChangeFocusPoint(ELensDataCategory InDataCategory, float InExistingFocus, float InNewFocus);
	void ChangeZoomPoint(ELensDataCategory InDataCategory, float InFocus, float InExistingZoom, float InNewZoom);
	void ClearAll();
	void ClearData(ELensDataCategory InDataCategory);
	bool HasZoomPoint(ELensDataCategory InDataCategory, float InFocus, float InZoom);
	void MergeFocusPoint(ELensDataCategory InDataCategory, float InSrcFocus, float InDestFocus, bool bReplaceExistingZoomPoints);
	void RemoveFocusPoint(ELensDataCategory InDataCategory, float InFocus);
	void RemoveZoomPoint(ELensDataCategory InDataCategory, float InFocus, float InZoom);

	bool EvaluateDistortionData(float InFocus, float InZoom, const struct FVector2D& InFilmback, class ULensDistortionModelHandlerBase* InLensHandler) const;
	bool EvaluateDistortionParameters(float InFocus, float InZoom, struct FDistortionInfo* OutEvaluatedValue) const;
	bool EvaluateFocalLength(float InFocus, float InZoom, struct FFocalLengthInfo* OutEvaluatedValue) const;
	bool EvaluateImageCenterParameters(float InFocus, float InZoom, struct FImageCenterInfo* OutEvaluatedValue) const;
	bool EvaluateNodalPointOffset(float InFocus, float InZoom, struct FNodalPointOffset* OutEvaluatedValue) const;
	float EvaluateNormalizedFocus(float InNormalizedValue) const;
	float EvaluateNormalizedIris(float InNormalizedValue) const;
	bool GetDistortionPoint(float InFocus, float InZoom, struct FDistortionInfo* OutDistortionInfo) const;
	TArray<struct FDistortionPointInfo> GetDistortionPoints() const;
	bool GetFocalLengthPoint(float InFocus, float InZoom, struct FFocalLengthInfo* OutFocalLengthInfo) const;
	TArray<struct FFocalLengthPointInfo> GetFocalLengthPoints() const;
	bool GetImageCenterPoint(float InFocus, float InZoom, struct FImageCenterInfo* OutImageCenterInfo) const;
	TArray<struct FImageCenterPointInfo> GetImageCenterPoints() const;
	bool GetNodalOffsetPoint(float InFocus, float InZoom, struct FNodalPointOffset* OutNodalPointOffset) const;
	TArray<struct FNodalOffsetPointInfo> GetNodalOffsetPoints() const;
	bool GetSTMapPoint(float InFocus, float InZoom, struct FSTMapInfo* OutSTMapInfo) const;
	TArray<struct FSTMapPointInfo> GetSTMapPoints() const;
	int32 GetTotalPointNum(ELensDataCategory InDataCategory) const;
	bool HasFocusEncoderMapping() const;
	bool HasFocusPoint(ELensDataCategory InDataCategory, float InFocus) const;
	bool HasIrisEncoderMapping() const;
	bool HasSamples(ELensDataCategory InDataCategory) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LensFile">();
	}
	static class ULensFile* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULensFile>();
	}
};
static_assert(alignof(ULensFile) == 0x000008, "Wrong alignment on ULensFile");
static_assert(sizeof(ULensFile) == 0x000308, "Wrong size on ULensFile");
static_assert(offsetof(ULensFile, LensInfo) == 0x000030, "Member 'ULensFile::LensInfo' has a wrong offset!");
static_assert(offsetof(ULensFile, DataMode) == 0x000078, "Member 'ULensFile::DataMode' has a wrong offset!");
static_assert(offsetof(ULensFile, UserMetadata) == 0x000080, "Member 'ULensFile::UserMetadata' has a wrong offset!");
static_assert(offsetof(ULensFile, EncodersTable) == 0x0000D0, "Member 'ULensFile::EncodersTable' has a wrong offset!");
static_assert(offsetof(ULensFile, DistortionTable) == 0x0001D0, "Member 'ULensFile::DistortionTable' has a wrong offset!");
static_assert(offsetof(ULensFile, FocalLengthTable) == 0x000200, "Member 'ULensFile::FocalLengthTable' has a wrong offset!");
static_assert(offsetof(ULensFile, ImageCenterTable) == 0x000230, "Member 'ULensFile::ImageCenterTable' has a wrong offset!");
static_assert(offsetof(ULensFile, NodalOffsetTable) == 0x000260, "Member 'ULensFile::NodalOffsetTable' has a wrong offset!");
static_assert(offsetof(ULensFile, STMapTable) == 0x000290, "Member 'ULensFile::STMapTable' has a wrong offset!");
static_assert(offsetof(ULensFile, UndistortionDisplacementMapHolders) == 0x0002D0, "Member 'ULensFile::UndistortionDisplacementMapHolders' has a wrong offset!");
static_assert(offsetof(ULensFile, DistortionDisplacementMapHolders) == 0x0002E0, "Member 'ULensFile::DistortionDisplacementMapHolders' has a wrong offset!");

// Class CameraCalibrationCore.SphericalLensDistortionModelHandler
// 0x0018 (0x00E8 - 0x00D0)
class USphericalLensDistortionModelHandler final : public ULensDistortionModelHandlerBase
{
public:
	uint8                                         Pad_D0[0x18];                                      // 0x00D0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SphericalLensDistortionModelHandler">();
	}
	static class USphericalLensDistortionModelHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<USphericalLensDistortionModelHandler>();
	}
};
static_assert(alignof(USphericalLensDistortionModelHandler) == 0x000008, "Wrong alignment on USphericalLensDistortionModelHandler");
static_assert(sizeof(USphericalLensDistortionModelHandler) == 0x0000E8, "Wrong size on USphericalLensDistortionModelHandler");

// Class CameraCalibrationCore.SphericalLensModel
// 0x0000 (0x0028 - 0x0028)
class USphericalLensModel final : public ULensModel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SphericalLensModel">();
	}
	static class USphericalLensModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<USphericalLensModel>();
	}
};
