#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChaosVehiclesCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum ChaosVehiclesCore.EModuleInputValueType
// NumValues: 0x0006
enum class EModuleInputValueType : uint8
{
	MBoolean                                 = 0,
	MAxis1D                                  = 1,
	MAxis2D                                  = 2,
	MAxis3D                                  = 3,
	MInteger                                 = 4,
	EModuleInputValueType_MAX                = 5,
};

// Enum ChaosVehiclesCore.EFunctionType
// NumValues: 0x0004
enum class EFunctionType : uint8
{
	LinearFunction                           = 0,
	SquaredFunction                          = 1,
	CustomCurve                              = 2,
	EFunctionType_MAX                        = 3,
};

// Enum ChaosVehiclesCore.ESimTreeProcessingOrder
// NumValues: 0x0005
enum class ESimTreeProcessingOrder : uint8
{
	ManualOverride                           = 0,
	LeafFirst                                = 1,
	RootFirst                                = 2,
	LeafFirstBFS                             = 3,
	ESimTreeProcessingOrder_MAX              = 4,
};

// ScriptStruct ChaosVehiclesCore.ModuleInputValue
// 0x0020 (0x0020 - 0x0000)
struct FModuleInputValue final
{
public:
	struct FVector                                Value;                                             // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ValueInt;                                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EModuleInputValueType                         ValueType;                                         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bApplyInputDecay;                                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModuleInputValue) == 0x000004, "Wrong alignment on FModuleInputValue");
static_assert(sizeof(FModuleInputValue) == 0x000020, "Wrong size on FModuleInputValue");
static_assert(offsetof(FModuleInputValue, Value) == 0x000000, "Member 'FModuleInputValue::Value' has a wrong offset!");
static_assert(offsetof(FModuleInputValue, ValueInt) == 0x000018, "Member 'FModuleInputValue::ValueInt' has a wrong offset!");
static_assert(offsetof(FModuleInputValue, ValueType) == 0x00001C, "Member 'FModuleInputValue::ValueType' has a wrong offset!");
static_assert(offsetof(FModuleInputValue, bApplyInputDecay) == 0x00001D, "Member 'FModuleInputValue::bApplyInputDecay' has a wrong offset!");

// ScriptStruct ChaosVehiclesCore.ModuleInputSetup
// 0x0020 (0x0020 - 0x0000)
struct FModuleInputSetup final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EModuleInputValueType                         Type;                                              // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UDefaultModularVehicleInputModifier> InputModifierClass;                       // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyInputDecay;                                  // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FModuleInputSetup) == 0x000008, "Wrong alignment on FModuleInputSetup");
static_assert(sizeof(FModuleInputSetup) == 0x000020, "Wrong size on FModuleInputSetup");
static_assert(offsetof(FModuleInputSetup, Name) == 0x000000, "Member 'FModuleInputSetup::Name' has a wrong offset!");
static_assert(offsetof(FModuleInputSetup, Type) == 0x000008, "Member 'FModuleInputSetup::Type' has a wrong offset!");
static_assert(offsetof(FModuleInputSetup, InputModifierClass) == 0x000010, "Member 'FModuleInputSetup::InputModifierClass' has a wrong offset!");
static_assert(offsetof(FModuleInputSetup, bApplyInputDecay) == 0x000018, "Member 'FModuleInputSetup::bApplyInputDecay' has a wrong offset!");

// ScriptStruct ChaosVehiclesCore.ModuleInputContainer
// 0x0010 (0x0010 - 0x0000)
struct FModuleInputContainer final
{
public:
	TArray<struct FModuleInputValue>              InputValues;                                       // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FModuleInputContainer) == 0x000008, "Wrong alignment on FModuleInputContainer");
static_assert(sizeof(FModuleInputContainer) == 0x000010, "Wrong size on FModuleInputContainer");
static_assert(offsetof(FModuleInputContainer, InputValues) == 0x000000, "Member 'FModuleInputContainer::InputValues' has a wrong offset!");

}

