#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChaosSolverEngine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ChaosVDRuntime_structs.hpp"
#include "DataflowSimulation_structs.hpp"


namespace SDK
{

// Enum ChaosSolverEngine.EChaosVDRemoteSessionAttributes
// NumValues: 0x0005
enum class EChaosVDRemoteSessionAttributes : uint8
{
	None                                     = 0,
	SupportsDataChannelChange                = 1,
	CanExpire                                = 2,
	IsMultiSessionWrapper                    = 4,
	EChaosVDRemoteSessionAttributes_MAX      = 5,
};

// Enum ChaosSolverEngine.EChaosVDRemoteSessionReadyState
// NumValues: 0x0003
enum class EChaosVDRemoteSessionReadyState : uint8
{
	Ready                                    = 0,
	Busy                                     = 1,
	EChaosVDRemoteSessionReadyState_MAX      = 2,
};

// Enum ChaosSolverEngine.EClusterConnectionTypeEnum
// NumValues: 0x0008
enum class EClusterConnectionTypeEnum : uint8
{
	Chaos_PointImplicit                      = 0,
	Chaos_DelaunayTriangulation              = 1,
	Chaos_MinimalSpanningSubsetDelaunayTriangulation = 2,
	Chaos_PointImplicitAugmentedWithMinimalDelaunay = 3,
	Chaos_BoundsOverlapFilteredDelaunayTriangulation = 4,
	Chaos_None                               = 5,
	Chaos_EClsuterCreationParameters_Max     = 6,
	Chaos_MAX                                = 7,
};

// ScriptStruct ChaosSolverEngine.ChaosVDDataChannelState
// 0x0018 (0x0018 - 0x0000)
struct FChaosVDDataChannelState final
{
public:
	class FString                                 ChannelName;                                       // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEnabled;                                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanChangeChannelState;                            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FChaosVDDataChannelState) == 0x000008, "Wrong alignment on FChaosVDDataChannelState");
static_assert(sizeof(FChaosVDDataChannelState) == 0x000018, "Wrong size on FChaosVDDataChannelState");
static_assert(offsetof(FChaosVDDataChannelState, ChannelName) == 0x000000, "Member 'FChaosVDDataChannelState::ChannelName' has a wrong offset!");
static_assert(offsetof(FChaosVDDataChannelState, bIsEnabled) == 0x000010, "Member 'FChaosVDDataChannelState::bIsEnabled' has a wrong offset!");
static_assert(offsetof(FChaosVDDataChannelState, bCanChangeChannelState) == 0x000011, "Member 'FChaosVDDataChannelState::bCanChangeChannelState' has a wrong offset!");

// ScriptStruct ChaosSolverEngine.ChaosPhysicsCollisionInfo
// 0x00C0 (0x00C0 - 0x0000)
struct FChaosPhysicsCollisionInfo final
{
public:
	class UPrimitiveComponent*                    Component;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComponent;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Normal;                                            // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                AccumulatedImpulse;                                // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Velocity;                                          // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OtherVelocity;                                     // 0x0070(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                AngularVelocity;                                   // 0x0088(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OtherAngularVelocity;                              // 0x00A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mass;                                              // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OtherMass;                                         // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosPhysicsCollisionInfo) == 0x000008, "Wrong alignment on FChaosPhysicsCollisionInfo");
static_assert(sizeof(FChaosPhysicsCollisionInfo) == 0x0000C0, "Wrong size on FChaosPhysicsCollisionInfo");
static_assert(offsetof(FChaosPhysicsCollisionInfo, Component) == 0x000000, "Member 'FChaosPhysicsCollisionInfo::Component' has a wrong offset!");
static_assert(offsetof(FChaosPhysicsCollisionInfo, OtherComponent) == 0x000008, "Member 'FChaosPhysicsCollisionInfo::OtherComponent' has a wrong offset!");
static_assert(offsetof(FChaosPhysicsCollisionInfo, Location) == 0x000010, "Member 'FChaosPhysicsCollisionInfo::Location' has a wrong offset!");
static_assert(offsetof(FChaosPhysicsCollisionInfo, Normal) == 0x000028, "Member 'FChaosPhysicsCollisionInfo::Normal' has a wrong offset!");
static_assert(offsetof(FChaosPhysicsCollisionInfo, AccumulatedImpulse) == 0x000040, "Member 'FChaosPhysicsCollisionInfo::AccumulatedImpulse' has a wrong offset!");
static_assert(offsetof(FChaosPhysicsCollisionInfo, Velocity) == 0x000058, "Member 'FChaosPhysicsCollisionInfo::Velocity' has a wrong offset!");
static_assert(offsetof(FChaosPhysicsCollisionInfo, OtherVelocity) == 0x000070, "Member 'FChaosPhysicsCollisionInfo::OtherVelocity' has a wrong offset!");
static_assert(offsetof(FChaosPhysicsCollisionInfo, AngularVelocity) == 0x000088, "Member 'FChaosPhysicsCollisionInfo::AngularVelocity' has a wrong offset!");
static_assert(offsetof(FChaosPhysicsCollisionInfo, OtherAngularVelocity) == 0x0000A0, "Member 'FChaosPhysicsCollisionInfo::OtherAngularVelocity' has a wrong offset!");
static_assert(offsetof(FChaosPhysicsCollisionInfo, Mass) == 0x0000B8, "Member 'FChaosPhysicsCollisionInfo::Mass' has a wrong offset!");
static_assert(offsetof(FChaosPhysicsCollisionInfo, OtherMass) == 0x0000BC, "Member 'FChaosPhysicsCollisionInfo::OtherMass' has a wrong offset!");

// ScriptStruct ChaosSolverEngine.ChaosVDSessionPing
// 0x0010 (0x0010 - 0x0000)
struct FChaosVDSessionPing final
{
public:
	struct FGuid                                  ControllerInstanceId;                              // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosVDSessionPing) == 0x000001, "Wrong alignment on FChaosVDSessionPing");
static_assert(sizeof(FChaosVDSessionPing) == 0x000010, "Wrong size on FChaosVDSessionPing");
static_assert(offsetof(FChaosVDSessionPing, ControllerInstanceId) == 0x000000, "Member 'FChaosVDSessionPing::ControllerInstanceId' has a wrong offset!");

// ScriptStruct ChaosSolverEngine.ChaosVDSessionPong
// 0x0038 (0x0038 - 0x0000)
struct FChaosVDSessionPong final
{
public:
	struct FGuid                                  InstanceId;                                        // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  SessionId;                                         // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SessionName;                                       // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         BuildTargetType;                                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FChaosVDSessionPong) == 0x000008, "Wrong alignment on FChaosVDSessionPong");
static_assert(sizeof(FChaosVDSessionPong) == 0x000038, "Wrong size on FChaosVDSessionPong");
static_assert(offsetof(FChaosVDSessionPong, InstanceId) == 0x000000, "Member 'FChaosVDSessionPong::InstanceId' has a wrong offset!");
static_assert(offsetof(FChaosVDSessionPong, SessionId) == 0x000010, "Member 'FChaosVDSessionPong::SessionId' has a wrong offset!");
static_assert(offsetof(FChaosVDSessionPong, SessionName) == 0x000020, "Member 'FChaosVDSessionPong::SessionName' has a wrong offset!");
static_assert(offsetof(FChaosVDSessionPong, BuildTargetType) == 0x000030, "Member 'FChaosVDSessionPong::BuildTargetType' has a wrong offset!");

// ScriptStruct ChaosSolverEngine.ChaosVDStartRecordingCommandMessage
// 0x0018 (0x0018 - 0x0000)
struct FChaosVDStartRecordingCommandMessage final
{
public:
	EChaosVDRecordingMode                         RecordingMode;                                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Target;                                            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosVDStartRecordingCommandMessage) == 0x000008, "Wrong alignment on FChaosVDStartRecordingCommandMessage");
static_assert(sizeof(FChaosVDStartRecordingCommandMessage) == 0x000018, "Wrong size on FChaosVDStartRecordingCommandMessage");
static_assert(offsetof(FChaosVDStartRecordingCommandMessage, RecordingMode) == 0x000000, "Member 'FChaosVDStartRecordingCommandMessage::RecordingMode' has a wrong offset!");
static_assert(offsetof(FChaosVDStartRecordingCommandMessage, Target) == 0x000008, "Member 'FChaosVDStartRecordingCommandMessage::Target' has a wrong offset!");

// ScriptStruct ChaosSolverEngine.ChaosVDStopRecordingCommandMessage
// 0x0001 (0x0001 - 0x0000)
struct FChaosVDStopRecordingCommandMessage final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FChaosVDStopRecordingCommandMessage) == 0x000001, "Wrong alignment on FChaosVDStopRecordingCommandMessage");
static_assert(sizeof(FChaosVDStopRecordingCommandMessage) == 0x000001, "Wrong size on FChaosVDStopRecordingCommandMessage");

// ScriptStruct ChaosSolverEngine.ChaosVDRecordingStatusMessage
// 0x0050 (0x0050 - 0x0000)
struct FChaosVDRecordingStatusMessage final
{
public:
	struct FGuid                                  InstanceId;                                        // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRecording;                                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ElapsedTime;                                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChaosVDTraceDetails                   TraceDetails;                                      // 0x0018(0x0038)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosVDRecordingStatusMessage) == 0x000004, "Wrong alignment on FChaosVDRecordingStatusMessage");
static_assert(sizeof(FChaosVDRecordingStatusMessage) == 0x000050, "Wrong size on FChaosVDRecordingStatusMessage");
static_assert(offsetof(FChaosVDRecordingStatusMessage, InstanceId) == 0x000000, "Member 'FChaosVDRecordingStatusMessage::InstanceId' has a wrong offset!");
static_assert(offsetof(FChaosVDRecordingStatusMessage, bIsRecording) == 0x000010, "Member 'FChaosVDRecordingStatusMessage::bIsRecording' has a wrong offset!");
static_assert(offsetof(FChaosVDRecordingStatusMessage, ElapsedTime) == 0x000014, "Member 'FChaosVDRecordingStatusMessage::ElapsedTime' has a wrong offset!");
static_assert(offsetof(FChaosVDRecordingStatusMessage, TraceDetails) == 0x000018, "Member 'FChaosVDRecordingStatusMessage::TraceDetails' has a wrong offset!");

// ScriptStruct ChaosSolverEngine.ChaosVDChannelStateChangeCommandMessage
// 0x0018 (0x0018 - 0x0000)
struct FChaosVDChannelStateChangeCommandMessage final
{
public:
	struct FChaosVDDataChannelState               NewState;                                          // 0x0000(0x0018)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosVDChannelStateChangeCommandMessage) == 0x000001, "Wrong alignment on FChaosVDChannelStateChangeCommandMessage");
static_assert(sizeof(FChaosVDChannelStateChangeCommandMessage) == 0x000018, "Wrong size on FChaosVDChannelStateChangeCommandMessage");
static_assert(offsetof(FChaosVDChannelStateChangeCommandMessage, NewState) == 0x000000, "Member 'FChaosVDChannelStateChangeCommandMessage::NewState' has a wrong offset!");

// ScriptStruct ChaosSolverEngine.ChaosVDChannelStateChangeResponseMessage
// 0x0028 (0x0028 - 0x0000)
struct FChaosVDChannelStateChangeResponseMessage final
{
public:
	struct FGuid                                  InstanceId;                                        // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChaosVDDataChannelState               NewState;                                          // 0x0010(0x0018)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosVDChannelStateChangeResponseMessage) == 0x000001, "Wrong alignment on FChaosVDChannelStateChangeResponseMessage");
static_assert(sizeof(FChaosVDChannelStateChangeResponseMessage) == 0x000028, "Wrong size on FChaosVDChannelStateChangeResponseMessage");
static_assert(offsetof(FChaosVDChannelStateChangeResponseMessage, InstanceId) == 0x000000, "Member 'FChaosVDChannelStateChangeResponseMessage::InstanceId' has a wrong offset!");
static_assert(offsetof(FChaosVDChannelStateChangeResponseMessage, NewState) == 0x000010, "Member 'FChaosVDChannelStateChangeResponseMessage::NewState' has a wrong offset!");

// ScriptStruct ChaosSolverEngine.ChaosVDFullSessionInfoRequestMessage
// 0x0001 (0x0001 - 0x0000)
struct FChaosVDFullSessionInfoRequestMessage final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FChaosVDFullSessionInfoRequestMessage) == 0x000001, "Wrong alignment on FChaosVDFullSessionInfoRequestMessage");
static_assert(sizeof(FChaosVDFullSessionInfoRequestMessage) == 0x000001, "Wrong size on FChaosVDFullSessionInfoRequestMessage");

// ScriptStruct ChaosSolverEngine.ChaosVDFullSessionInfoResponseMessage
// 0x0028 (0x0028 - 0x0000)
struct FChaosVDFullSessionInfoResponseMessage final
{
public:
	struct FGuid                                  InstanceId;                                        // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FChaosVDDataChannelState>       DataChannelsStates;                                // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIsRecording;                                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FChaosVDFullSessionInfoResponseMessage) == 0x000008, "Wrong alignment on FChaosVDFullSessionInfoResponseMessage");
static_assert(sizeof(FChaosVDFullSessionInfoResponseMessage) == 0x000028, "Wrong size on FChaosVDFullSessionInfoResponseMessage");
static_assert(offsetof(FChaosVDFullSessionInfoResponseMessage, InstanceId) == 0x000000, "Member 'FChaosVDFullSessionInfoResponseMessage::InstanceId' has a wrong offset!");
static_assert(offsetof(FChaosVDFullSessionInfoResponseMessage, DataChannelsStates) == 0x000010, "Member 'FChaosVDFullSessionInfoResponseMessage::DataChannelsStates' has a wrong offset!");
static_assert(offsetof(FChaosVDFullSessionInfoResponseMessage, bIsRecording) == 0x000020, "Member 'FChaosVDFullSessionInfoResponseMessage::bIsRecording' has a wrong offset!");

// ScriptStruct ChaosSolverEngine.BreakEventCallbackWrapper
// 0x0030 (0x0030 - 0x0000)
struct FBreakEventCallbackWrapper final
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBreakEventCallbackWrapper) == 0x000001, "Wrong alignment on FBreakEventCallbackWrapper");
static_assert(sizeof(FBreakEventCallbackWrapper) == 0x000030, "Wrong size on FBreakEventCallbackWrapper");

// ScriptStruct ChaosSolverEngine.RemovalEventCallbackWrapper
// 0x0030 (0x0030 - 0x0000)
struct FRemovalEventCallbackWrapper final
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRemovalEventCallbackWrapper) == 0x000001, "Wrong alignment on FRemovalEventCallbackWrapper");
static_assert(sizeof(FRemovalEventCallbackWrapper) == 0x000030, "Wrong size on FRemovalEventCallbackWrapper");

// ScriptStruct ChaosSolverEngine.CrumblingEventCallbackWrapper
// 0x0030 (0x0030 - 0x0000)
struct FCrumblingEventCallbackWrapper final
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCrumblingEventCallbackWrapper) == 0x000001, "Wrong alignment on FCrumblingEventCallbackWrapper");
static_assert(sizeof(FCrumblingEventCallbackWrapper) == 0x000030, "Wrong size on FCrumblingEventCallbackWrapper");

// ScriptStruct ChaosSolverEngine.ChaosHandlerSet
// 0x0058 (0x0058 - 0x0000)
struct FChaosHandlerSet final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class UObject*>                          ChaosHandlers;                                     // 0x0008(0x0050)(UObjectWrapper, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosHandlerSet) == 0x000008, "Wrong alignment on FChaosHandlerSet");
static_assert(sizeof(FChaosHandlerSet) == 0x000058, "Wrong size on FChaosHandlerSet");
static_assert(offsetof(FChaosHandlerSet, ChaosHandlers) == 0x000008, "Member 'FChaosHandlerSet::ChaosHandlers' has a wrong offset!");

// ScriptStruct ChaosSolverEngine.ChaosDebugSubstepControl
// 0x0003 (0x0003 - 0x0000)
struct FChaosDebugSubstepControl final
{
public:
	bool                                          bPause;                                            // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSubstep;                                          // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStep;                                             // 0x0002(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosDebugSubstepControl) == 0x000001, "Wrong alignment on FChaosDebugSubstepControl");
static_assert(sizeof(FChaosDebugSubstepControl) == 0x000003, "Wrong size on FChaosDebugSubstepControl");
static_assert(offsetof(FChaosDebugSubstepControl, bPause) == 0x000000, "Member 'FChaosDebugSubstepControl::bPause' has a wrong offset!");
static_assert(offsetof(FChaosDebugSubstepControl, bSubstep) == 0x000001, "Member 'FChaosDebugSubstepControl::bSubstep' has a wrong offset!");
static_assert(offsetof(FChaosDebugSubstepControl, bStep) == 0x000002, "Member 'FChaosDebugSubstepControl::bStep' has a wrong offset!");

// ScriptStruct ChaosSolverEngine.DataflowRigidSolverProxy
// 0x0018 (0x0090 - 0x0078)
struct FDataflowRigidSolverProxy final : public FDataflowPhysicsSolverProxy
{
public:
	uint8                                         Pad_78[0x18];                                      // 0x0078(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowRigidSolverProxy) == 0x000001, "Wrong alignment on FDataflowRigidSolverProxy");
static_assert(sizeof(FDataflowRigidSolverProxy) == 0x000090, "Wrong size on FDataflowRigidSolverProxy");

}

