#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChaosVDRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum ChaosVDRuntime.EChaosVDAABBTreeNodeFlags
// NumValues: 0x0004
enum class EChaosVDAABBTreeNodeFlags : uint8
{
	None                                     = 0,
	IsLeaf                                   = 1,
	IsDirty                                  = 2,
	EChaosVDAABBTreeNodeFlags_MAX            = 3,
};

// Enum ChaosVDRuntime.EChaosVDAccelerationStructureType
// NumValues: 0x0006
enum class EChaosVDAccelerationStructureType : uint32
{
	BoundingVolume                           = 0,
	AABBTree                                 = 1,
	AABBTreeBV                               = 2,
	Collection                               = 3,
	Unknown                                  = 4,
	EChaosVDAccelerationStructureType_MAX    = 5,
};

// Enum ChaosVDRuntime.EChaosVDContactShapesType
// NumValues: 0x0019
enum class EChaosVDContactShapesType : uint32
{
	Unknown                                  = 0,
	SphereSphere                             = 1,
	SphereCapsule                            = 2,
	SphereBox                                = 3,
	SphereConvex                             = 4,
	SphereTriMesh                            = 5,
	SphereHeightField                        = 6,
	SpherePlane                              = 7,
	CapsuleCapsule                           = 8,
	CapsuleBox                               = 9,
	CapsuleConvex                            = 10,
	CapsuleTriMesh                           = 11,
	CapsuleHeightField                       = 12,
	BoxBox                                   = 13,
	BoxConvex                                = 14,
	BoxTriMesh                               = 15,
	BoxHeightField                           = 16,
	BoxPlane                                 = 17,
	ConvexConvex                             = 18,
	ConvexTriMesh                            = 19,
	ConvexHeightField                        = 20,
	GenericConvexConvex                      = 21,
	LevelSetLevelSet                         = 22,
	NumShapesTypes                           = 23,
	EChaosVDContactShapesType_MAX            = 24,
};

// Enum ChaosVDRuntime.EChaosVDContactPointType
// NumValues: 0x0006
enum class EChaosVDContactPointType : uint8
{
	Unknown                                  = 0,
	VertexPlane                              = 1,
	EdgeEdge                                 = 2,
	PlaneVertex                              = 3,
	VertexVertex                             = 4,
	EChaosVDContactPointType_MAX             = 5,
};

// Enum ChaosVDRuntime.EChaosVDManifoldPointFlags
// NumValues: 0x0008
enum class EChaosVDManifoldPointFlags : uint8
{
	None                                     = 0,
	Disabled                                 = 1,
	WasRestored                              = 2,
	WasReplaced                              = 4,
	HasStaticFrictionAnchor                  = 8,
	IsValid                                  = 16,
	InsideStaticFrictionCone                 = 32,
	EChaosVDManifoldPointFlags_MAX           = 33,
};

// Enum ChaosVDRuntime.EChaosVDConstraintFlags
// NumValues: 0x000F
enum class EChaosVDConstraintFlags : uint16
{
	None                                     = 0,
	IsCurrent                                = 1,
	Disabled                                 = 2,
	UseManifold                              = 4,
	UseIncrementalManifold                   = 8,
	CanRestoreManifold                       = 16,
	WasManifoldRestored                      = 32,
	IsQuadratic0                             = 64,
	IsQuadratic1                             = 128,
	IsProbe                                  = 256,
	CCDEnabled                               = 512,
	CCDSweepEnabled                          = 1024,
	ModifierApplied                          = 2048,
	MaterialSet                              = 4096,
	EChaosVDConstraintFlags_MAX              = 4097,
};

// Enum ChaosVDRuntime.EChaosVDMidPhaseFlags
// NumValues: 0x0007
enum class EChaosVDMidPhaseFlags : uint8
{
	None                                     = 0,
	IsActive                                 = 1,
	IsCCD                                    = 2,
	IsCCDActive                              = 4,
	IsSleeping                               = 8,
	IsModified                               = 16,
	EChaosVDMidPhaseFlags_MAX                = 17,
};

// Enum ChaosVDRuntime.EChaosVDMidPhaseType
// NumValues: 0x0005
enum class EChaosVDMidPhaseType : uint8
{
	Generic                                  = 0,
	ShapePair                                = 1,
	SphereApproximation                      = 2,
	Unknown                                  = 3,
	EChaosVDMidPhaseType_MAX                 = 4,
};

// Enum ChaosVDRuntime.EChaosVDCollisionTraceFlag
// NumValues: 0x0005
enum class EChaosVDCollisionTraceFlag : uint32
{
	UseDefault                               = 0,
	UseSimpleAndComplex                      = 1,
	UseSimpleAsComplex                       = 2,
	UseComplexAsSimple                       = 3,
	MAX                                      = 4,
};

// Enum ChaosVDRuntime.EChaosVDCollisionShapeDataFlags
// NumValues: 0x0005
enum class EChaosVDCollisionShapeDataFlags : uint8
{
	None                                     = 0,
	SimCollision                             = 1,
	QueryCollision                           = 2,
	IsProbe                                  = 4,
	EChaosVDCollisionShapeDataFlags_MAX      = 5,
};

// Enum ChaosVDRuntime.EChaosVDJointReSimType
// NumValues: 0x0003
enum class EChaosVDJointReSimType : uint32
{
	FullResim                                = 0,
	ResimAsFollower                          = 1,
	EChaosVDJointReSimType_MAX               = 2,
};

// Enum ChaosVDRuntime.EChaosVDJointSyncType
// NumValues: 0x0003
enum class EChaosVDJointSyncType : uint32
{
	InSync                                   = 0,
	HardDesync                               = 1,
	EChaosVDJointSyncType_MAX                = 2,
};

// Enum ChaosVDRuntime.EChaosVDJointStateFlags
// NumValues: 0x0007
enum class EChaosVDJointStateFlags : uint8
{
	None                                     = 0,
	Disabled                                 = 1,
	Broken                                   = 2,
	Breaking                                 = 4,
	DriveTargetChanged                       = 8,
	EnabledDuringResim                       = 16,
	EChaosVDJointStateFlags_MAX              = 17,
};

// Enum ChaosVDRuntime.EChaosVDGTJointStateFlags
// NumValues: 0x0006
enum class EChaosVDGTJointStateFlags : uint8
{
	None                                     = 0,
	IsBreaking                               = 1,
	IsBroken                                 = 2,
	DriveTargetChanged                       = 4,
	IsViolating                              = 8,
	EChaosVDGTJointStateFlags_MAX            = 9,
};

// Enum ChaosVDRuntime.EChaosVDJointSolverSettingsFlags
// NumValues: 0x0009
enum class EChaosVDJointSolverSettingsFlags : uint8
{
	None                                     = 0,
	UseLinearSolver                          = 1,
	SortEnabled                              = 2,
	SolvePositionLast                        = 4,
	UsePositionBasedDrives                   = 8,
	EnableTwistLimits                        = 16,
	EnableSwingLimits                        = 32,
	EnableDrives                             = 64,
	EChaosVDJointSolverSettingsFlags_MAX     = 65,
};

// Enum ChaosVDRuntime.EChaosVDJointMotionType
// NumValues: 0x0004
enum class EChaosVDJointMotionType : uint32
{
	Free                                     = 0,
	Limited                                  = 1,
	Locked                                   = 2,
	EChaosVDJointMotionType_MAX              = 3,
};

// Enum ChaosVDRuntime.EChaosVDJointForceMode
// NumValues: 0x0003
enum class EChaosVDJointForceMode : uint32
{
	Acceleration                             = 0,
	Force                                    = 1,
	EChaosVDJointForceMode_MAX               = 2,
};

// Enum ChaosVDRuntime.EChaosVDPlasticityType
// NumValues: 0x0004
enum class EChaosVDPlasticityType : uint32
{
	Free                                     = 0,
	Shrink                                   = 1,
	Grow                                     = 2,
	EChaosVDPlasticityType_MAX               = 3,
};

// Enum ChaosVDRuntime.EChaosVDJointSettingsFlags
// NumValues: 0x0014
enum class EChaosVDJointSettingsFlags : uint32
{
	None                                     = 0,
	CollisionEnabled                         = 1,
	MassConditioningEnabled                  = 2,
	AngularSLerpPositionDriveEnabled         = 4,
	AngularSLerpVelocityDriveEnabled         = 8,
	AngularTwistPositionDriveEnabled         = 16,
	AngularTwistVelocityDriveEnabled         = 32,
	AngularSwingPositionDriveEnabled         = 64,
	AngularSwingVelocityDriveEnabled         = 128,
	SoftLinearLimitsEnabled                  = 256,
	SoftTwistLimitsEnabled                   = 512,
	SoftSwingLimitsEnabled                   = 1024,
	LinearPositionDriveEnabled0              = 2048,
	LinearPositionDriveEnable1               = 4096,
	LinearPositionDriveEnable2               = 8192,
	LinearVelocityDriveEnabled0              = 16384,
	LinearVelocityDriveEnabled1              = 32768,
	LinearVelocityDriveEnabled2              = 65536,
	UseLinearSolver                          = 131072,
	EChaosVDJointSettingsFlags_MAX           = 131073,
};

// Enum ChaosVDRuntime.EChaosVDParticleType
// NumValues: 0x0009
enum class EChaosVDParticleType : uint8
{
	Static                                   = 0,
	Kinematic                                = 1,
	Rigid                                    = 2,
	Clustered                                = 3,
	StaticMesh                               = 4,
	SkeletalMesh                             = 5,
	GeometryCollection                       = 6,
	Unknown                                  = 7,
	EChaosVDParticleType_MAX                 = 8,
};

// Enum ChaosVDRuntime.EChaosVDSleepType
// NumValues: 0x0003
enum class EChaosVDSleepType : uint8
{
	MaterialSleep                            = 0,
	NeverSleep                               = 1,
	EChaosVDSleepType_MAX                    = 2,
};

// Enum ChaosVDRuntime.EChaosVDObjectStateType
// NumValues: 0x0007
enum class EChaosVDObjectStateType : uint8
{
	Uninitialized                            = 0,
	Sleeping                                 = 1,
	Kinematic                                = 2,
	Static                                   = 3,
	Dynamic                                  = 4,
	Count                                    = 5,
	EChaosVDObjectStateType_MAX              = 6,
};

// Enum ChaosVDRuntime.EChaosVDParticleContext
// NumValues: 0x0004
enum class EChaosVDParticleContext : uint32
{
	Invalid                                  = 0,
	GameThread                               = 1,
	PhysicsThread                            = 2,
	EChaosVDParticleContext_MAX              = 3,
};

// Enum ChaosVDRuntime.EChaosVDKinematicTargetMode
// NumValues: 0x0005
enum class EChaosVDKinematicTargetMode : uint32
{
	None                                     = 0,
	Reset                                    = 1,
	Position                                 = 2,
	Velocity                                 = 3,
	EChaosVDKinematicTargetMode_MAX          = 4,
};

// Enum ChaosVDRuntime.EChaosVDSceneQueryType
// NumValues: 0x0005
enum class EChaosVDSceneQueryType : uint32
{
	Invalid                                  = 0,
	Sweep                                    = 1,
	Overlap                                  = 2,
	RayCast                                  = 3,
	EChaosVDSceneQueryType_MAX               = 4,
};

// Enum ChaosVDRuntime.EChaosVDSceneQueryMode
// NumValues: 0x0005
enum class EChaosVDSceneQueryMode : uint32
{
	Single                                   = 0,
	Multi                                    = 1,
	Test                                     = 2,
	Invalid                                  = 3,
	EChaosVDSceneQueryMode_MAX               = 4,
};

// Enum ChaosVDRuntime.EChaosVDCollisionQueryParamsFlags
// NumValues: 0x000B
enum class EChaosVDCollisionQueryParamsFlags : uint16
{
	None                                     = 0,
	TraceComplex                             = 1,
	FindInitialOverlaps                      = 2,
	ReturnFaceIndex                          = 4,
	ReturnPhysicalMaterial                   = 8,
	IgnoreBlocks                             = 16,
	IgnoreTouches                            = 32,
	SkipNarrowPhase                          = 64,
	TraceIntoSubComponents                   = 128,
	ReplaceHitWithSubComponents              = 256,
	EChaosVDCollisionQueryParamsFlags_MAX    = 257,
};

// Enum ChaosVDRuntime.EChaosVDQueryFastDataParallelFlags
// NumValues: 0x0005
enum class EChaosVDQueryFastDataParallelFlags : uint8
{
	None                                     = 0,
	Parallel0                                = 1,
	Parallel1                                = 2,
	Parallel2                                = 4,
	EChaosVDQueryFastDataParallelFlags_MAX   = 5,
};

// Enum ChaosVDRuntime.EChaosVDSQHitFlags
// NumValues: 0x0008
enum class EChaosVDSQHitFlags : uint16
{
	None                                     = 0,
	Position                                 = 1,
	Normal                                   = 2,
	Distance                                 = 4,
	UV                                       = 8,
	MTD                                      = 512,
	FaceIndex                                = 1024,
	EChaosVDSQHitFlags_MAX                   = 1025,
};

// Enum ChaosVDRuntime.EChaosVDCollisionQueryHitType
// NumValues: 0x0004
enum class EChaosVDCollisionQueryHitType : uint32
{
	None                                     = 0,
	Touch                                    = 1,
	Block                                    = 2,
	EChaosVDCollisionQueryHitType_MAX        = 3,
};

// Enum ChaosVDRuntime.EChaosVDSQVisitRejectReason
// NumValues: 0x0007
enum class EChaosVDSQVisitRejectReason : uint32
{
	None                                     = 0,
	NoHit                                    = 1,
	PreFilter                                = 2,
	PostFilter                               = 3,
	ColocatedHitHasWorseNormal               = 4,
	FailedFastBoundTest                      = 5,
	EChaosVDSQVisitRejectReason_MAX          = 6,
};

// Enum ChaosVDRuntime.EChaosVDSceneQueryVisitorType
// NumValues: 0x0004
enum class EChaosVDSceneQueryVisitorType : uint32
{
	Invalid                                  = 0,
	BroadPhase                               = 1,
	NarrowPhase                              = 2,
	EChaosVDSceneQueryVisitorType_MAX        = 3,
};

// Enum ChaosVDRuntime.EChaosVDRecordingMode
// NumValues: 0x0004
enum class EChaosVDRecordingMode : uint8
{
	Invalid                                  = 0,
	Live                                     = 1,
	File                                     = 2,
	EChaosVDRecordingMode_MAX                = 3,
};

// ScriptStruct ChaosVDRuntime.ChaosVDWrapperDataBase
// 0x0010 (0x0010 - 0x0000)
struct FChaosVDWrapperDataBase
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bHasValidData;                                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FChaosVDWrapperDataBase) == 0x000001, "Wrong alignment on FChaosVDWrapperDataBase");
static_assert(sizeof(FChaosVDWrapperDataBase) == 0x000010, "Wrong size on FChaosVDWrapperDataBase");
static_assert(offsetof(FChaosVDWrapperDataBase, bHasValidData) == 0x000008, "Member 'FChaosVDWrapperDataBase::bHasValidData' has a wrong offset!");

// ScriptStruct ChaosVDRuntime.ChaosVDAccelerationStructureBase
// 0x0008 (0x0018 - 0x0010)
struct FChaosVDAccelerationStructureBase : public FChaosVDWrapperDataBase
{
public:
	int32                                         SolverId;                                          // 0x0010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChaosVDAccelerationStructureType             Type;                                              // 0x0014(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosVDAccelerationStructureBase) == 0x000004, "Wrong alignment on FChaosVDAccelerationStructureBase");
static_assert(sizeof(FChaosVDAccelerationStructureBase) == 0x000018, "Wrong size on FChaosVDAccelerationStructureBase");
static_assert(offsetof(FChaosVDAccelerationStructureBase, SolverId) == 0x000010, "Member 'FChaosVDAccelerationStructureBase::SolverId' has a wrong offset!");
static_assert(offsetof(FChaosVDAccelerationStructureBase, Type) == 0x000014, "Member 'FChaosVDAccelerationStructureBase::Type' has a wrong offset!");

// ScriptStruct ChaosVDRuntime.ChaosVDBVCellElementDataWrapper
// 0x0058 (0x0068 - 0x0010)
struct FChaosVDBVCellElementDataWrapper final : public FChaosVDWrapperDataBase
{
public:
	struct FBox                                   Bounds;                                            // 0x0010(0x0038)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParticleIndex;                                     // 0x0048(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x1C];                                      // 0x004C(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FChaosVDBVCellElementDataWrapper) == 0x000004, "Wrong alignment on FChaosVDBVCellElementDataWrapper");
static_assert(sizeof(FChaosVDBVCellElementDataWrapper) == 0x000068, "Wrong size on FChaosVDBVCellElementDataWrapper");
static_assert(offsetof(FChaosVDBVCellElementDataWrapper, Bounds) == 0x000010, "Member 'FChaosVDBVCellElementDataWrapper::Bounds' has a wrong offset!");
static_assert(offsetof(FChaosVDBVCellElementDataWrapper, ParticleIndex) == 0x000048, "Member 'FChaosVDBVCellElementDataWrapper::ParticleIndex' has a wrong offset!");

// ScriptStruct ChaosVDRuntime.ChaosVDBoundingVolumeDataWrapper
// 0x0028 (0x0040 - 0x0018)
struct FChaosVDBoundingVolumeDataWrapper final : public FChaosVDAccelerationStructureBase
{
public:
	uint8                                         Pad_18[0x20];                                      // 0x0018(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxPayloadBounds;                                  // 0x0038(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosVDBoundingVolumeDataWrapper) == 0x000008, "Wrong alignment on FChaosVDBoundingVolumeDataWrapper");
static_assert(sizeof(FChaosVDBoundingVolumeDataWrapper) == 0x000040, "Wrong size on FChaosVDBoundingVolumeDataWrapper");
static_assert(offsetof(FChaosVDBoundingVolumeDataWrapper, MaxPayloadBounds) == 0x000038, "Member 'FChaosVDBoundingVolumeDataWrapper::MaxPayloadBounds' has a wrong offset!");

// ScriptStruct ChaosVDRuntime.ChaosVDAABBTreeNodeDataWrapper
// 0x0080 (0x0090 - 0x0010)
struct FChaosVDAABBTreeNodeDataWrapper final : public FChaosVDWrapperDataBase
{
public:
	struct FBox                                   ChildrenBounds[0x2];                               // 0x0010(0x0038)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChildrenNodes[0x2];                                // 0x0080(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParentNode;                                        // 0x0088(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bLeaf : 1;                                         // 0x008C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDirtyNode : 1;                                    // 0x008C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FChaosVDAABBTreeNodeDataWrapper) == 0x000004, "Wrong alignment on FChaosVDAABBTreeNodeDataWrapper");
static_assert(sizeof(FChaosVDAABBTreeNodeDataWrapper) == 0x000090, "Wrong size on FChaosVDAABBTreeNodeDataWrapper");
static_assert(offsetof(FChaosVDAABBTreeNodeDataWrapper, ChildrenBounds) == 0x000010, "Member 'FChaosVDAABBTreeNodeDataWrapper::ChildrenBounds' has a wrong offset!");
static_assert(offsetof(FChaosVDAABBTreeNodeDataWrapper, ChildrenNodes) == 0x000080, "Member 'FChaosVDAABBTreeNodeDataWrapper::ChildrenNodes' has a wrong offset!");
static_assert(offsetof(FChaosVDAABBTreeNodeDataWrapper, ParentNode) == 0x000088, "Member 'FChaosVDAABBTreeNodeDataWrapper::ParentNode' has a wrong offset!");

// ScriptStruct ChaosVDRuntime.ChaosVDAABBTreePayloadBoundsElement
// 0x0078 (0x0088 - 0x0010)
struct FChaosVDAABBTreePayloadBoundsElement final : public FChaosVDWrapperDataBase
{
public:
	int32                                         ParticleIndex;                                     // 0x0010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   Bounds;                                            // 0x0018(0x0038)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x38];                                      // 0x0050(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FChaosVDAABBTreePayloadBoundsElement) == 0x000004, "Wrong alignment on FChaosVDAABBTreePayloadBoundsElement");
static_assert(sizeof(FChaosVDAABBTreePayloadBoundsElement) == 0x000088, "Wrong size on FChaosVDAABBTreePayloadBoundsElement");
static_assert(offsetof(FChaosVDAABBTreePayloadBoundsElement, ParticleIndex) == 0x000010, "Member 'FChaosVDAABBTreePayloadBoundsElement::ParticleIndex' has a wrong offset!");
static_assert(offsetof(FChaosVDAABBTreePayloadBoundsElement, Bounds) == 0x000018, "Member 'FChaosVDAABBTreePayloadBoundsElement::Bounds' has a wrong offset!");

// ScriptStruct ChaosVDRuntime.ChaosVDAABBTreeLeafDataWrapper
// 0x0048 (0x0058 - 0x0010)
struct FChaosVDAABBTreeLeafDataWrapper final : public FChaosVDWrapperDataBase
{
public:
	TArray<struct FChaosVDAABBTreePayloadBoundsElement> Elements;                                    // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FBox                                   Bounds;                                            // 0x0020(0x0038)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosVDAABBTreeLeafDataWrapper) == 0x000008, "Wrong alignment on FChaosVDAABBTreeLeafDataWrapper");
static_assert(sizeof(FChaosVDAABBTreeLeafDataWrapper) == 0x000058, "Wrong size on FChaosVDAABBTreeLeafDataWrapper");
static_assert(offsetof(FChaosVDAABBTreeLeafDataWrapper, Elements) == 0x000010, "Member 'FChaosVDAABBTreeLeafDataWrapper::Elements' has a wrong offset!");
static_assert(offsetof(FChaosVDAABBTreeLeafDataWrapper, Bounds) == 0x000020, "Member 'FChaosVDAABBTreeLeafDataWrapper::Bounds' has a wrong offset!");

// ScriptStruct ChaosVDRuntime.ChaosVDAccelerationStructureContainer
// 0x0050 (0x0050 - 0x0000)
struct FChaosVDAccelerationStructureContainer final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FChaosVDAccelerationStructureContainer) == 0x000001, "Wrong alignment on FChaosVDAccelerationStructureContainer");
static_assert(sizeof(FChaosVDAccelerationStructureContainer) == 0x000050, "Wrong size on FChaosVDAccelerationStructureContainer");

// ScriptStruct ChaosVDRuntime.ChaosVDAABBTreeDataWrapper
// 0x0058 (0x0070 - 0x0018)
struct FChaosVDAABBTreeDataWrapper final : public FChaosVDAccelerationStructureBase
{
public:
	int32                                         RootNodeIndex;                                     // 0x0018(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TreeDepth;                                         // 0x001C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NodesNum;                                          // 0x0020(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LeavesNum;                                         // 0x0024(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDynamicTree;                                      // 0x0028(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxChildrenInLeaf;                                 // 0x002C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxTreeDepth;                                      // 0x0030(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxPayloadBounds;                                  // 0x0038(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x30];                                      // 0x0040(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FChaosVDAABBTreeDataWrapper) == 0x000008, "Wrong alignment on FChaosVDAABBTreeDataWrapper");
static_assert(sizeof(FChaosVDAABBTreeDataWrapper) == 0x000070, "Wrong size on FChaosVDAABBTreeDataWrapper");
static_assert(offsetof(FChaosVDAABBTreeDataWrapper, RootNodeIndex) == 0x000018, "Member 'FChaosVDAABBTreeDataWrapper::RootNodeIndex' has a wrong offset!");
static_assert(offsetof(FChaosVDAABBTreeDataWrapper, TreeDepth) == 0x00001C, "Member 'FChaosVDAABBTreeDataWrapper::TreeDepth' has a wrong offset!");
static_assert(offsetof(FChaosVDAABBTreeDataWrapper, NodesNum) == 0x000020, "Member 'FChaosVDAABBTreeDataWrapper::NodesNum' has a wrong offset!");
static_assert(offsetof(FChaosVDAABBTreeDataWrapper, LeavesNum) == 0x000024, "Member 'FChaosVDAABBTreeDataWrapper::LeavesNum' has a wrong offset!");
static_assert(offsetof(FChaosVDAABBTreeDataWrapper, bDynamicTree) == 0x000028, "Member 'FChaosVDAABBTreeDataWrapper::bDynamicTree' has a wrong offset!");
static_assert(offsetof(FChaosVDAABBTreeDataWrapper, MaxChildrenInLeaf) == 0x00002C, "Member 'FChaosVDAABBTreeDataWrapper::MaxChildrenInLeaf' has a wrong offset!");
static_assert(offsetof(FChaosVDAABBTreeDataWrapper, MaxTreeDepth) == 0x000030, "Member 'FChaosVDAABBTreeDataWrapper::MaxTreeDepth' has a wrong offset!");
static_assert(offsetof(FChaosVDAABBTreeDataWrapper, MaxPayloadBounds) == 0x000038, "Member 'FChaosVDAABBTreeDataWrapper::MaxPayloadBounds' has a wrong offset!");

// ScriptStruct ChaosVDRuntime.ChaosVDCharacterGroundConstraintStateDataWrapper
// 0x0048 (0x0058 - 0x0010)
struct FChaosVDCharacterGroundConstraintStateDataWrapper final : public FChaosVDWrapperDataBase
{
public:
	uint8                                         Pad_10[0x10];                                      // 0x0010(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bDisabled;                                         // 0x0020(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SolverAppliedForce;                                // 0x0028(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SolverAppliedTorque;                               // 0x0040(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosVDCharacterGroundConstraintStateDataWrapper) == 0x000001, "Wrong alignment on FChaosVDCharacterGroundConstraintStateDataWrapper");
static_assert(sizeof(FChaosVDCharacterGroundConstraintStateDataWrapper) == 0x000058, "Wrong size on FChaosVDCharacterGroundConstraintStateDataWrapper");
static_assert(offsetof(FChaosVDCharacterGroundConstraintStateDataWrapper, bDisabled) == 0x000020, "Member 'FChaosVDCharacterGroundConstraintStateDataWrapper::bDisabled' has a wrong offset!");
static_assert(offsetof(FChaosVDCharacterGroundConstraintStateDataWrapper, SolverAppliedForce) == 0x000028, "Member 'FChaosVDCharacterGroundConstraintStateDataWrapper::SolverAppliedForce' has a wrong offset!");
static_assert(offsetof(FChaosVDCharacterGroundConstraintStateDataWrapper, SolverAppliedTorque) == 0x000040, "Member 'FChaosVDCharacterGroundConstraintStateDataWrapper::SolverAppliedTorque' has a wrong offset!");

// ScriptStruct ChaosVDRuntime.ChaosVDCharacterGroundConstraintSettingsDataWrapper
// 0x0058 (0x0068 - 0x0010)
struct FChaosVDCharacterGroundConstraintSettingsDataWrapper final : public FChaosVDWrapperDataBase
{
public:
	struct FVector                                VerticalAxis;                                      // 0x0010(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        TargetHeight;                                      // 0x0028(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RadialForceLimit;                                  // 0x0030(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        FrictionForceLimit;                                // 0x0038(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        TwistTorqueLimit;                                  // 0x0040(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        SwingTorqueLimit;                                  // 0x0048(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        CosMaxWalkableSlopeAngle;                          // 0x0050(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        DampingFactor;                                     // 0x0058(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        AssumedOnGroundHeight;                             // 0x0060(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosVDCharacterGroundConstraintSettingsDataWrapper) == 0x000008, "Wrong alignment on FChaosVDCharacterGroundConstraintSettingsDataWrapper");
static_assert(sizeof(FChaosVDCharacterGroundConstraintSettingsDataWrapper) == 0x000068, "Wrong size on FChaosVDCharacterGroundConstraintSettingsDataWrapper");
static_assert(offsetof(FChaosVDCharacterGroundConstraintSettingsDataWrapper, VerticalAxis) == 0x000010, "Member 'FChaosVDCharacterGroundConstraintSettingsDataWrapper::VerticalAxis' has a wrong offset!");
static_assert(offsetof(FChaosVDCharacterGroundConstraintSettingsDataWrapper, TargetHeight) == 0x000028, "Member 'FChaosVDCharacterGroundConstraintSettingsDataWrapper::TargetHeight' has a wrong offset!");
static_assert(offsetof(FChaosVDCharacterGroundConstraintSettingsDataWrapper, RadialForceLimit) == 0x000030, "Member 'FChaosVDCharacterGroundConstraintSettingsDataWrapper::RadialForceLimit' has a wrong offset!");
static_assert(offsetof(FChaosVDCharacterGroundConstraintSettingsDataWrapper, FrictionForceLimit) == 0x000038, "Member 'FChaosVDCharacterGroundConstraintSettingsDataWrapper::FrictionForceLimit' has a wrong offset!");
static_assert(offsetof(FChaosVDCharacterGroundConstraintSettingsDataWrapper, TwistTorqueLimit) == 0x000040, "Member 'FChaosVDCharacterGroundConstraintSettingsDataWrapper::TwistTorqueLimit' has a wrong offset!");
static_assert(offsetof(FChaosVDCharacterGroundConstraintSettingsDataWrapper, SwingTorqueLimit) == 0x000048, "Member 'FChaosVDCharacterGroundConstraintSettingsDataWrapper::SwingTorqueLimit' has a wrong offset!");
static_assert(offsetof(FChaosVDCharacterGroundConstraintSettingsDataWrapper, CosMaxWalkableSlopeAngle) == 0x000050, "Member 'FChaosVDCharacterGroundConstraintSettingsDataWrapper::CosMaxWalkableSlopeAngle' has a wrong offset!");
static_assert(offsetof(FChaosVDCharacterGroundConstraintSettingsDataWrapper, DampingFactor) == 0x000058, "Member 'FChaosVDCharacterGroundConstraintSettingsDataWrapper::DampingFactor' has a wrong offset!");
static_assert(offsetof(FChaosVDCharacterGroundConstraintSettingsDataWrapper, AssumedOnGroundHeight) == 0x000060, "Member 'FChaosVDCharacterGroundConstraintSettingsDataWrapper::AssumedOnGroundHeight' has a wrong offset!");

// ScriptStruct ChaosVDRuntime.ChaosVDCharacterGroundConstraintDataDataWrapper
// 0x0048 (0x0058 - 0x0010)
struct FChaosVDCharacterGroundConstraintDataDataWrapper final : public FChaosVDWrapperDataBase
{
public:
	struct FVector                                GroundNormal;                                      // 0x0010(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetDeltaPosition;                               // 0x0028(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        TargetDeltaFacing;                                 // 0x0040(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        GroundDistance;                                    // 0x0048(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        CosMaxWalkableSlopeAngle;                          // 0x0050(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosVDCharacterGroundConstraintDataDataWrapper) == 0x000008, "Wrong alignment on FChaosVDCharacterGroundConstraintDataDataWrapper");
static_assert(sizeof(FChaosVDCharacterGroundConstraintDataDataWrapper) == 0x000058, "Wrong size on FChaosVDCharacterGroundConstraintDataDataWrapper");
static_assert(offsetof(FChaosVDCharacterGroundConstraintDataDataWrapper, GroundNormal) == 0x000010, "Member 'FChaosVDCharacterGroundConstraintDataDataWrapper::GroundNormal' has a wrong offset!");
static_assert(offsetof(FChaosVDCharacterGroundConstraintDataDataWrapper, TargetDeltaPosition) == 0x000028, "Member 'FChaosVDCharacterGroundConstraintDataDataWrapper::TargetDeltaPosition' has a wrong offset!");
static_assert(offsetof(FChaosVDCharacterGroundConstraintDataDataWrapper, TargetDeltaFacing) == 0x000040, "Member 'FChaosVDCharacterGroundConstraintDataDataWrapper::TargetDeltaFacing' has a wrong offset!");
static_assert(offsetof(FChaosVDCharacterGroundConstraintDataDataWrapper, GroundDistance) == 0x000048, "Member 'FChaosVDCharacterGroundConstraintDataDataWrapper::GroundDistance' has a wrong offset!");
static_assert(offsetof(FChaosVDCharacterGroundConstraintDataDataWrapper, CosMaxWalkableSlopeAngle) == 0x000050, "Member 'FChaosVDCharacterGroundConstraintDataDataWrapper::CosMaxWalkableSlopeAngle' has a wrong offset!");

// ScriptStruct ChaosVDRuntime.ChaosVDConstraintDataWrapperBase
// 0x0000 (0x0010 - 0x0010)
struct FChaosVDConstraintDataWrapperBase : public FChaosVDWrapperDataBase
{
};
static_assert(alignof(FChaosVDConstraintDataWrapperBase) == 0x000001, "Wrong alignment on FChaosVDConstraintDataWrapperBase");
static_assert(sizeof(FChaosVDConstraintDataWrapperBase) == 0x000010, "Wrong size on FChaosVDConstraintDataWrapperBase");

// ScriptStruct ChaosVDRuntime.ChaosVDCharacterGroundConstraint
// 0x0128 (0x0138 - 0x0010)
struct FChaosVDCharacterGroundConstraint final : public FChaosVDConstraintDataWrapperBase
{
public:
	uint8                                         Pad_10[0x4];                                       // 0x0010(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ConstraintIndex;                                   // 0x0014(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChaosVDCharacterGroundConstraintStateDataWrapper State;                                  // 0x0020(0x0058)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FChaosVDCharacterGroundConstraintSettingsDataWrapper Settings;                            // 0x0078(0x0068)(Edit, EditConst, NativeAccessSpecifierPublic)
	struct FChaosVDCharacterGroundConstraintDataDataWrapper Data;                                    // 0x00E0(0x0058)(Edit, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosVDCharacterGroundConstraint) == 0x000004, "Wrong alignment on FChaosVDCharacterGroundConstraint");
static_assert(sizeof(FChaosVDCharacterGroundConstraint) == 0x000138, "Wrong size on FChaosVDCharacterGroundConstraint");
static_assert(offsetof(FChaosVDCharacterGroundConstraint, ConstraintIndex) == 0x000014, "Member 'FChaosVDCharacterGroundConstraint::ConstraintIndex' has a wrong offset!");
static_assert(offsetof(FChaosVDCharacterGroundConstraint, State) == 0x000020, "Member 'FChaosVDCharacterGroundConstraint::State' has a wrong offset!");
static_assert(offsetof(FChaosVDCharacterGroundConstraint, Settings) == 0x000078, "Member 'FChaosVDCharacterGroundConstraint::Settings' has a wrong offset!");
static_assert(offsetof(FChaosVDCharacterGroundConstraint, Data) == 0x0000E0, "Member 'FChaosVDCharacterGroundConstraint::Data' has a wrong offset!");

// ScriptStruct ChaosVDRuntime.ChaosVDContactPoint
// 0x0058 (0x0058 - 0x0000)
struct FChaosVDContactPoint final
{
public:
	struct FVector                                ShapeContactPoints[0x2];                           // 0x0000(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ShapeContactNormal;                                // 0x0030(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Phi;                                               // 0x0048(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FaceIndex;                                         // 0x004C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChaosVDContactPointType                      ContactType;                                       // 0x0050(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FChaosVDContactPoint) == 0x000004, "Wrong alignment on FChaosVDContactPoint");
static_assert(sizeof(FChaosVDContactPoint) == 0x000058, "Wrong size on FChaosVDContactPoint");
static_assert(offsetof(FChaosVDContactPoint, ShapeContactPoints) == 0x000000, "Member 'FChaosVDContactPoint::ShapeContactPoints' has a wrong offset!");
static_assert(offsetof(FChaosVDContactPoint, ShapeContactNormal) == 0x000030, "Member 'FChaosVDContactPoint::ShapeContactNormal' has a wrong offset!");
static_assert(offsetof(FChaosVDContactPoint, Phi) == 0x000048, "Member 'FChaosVDContactPoint::Phi' has a wrong offset!");
static_assert(offsetof(FChaosVDContactPoint, FaceIndex) == 0x00004C, "Member 'FChaosVDContactPoint::FaceIndex' has a wrong offset!");
static_assert(offsetof(FChaosVDContactPoint, ContactType) == 0x000050, "Member 'FChaosVDContactPoint::ContactType' has a wrong offset!");

// ScriptStruct ChaosVDRuntime.ChaosVDManifoldPoint
// 0x0130 (0x0130 - 0x0000)
struct FChaosVDManifoldPoint final
{
public:
	uint8                                         bDisabled : 1;                                     // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bWasRestored : 1;                                  // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bWasReplaced : 1;                                  // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bHasStaticFrictionAnchor : 1;                      // 0x0000(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsValid : 1;                                      // 0x0000(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bInsideStaticFrictionCone : 1;                     // 0x0000(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                NetPushOut;                                        // 0x0008(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NetImpulse;                                        // 0x0020(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetPhi;                                         // 0x0038(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitialPhi;                                        // 0x003C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ShapeAnchorPoints[0x2];                            // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InitialShapeContactPoints[0x2];                    // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChaosVDContactPoint                   ContactPoint;                                      // 0x00A0(0x0058)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ShapeContactPoints[0x2];                           // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FChaosVDManifoldPoint) == 0x000004, "Wrong alignment on FChaosVDManifoldPoint");
static_assert(sizeof(FChaosVDManifoldPoint) == 0x000130, "Wrong size on FChaosVDManifoldPoint");
static_assert(offsetof(FChaosVDManifoldPoint, NetPushOut) == 0x000008, "Member 'FChaosVDManifoldPoint::NetPushOut' has a wrong offset!");
static_assert(offsetof(FChaosVDManifoldPoint, NetImpulse) == 0x000020, "Member 'FChaosVDManifoldPoint::NetImpulse' has a wrong offset!");
static_assert(offsetof(FChaosVDManifoldPoint, TargetPhi) == 0x000038, "Member 'FChaosVDManifoldPoint::TargetPhi' has a wrong offset!");
static_assert(offsetof(FChaosVDManifoldPoint, InitialPhi) == 0x00003C, "Member 'FChaosVDManifoldPoint::InitialPhi' has a wrong offset!");
static_assert(offsetof(FChaosVDManifoldPoint, ShapeAnchorPoints) == 0x000040, "Member 'FChaosVDManifoldPoint::ShapeAnchorPoints' has a wrong offset!");
static_assert(offsetof(FChaosVDManifoldPoint, InitialShapeContactPoints) == 0x000070, "Member 'FChaosVDManifoldPoint::InitialShapeContactPoints' has a wrong offset!");
static_assert(offsetof(FChaosVDManifoldPoint, ContactPoint) == 0x0000A0, "Member 'FChaosVDManifoldPoint::ContactPoint' has a wrong offset!");
static_assert(offsetof(FChaosVDManifoldPoint, ShapeContactPoints) == 0x0000F8, "Member 'FChaosVDManifoldPoint::ShapeContactPoints' has a wrong offset!");

// ScriptStruct ChaosVDRuntime.ChaosVDCollisionMaterial
// 0x0030 (0x0030 - 0x0000)
struct FChaosVDCollisionMaterial final
{
public:
	int32                                         FaceIndex;                                         // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaterialDynamicFriction;                           // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaterialStaticFriction;                            // 0x0008(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaterialRestitution;                               // 0x000C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DynamicFriction;                                   // 0x0010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StaticFriction;                                    // 0x0014(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Restitution;                                       // 0x0018(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RestitutionThreshold;                              // 0x001C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InvMassScale0;                                     // 0x0020(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InvMassScale1;                                     // 0x0024(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InvInertiaScale0;                                  // 0x0028(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InvInertiaScale1;                                  // 0x002C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChaosVDCollisionMaterial) == 0x000004, "Wrong alignment on FChaosVDCollisionMaterial");
static_assert(sizeof(FChaosVDCollisionMaterial) == 0x000030, "Wrong size on FChaosVDCollisionMaterial");
static_assert(offsetof(FChaosVDCollisionMaterial, FaceIndex) == 0x000000, "Member 'FChaosVDCollisionMaterial::FaceIndex' has a wrong offset!");
static_assert(offsetof(FChaosVDCollisionMaterial, MaterialDynamicFriction) == 0x000004, "Member 'FChaosVDCollisionMaterial::MaterialDynamicFriction' has a wrong offset!");
static_assert(offsetof(FChaosVDCollisionMaterial, MaterialStaticFriction) == 0x000008, "Member 'FChaosVDCollisionMaterial::MaterialStaticFriction' has a wrong offset!");
static_assert(offsetof(FChaosVDCollisionMaterial, MaterialRestitution) == 0x00000C, "Member 'FChaosVDCollisionMaterial::MaterialRestitution' has a wrong offset!");
static_assert(offsetof(FChaosVDCollisionMaterial, DynamicFriction) == 0x000010, "Member 'FChaosVDCollisionMaterial::DynamicFriction' has a wrong offset!");
static_assert(offsetof(FChaosVDCollisionMaterial, StaticFriction) == 0x000014, "Member 'FChaosVDCollisionMaterial::StaticFriction' has a wrong offset!");
static_assert(offsetof(FChaosVDCollisionMaterial, Restitution) == 0x000018, "Member 'FChaosVDCollisionMaterial::Restitution' has a wrong offset!");
static_assert(offsetof(FChaosVDCollisionMaterial, RestitutionThreshold) == 0x00001C, "Member 'FChaosVDCollisionMaterial::RestitutionThreshold' has a wrong offset!");
static_assert(offsetof(FChaosVDCollisionMaterial, InvMassScale0) == 0x000020, "Member 'FChaosVDCollisionMaterial::InvMassScale0' has a wrong offset!");
static_assert(offsetof(FChaosVDCollisionMaterial, InvMassScale1) == 0x000024, "Member 'FChaosVDCollisionMaterial::InvMassScale1' has a wrong offset!");
static_assert(offsetof(FChaosVDCollisionMaterial, InvInertiaScale0) == 0x000028, "Member 'FChaosVDCollisionMaterial::InvInertiaScale0' has a wrong offset!");
static_assert(offsetof(FChaosVDCollisionMaterial, InvInertiaScale1) == 0x00002C, "Member 'FChaosVDCollisionMaterial::InvInertiaScale1' has a wrong offset!");

// ScriptStruct ChaosVDRuntime.ChaosVDConstraint
// 0x0280 (0x0280 - 0x0000)
struct FChaosVDConstraint final
{
public:
	uint8                                         bIsCurrent : 1;                                    // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDisabled : 1;                                     // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseManifold : 1;                                  // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseIncrementalManifold : 1;                       // 0x0000(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCanRestoreManifold : 1;                           // 0x0000(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bWasManifoldRestored : 1;                          // 0x0000(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsQuadratic0 : 1;                                 // 0x0000(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsQuadratic1 : 1;                                 // 0x0000(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsProbe : 1;                                      // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCCDEnabled : 1;                                   // 0x0001(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCCDSweepEnabled : 1;                              // 0x0001(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bModifierApplied : 1;                              // 0x0001(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMaterialSet : 1;                                  // 0x0001(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChaosVDCollisionMaterial              Material;                                          // 0x0004(0x0030)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AccumulatedImpulse;                                // 0x0038(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChaosVDContactShapesType                     ShapesType;                                        // 0x0050(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0xC];                                       // 0x0054(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ShapeWorldTransforms[0x2];                         // 0x0060(0x0060)(Edit, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ImplicitTransforms[0x2];                           // 0x0120(0x0060)(Edit, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CullDistance;                                      // 0x01E0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CollisionMargins;                                  // 0x01E8(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	float                                         CollisionTolerance;                                // 0x01F8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ClosestManifoldPointIndex;                         // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExpectedNumManifoldPoints;                         // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LastShapeWorldPositionDelta;                       // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                  LastShapeWorldRotationDelta;                       // 0x0220(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Stiffness;                                         // 0x0240(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
