#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChatSDK

#include "Basic.hpp"

#include "ChatSDK_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ChatSDK.ChatKefuSDK
// 0x0020 (0x0048 - 0x0028)
class UChatKefuSDK final : public UObject
{
public:
	TMulticastInlineDelegate<void(bool bIsOnline)> OnKefuOnlineStateListener;                        // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FChatSDKMessage& Message)> OnRecvNewKefuMessageDelegate; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void DownloadResource(const class FString& UUID, int32 Type, TDelegate<void(int64 Current, int64 Total)> ProgressCallback, TDelegate<void(bool bSucceed, const class FString& Path, int32 Code, const class FString& Msg)> Callback);
	void FetchHistoryMessage(const class FString& FromMsgSeq, int32 Count, TDelegate<void(bool bSucceed, const TArray<struct FChatSDKMessage>& List, int32 Code, const class FString& Msg)> Callback);
	struct FKefuInfo GetKefuInfo();
	void Init(TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback);
	void Login(const struct FLoginUserInfo& Info, TDelegate<void(bool bSucceed, const struct FKefuInfo& KefuInfo, int32 Code, const class FString& Desc)> Callback);
	void Logout(TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback);
	struct FSendMsgResult ResendMessage(const class FString& ClientMsgId, TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc, const class FString& ClientMsgId, int64 MsgId)> Callback);
	void SelectImageFromAlbum(TDelegate<void(const class FString& ImagePath)> Callback);
	struct FSendMsgResult SendMessage(const struct FChatSDKMessage& Message, const class FString& Ext, TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc, const class FString& ClientMsgId, int64 MsgId)> Callback);
	void SetDeBugMode(bool flag);
	void SetSupportMessageTypes(const TArray<EChatSDKMessageType>& Types);
	void StartChat(TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback);
	void StopChat();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChatKefuSDK">();
	}
	static class UChatKefuSDK* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatKefuSDK>();
	}
};
static_assert(alignof(UChatKefuSDK) == 0x000008, "Wrong alignment on UChatKefuSDK");
static_assert(sizeof(UChatKefuSDK) == 0x000048, "Wrong size on UChatKefuSDK");
static_assert(offsetof(UChatKefuSDK, OnKefuOnlineStateListener) == 0x000028, "Member 'UChatKefuSDK::OnKefuOnlineStateListener' has a wrong offset!");
static_assert(offsetof(UChatKefuSDK, OnRecvNewKefuMessageDelegate) == 0x000038, "Member 'UChatKefuSDK::OnRecvNewKefuMessageDelegate' has a wrong offset!");

// Class ChatSDK.WMChatSDKSubsystem
// 0x0010 (0x0040 - 0x0030)
class UWMChatSDKSubsystem final : public UEngineSubsystem
{
public:
	class UChatCommunitySDK*                      CommunitySDK;                                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UChatKefuSDK*                           ChatKefuSDK;                                       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UChatCommunitySDK* GetCommunitySDK();
	class UChatKefuSDK* GetKefuSDK();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WMChatSDKSubsystem">();
	}
	static class UWMChatSDKSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWMChatSDKSubsystem>();
	}
};
static_assert(alignof(UWMChatSDKSubsystem) == 0x000008, "Wrong alignment on UWMChatSDKSubsystem");
static_assert(sizeof(UWMChatSDKSubsystem) == 0x000040, "Wrong size on UWMChatSDKSubsystem");
static_assert(offsetof(UWMChatSDKSubsystem, CommunitySDK) == 0x000030, "Member 'UWMChatSDKSubsystem::CommunitySDK' has a wrong offset!");
static_assert(offsetof(UWMChatSDKSubsystem, ChatKefuSDK) == 0x000038, "Member 'UWMChatSDKSubsystem::ChatKefuSDK' has a wrong offset!");

// Class ChatSDK.ChatCommunitySDK
// 0x0090 (0x00B8 - 0x0028)
class UChatCommunitySDK final : public UObject
{
public:
	TMulticastInlineDelegate<void(EConnectionStatus Status, int32 Code, const class FString& Desc)> OnConnectStatusChangeDelegate; // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FChatSDKChannelMessage& Message)> OnRecvNewChannelMessageDelegate; // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FChatSDKMessage& Message)> OnRecvNewSingleMessageDelegate; // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FChatSDKMessage& Message)> OnRecvNewGroupMessageDelegate; // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FChatNotifyMessage& Message)> OnRecvNewNotifyMessageDelegate; // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 EventType, const class FString& EventContent)> OnRecvChannelEventDelegate; // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 EventType, const class FString& EventContent)> OnRecvSessionEventDelegate; // 0x0088(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 EventType, const class FString& EventContent)> OnRecvGroupEventDelegate; // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 LoginType)> OnRecvLoginEventDelegate;                        // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void ChangeGroupName(const class FString& GroupId, const class FString& NewGroupName, TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback);
	void ChangeGroupOwner(const class FString& GroupId, const class FString& NewOwnerRoleId, TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback);
	void ClearLocalSessionMessage(int32 Type, const class FString& To, TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback);
	struct FChatSDKChannelMessage CreateChannelEmojiMessage(int32 Index_0, const TArray<uint8>& Data, int32 ByteSize);
	struct FChatSDKChannelMessage CreateChannelImageMessage(const class FString& FilePath);
	struct FChatSDKChannelMessage CreateChannelTextMessage(const class FString& Text);
	void DeleteSession(int32 Type, const class FString& To, bool QueryCloud, bool DeleteCloudMessage, TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback);
	void DismissGroup(const class FString& GroupId, TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback);
	void DownloadChannelRes(const class FString& Cid, const class FString& UUID, int32 ResType, TDelegate<void(int64 TotalSize, int64 CurrentSize)> ProgressDelegate, TDelegate<void(bool bSucceed, const class FString& Path, int32 Code, const class FString& Desc)> DownloadDelegate);
	void DownloadRes(const class FString& To, const class FString& UUID, int32 ChatType, int32 ResType, TDelegate<void(int64 TotalSize, int64 CurrentSize)> ProgressDelegate, TDelegate<void(bool bSucceed, const class FString& Path, int32 Code, const class FString& Desc)> DownloadDelegate);
	void EnableDebug(bool Enable);
	void ExitGroup(const class FString& GroupId, const TArray<class FString>& RoleIds, bool bIsKicked, TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback);
	void GetChannelMemberList(int32 Count, const class FString& Cid, int32 FromCursor, TDelegate<void(bool bSucceed, const TArray<struct FChatChannelMember>& MemberList, bool bHasMore, int64 NextFromId, int32 Code, const class FString& Desc)> Callback);
	void GetGroupMemberList(int32 Count, const class FString& GId, int32 FromId, EChatGroupMemberFilter Filter, TDelegate<void(bool bSucceed, const TArray<struct FChatGroupMember>& MemberList, bool bHasMore, int64 NextFromId, int32 Code, const class FString& Desc)> Callback);
	void GetHistoryChannelMessageList(int32 Count, const class FString& Cid, TDelegate<void(bool bSucceed, const TArray<struct FChatSDKChannelMessage>& MsgList, int32 Code, const class FString& Desc)> Callback);
	void GetHistoryChannelMessageListWithExcludeMessageTypeList(int32 Count, const class FString& Cid, const TArray<EChatSDKMessageType>& MessageTypes, TDelegate<void(bool bSucceed, const TArray<struct FChatSDKChannelMessage>& MsgList, int32 Code, const class FString& Desc)> Callback);
	void GetHistoryGroupMessageList(int32 Count, const class FString& GId, TDelegate<void(bool bSucceed, const TArray<struct FChatSDKMessage>& MsgList, int32 Code, const class FString& Desc)> Callback);
	void GetHistorySingleMessageList(int32 Count, const class FString& To, TDelegate<void(bool bSucceed, const TArray<struct FChatSDKMessage>& MsgList, int32 Code, const class FString& Desc)> Callback);
	void GetJoinedChannelList(int32 Page, int32 PageSize, TDelegate<void(bool bSucceed, const TArray<struct FChatChannelInfo>& ChannelList, int32 Code, const class FString& Desc)> Callback);
	void GetJoinedGroupList(int32 Page, int32 PageSize, TDelegate<void(bool bSucceed, const TArray<struct FChatGroupInfo>& GroupList, int32 Code, const class FString& Desc)> Callback);
	void GetLocalChannelMessageList(const class FString& FromMsgSeq, int32 Count, const class FString& Cid, TDelegate<void(bool bSucceed, const TArray<struct FChatSDKChannelMessage>& MsgList, int32 Code, const class FString& Desc)> Callback);
	void GetLocalChannelMessageListWithExcludeMessageTypeList(const class FString& FromMsgSeq, int32 Count, const class FString& Cid, const TArray<EChatSDKMessageType>& MessageTypes, TDelegate<void(bool bSucceed, const TArray<struct FChatSDKChannelMessage>& MsgList, int32 Code, const class FString& Desc)> Callback);
	void GetLocalGroupMessageList(const class FString& FromMsgSeq, int32 Count, const class FString& GId, TDelegate<void(bool bSucceed, const TArray<struct FChatSDKMessage>& MsgList, int32 Code, const class FString& Desc)> Callback);
	void GetLocalNotifyMsgList(const class FString& From, const class FString& MsgSeq, int32 Count, TDelegate<void(bool bSucceed, const TArray<struct FChatNotifyMessage>& MsgList, int32 Code, const class FString& Desc)> Delegate);
	void GetLocalSingleMessageList(const class FString& FromMsgSeq, int32 Count, const class FString& To, TDelegate<void(bool bSucceed, const TArray<struct FChatSDKMessage>& MsgList, int32 Code, const class FString& Desc)> Callback);
	void GetTotalUnReadMessageCount(TDelegate<void(bool bSucceed, int32 Count, int32 Code, const class FString& Desc)> Callback);
	void GetTotalUnReadNotifyMsgCount(TDelegate<void(bool bSucceed, int32 Count, int32 Code, const class FString& Desc)> Delegate);
	void GetUserSilenceList(EChatSilenceType SilenceType, const TArray<class FString>& RoleIds, TDelegate<void(bool bSucceed, const TArray<struct FChatUserSilence>& UserSilenceList, int32 Code, const class FString& Desc)> Delegate);
	void Init(const class FString& AppID, const class FString& AppKey, TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> OnInitResult);
	void InitWithRegionType(const class FString& AppID, const class FString& AppKey, EChatRegionType RegionType, TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> OnInitResult);
	void InviteToGroup(const class FString& GroupId, const class FString& GroupName, const TArray<struct FChatGroupMember>& MemberList, TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback);
	void JoinChannel(const TArray<class FString>& CidList, TDelegate<void(bool bSucceed, const TArray<struct FChatChannelInfo>& ChannelList, const TArray<struct FChatChannelInfo>& FailedList, int32 Code, const class FString& Desc)> Callback);
	void JoinGroup(const class FString& GroupId, const class FString& GroupName, int32 RoleType, TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback);
	void Login(const struct FGameUserInfo& UserInfo, TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> OnLoginResult);
	void Logout(TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> OnLogoutResult);
	void MarkAllMessageAsRead(TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback);
	void MarkAllNotifyMsgAsRead(TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Delegate);
	void MarkMessageAsRead(int32 Type, const class FString& To, TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback);
	void QuerySessionInfo(int32 Type, const class FString& To, TDelegate<void(bool bSucceed, const struct FChatSessionInfo& SessionInfo, int32 Code, const class FString& Desc)> Callback);
	void QuerySessionList(int64 UpdateTime, int32 Count, bool IsTop, TDelegate<void(bool bSucceed, const TArray<struct FChatSessionInfo>& SessionList, int32 Code, const class FString& Desc)> Callback);
	void QueryUserInfo(const class FString& RoleId, TDelegate<void(bool bSucceed, const struct FChatUserInfo& UserInfo, int32 Code, const class FString& Desc)> Callback);
	void QueryUserIsOnline(const class FString& RoleId, TDelegate<void(bool bSucceed, bool IsOnline, int32 Code, const class FString& Desc)> Callback);
	void QueryUserListIsOnline(const TArray<class FString>& RoleIdList, TDelegate<void(bool bSucceed, const TArray<struct FChatUserOnlineStatus>& UserOnlineStatusList, int32 Code, const class FString& Desc)> Callback);
	void QuitChannel(const class FString& Cid, TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback);
	void RemoveFriend(const class FString& uid, TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> OnRemoveFriendResult);
	struct FSendMsgResult SendChannelMessage(const struct FChatSDKChannelMessage& Message, const class FString& ChannelId, bool AtAll, const TArray<class FString>& AtList, const class FString& Ext, TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc, const class FString& ClientMsgId, int64 MsgId, const class FString& RepleaceContent, const TArray<int32>& AntispamType, int32 Suggestion)> OnSendChannelMessageResult);
	struct FSendMsgResult SendChatMessage(const struct FChatSDKMessage& Message, const class FString& To, const class FString& Ext, TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc, const class FString& ClientMsgId, int64 MsgId, const class FString& RepleaceContent, const TArray<int32>& AntispamType, int32 Suggestion)> OnSendMessageResult);
	struct FSendMsgResult SendGroupMessage(const struct FChatSDKMessage& Message, const class FString& To, bool AtAll, const TArray<class FString>& AtList, const class FString& Ext, TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc, const class FString& ClientMsgId, int64 MsgId, const class FString& RepleaceContent, const TArray<int32>& AntispamType, int32 Suggestion)> OnSendMessageResult);
	void SetInfoForNoLauncher(const struct FGameNoLauncherInfo& Info, TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback);
	void UpdateUserInfo(const class FString& RoleName, const class FString& Avatar, const class FString& ServerId, const class FString& GameExt, TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChatCommunitySDK">();
	}
	static class UChatCommunitySDK* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatCommunitySDK>();
	}
};
static_assert(alignof(UChatCommunitySDK) == 0x000008, "Wrong alignment on UChatCommunitySDK");
static_assert(sizeof(UChatCommunitySDK) == 0x0000B8, "Wrong size on UChatCommunitySDK");
static_assert(offsetof(UChatCommunitySDK, OnConnectStatusChangeDelegate) == 0x000028, "Member 'UChatCommunitySDK::OnConnectStatusChangeDelegate' has a wrong offset!");
static_assert(offsetof(UChatCommunitySDK, OnRecvNewChannelMessageDelegate) == 0x000038, "Member 'UChatCommunitySDK::OnRecvNewChannelMessageDelegate' has a wrong offset!");
static_assert(offsetof(UChatCommunitySDK, OnRecvNewSingleMessageDelegate) == 0x000048, "Member 'UChatCommunitySDK::OnRecvNewSingleMessageDelegate' has a wrong offset!");
static_assert(offsetof(UChatCommunitySDK, OnRecvNewGroupMessageDelegate) == 0x000058, "Member 'UChatCommunitySDK::OnRecvNewGroupMessageDelegate' has a wrong offset!");
static_assert(offsetof(UChatCommunitySDK, OnRecvNewNotifyMessageDelegate) == 0x000068, "Member 'UChatCommunitySDK::OnRecvNewNotifyMessageDelegate' has a wrong offset!");
static_assert(offsetof(UChatCommunitySDK, OnRecvChannelEventDelegate) == 0x000078, "Member 'UChatCommunitySDK::OnRecvChannelEventDelegate' has a wrong offset!");
static_assert(offsetof(UChatCommunitySDK, OnRecvSessionEventDelegate) == 0x000088, "Member 'UChatCommunitySDK::OnRecvSessionEventDelegate' has a wrong offset!");
static_assert(offsetof(UChatCommunitySDK, OnRecvGroupEventDelegate) == 0x000098, "Member 'UChatCommunitySDK::OnRecvGroupEventDelegate' has a wrong offset!");
static_assert(offsetof(UChatCommunitySDK, OnRecvLoginEventDelegate) == 0x0000A8, "Member 'UChatCommunitySDK::OnRecvLoginEventDelegate' has a wrong offset!");

// Class ChatSDK.ChatSDKTextMessage
// 0x0010 (0x0038 - 0x0028)
class UChatSDKTextMessage final : public UObject
{
public:
	class FString                                 Text;                                              // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChatSDKTextMessage">();
	}
	static class UChatSDKTextMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatSDKTextMessage>();
	}
};
static_assert(alignof(UChatSDKTextMessage) == 0x000008, "Wrong alignment on UChatSDKTextMessage");
static_assert(sizeof(UChatSDKTextMessage) == 0x000038, "Wrong size on UChatSDKTextMessage");
static_assert(offsetof(UChatSDKTextMessage, Text) == 0x000028, "Member 'UChatSDKTextMessage::Text' has a wrong offset!");

// Class ChatSDK.ChatSDKEmojiMessage
// 0x0018 (0x0040 - 0x0028)
class UChatSDKEmojiMessage final : public UObject
{
public:
	TArray<uint8>                                 Data;                                              // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ByteSize;                                          // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class FString GetDataBase64Str();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChatSDKEmojiMessage">();
	}
	static class UChatSDKEmojiMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatSDKEmojiMessage>();
	}
};
static_assert(alignof(UChatSDKEmojiMessage) == 0x000008, "Wrong alignment on UChatSDKEmojiMessage");
static_assert(sizeof(UChatSDKEmojiMessage) == 0x000040, "Wrong size on UChatSDKEmojiMessage");
static_assert(offsetof(UChatSDKEmojiMessage, Data) == 0x000028, "Member 'UChatSDKEmojiMessage::Data' has a wrong offset!");
static_assert(offsetof(UChatSDKEmojiMessage, ByteSize) == 0x000038, "Member 'UChatSDKEmojiMessage::ByteSize' has a wrong offset!");
static_assert(offsetof(UChatSDKEmojiMessage, Index_0) == 0x00003C, "Member 'UChatSDKEmojiMessage::Index_0' has a wrong offset!");

// Class ChatSDK.ChatSDKImageMessage
// 0x0090 (0x00B8 - 0x0028)
class UChatSDKImageMessage final : public UObject
{
public:
	class FString                                 Path;                                              // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ThumbnailUUID;                                     // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ThumbnailFilename;                                 // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ThumbnailWidth;                                    // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ThumbnailHeight;                                   // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BigImgUUID;                                        // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BigImgFilename;                                    // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BigImgWidth;                                       // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BigImgHeight;                                      // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OriginalImgUUID;                                   // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OriginalImgFilename;                               // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OriginalImgWidth;                                  // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OriginalImgHeight;                                 // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OriginalByteSize;                                  // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChatSDKImageMessage">();
	}
	static class UChatSDKImageMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatSDKImageMessage>();
	}
};
static_assert(alignof(UChatSDKImageMessage) == 0x000008, "Wrong alignment on UChatSDKImageMessage");
static_assert(sizeof(UChatSDKImageMessage) == 0x0000B8, "Wrong size on UChatSDKImageMessage");
static_assert(offsetof(UChatSDKImageMessage, Path) == 0x000028, "Member 'UChatSDKImageMessage::Path' has a wrong offset!");
static_assert(offsetof(UChatSDKImageMessage, ThumbnailUUID) == 0x000038, "Member 'UChatSDKImageMessage::ThumbnailUUID' has a wrong offset!");
static_assert(offsetof(UChatSDKImageMessage, ThumbnailFilename) == 0x000048, "Member 'UChatSDKImageMessage::ThumbnailFilename' has a wrong offset!");
static_assert(offsetof(UChatSDKImageMessage, ThumbnailWidth) == 0x000058, "Member 'UChatSDKImageMessage::ThumbnailWidth' has a wrong offset!");
static_assert(offsetof(UChatSDKImageMessage, ThumbnailHeight) == 0x00005C, "Member 'UChatSDKImageMessage::ThumbnailHeight' has a wrong offset!");
static_assert(offsetof(UChatSDKImageMessage, BigImgUUID) == 0x000060, "Member 'UChatSDKImageMessage::BigImgUUID' has a wrong offset!");
static_assert(offsetof(UChatSDKImageMessage, BigImgFilename) == 0x000070, "Member 'UChatSDKImageMessage::BigImgFilename' has a wrong offset!");
static_assert(offsetof(UChatSDKImageMessage, BigImgWidth) == 0x000080, "Member 'UChatSDKImageMessage::BigImgWidth' has a wrong offset!");
static_assert(offsetof(UChatSDKImageMessage, BigImgHeight) == 0x000084, "Member 'UChatSDKImageMessage::BigImgHeight' has a wrong offset!");
static_assert(offsetof(UChatSDKImageMessage, OriginalImgUUID) == 0x000088, "Member 'UChatSDKImageMessage::OriginalImgUUID' has a wrong offset!");
static_assert(offsetof(UChatSDKImageMessage, OriginalImgFilename) == 0x000098, "Member 'UChatSDKImageMessage::OriginalImgFilename' has a wrong offset!");
static_assert(offsetof(UChatSDKImageMessage, OriginalImgWidth) == 0x0000A8, "Member 'UChatSDKImageMessage::OriginalImgWidth' has a wrong offset!");
static_assert(offsetof(UChatSDKImageMessage, OriginalImgHeight) == 0x0000AC, "Member 'UChatSDKImageMessage::OriginalImgHeight' has a wrong offset!");
static_assert(offsetof(UChatSDKImageMessage, OriginalByteSize) == 0x0000B0, "Member 'UChatSDKImageMessage::OriginalByteSize' has a wrong offset!");

// Class ChatSDK.ChatSDKAudioMessage
// 0x0070 (0x0098 - 0x0028)
class UChatSDKAudioMessage final : public UObject
{
public:
	int32                                         duration;                                          // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 Data;                                              // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 Path;                                              // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UUID;                                              // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Filename;                                          // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ByteSize;                                          // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AttachText;                                        // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Format;                                            // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class FString GetDataBase64Str();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChatSDKAudioMessage">();
	}
	static class UChatSDKAudioMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatSDKAudioMessage>();
	}
};
static_assert(alignof(UChatSDKAudioMessage) == 0x000008, "Wrong alignment on UChatSDKAudioMessage");
static_assert(sizeof(UChatSDKAudioMessage) == 0x000098, "Wrong size on UChatSDKAudioMessage");
static_assert(offsetof(UChatSDKAudioMessage, duration) == 0x000028, "Member 'UChatSDKAudioMessage::duration' has a wrong offset!");
static_assert(offsetof(UChatSDKAudioMessage, Data) == 0x000030, "Member 'UChatSDKAudioMessage::Data' has a wrong offset!");
static_assert(offsetof(UChatSDKAudioMessage, Path) == 0x000040, "Member 'UChatSDKAudioMessage::Path' has a wrong offset!");
static_assert(offsetof(UChatSDKAudioMessage, UUID) == 0x000050, "Member 'UChatSDKAudioMessage::UUID' has a wrong offset!");
static_assert(offsetof(UChatSDKAudioMessage, Filename) == 0x000060, "Member 'UChatSDKAudioMessage::Filename' has a wrong offset!");
static_assert(offsetof(UChatSDKAudioMessage, ByteSize) == 0x000070, "Member 'UChatSDKAudioMessage::ByteSize' has a wrong offset!");
static_assert(offsetof(UChatSDKAudioMessage, AttachText) == 0x000078, "Member 'UChatSDKAudioMessage::AttachText' has a wrong offset!");
static_assert(offsetof(UChatSDKAudioMessage, Format) == 0x000088, "Member 'UChatSDKAudioMessage::Format' has a wrong offset!");

// Class ChatSDK.ChatSDKVideoMessage
// 0x0090 (0x00B8 - 0x0028)
class UChatSDKVideoMessage final : public UObject
{
public:
	class FString                                 VideoPath;                                         // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SnapshotPath;                                      // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VideoUUID;                                         // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VideoFilename;                                     // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         VideoByteSize;                                     // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VideoType;                                         // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         duration;                                          // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SnapshotUUID;                                      // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SnapshotFilename;                                  // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SnapshotWidth;                                     // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SnapshotHeight;                                    // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         SnapshotByteSize;                                  // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChatSDKVideoMessage">();
	}
	static class UChatSDKVideoMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatSDKVideoMessage>();
	}
};
static_assert(alignof(UChatSDKVideoMessage) == 0x000008, "Wrong alignment on UChatSDKVideoMessage");
static_assert(sizeof(UChatSDKVideoMessage) == 0x0000B8, "Wrong size on UChatSDKVideoMessage");
static_assert(offsetof(UChatSDKVideoMessage, VideoPath) == 0x000028, "Member 'UChatSDKVideoMessage::VideoPath' has a wrong offset!");
static_assert(offsetof(UChatSDKVideoMessage, SnapshotPath) == 0x000038, "Member 'UChatSDKVideoMessage::SnapshotPath' has a wrong offset!");
static_assert(offsetof(UChatSDKVideoMessage, VideoUUID) == 0x000048, "Member 'UChatSDKVideoMessage::VideoUUID' has a wrong offset!");
static_assert(offsetof(UChatSDKVideoMessage, VideoFilename) == 0x000058, "Member 'UChatSDKVideoMessage::VideoFilename' has a wrong offset!");
static_assert(offsetof(UChatSDKVideoMessage, VideoByteSize) == 0x000068, "Member 'UChatSDKVideoMessage::VideoByteSize' has a wrong offset!");
static_assert(offsetof(UChatSDKVideoMessage, VideoType) == 0x000070, "Member 'UChatSDKVideoMessage::VideoType' has a wrong offset!");
static_assert(offsetof(UChatSDKVideoMessage, duration) == 0x000080, "Member 'UChatSDKVideoMessage::duration' has a wrong offset!");
static_assert(offsetof(UChatSDKVideoMessage, SnapshotUUID) == 0x000088, "Member 'UChatSDKVideoMessage::SnapshotUUID' has a wrong offset!");
static_assert(offsetof(UChatSDKVideoMessage, SnapshotFilename) == 0x000098, "Member 'UChatSDKVideoMessage::SnapshotFilename' has a wrong offset!");
static_assert(offsetof(UChatSDKVideoMessage, SnapshotWidth) == 0x0000A8, "Member 'UChatSDKVideoMessage::SnapshotWidth' has a wrong offset!");
static_assert(offsetof(UChatSDKVideoMessage, SnapshotHeight) == 0x0000AC, "Member 'UChatSDKVideoMessage::SnapshotHeight' has a wrong offset!");
static_assert(offsetof(UChatSDKVideoMessage, SnapshotByteSize) == 0x0000B0, "Member 'UChatSDKVideoMessage::SnapshotByteSize' has a wrong offset!");

// Class ChatSDK.ChatSDKFileMessage
// 0x0048 (0x0070 - 0x0028)
class UChatSDKFileMessage final : public UObject
{
public:
	class FString                                 Path;                                              // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UUID;                                              // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Filename;                                          // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ByteSize;                                          // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChatSDKFileMessage">();
	}
	static class UChatSDKFileMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatSDKFileMessage>();
	}
};
static_assert(alignof(UChatSDKFileMessage) == 0x000008, "Wrong alignment on UChatSDKFileMessage");
static_assert(sizeof(UChatSDKFileMessage) == 0x000070, "Wrong size on UChatSDKFileMessage");
static_assert(offsetof(UChatSDKFileMessage, Path) == 0x000028, "Member 'UChatSDKFileMessage::Path' has a wrong offset!");
static_assert(offsetof(UChatSDKFileMessage, Name_0) == 0x000038, "Member 'UChatSDKFileMessage::Name_0' has a wrong offset!");
static_assert(offsetof(UChatSDKFileMessage, UUID) == 0x000048, "Member 'UChatSDKFileMessage::UUID' has a wrong offset!");
static_assert(offsetof(UChatSDKFileMessage, Filename) == 0x000058, "Member 'UChatSDKFileMessage::Filename' has a wrong offset!");
static_assert(offsetof(UChatSDKFileMessage, ByteSize) == 0x000068, "Member 'UChatSDKFileMessage::ByteSize' has a wrong offset!");

// Class ChatSDK.ChatSDKLocationMessage
// 0x0030 (0x0058 - 0x0028)
class UChatSDKLocationMessage final : public UObject
{
public:
	class FString                                 Desc;                                              // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Longitude;                                         // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Latitude;                                          // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChatSDKLocationMessage">();
	}
	static class UChatSDKLocationMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatSDKLocationMessage>();
	}
};
static_assert(alignof(UChatSDKLocationMessage) == 0x000008, "Wrong alignment on UChatSDKLocationMessage");
static_assert(sizeof(UChatSDKLocationMessage) == 0x000058, "Wrong size on UChatSDKLocationMessage");
static_assert(offsetof(UChatSDKLocationMessage, Desc) == 0x000028, "Member 'UChatSDKLocationMessage::Desc' has a wrong offset!");
static_assert(offsetof(UChatSDKLocationMessage, Longitude) == 0x000038, "Member 'UChatSDKLocationMessage::Longitude' has a wrong offset!");
static_assert(offsetof(UChatSDKLocationMessage, Latitude) == 0x000048, "Member 'UChatSDKLocationMessage::Latitude' has a wrong offset!");

// Class ChatSDK.ChatSDKPassMessage
// 0x0018 (0x0040 - 0x0028)
class UChatSDKPassMessage final : public UObject
{
public:
	TArray<uint8>                                 Data;                                              // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int64                                         ByteSize;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class FString GetDataBase64Str();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChatSDKPassMessage">();
	}
	static class UChatSDKPassMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatSDKPassMessage>();
	}
};
static_assert(alignof(UChatSDKPassMessage) == 0x000008, "Wrong alignment on UChatSDKPassMessage");
static_assert(sizeof(UChatSDKPassMessage) == 0x000040, "Wrong size on UChatSDKPassMessage");
static_assert(offsetof(UChatSDKPassMessage, Data) == 0x000028, "Member 'UChatSDKPassMessage::Data' has a wrong offset!");
static_assert(offsetof(UChatSDKPassMessage, ByteSize) == 0x000038, "Member 'UChatSDKPassMessage::ByteSize' has a wrong offset!");

// Class ChatSDK.ChatSDKCustomMessage
// 0x0018 (0x0040 - 0x0028)
class UChatSDKCustomMessage final : public UObject
{
public:
	TArray<uint8>                                 Data;                                              // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int64                                         ByteSize;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class FString GetDataBase64Str();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChatSDKCustomMessage">();
	}
	static class UChatSDKCustomMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatSDKCustomMessage>();
	}
};
static_assert(alignof(UChatSDKCustomMessage) == 0x000008, "Wrong alignment on UChatSDKCustomMessage");
static_assert(sizeof(UChatSDKCustomMessage) == 0x000040, "Wrong size on UChatSDKCustomMessage");
static_assert(offsetof(UChatSDKCustomMessage, Data) == 0x000028, "Member 'UChatSDKCustomMessage::Data' has a wrong offset!");
static_assert(offsetof(UChatSDKCustomMessage, ByteSize) == 0x000038, "Member 'UChatSDKCustomMessage::ByteSize' has a wrong offset!");

// Class ChatSDK.ChatSDKHelper
// 0x0000 (0x0028 - 0x0028)
class UChatSDKHelper final : public UObject
{
public:
