#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChatSDK

#include "Basic.hpp"

#include "ChatSDK_structs.hpp"


namespace SDK::Params
{

// Function ChatSDK.ChatKefuSDK.DownloadResource
// 0x0038 (0x0038 - 0x0000)
struct ChatKefuSDK_DownloadResource final
{
public:
	class FString                                 UUID;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int64 Current, int64 Total)>   ProgressCallback;                                  // 0x0014(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, const class FString& Path, int32 Code, const class FString& Msg)> Callback; // 0x0024(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChatKefuSDK_DownloadResource) == 0x000008, "Wrong alignment on ChatKefuSDK_DownloadResource");
static_assert(sizeof(ChatKefuSDK_DownloadResource) == 0x000038, "Wrong size on ChatKefuSDK_DownloadResource");
static_assert(offsetof(ChatKefuSDK_DownloadResource, UUID) == 0x000000, "Member 'ChatKefuSDK_DownloadResource::UUID' has a wrong offset!");
static_assert(offsetof(ChatKefuSDK_DownloadResource, Type) == 0x000010, "Member 'ChatKefuSDK_DownloadResource::Type' has a wrong offset!");
static_assert(offsetof(ChatKefuSDK_DownloadResource, ProgressCallback) == 0x000014, "Member 'ChatKefuSDK_DownloadResource::ProgressCallback' has a wrong offset!");
static_assert(offsetof(ChatKefuSDK_DownloadResource, Callback) == 0x000024, "Member 'ChatKefuSDK_DownloadResource::Callback' has a wrong offset!");

// Function ChatSDK.ChatKefuSDK.FetchHistoryMessage
// 0x0028 (0x0028 - 0x0000)
struct ChatKefuSDK_FetchHistoryMessage final
{
public:
	class FString                                 FromMsgSeq;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, const TArray<struct FChatSDKMessage>& List, int32 Code, const class FString& Msg)> Callback; // 0x0014(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChatKefuSDK_FetchHistoryMessage) == 0x000008, "Wrong alignment on ChatKefuSDK_FetchHistoryMessage");
static_assert(sizeof(ChatKefuSDK_FetchHistoryMessage) == 0x000028, "Wrong size on ChatKefuSDK_FetchHistoryMessage");
static_assert(offsetof(ChatKefuSDK_FetchHistoryMessage, FromMsgSeq) == 0x000000, "Member 'ChatKefuSDK_FetchHistoryMessage::FromMsgSeq' has a wrong offset!");
static_assert(offsetof(ChatKefuSDK_FetchHistoryMessage, Count) == 0x000010, "Member 'ChatKefuSDK_FetchHistoryMessage::Count' has a wrong offset!");
static_assert(offsetof(ChatKefuSDK_FetchHistoryMessage, Callback) == 0x000014, "Member 'ChatKefuSDK_FetchHistoryMessage::Callback' has a wrong offset!");

// Function ChatSDK.ChatKefuSDK.GetKefuInfo
// 0x0068 (0x0068 - 0x0000)
struct ChatKefuSDK_GetKefuInfo final
{
public:
	struct FKefuInfo                              ReturnValue;                                       // 0x0000(0x0068)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatKefuSDK_GetKefuInfo) == 0x000001, "Wrong alignment on ChatKefuSDK_GetKefuInfo");
static_assert(sizeof(ChatKefuSDK_GetKefuInfo) == 0x000068, "Wrong size on ChatKefuSDK_GetKefuInfo");
static_assert(offsetof(ChatKefuSDK_GetKefuInfo, ReturnValue) == 0x000000, "Member 'ChatKefuSDK_GetKefuInfo::ReturnValue' has a wrong offset!");

// Function ChatSDK.ChatKefuSDK.Init
// 0x0010 (0x0010 - 0x0000)
struct ChatKefuSDK_Init final
{
public:
	TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback;                  // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatKefuSDK_Init) == 0x000004, "Wrong alignment on ChatKefuSDK_Init");
static_assert(sizeof(ChatKefuSDK_Init) == 0x000010, "Wrong size on ChatKefuSDK_Init");
static_assert(offsetof(ChatKefuSDK_Init, Callback) == 0x000000, "Member 'ChatKefuSDK_Init::Callback' has a wrong offset!");

// Function ChatSDK.ChatKefuSDK.Login
// 0x0080 (0x0080 - 0x0000)
struct ChatKefuSDK_Login final
{
public:
	struct FLoginUserInfo                         Info;                                              // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, const struct FKefuInfo& KefuInfo, int32 Code, const class FString& Desc)> Callback; // 0x0070(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatKefuSDK_Login) == 0x000004, "Wrong alignment on ChatKefuSDK_Login");
static_assert(sizeof(ChatKefuSDK_Login) == 0x000080, "Wrong size on ChatKefuSDK_Login");
static_assert(offsetof(ChatKefuSDK_Login, Info) == 0x000000, "Member 'ChatKefuSDK_Login::Info' has a wrong offset!");
static_assert(offsetof(ChatKefuSDK_Login, Callback) == 0x000070, "Member 'ChatKefuSDK_Login::Callback' has a wrong offset!");

// Function ChatSDK.ChatKefuSDK.Logout
// 0x0010 (0x0010 - 0x0000)
struct ChatKefuSDK_Logout final
{
public:
	TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback;                  // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatKefuSDK_Logout) == 0x000004, "Wrong alignment on ChatKefuSDK_Logout");
static_assert(sizeof(ChatKefuSDK_Logout) == 0x000010, "Wrong size on ChatKefuSDK_Logout");
static_assert(offsetof(ChatKefuSDK_Logout, Callback) == 0x000000, "Member 'ChatKefuSDK_Logout::Callback' has a wrong offset!");

// Function ChatSDK.ChatKefuSDK.ResendMessage
// 0x0068 (0x0068 - 0x0000)
struct ChatKefuSDK_ResendMessage final
{
public:
	class FString                                 ClientMsgId;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc, const class FString& ClientMsgId, int64 MsgId)> Callback; // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSendMsgResult                         ReturnValue;                                       // 0x0020(0x0048)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatKefuSDK_ResendMessage) == 0x000008, "Wrong alignment on ChatKefuSDK_ResendMessage");
static_assert(sizeof(ChatKefuSDK_ResendMessage) == 0x000068, "Wrong size on ChatKefuSDK_ResendMessage");
static_assert(offsetof(ChatKefuSDK_ResendMessage, ClientMsgId) == 0x000000, "Member 'ChatKefuSDK_ResendMessage::ClientMsgId' has a wrong offset!");
static_assert(offsetof(ChatKefuSDK_ResendMessage, Callback) == 0x000010, "Member 'ChatKefuSDK_ResendMessage::Callback' has a wrong offset!");
static_assert(offsetof(ChatKefuSDK_ResendMessage, ReturnValue) == 0x000020, "Member 'ChatKefuSDK_ResendMessage::ReturnValue' has a wrong offset!");

// Function ChatSDK.ChatKefuSDK.SelectImageFromAlbum
// 0x0010 (0x0010 - 0x0000)
struct ChatKefuSDK_SelectImageFromAlbum final
{
public:
	TDelegate<void(const class FString& ImagePath)> Callback;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatKefuSDK_SelectImageFromAlbum) == 0x000004, "Wrong alignment on ChatKefuSDK_SelectImageFromAlbum");
static_assert(sizeof(ChatKefuSDK_SelectImageFromAlbum) == 0x000010, "Wrong size on ChatKefuSDK_SelectImageFromAlbum");
static_assert(offsetof(ChatKefuSDK_SelectImageFromAlbum, Callback) == 0x000000, "Member 'ChatKefuSDK_SelectImageFromAlbum::Callback' has a wrong offset!");

// Function ChatSDK.ChatKefuSDK.SendMessage
// 0x0198 (0x0198 - 0x0000)
struct ChatKefuSDK_SendMessage final
{
public:
	struct FChatSDKMessage                        Message;                                           // 0x0000(0x0130)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Ext;                                               // 0x0130(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc, const class FString& ClientMsgId, int64 MsgId)> Callback; // 0x0140(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSendMsgResult                         ReturnValue;                                       // 0x0150(0x0048)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatKefuSDK_SendMessage) == 0x000008, "Wrong alignment on ChatKefuSDK_SendMessage");
static_assert(sizeof(ChatKefuSDK_SendMessage) == 0x000198, "Wrong size on ChatKefuSDK_SendMessage");
static_assert(offsetof(ChatKefuSDK_SendMessage, Message) == 0x000000, "Member 'ChatKefuSDK_SendMessage::Message' has a wrong offset!");
static_assert(offsetof(ChatKefuSDK_SendMessage, Ext) == 0x000130, "Member 'ChatKefuSDK_SendMessage::Ext' has a wrong offset!");
static_assert(offsetof(ChatKefuSDK_SendMessage, Callback) == 0x000140, "Member 'ChatKefuSDK_SendMessage::Callback' has a wrong offset!");
static_assert(offsetof(ChatKefuSDK_SendMessage, ReturnValue) == 0x000150, "Member 'ChatKefuSDK_SendMessage::ReturnValue' has a wrong offset!");

// Function ChatSDK.ChatKefuSDK.SetDeBugMode
// 0x0001 (0x0001 - 0x0000)
struct ChatKefuSDK_SetDeBugMode final
{
public:
	bool                                          flag;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatKefuSDK_SetDeBugMode) == 0x000001, "Wrong alignment on ChatKefuSDK_SetDeBugMode");
static_assert(sizeof(ChatKefuSDK_SetDeBugMode) == 0x000001, "Wrong size on ChatKefuSDK_SetDeBugMode");
static_assert(offsetof(ChatKefuSDK_SetDeBugMode, flag) == 0x000000, "Member 'ChatKefuSDK_SetDeBugMode::flag' has a wrong offset!");

// Function ChatSDK.ChatKefuSDK.SetSupportMessageTypes
// 0x0010 (0x0010 - 0x0000)
struct ChatKefuSDK_SetSupportMessageTypes final
{
public:
	TArray<EChatSDKMessageType>                   Types;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatKefuSDK_SetSupportMessageTypes) == 0x000008, "Wrong alignment on ChatKefuSDK_SetSupportMessageTypes");
static_assert(sizeof(ChatKefuSDK_SetSupportMessageTypes) == 0x000010, "Wrong size on ChatKefuSDK_SetSupportMessageTypes");
static_assert(offsetof(ChatKefuSDK_SetSupportMessageTypes, Types) == 0x000000, "Member 'ChatKefuSDK_SetSupportMessageTypes::Types' has a wrong offset!");

// Function ChatSDK.ChatKefuSDK.StartChat
// 0x0010 (0x0010 - 0x0000)
struct ChatKefuSDK_StartChat final
{
public:
	TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback;                  // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatKefuSDK_StartChat) == 0x000004, "Wrong alignment on ChatKefuSDK_StartChat");
static_assert(sizeof(ChatKefuSDK_StartChat) == 0x000010, "Wrong size on ChatKefuSDK_StartChat");
static_assert(offsetof(ChatKefuSDK_StartChat, Callback) == 0x000000, "Member 'ChatKefuSDK_StartChat::Callback' has a wrong offset!");

// Function ChatSDK.WMChatSDKSubsystem.GetCommunitySDK
// 0x0008 (0x0008 - 0x0000)
struct WMChatSDKSubsystem_GetCommunitySDK final
{
public:
	class UChatCommunitySDK*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WMChatSDKSubsystem_GetCommunitySDK) == 0x000008, "Wrong alignment on WMChatSDKSubsystem_GetCommunitySDK");
static_assert(sizeof(WMChatSDKSubsystem_GetCommunitySDK) == 0x000008, "Wrong size on WMChatSDKSubsystem_GetCommunitySDK");
static_assert(offsetof(WMChatSDKSubsystem_GetCommunitySDK, ReturnValue) == 0x000000, "Member 'WMChatSDKSubsystem_GetCommunitySDK::ReturnValue' has a wrong offset!");

// Function ChatSDK.WMChatSDKSubsystem.GetKefuSDK
// 0x0008 (0x0008 - 0x0000)
struct WMChatSDKSubsystem_GetKefuSDK final
{
public:
	class UChatKefuSDK*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WMChatSDKSubsystem_GetKefuSDK) == 0x000008, "Wrong alignment on WMChatSDKSubsystem_GetKefuSDK");
static_assert(sizeof(WMChatSDKSubsystem_GetKefuSDK) == 0x000008, "Wrong size on WMChatSDKSubsystem_GetKefuSDK");
static_assert(offsetof(WMChatSDKSubsystem_GetKefuSDK, ReturnValue) == 0x000000, "Member 'WMChatSDKSubsystem_GetKefuSDK::ReturnValue' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.ChangeGroupName
// 0x0030 (0x0030 - 0x0000)
struct ChatCommunitySDK_ChangeGroupName final
{
public:
	class FString                                 GroupId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewGroupName;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback;                  // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatCommunitySDK_ChangeGroupName) == 0x000008, "Wrong alignment on ChatCommunitySDK_ChangeGroupName");
static_assert(sizeof(ChatCommunitySDK_ChangeGroupName) == 0x000030, "Wrong size on ChatCommunitySDK_ChangeGroupName");
static_assert(offsetof(ChatCommunitySDK_ChangeGroupName, GroupId) == 0x000000, "Member 'ChatCommunitySDK_ChangeGroupName::GroupId' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_ChangeGroupName, NewGroupName) == 0x000010, "Member 'ChatCommunitySDK_ChangeGroupName::NewGroupName' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_ChangeGroupName, Callback) == 0x000020, "Member 'ChatCommunitySDK_ChangeGroupName::Callback' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.ChangeGroupOwner
// 0x0030 (0x0030 - 0x0000)
struct ChatCommunitySDK_ChangeGroupOwner final
{
public:
	class FString                                 GroupId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NewOwnerRoleId;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback;                  // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatCommunitySDK_ChangeGroupOwner) == 0x000008, "Wrong alignment on ChatCommunitySDK_ChangeGroupOwner");
static_assert(sizeof(ChatCommunitySDK_ChangeGroupOwner) == 0x000030, "Wrong size on ChatCommunitySDK_ChangeGroupOwner");
static_assert(offsetof(ChatCommunitySDK_ChangeGroupOwner, GroupId) == 0x000000, "Member 'ChatCommunitySDK_ChangeGroupOwner::GroupId' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_ChangeGroupOwner, NewOwnerRoleId) == 0x000010, "Member 'ChatCommunitySDK_ChangeGroupOwner::NewOwnerRoleId' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_ChangeGroupOwner, Callback) == 0x000020, "Member 'ChatCommunitySDK_ChangeGroupOwner::Callback' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.ClearLocalSessionMessage
// 0x0028 (0x0028 - 0x0000)
struct ChatCommunitySDK_ClearLocalSessionMessage final
{
public:
	int32                                         Type;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 To;                                                // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback;                  // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatCommunitySDK_ClearLocalSessionMessage) == 0x000008, "Wrong alignment on ChatCommunitySDK_ClearLocalSessionMessage");
static_assert(sizeof(ChatCommunitySDK_ClearLocalSessionMessage) == 0x000028, "Wrong size on ChatCommunitySDK_ClearLocalSessionMessage");
static_assert(offsetof(ChatCommunitySDK_ClearLocalSessionMessage, Type) == 0x000000, "Member 'ChatCommunitySDK_ClearLocalSessionMessage::Type' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_ClearLocalSessionMessage, To) == 0x000008, "Member 'ChatCommunitySDK_ClearLocalSessionMessage::To' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_ClearLocalSessionMessage, Callback) == 0x000018, "Member 'ChatCommunitySDK_ClearLocalSessionMessage::Callback' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.CreateChannelEmojiMessage
// 0x0130 (0x0130 - 0x0000)
struct ChatCommunitySDK_CreateChannelEmojiMessage final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 Data;                                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ByteSize;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChatSDKChannelMessage                 ReturnValue;                                       // 0x0020(0x0110)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatCommunitySDK_CreateChannelEmojiMessage) == 0x000008, "Wrong alignment on ChatCommunitySDK_CreateChannelEmojiMessage");
static_assert(sizeof(ChatCommunitySDK_CreateChannelEmojiMessage) == 0x000130, "Wrong size on ChatCommunitySDK_CreateChannelEmojiMessage");
static_assert(offsetof(ChatCommunitySDK_CreateChannelEmojiMessage, Index_0) == 0x000000, "Member 'ChatCommunitySDK_CreateChannelEmojiMessage::Index_0' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_CreateChannelEmojiMessage, Data) == 0x000008, "Member 'ChatCommunitySDK_CreateChannelEmojiMessage::Data' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_CreateChannelEmojiMessage, ByteSize) == 0x000018, "Member 'ChatCommunitySDK_CreateChannelEmojiMessage::ByteSize' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_CreateChannelEmojiMessage, ReturnValue) == 0x000020, "Member 'ChatCommunitySDK_CreateChannelEmojiMessage::ReturnValue' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.CreateChannelImageMessage
// 0x0120 (0x0120 - 0x0000)
struct ChatCommunitySDK_CreateChannelImageMessage final
{
public:
	class FString                                 FilePath;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChatSDKChannelMessage                 ReturnValue;                                       // 0x0010(0x0110)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatCommunitySDK_CreateChannelImageMessage) == 0x000008, "Wrong alignment on ChatCommunitySDK_CreateChannelImageMessage");
static_assert(sizeof(ChatCommunitySDK_CreateChannelImageMessage) == 0x000120, "Wrong size on ChatCommunitySDK_CreateChannelImageMessage");
static_assert(offsetof(ChatCommunitySDK_CreateChannelImageMessage, FilePath) == 0x000000, "Member 'ChatCommunitySDK_CreateChannelImageMessage::FilePath' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_CreateChannelImageMessage, ReturnValue) == 0x000010, "Member 'ChatCommunitySDK_CreateChannelImageMessage::ReturnValue' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.CreateChannelTextMessage
// 0x0120 (0x0120 - 0x0000)
struct ChatCommunitySDK_CreateChannelTextMessage final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChatSDKChannelMessage                 ReturnValue;                                       // 0x0010(0x0110)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatCommunitySDK_CreateChannelTextMessage) == 0x000008, "Wrong alignment on ChatCommunitySDK_CreateChannelTextMessage");
static_assert(sizeof(ChatCommunitySDK_CreateChannelTextMessage) == 0x000120, "Wrong size on ChatCommunitySDK_CreateChannelTextMessage");
static_assert(offsetof(ChatCommunitySDK_CreateChannelTextMessage, Text) == 0x000000, "Member 'ChatCommunitySDK_CreateChannelTextMessage::Text' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_CreateChannelTextMessage, ReturnValue) == 0x000010, "Member 'ChatCommunitySDK_CreateChannelTextMessage::ReturnValue' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.DeleteSession
// 0x0030 (0x0030 - 0x0000)
struct ChatCommunitySDK_DeleteSession final
{
public:
	int32                                         Type;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 To;                                                // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          QueryCloud;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DeleteCloudMessage;                                // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback;                  // 0x001C(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChatCommunitySDK_DeleteSession) == 0x000008, "Wrong alignment on ChatCommunitySDK_DeleteSession");
static_assert(sizeof(ChatCommunitySDK_DeleteSession) == 0x000030, "Wrong size on ChatCommunitySDK_DeleteSession");
static_assert(offsetof(ChatCommunitySDK_DeleteSession, Type) == 0x000000, "Member 'ChatCommunitySDK_DeleteSession::Type' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_DeleteSession, To) == 0x000008, "Member 'ChatCommunitySDK_DeleteSession::To' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_DeleteSession, QueryCloud) == 0x000018, "Member 'ChatCommunitySDK_DeleteSession::QueryCloud' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_DeleteSession, DeleteCloudMessage) == 0x000019, "Member 'ChatCommunitySDK_DeleteSession::DeleteCloudMessage' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_DeleteSession, Callback) == 0x00001C, "Member 'ChatCommunitySDK_DeleteSession::Callback' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.DismissGroup
// 0x0020 (0x0020 - 0x0000)
struct ChatCommunitySDK_DismissGroup final
{
public:
	class FString                                 GroupId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback;                  // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatCommunitySDK_DismissGroup) == 0x000008, "Wrong alignment on ChatCommunitySDK_DismissGroup");
static_assert(sizeof(ChatCommunitySDK_DismissGroup) == 0x000020, "Wrong size on ChatCommunitySDK_DismissGroup");
static_assert(offsetof(ChatCommunitySDK_DismissGroup, GroupId) == 0x000000, "Member 'ChatCommunitySDK_DismissGroup::GroupId' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_DismissGroup, Callback) == 0x000010, "Member 'ChatCommunitySDK_DismissGroup::Callback' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.DownloadChannelRes
// 0x0048 (0x0048 - 0x0000)
struct ChatCommunitySDK_DownloadChannelRes final
{
public:
	class FString                                 Cid;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UUID;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ResType;                                           // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int64 TotalSize, int64 CurrentSize)> ProgressDelegate;                            // 0x0024(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, const class FString& Path, int32 Code, const class FString& Desc)> DownloadDelegate; // 0x0034(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChatCommunitySDK_DownloadChannelRes) == 0x000008, "Wrong alignment on ChatCommunitySDK_DownloadChannelRes");
static_assert(sizeof(ChatCommunitySDK_DownloadChannelRes) == 0x000048, "Wrong size on ChatCommunitySDK_DownloadChannelRes");
static_assert(offsetof(ChatCommunitySDK_DownloadChannelRes, Cid) == 0x000000, "Member 'ChatCommunitySDK_DownloadChannelRes::Cid' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_DownloadChannelRes, UUID) == 0x000010, "Member 'ChatCommunitySDK_DownloadChannelRes::UUID' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_DownloadChannelRes, ResType) == 0x000020, "Member 'ChatCommunitySDK_DownloadChannelRes::ResType' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_DownloadChannelRes, ProgressDelegate) == 0x000024, "Member 'ChatCommunitySDK_DownloadChannelRes::ProgressDelegate' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_DownloadChannelRes, DownloadDelegate) == 0x000034, "Member 'ChatCommunitySDK_DownloadChannelRes::DownloadDelegate' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.DownloadRes
// 0x0048 (0x0048 - 0x0000)
struct ChatCommunitySDK_DownloadRes final
{
public:
	class FString                                 To;                                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UUID;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChatType;                                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ResType;                                           // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int64 TotalSize, int64 CurrentSize)> ProgressDelegate;                            // 0x0028(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, const class FString& Path, int32 Code, const class FString& Desc)> DownloadDelegate; // 0x0038(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatCommunitySDK_DownloadRes) == 0x000008, "Wrong alignment on ChatCommunitySDK_DownloadRes");
static_assert(sizeof(ChatCommunitySDK_DownloadRes) == 0x000048, "Wrong size on ChatCommunitySDK_DownloadRes");
static_assert(offsetof(ChatCommunitySDK_DownloadRes, To) == 0x000000, "Member 'ChatCommunitySDK_DownloadRes::To' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_DownloadRes, UUID) == 0x000010, "Member 'ChatCommunitySDK_DownloadRes::UUID' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_DownloadRes, ChatType) == 0x000020, "Member 'ChatCommunitySDK_DownloadRes::ChatType' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_DownloadRes, ResType) == 0x000024, "Member 'ChatCommunitySDK_DownloadRes::ResType' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_DownloadRes, ProgressDelegate) == 0x000028, "Member 'ChatCommunitySDK_DownloadRes::ProgressDelegate' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_DownloadRes, DownloadDelegate) == 0x000038, "Member 'ChatCommunitySDK_DownloadRes::DownloadDelegate' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.EnableDebug
// 0x0001 (0x0001 - 0x0000)
struct ChatCommunitySDK_EnableDebug final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatCommunitySDK_EnableDebug) == 0x000001, "Wrong alignment on ChatCommunitySDK_EnableDebug");
static_assert(sizeof(ChatCommunitySDK_EnableDebug) == 0x000001, "Wrong size on ChatCommunitySDK_EnableDebug");
static_assert(offsetof(ChatCommunitySDK_EnableDebug, Enable) == 0x000000, "Member 'ChatCommunitySDK_EnableDebug::Enable' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.ExitGroup
// 0x0038 (0x0038 - 0x0000)
struct ChatCommunitySDK_ExitGroup final
{
public:
	class FString                                 GroupId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         RoleIds;                                           // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bIsKicked;                                         // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bSucceed, int32 Code, const class FString& Desc)> Callback;                  // 0x0024(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChatCommunitySDK_ExitGroup) == 0x000008, "Wrong alignment on ChatCommunitySDK_ExitGroup");
static_assert(sizeof(ChatCommunitySDK_ExitGroup) == 0x000038, "Wrong size on ChatCommunitySDK_ExitGroup");
static_assert(offsetof(ChatCommunitySDK_ExitGroup, GroupId) == 0x000000, "Member 'ChatCommunitySDK_ExitGroup::GroupId' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_ExitGroup, RoleIds) == 0x000010, "Member 'ChatCommunitySDK_ExitGroup::RoleIds' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_ExitGroup, bIsKicked) == 0x000020, "Member 'ChatCommunitySDK_ExitGroup::bIsKicked' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_ExitGroup, Callback) == 0x000024, "Member 'ChatCommunitySDK_ExitGroup::Callback' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.GetChannelMemberList
// 0x0030 (0x0030 - 0x0000)
struct ChatCommunitySDK_GetChannelMemberList final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Cid;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FromCursor;                                        // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, const TArray<struct FChatChannelMember>& MemberList, bool bHasMore, int64 NextFromId, int32 Code, const class FString& Desc)> Callback; // 0x001C(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChatCommunitySDK_GetChannelMemberList) == 0x000008, "Wrong alignment on ChatCommunitySDK_GetChannelMemberList");
static_assert(sizeof(ChatCommunitySDK_GetChannelMemberList) == 0x000030, "Wrong size on ChatCommunitySDK_GetChannelMemberList");
static_assert(offsetof(ChatCommunitySDK_GetChannelMemberList, Count) == 0x000000, "Member 'ChatCommunitySDK_GetChannelMemberList::Count' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetChannelMemberList, Cid) == 0x000008, "Member 'ChatCommunitySDK_GetChannelMemberList::Cid' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetChannelMemberList, FromCursor) == 0x000018, "Member 'ChatCommunitySDK_GetChannelMemberList::FromCursor' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetChannelMemberList, Callback) == 0x00001C, "Member 'ChatCommunitySDK_GetChannelMemberList::Callback' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.GetGroupMemberList
// 0x0030 (0x0030 - 0x0000)
struct ChatCommunitySDK_GetGroupMemberList final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GId;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FromId;                                            // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChatGroupMemberFilter                        Filter;                                            // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bSucceed, const TArray<struct FChatGroupMember>& MemberList, bool bHasMore, int64 NextFromId, int32 Code, const class FString& Desc)> Callback; // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatCommunitySDK_GetGroupMemberList) == 0x000008, "Wrong alignment on ChatCommunitySDK_GetGroupMemberList");
static_assert(sizeof(ChatCommunitySDK_GetGroupMemberList) == 0x000030, "Wrong size on ChatCommunitySDK_GetGroupMemberList");
static_assert(offsetof(ChatCommunitySDK_GetGroupMemberList, Count) == 0x000000, "Member 'ChatCommunitySDK_GetGroupMemberList::Count' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetGroupMemberList, GId) == 0x000008, "Member 'ChatCommunitySDK_GetGroupMemberList::GId' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetGroupMemberList, FromId) == 0x000018, "Member 'ChatCommunitySDK_GetGroupMemberList::FromId' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetGroupMemberList, Filter) == 0x00001C, "Member 'ChatCommunitySDK_GetGroupMemberList::Filter' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetGroupMemberList, Callback) == 0x000020, "Member 'ChatCommunitySDK_GetGroupMemberList::Callback' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.GetHistoryChannelMessageList
// 0x0028 (0x0028 - 0x0000)
struct ChatCommunitySDK_GetHistoryChannelMessageList final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Cid;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, const TArray<struct FChatSDKChannelMessage>& MsgList, int32 Code, const class FString& Desc)> Callback; // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatCommunitySDK_GetHistoryChannelMessageList) == 0x000008, "Wrong alignment on ChatCommunitySDK_GetHistoryChannelMessageList");
static_assert(sizeof(ChatCommunitySDK_GetHistoryChannelMessageList) == 0x000028, "Wrong size on ChatCommunitySDK_GetHistoryChannelMessageList");
static_assert(offsetof(ChatCommunitySDK_GetHistoryChannelMessageList, Count) == 0x000000, "Member 'ChatCommunitySDK_GetHistoryChannelMessageList::Count' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetHistoryChannelMessageList, Cid) == 0x000008, "Member 'ChatCommunitySDK_GetHistoryChannelMessageList::Cid' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetHistoryChannelMessageList, Callback) == 0x000018, "Member 'ChatCommunitySDK_GetHistoryChannelMessageList::Callback' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.GetHistoryChannelMessageListWithExcludeMessageTypeList
// 0x0038 (0x0038 - 0x0000)
struct ChatCommunitySDK_GetHistoryChannelMessageListWithExcludeMessageTypeList final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Cid;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EChatSDKMessageType>                   MessageTypes;                                      // 0x0018(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, const TArray<struct FChatSDKChannelMessage>& MsgList, int32 Code, const class FString& Desc)> Callback; // 0x0028(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatCommunitySDK_GetHistoryChannelMessageListWithExcludeMessageTypeList) == 0x000008, "Wrong alignment on ChatCommunitySDK_GetHistoryChannelMessageListWithExcludeMessageTypeList");
static_assert(sizeof(ChatCommunitySDK_GetHistoryChannelMessageListWithExcludeMessageTypeList) == 0x000038, "Wrong size on ChatCommunitySDK_GetHistoryChannelMessageListWithExcludeMessageTypeList");
static_assert(offsetof(ChatCommunitySDK_GetHistoryChannelMessageListWithExcludeMessageTypeList, Count) == 0x000000, "Member 'ChatCommunitySDK_GetHistoryChannelMessageListWithExcludeMessageTypeList::Count' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetHistoryChannelMessageListWithExcludeMessageTypeList, Cid) == 0x000008, "Member 'ChatCommunitySDK_GetHistoryChannelMessageListWithExcludeMessageTypeList::Cid' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetHistoryChannelMessageListWithExcludeMessageTypeList, MessageTypes) == 0x000018, "Member 'ChatCommunitySDK_GetHistoryChannelMessageListWithExcludeMessageTypeList::MessageTypes' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetHistoryChannelMessageListWithExcludeMessageTypeList, Callback) == 0x000028, "Member 'ChatCommunitySDK_GetHistoryChannelMessageListWithExcludeMessageTypeList::Callback' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.GetHistoryGroupMessageList
// 0x0028 (0x0028 - 0x0000)
struct ChatCommunitySDK_GetHistoryGroupMessageList final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GId;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, const TArray<struct FChatSDKMessage>& MsgList, int32 Code, const class FString& Desc)> Callback; // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatCommunitySDK_GetHistoryGroupMessageList) == 0x000008, "Wrong alignment on ChatCommunitySDK_GetHistoryGroupMessageList");
static_assert(sizeof(ChatCommunitySDK_GetHistoryGroupMessageList) == 0x000028, "Wrong size on ChatCommunitySDK_GetHistoryGroupMessageList");
static_assert(offsetof(ChatCommunitySDK_GetHistoryGroupMessageList, Count) == 0x000000, "Member 'ChatCommunitySDK_GetHistoryGroupMessageList::Count' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetHistoryGroupMessageList, GId) == 0x000008, "Member 'ChatCommunitySDK_GetHistoryGroupMessageList::GId' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetHistoryGroupMessageList, Callback) == 0x000018, "Member 'ChatCommunitySDK_GetHistoryGroupMessageList::Callback' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.GetHistorySingleMessageList
// 0x0028 (0x0028 - 0x0000)
struct ChatCommunitySDK_GetHistorySingleMessageList final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 To;                                                // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, const TArray<struct FChatSDKMessage>& MsgList, int32 Code, const class FString& Desc)> Callback; // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatCommunitySDK_GetHistorySingleMessageList) == 0x000008, "Wrong alignment on ChatCommunitySDK_GetHistorySingleMessageList");
static_assert(sizeof(ChatCommunitySDK_GetHistorySingleMessageList) == 0x000028, "Wrong size on ChatCommunitySDK_GetHistorySingleMessageList");
static_assert(offsetof(ChatCommunitySDK_GetHistorySingleMessageList, Count) == 0x000000, "Member 'ChatCommunitySDK_GetHistorySingleMessageList::Count' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetHistorySingleMessageList, To) == 0x000008, "Member 'ChatCommunitySDK_GetHistorySingleMessageList::To' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetHistorySingleMessageList, Callback) == 0x000018, "Member 'ChatCommunitySDK_GetHistorySingleMessageList::Callback' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.GetJoinedChannelList
// 0x0018 (0x0018 - 0x0000)
struct ChatCommunitySDK_GetJoinedChannelList final
{
public:
	int32                                         Page;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PageSize;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, const TArray<struct FChatChannelInfo>& ChannelList, int32 Code, const class FString& Desc)> Callback; // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatCommunitySDK_GetJoinedChannelList) == 0x000004, "Wrong alignment on ChatCommunitySDK_GetJoinedChannelList");
static_assert(sizeof(ChatCommunitySDK_GetJoinedChannelList) == 0x000018, "Wrong size on ChatCommunitySDK_GetJoinedChannelList");
static_assert(offsetof(ChatCommunitySDK_GetJoinedChannelList, Page) == 0x000000, "Member 'ChatCommunitySDK_GetJoinedChannelList::Page' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetJoinedChannelList, PageSize) == 0x000004, "Member 'ChatCommunitySDK_GetJoinedChannelList::PageSize' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetJoinedChannelList, Callback) == 0x000008, "Member 'ChatCommunitySDK_GetJoinedChannelList::Callback' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.GetJoinedGroupList
// 0x0018 (0x0018 - 0x0000)
struct ChatCommunitySDK_GetJoinedGroupList final
{
public:
	int32                                         Page;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PageSize;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, const TArray<struct FChatGroupInfo>& GroupList, int32 Code, const class FString& Desc)> Callback; // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatCommunitySDK_GetJoinedGroupList) == 0x000004, "Wrong alignment on ChatCommunitySDK_GetJoinedGroupList");
static_assert(sizeof(ChatCommunitySDK_GetJoinedGroupList) == 0x000018, "Wrong size on ChatCommunitySDK_GetJoinedGroupList");
static_assert(offsetof(ChatCommunitySDK_GetJoinedGroupList, Page) == 0x000000, "Member 'ChatCommunitySDK_GetJoinedGroupList::Page' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetJoinedGroupList, PageSize) == 0x000004, "Member 'ChatCommunitySDK_GetJoinedGroupList::PageSize' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetJoinedGroupList, Callback) == 0x000008, "Member 'ChatCommunitySDK_GetJoinedGroupList::Callback' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.GetLocalChannelMessageList
// 0x0038 (0x0038 - 0x0000)
struct ChatCommunitySDK_GetLocalChannelMessageList final
{
public:
	class FString                                 FromMsgSeq;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Cid;                                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, const TArray<struct FChatSDKChannelMessage>& MsgList, int32 Code, const class FString& Desc)> Callback; // 0x0028(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatCommunitySDK_GetLocalChannelMessageList) == 0x000008, "Wrong alignment on ChatCommunitySDK_GetLocalChannelMessageList");
static_assert(sizeof(ChatCommunitySDK_GetLocalChannelMessageList) == 0x000038, "Wrong size on ChatCommunitySDK_GetLocalChannelMessageList");
static_assert(offsetof(ChatCommunitySDK_GetLocalChannelMessageList, FromMsgSeq) == 0x000000, "Member 'ChatCommunitySDK_GetLocalChannelMessageList::FromMsgSeq' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetLocalChannelMessageList, Count) == 0x000010, "Member 'ChatCommunitySDK_GetLocalChannelMessageList::Count' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetLocalChannelMessageList, Cid) == 0x000018, "Member 'ChatCommunitySDK_GetLocalChannelMessageList::Cid' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetLocalChannelMessageList, Callback) == 0x000028, "Member 'ChatCommunitySDK_GetLocalChannelMessageList::Callback' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.GetLocalChannelMessageListWithExcludeMessageTypeList
// 0x0048 (0x0048 - 0x0000)
struct ChatCommunitySDK_GetLocalChannelMessageListWithExcludeMessageTypeList final
{
public:
	class FString                                 FromMsgSeq;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Cid;                                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EChatSDKMessageType>                   MessageTypes;                                      // 0x0028(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, const TArray<struct FChatSDKChannelMessage>& MsgList, int32 Code, const class FString& Desc)> Callback; // 0x0038(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatCommunitySDK_GetLocalChannelMessageListWithExcludeMessageTypeList) == 0x000008, "Wrong alignment on ChatCommunitySDK_GetLocalChannelMessageListWithExcludeMessageTypeList");
static_assert(sizeof(ChatCommunitySDK_GetLocalChannelMessageListWithExcludeMessageTypeList) == 0x000048, "Wrong size on ChatCommunitySDK_GetLocalChannelMessageListWithExcludeMessageTypeList");
static_assert(offsetof(ChatCommunitySDK_GetLocalChannelMessageListWithExcludeMessageTypeList, FromMsgSeq) == 0x000000, "Member 'ChatCommunitySDK_GetLocalChannelMessageListWithExcludeMessageTypeList::FromMsgSeq' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetLocalChannelMessageListWithExcludeMessageTypeList, Count) == 0x000010, "Member 'ChatCommunitySDK_GetLocalChannelMessageListWithExcludeMessageTypeList::Count' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetLocalChannelMessageListWithExcludeMessageTypeList, Cid) == 0x000018, "Member 'ChatCommunitySDK_GetLocalChannelMessageListWithExcludeMessageTypeList::Cid' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetLocalChannelMessageListWithExcludeMessageTypeList, MessageTypes) == 0x000028, "Member 'ChatCommunitySDK_GetLocalChannelMessageListWithExcludeMessageTypeList::MessageTypes' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetLocalChannelMessageListWithExcludeMessageTypeList, Callback) == 0x000038, "Member 'ChatCommunitySDK_GetLocalChannelMessageListWithExcludeMessageTypeList::Callback' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.GetLocalGroupMessageList
// 0x0038 (0x0038 - 0x0000)
struct ChatCommunitySDK_GetLocalGroupMessageList final
{
public:
	class FString                                 FromMsgSeq;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GId;                                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, const TArray<struct FChatSDKMessage>& MsgList, int32 Code, const class FString& Desc)> Callback; // 0x0028(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ChatCommunitySDK_GetLocalGroupMessageList) == 0x000008, "Wrong alignment on ChatCommunitySDK_GetLocalGroupMessageList");
static_assert(sizeof(ChatCommunitySDK_GetLocalGroupMessageList) == 0x000038, "Wrong size on ChatCommunitySDK_GetLocalGroupMessageList");
static_assert(offsetof(ChatCommunitySDK_GetLocalGroupMessageList, FromMsgSeq) == 0x000000, "Member 'ChatCommunitySDK_GetLocalGroupMessageList::FromMsgSeq' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetLocalGroupMessageList, Count) == 0x000010, "Member 'ChatCommunitySDK_GetLocalGroupMessageList::Count' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetLocalGroupMessageList, GId) == 0x000018, "Member 'ChatCommunitySDK_GetLocalGroupMessageList::GId' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetLocalGroupMessageList, Callback) == 0x000028, "Member 'ChatCommunitySDK_GetLocalGroupMessageList::Callback' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.GetLocalNotifyMsgList
// 0x0038 (0x0038 - 0x0000)
struct ChatCommunitySDK_GetLocalNotifyMsgList final
{
public:
	class FString                                 From;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MsgSeq;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, const TArray<struct FChatNotifyMessage>& MsgList, int32 Code, const class FString& Desc)> Delegate; // 0x0024(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ChatCommunitySDK_GetLocalNotifyMsgList) == 0x000008, "Wrong alignment on ChatCommunitySDK_GetLocalNotifyMsgList");
static_assert(sizeof(ChatCommunitySDK_GetLocalNotifyMsgList) == 0x000038, "Wrong size on ChatCommunitySDK_GetLocalNotifyMsgList");
static_assert(offsetof(ChatCommunitySDK_GetLocalNotifyMsgList, From) == 0x000000, "Member 'ChatCommunitySDK_GetLocalNotifyMsgList::From' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetLocalNotifyMsgList, MsgSeq) == 0x000010, "Member 'ChatCommunitySDK_GetLocalNotifyMsgList::MsgSeq' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetLocalNotifyMsgList, Count) == 0x000020, "Member 'ChatCommunitySDK_GetLocalNotifyMsgList::Count' has a wrong offset!");
static_assert(offsetof(ChatCommunitySDK_GetLocalNotifyMsgList, Delegate) == 0x000024, "Member 'ChatCommunitySDK_GetLocalNotifyMsgList::Delegate' has a wrong offset!");

// Function ChatSDK.ChatCommunitySDK.GetLocalSingleMessageList
// 0x0038 (0x0038 - 0x0000)
