#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChatSDK

#include "Basic.hpp"


namespace SDK
{

// Enum ChatSDK.EChatSDKMsgSendStatus
// NumValues: 0x0005
enum class EChatSDKMsgSendStatus : uint8
{
	ChatSDKMsgSendStatusNotNeed              = 0,
	ChatSDKMsgSendStatusSucceed              = 1,
	ChatSDKMsgSendStatusFail                 = 2,
	ChatSDKMsgSendStatusSending              = 3,
	EChatSDKMsgSendStatus_MAX                = 4,
};

// Enum ChatSDK.EChatSDKMessageType
// NumValues: 0x000D
enum class EChatSDKMessageType : uint8
{
	Unknow                                   = 0,
	Text                                     = 1,
	Emoji                                    = 2,
	Image                                    = 3,
	Location                                 = 4,
	Audio                                    = 5,
	Video                                    = 6,
	File                                     = 7,
	Event                                    = 8,
	Pass                                     = 9,
	Custom                                   = 100,
	RichText                                 = 200,
	EChatSDKMessageType_MAX                  = 201,
};

// Enum ChatSDK.EChatGroupMemberFilter
// NumValues: 0x0005
enum class EChatGroupMemberFilter : uint8
{
	GROUP_MEMBER_FILTER_ALL                  = 100,
	GROUP_MEMBER_FILTER_COMMON               = 0,
	GROUP_MEMBER_FILTER_ADMIN                = 1,
	GROUP_MEMBER_FILTER_LORD                 = 2,
	GROUP_MEMBER_FILTER_MAX                  = 101,
};

// Enum ChatSDK.EChatSDKSessionType
// NumValues: 0x0004
enum class EChatSDKSessionType : uint8
{
	EChatSDKSessionTypeUnknow                = 0,
	EChatSDKSessionTypeSingle                = 1,
	EChatSDKSessionTypeGroup                 = 2,
	EChatSDKSessionType_MAX                  = 3,
};

// Enum ChatSDK.EChatSilenceType
// NumValues: 0x0006
enum class EChatSilenceType : uint8
{
	SILENCE_TYPE_ALL                         = 0,
	SILENCE_TYPE_OVERALL                     = 1,
	SILENCE_TYPE_SINGLE                      = 2,
	SILENCE_TYPE_GROUP                       = 3,
	SILENCE_TYPE_CHANNEL                     = 4,
	SILENCE_TYPE_MAX                         = 5,
};

// Enum ChatSDK.EChatRegionType
// NumValues: 0x0004
enum class EChatRegionType : uint8
{
	EChatRegionTypeMainland                  = 0,
	EChatRegionTypeTGA                       = 1,
	EChatRegionTypeOversea                   = 2,
	EChatRegionType_MAX                      = 3,
};

// Enum ChatSDK.EConnectionStatus
// NumValues: 0x0004
enum class EConnectionStatus : uint8
{
	Connecting                               = 0,
	ConnectSucceed                           = 1,
	ConnectFailed                            = 2,
	EConnectionStatus_MAX                    = 3,
};

// Enum ChatSDK.EChatSessionEventType
// NumValues: 0x000B
enum class EChatSessionEventType : uint8
{
	UNKNOW                                   = 0,
	SESSION_NEW                              = 100,
	SESSION_TOP_CHANGE                       = 101,
	SESSION_DISTURB_CHANGE                   = 102,
	SESSION_EXT_CHANGE                       = 103,
	SESSION_APP_EXT_CHANGE                   = 104,
	SESSION_DELETE                           = 105,
	SESSION_LAST_MESSAGE_CHANGE              = 106,
	SESSION_MESSAGE_ATALL                    = 107,
	SESSION_MESSAGE_ATME                     = 108,
	EChatSessionEventType_MAX                = 109,
};

// Enum ChatSDK.EChatGroupEventType
// NumValues: 0x000F
enum class EChatGroupEventType : uint8
{
	UNKNOW                                   = 0,
	GROUP_CREATE                             = 1,
	GROUP_POSITIVE_JOIN                      = 2,
	GROUP_NEGATIVE_JOIN                      = 3,
	GROUP_POSITIVE_OUT                       = 4,
	GROUP_KICK_OUT                           = 5,
	GROUP_DISMISS                            = 6,
	GROUP_CHANGE_INFO                        = 7,
	GROUP_CHANGE_NAME                        = 8,
	GROUP_CHANGE_EXT_INFO                    = 9,
	GROUP_CHANGE_APP_EXT                     = 10,
	GROUP_CHANGE_MEMBERS                     = 11,
	GROUP_CHANGE_MEMBERS_ROLE                = 12,
	GROUP_CHANGE_MEMBERS_OWNER               = 13,
	EChatGroupEventType_MAX                  = 14,
};

// Enum ChatSDK.EChatChannelEventType
// NumValues: 0x000C
enum class EChatChannelEventType : uint8
{
	UNKNOW                                   = 0,
	CHANNEL_JOIN                             = 1,
	CHANNEL_QUIT                             = 2,
	CHANNEL_KICK_OUT                         = 3,
	CHANNEL_DELETE                           = 4,
	CHANNEL_CHANGE_NAME                      = 5,
	CHANNEL_CHANGE_SILENCE                   = 6,
	CHANNEL_CHANGE_HISTORY_CONFIG            = 7,
	CHANNEL_CHANGE_APP_EXT                   = 8,
	CHANNEL_CHANGE_MEMBER_SILENCE            = 9,
	CHANNEL_DISCONNET                        = 10,
	EChatChannelEventType_MAX                = 11,
};

// Enum ChatSDK.EChatSDKLoginEventType
// NumValues: 0x000C
enum class EChatSDKLoginEventType : uint8
{
	UNKNOW                                   = 0,
	LOGINING                                 = 1,
	LOGIN_SUCCESS                            = 2,
	LOGIN_FAILED                             = 3,
	RE_LOGINING                              = 4,
	RE_LOGIN_SUCCESS                         = 5,
	RE_LOGIN_FAILED                          = 6,
	LOGOUTING                                = 7,
	LOGOUT_SUCCESS                           = 8,
	LOGOUT_FAILED                            = 9,
	TOKEN_NEED_REFRESH                       = 10,
	EChatSDKLoginEventType_MAX               = 11,
};

// ScriptStruct ChatSDK.ChatNotifyMessage
// 0x0070 (0x0070 - 0x0000)
struct FChatNotifyMessage final
{
public:
	int64                                         MsgId;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MsgSeq;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         MsgTime;                                           // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCancel;                                         // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRead;                                           // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 From;                                              // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Ext;                                               // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChatSDKMessageType                           MsgType;                                           // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UChatSDKCustomMessage*                  CustomMsg;                                         // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventMsg;                                          // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UChatSDKTextMessage*                    TxtMsg;                                            // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChatNotifyMessage) == 0x000008, "Wrong alignment on FChatNotifyMessage");
static_assert(sizeof(FChatNotifyMessage) == 0x000070, "Wrong size on FChatNotifyMessage");
static_assert(offsetof(FChatNotifyMessage, MsgId) == 0x000000, "Member 'FChatNotifyMessage::MsgId' has a wrong offset!");
static_assert(offsetof(FChatNotifyMessage, MsgSeq) == 0x000008, "Member 'FChatNotifyMessage::MsgSeq' has a wrong offset!");
static_assert(offsetof(FChatNotifyMessage, MsgTime) == 0x000018, "Member 'FChatNotifyMessage::MsgTime' has a wrong offset!");
static_assert(offsetof(FChatNotifyMessage, bIsCancel) == 0x000020, "Member 'FChatNotifyMessage::bIsCancel' has a wrong offset!");
static_assert(offsetof(FChatNotifyMessage, bIsRead) == 0x000021, "Member 'FChatNotifyMessage::bIsRead' has a wrong offset!");
static_assert(offsetof(FChatNotifyMessage, From) == 0x000028, "Member 'FChatNotifyMessage::From' has a wrong offset!");
static_assert(offsetof(FChatNotifyMessage, Ext) == 0x000038, "Member 'FChatNotifyMessage::Ext' has a wrong offset!");
static_assert(offsetof(FChatNotifyMessage, MsgType) == 0x000048, "Member 'FChatNotifyMessage::MsgType' has a wrong offset!");
static_assert(offsetof(FChatNotifyMessage, CustomMsg) == 0x000050, "Member 'FChatNotifyMessage::CustomMsg' has a wrong offset!");
static_assert(offsetof(FChatNotifyMessage, EventMsg) == 0x000058, "Member 'FChatNotifyMessage::EventMsg' has a wrong offset!");
static_assert(offsetof(FChatNotifyMessage, TxtMsg) == 0x000068, "Member 'FChatNotifyMessage::TxtMsg' has a wrong offset!");

// ScriptStruct ChatSDK.ChatChannelMember
// 0x0048 (0x0048 - 0x0000)
struct FChatChannelMember final
{
public:
	class FString                                 RoleId;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Nickname;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Avatar;                                            // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Ext;                                               // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         JoinTime;                                          // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChatChannelMember) == 0x000008, "Wrong alignment on FChatChannelMember");
static_assert(sizeof(FChatChannelMember) == 0x000048, "Wrong size on FChatChannelMember");
static_assert(offsetof(FChatChannelMember, RoleId) == 0x000000, "Member 'FChatChannelMember::RoleId' has a wrong offset!");
static_assert(offsetof(FChatChannelMember, Nickname) == 0x000010, "Member 'FChatChannelMember::Nickname' has a wrong offset!");
static_assert(offsetof(FChatChannelMember, Avatar) == 0x000020, "Member 'FChatChannelMember::Avatar' has a wrong offset!");
static_assert(offsetof(FChatChannelMember, Ext) == 0x000030, "Member 'FChatChannelMember::Ext' has a wrong offset!");
static_assert(offsetof(FChatChannelMember, JoinTime) == 0x000040, "Member 'FChatChannelMember::JoinTime' has a wrong offset!");

// ScriptStruct ChatSDK.ChatSDKMessageData
// 0x0100 (0x0100 - 0x0000)
struct FChatSDKMessageData final
{
public:
	class FString                                 ClientMsgId;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         MsgId;                                             // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MsgSeq;                                            // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         MsgTime;                                           // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsFromMe;                                         // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 From;                                              // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAtAll;                                            // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         AtUserList;                                        // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bAtMe;                                             // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChatSDKMessageType                           MsgType;                                           // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UChatSDKTextMessage*                    TxtMsg;                                            // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UChatSDKEmojiMessage*                   EmojiMsg;                                          // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UChatSDKImageMessage*                   ImageMsg;                                          // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UChatSDKLocationMessage*                LocationMsg;                                       // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UChatSDKAudioMessage*                   AudioMsg;                                          // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UChatSDKVideoMessage*                   VideoMsg;                                          // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UChatSDKFileMessage*                    FileMsg;                                           // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UChatSDKPassMessage*                    PassMsg;                                           // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UChatSDKCustomMessage*                  CustomMsg;                                         // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventMsg;                                          // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Ext;                                               // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChatSDKMsgSendStatus                         SendStatus;                                        // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRead;                                           // 0x00D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LocalExt;                                          // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAuditFailed;                                    // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LogInfo;                                           // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChatSDKMessageData) == 0x000008, "Wrong alignment on FChatSDKMessageData");
static_assert(sizeof(FChatSDKMessageData) == 0x000100, "Wrong size on FChatSDKMessageData");
static_assert(offsetof(FChatSDKMessageData, ClientMsgId) == 0x000000, "Member 'FChatSDKMessageData::ClientMsgId' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, MsgId) == 0x000010, "Member 'FChatSDKMessageData::MsgId' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, MsgSeq) == 0x000018, "Member 'FChatSDKMessageData::MsgSeq' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, MsgTime) == 0x000028, "Member 'FChatSDKMessageData::MsgTime' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, bIsFromMe) == 0x000030, "Member 'FChatSDKMessageData::bIsFromMe' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, From) == 0x000038, "Member 'FChatSDKMessageData::From' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, bAtAll) == 0x000048, "Member 'FChatSDKMessageData::bAtAll' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, AtUserList) == 0x000050, "Member 'FChatSDKMessageData::AtUserList' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, bAtMe) == 0x000060, "Member 'FChatSDKMessageData::bAtMe' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, MsgType) == 0x000061, "Member 'FChatSDKMessageData::MsgType' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, TxtMsg) == 0x000068, "Member 'FChatSDKMessageData::TxtMsg' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, EmojiMsg) == 0x000070, "Member 'FChatSDKMessageData::EmojiMsg' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, ImageMsg) == 0x000078, "Member 'FChatSDKMessageData::ImageMsg' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, LocationMsg) == 0x000080, "Member 'FChatSDKMessageData::LocationMsg' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, AudioMsg) == 0x000088, "Member 'FChatSDKMessageData::AudioMsg' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, VideoMsg) == 0x000090, "Member 'FChatSDKMessageData::VideoMsg' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, FileMsg) == 0x000098, "Member 'FChatSDKMessageData::FileMsg' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, PassMsg) == 0x0000A0, "Member 'FChatSDKMessageData::PassMsg' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, CustomMsg) == 0x0000A8, "Member 'FChatSDKMessageData::CustomMsg' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, EventMsg) == 0x0000B0, "Member 'FChatSDKMessageData::EventMsg' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, Ext) == 0x0000C0, "Member 'FChatSDKMessageData::Ext' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, SendStatus) == 0x0000D0, "Member 'FChatSDKMessageData::SendStatus' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, bIsRead) == 0x0000D1, "Member 'FChatSDKMessageData::bIsRead' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, LocalExt) == 0x0000D8, "Member 'FChatSDKMessageData::LocalExt' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, bIsAuditFailed) == 0x0000E8, "Member 'FChatSDKMessageData::bIsAuditFailed' has a wrong offset!");
static_assert(offsetof(FChatSDKMessageData, LogInfo) == 0x0000F0, "Member 'FChatSDKMessageData::LogInfo' has a wrong offset!");

// ScriptStruct ChatSDK.ChatSDKChannelMessage
// 0x0110 (0x0110 - 0x0000)
struct FChatSDKChannelMessage final
{
public:
	struct FChatSDKMessageData                    Msg;                                               // 0x0000(0x0100)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                 ChannelId;                                         // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChatSDKChannelMessage) == 0x000008, "Wrong alignment on FChatSDKChannelMessage");
static_assert(sizeof(FChatSDKChannelMessage) == 0x000110, "Wrong size on FChatSDKChannelMessage");
static_assert(offsetof(FChatSDKChannelMessage, Msg) == 0x000000, "Member 'FChatSDKChannelMessage::Msg' has a wrong offset!");
static_assert(offsetof(FChatSDKChannelMessage, ChannelId) == 0x000100, "Member 'FChatSDKChannelMessage::ChannelId' has a wrong offset!");

// ScriptStruct ChatSDK.ChatGroupMember
// 0x0090 (0x0090 - 0x0000)
struct FChatGroupMember final
{
public:
	class FString                                 RoleId;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Nickname;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Ext;                                               // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         MemberId;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GId;                                               // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         CreateTime;                                        // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         UpdateTime;                                        // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GroupNickname;                                     // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Showname;                                          // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Avatar;                                            // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChatGroupMember) == 0x000008, "Wrong alignment on FChatGroupMember");
static_assert(sizeof(FChatGroupMember) == 0x000090, "Wrong size on FChatGroupMember");
static_assert(offsetof(FChatGroupMember, RoleId) == 0x000000, "Member 'FChatGroupMember::RoleId' has a wrong offset!");
static_assert(offsetof(FChatGroupMember, Nickname) == 0x000010, "Member 'FChatGroupMember::Nickname' has a wrong offset!");
static_assert(offsetof(FChatGroupMember, Ext) == 0x000020, "Member 'FChatGroupMember::Ext' has a wrong offset!");
static_assert(offsetof(FChatGroupMember, Type) == 0x000030, "Member 'FChatGroupMember::Type' has a wrong offset!");
static_assert(offsetof(FChatGroupMember, MemberId) == 0x000038, "Member 'FChatGroupMember::MemberId' has a wrong offset!");
static_assert(offsetof(FChatGroupMember, GId) == 0x000040, "Member 'FChatGroupMember::GId' has a wrong offset!");
static_assert(offsetof(FChatGroupMember, CreateTime) == 0x000050, "Member 'FChatGroupMember::CreateTime' has a wrong offset!");
static_assert(offsetof(FChatGroupMember, UpdateTime) == 0x000058, "Member 'FChatGroupMember::UpdateTime' has a wrong offset!");
static_assert(offsetof(FChatGroupMember, GroupNickname) == 0x000060, "Member 'FChatGroupMember::GroupNickname' has a wrong offset!");
static_assert(offsetof(FChatGroupMember, Showname) == 0x000070, "Member 'FChatGroupMember::Showname' has a wrong offset!");
static_assert(offsetof(FChatGroupMember, Avatar) == 0x000080, "Member 'FChatGroupMember::Avatar' has a wrong offset!");

// ScriptStruct ChatSDK.ChatGroupInfo
// 0x0070 (0x0070 - 0x0000)
struct FChatGroupInfo final
{
public:
	class FString                                 GId;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OwnerUid;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Announcement;                                      // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MemberCount;                                       // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         MemberUpdateTime;                                  // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         CreateTime;                                        // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         UpdateTime;                                        // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Ext;                                               // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChatGroupInfo) == 0x000008, "Wrong alignment on FChatGroupInfo");
static_assert(sizeof(FChatGroupInfo) == 0x000070, "Wrong size on FChatGroupInfo");
static_assert(offsetof(FChatGroupInfo, GId) == 0x000000, "Member 'FChatGroupInfo::GId' has a wrong offset!");
static_assert(offsetof(FChatGroupInfo, Name) == 0x000010, "Member 'FChatGroupInfo::Name' has a wrong offset!");
static_assert(offsetof(FChatGroupInfo, OwnerUid) == 0x000020, "Member 'FChatGroupInfo::OwnerUid' has a wrong offset!");
static_assert(offsetof(FChatGroupInfo, Announcement) == 0x000030, "Member 'FChatGroupInfo::Announcement' has a wrong offset!");
static_assert(offsetof(FChatGroupInfo, MemberCount) == 0x000040, "Member 'FChatGroupInfo::MemberCount' has a wrong offset!");
static_assert(offsetof(FChatGroupInfo, MemberUpdateTime) == 0x000048, "Member 'FChatGroupInfo::MemberUpdateTime' has a wrong offset!");
static_assert(offsetof(FChatGroupInfo, CreateTime) == 0x000050, "Member 'FChatGroupInfo::CreateTime' has a wrong offset!");
static_assert(offsetof(FChatGroupInfo, UpdateTime) == 0x000058, "Member 'FChatGroupInfo::UpdateTime' has a wrong offset!");
static_assert(offsetof(FChatGroupInfo, Ext) == 0x000060, "Member 'FChatGroupInfo::Ext' has a wrong offset!");

// ScriptStruct ChatSDK.ChatSDKMessage
// 0x0130 (0x0130 - 0x0000)
struct FChatSDKMessage final
{
public:
	struct FChatSDKMessageData                    Msg;                                               // 0x0000(0x0100)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bIsCancel;                                         // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 To;                                                // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GId;                                               // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EChatSDKSessionType                           SessionType;                                       // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FChatSDKMessage) == 0x000008, "Wrong alignment on FChatSDKMessage");
static_assert(sizeof(FChatSDKMessage) == 0x000130, "Wrong size on FChatSDKMessage");
static_assert(offsetof(FChatSDKMessage, Msg) == 0x000000, "Member 'FChatSDKMessage::Msg' has a wrong offset!");
static_assert(offsetof(FChatSDKMessage, bIsCancel) == 0x000100, "Member 'FChatSDKMessage::bIsCancel' has a wrong offset!");
static_assert(offsetof(FChatSDKMessage, To) == 0x000108, "Member 'FChatSDKMessage::To' has a wrong offset!");
static_assert(offsetof(FChatSDKMessage, GId) == 0x000118, "Member 'FChatSDKMessage::GId' has a wrong offset!");
static_assert(offsetof(FChatSDKMessage, SessionType) == 0x000128, "Member 'FChatSDKMessage::SessionType' has a wrong offset!");

// ScriptStruct ChatSDK.ChatChannelInfo
// 0x0048 (0x0048 - 0x0000)
struct FChatChannelInfo final
{
public:
	class FString                                 Cid;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsSilence;                                         // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsTemp;                                            // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NeedHistoryMessage;                                // 0x0022(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxHistoryMessageCount;                            // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxHistoryMessageHour;                             // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UnreadCount;                                       // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         UpdateTime;                                        // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Ext;                                               // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChatChannelInfo) == 0x000008, "Wrong alignment on FChatChannelInfo");
static_assert(sizeof(FChatChannelInfo) == 0x000048, "Wrong size on FChatChannelInfo");
static_assert(offsetof(FChatChannelInfo, Cid) == 0x000000, "Member 'FChatChannelInfo::Cid' has a wrong offset!");
static_assert(offsetof(FChatChannelInfo, Name) == 0x000010, "Member 'FChatChannelInfo::Name' has a wrong offset!");
static_assert(offsetof(FChatChannelInfo, IsSilence) == 0x000020, "Member 'FChatChannelInfo::IsSilence' has a wrong offset!");
static_assert(offsetof(FChatChannelInfo, IsTemp) == 0x000021, "Member 'FChatChannelInfo::IsTemp' has a wrong offset!");
static_assert(offsetof(FChatChannelInfo, NeedHistoryMessage) == 0x000022, "Member 'FChatChannelInfo::NeedHistoryMessage' has a wrong offset!");
static_assert(offsetof(FChatChannelInfo, MaxHistoryMessageCount) == 0x000024, "Member 'FChatChannelInfo::MaxHistoryMessageCount' has a wrong offset!");
static_assert(offsetof(FChatChannelInfo, MaxHistoryMessageHour) == 0x000028, "Member 'FChatChannelInfo::MaxHistoryMessageHour' has a wrong offset!");
static_assert(offsetof(FChatChannelInfo, UnreadCount) == 0x00002C, "Member 'FChatChannelInfo::UnreadCount' has a wrong offset!");
static_assert(offsetof(FChatChannelInfo, UpdateTime) == 0x000030, "Member 'FChatChannelInfo::UpdateTime' has a wrong offset!");
static_assert(offsetof(FChatChannelInfo, Ext) == 0x000038, "Member 'FChatChannelInfo::Ext' has a wrong offset!");

// ScriptStruct ChatSDK.ChatUserSilenceInfo
// 0x0068 (0x0068 - 0x0000)
struct FChatUserSilenceInfo final
{
public:
	EChatSilenceType                              SilenceType;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TargetId;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Comment;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OperatorId;                                        // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AppExt;                                            // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Expire;                                            // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         CreateTime;                                        // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         UpdateTime;                                        // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ExpireTime;                                        // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChatUserSilenceInfo) == 0x000008, "Wrong alignment on FChatUserSilenceInfo");
static_assert(sizeof(FChatUserSilenceInfo) == 0x000068, "Wrong size on FChatUserSilenceInfo");
static_assert(offsetof(FChatUserSilenceInfo, SilenceType) == 0x000000, "Member 'FChatUserSilenceInfo::SilenceType' has a wrong offset!");
static_assert(offsetof(FChatUserSilenceInfo, TargetId) == 0x000008, "Member 'FChatUserSilenceInfo::TargetId' has a wrong offset!");
static_assert(offsetof(FChatUserSilenceInfo, Comment) == 0x000018, "Member 'FChatUserSilenceInfo::Comment' has a wrong offset!");
static_assert(offsetof(FChatUserSilenceInfo, OperatorId) == 0x000028, "Member 'FChatUserSilenceInfo::OperatorId' has a wrong offset!");
static_assert(offsetof(FChatUserSilenceInfo, AppExt) == 0x000038, "Member 'FChatUserSilenceInfo::AppExt' has a wrong offset!");
static_assert(offsetof(FChatUserSilenceInfo, Expire) == 0x000048, "Member 'FChatUserSilenceInfo::Expire' has a wrong offset!");
static_assert(offsetof(FChatUserSilenceInfo, CreateTime) == 0x000050, "Member 'FChatUserSilenceInfo::CreateTime' has a wrong offset!");
static_assert(offsetof(FChatUserSilenceInfo, UpdateTime) == 0x000058, "Member 'FChatUserSilenceInfo::UpdateTime' has a wrong offset!");
static_assert(offsetof(FChatUserSilenceInfo, ExpireTime) == 0x000060, "Member 'FChatUserSilenceInfo::ExpireTime' has a wrong offset!");

// ScriptStruct ChatSDK.ChatUserSilence
// 0x0020 (0x0020 - 0x0000)
struct FChatUserSilence final
{
public:
	class FString                                 RoleId;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FChatUserSilenceInfo>           SilenceList;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChatUserSilence) == 0x000008, "Wrong alignment on FChatUserSilence");
static_assert(sizeof(FChatUserSilence) == 0x000020, "Wrong size on FChatUserSilence");
static_assert(offsetof(FChatUserSilence, RoleId) == 0x000000, "Member 'FChatUserSilence::RoleId' has a wrong offset!");
static_assert(offsetof(FChatUserSilence, SilenceList) == 0x000010, "Member 'FChatUserSilence::SilenceList' has a wrong offset!");

// ScriptStruct ChatSDK.GameUserInfo
// 0x0080 (0x0080 - 0x0000)
struct FGameUserInfo final
{
public:
	class FString                                 uid;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleId;                                            // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerId;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleName;                                          // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerName;                                        // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Avatar;                                            // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameExt;                                           // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGameUserInfo) == 0x000008, "Wrong alignment on FGameUserInfo");
static_assert(sizeof(FGameUserInfo) == 0x000080, "Wrong size on FGameUserInfo");
static_assert(offsetof(FGameUserInfo, uid) == 0x000000, "Member 'FGameUserInfo::uid' has a wrong offset!");
static_assert(offsetof(FGameUserInfo, Token) == 0x000010, "Member 'FGameUserInfo::Token' has a wrong offset!");
static_assert(offsetof(FGameUserInfo, RoleId) == 0x000020, "Member 'FGameUserInfo::RoleId' has a wrong offset!");
static_assert(offsetof(FGameUserInfo, ServerId) == 0x000030, "Member 'FGameUserInfo::ServerId' has a wrong offset!");
static_assert(offsetof(FGameUserInfo, RoleName) == 0x000040, "Member 'FGameUserInfo::RoleName' has a wrong offset!");
static_assert(offsetof(FGameUserInfo, ServerName) == 0x000050, "Member 'FGameUserInfo::ServerName' has a wrong offset!");
static_assert(offsetof(FGameUserInfo, Avatar) == 0x000060, "Member 'FGameUserInfo::Avatar' has a wrong offset!");
static_assert(offsetof(FGameUserInfo, GameExt) == 0x000070, "Member 'FGameUserInfo::GameExt' has a wrong offset!");

// ScriptStruct ChatSDK.ChatSessionInfo
// 0x01B0 (0x01B0 - 0x0000)
struct FChatSessionInfo final
{
public:
	int32                                         SessionId;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Showname;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 To;                                                // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsTop;                                             // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NotDisturb;                                        // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Type;                                              // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LastMsgSeq;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         LastMsgId;                                         // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FChatSDKMessage                        LastMsg;                                           // 0x0048(0x0130)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                 Draft;                                             // 0x0178(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         UpdateTime;                                        // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UnreadCount;                                       // 0x0190(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Ext;                                               // 0x0198(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAtMe;                                           // 0x01A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAtAll;                                          // 0x01A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FChatSessionInfo) == 0x000008, "Wrong alignment on FChatSessionInfo");
static_assert(sizeof(FChatSessionInfo) == 0x0001B0, "Wrong size on FChatSessionInfo");
static_assert(offsetof(FChatSessionInfo, SessionId) == 0x000000, "Member 'FChatSessionInfo::SessionId' has a wrong offset!");
static_assert(offsetof(FChatSessionInfo, Showname) == 0x000008, "Member 'FChatSessionInfo::Showname' has a wrong offset!");
static_assert(offsetof(FChatSessionInfo, To) == 0x000018, "Member 'FChatSessionInfo::To' has a wrong offset!");
static_assert(offsetof(FChatSessionInfo, IsTop) == 0x000028, "Member 'FChatSessionInfo::IsTop' has a wrong offset!");
static_assert(offsetof(FChatSessionInfo, NotDisturb) == 0x000029, "Member 'FChatSessionInfo::NotDisturb' has a wrong offset!");
static_assert(offsetof(FChatSessionInfo, Type) == 0x00002C, "Member 'FChatSessionInfo::Type' has a wrong offset!");
static_assert(offsetof(FChatSessionInfo, LastMsgSeq) == 0x000030, "Member 'FChatSessionInfo::LastMsgSeq' has a wrong offset!");
static_assert(offsetof(FChatSessionInfo, LastMsgId) == 0x000040, "Member 'FChatSessionInfo::LastMsgId' has a wrong offset!");
static_assert(offsetof(FChatSessionInfo, LastMsg) == 0x000048, "Member 'FChatSessionInfo::LastMsg' has a wrong offset!");
static_assert(offsetof(FChatSessionInfo, Draft) == 0x000178, "Member 'FChatSessionInfo::Draft' has a wrong offset!");
static_assert(offsetof(FChatSessionInfo, UpdateTime) == 0x000188, "Member 'FChatSessionInfo::UpdateTime' has a wrong offset!");
static_assert(offsetof(FChatSessionInfo, UnreadCount) == 0x000190, "Member 'FChatSessionInfo::UnreadCount' has a wrong offset!");
static_assert(offsetof(FChatSessionInfo, Ext) == 0x000198, "Member 'FChatSessionInfo::Ext' has a wrong offset!");
static_assert(offsetof(FChatSessionInfo, bIsAtMe) == 0x0001A8, "Member 'FChatSessionInfo::bIsAtMe' has a wrong offset!");
static_assert(offsetof(FChatSessionInfo, bIsAtAll) == 0x0001A9, "Member 'FChatSessionInfo::bIsAtAll' has a wrong offset!");

// ScriptStruct ChatSDK.ChatUserInfo
// 0x0060 (0x0060 - 0x0000)
struct FChatUserInfo final
{
public:
	class FString                                 RoleId;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleName;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerId;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Avatar;                                            // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         CreateTime;                                        // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         UpdateTime;                                        // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Ext;                                               // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FChatUserInfo) == 0x000008, "Wrong alignment on FChatUserInfo");
static_assert(sizeof(FChatUserInfo) == 0x000060, "Wrong size on FChatUserInfo");
static_assert(offsetof(FChatUserInfo, RoleId) == 0x000000, "Member 'FChatUserInfo::RoleId' has a wrong offset!");
static_assert(offsetof(FChatUserInfo, RoleName) == 0x000010, "Member 'FChatUserInfo::RoleName' has a wrong offset!");
static_assert(offsetof(FChatUserInfo, ServerId) == 0x000020, "Member 'FChatUserInfo::ServerId' has a wrong offset!");
static_assert(offsetof(FChatUserInfo, Avatar) == 0x000030, "Member 'FChatUserInfo::Avatar' has a wrong offset!");
static_assert(offsetof(FChatUserInfo, CreateTime) == 0x000040, "Member 'FChatUserInfo::CreateTime' has a wrong offset!");
static_assert(offsetof(FChatUserInfo, UpdateTime) == 0x000048, "Member 'FChatUserInfo::UpdateTime' has a wrong offset!");
static_assert(offsetof(FChatUserInfo, Ext) == 0x000050, "Member 'FChatUserInfo::Ext' has a wrong offset!");

// ScriptStruct ChatSDK.ChatUserOnlineStatus
// 0x0018 (0x0018 - 0x0000)
struct FChatUserOnlineStatus final
{
public:
	class FString                                 RoleId;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Online;                                            // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FChatUserOnlineStatus) == 0x000008, "Wrong alignment on FChatUserOnlineStatus");
static_assert(sizeof(FChatUserOnlineStatus) == 0x000018, "Wrong size on FChatUserOnlineStatus");
static_assert(offsetof(FChatUserOnlineStatus, RoleId) == 0x000000, "Member 'FChatUserOnlineStatus::RoleId' has a wrong offset!");
static_assert(offsetof(FChatUserOnlineStatus, Online) == 0x000010, "Member 'FChatUserOnlineStatus::Online' has a wrong offset!");

// ScriptStruct ChatSDK.SendMsgResult
// 0x0048 (0x0048 - 0x0000)
struct FSendMsgResult final
{
public:
	bool                                          bSucceed;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ClientMsgId;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MsgSeq;                                            // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Timestamp;                                         // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Code;                                              // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Msg;                                               // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSendMsgResult) == 0x000008, "Wrong alignment on FSendMsgResult");
static_assert(sizeof(FSendMsgResult) == 0x000048, "Wrong size on FSendMsgResult");
static_assert(offsetof(FSendMsgResult, bSucceed) == 0x000000, "Member 'FSendMsgResult::bSucceed' has a wrong offset!");
static_assert(offsetof(FSendMsgResult, ClientMsgId) == 0x000008, "Member 'FSendMsgResult::ClientMsgId' has a wrong offset!");
static_assert(offsetof(FSendMsgResult, MsgSeq) == 0x000018, "Member 'FSendMsgResult::MsgSeq' has a wrong offset!");
static_assert(offsetof(FSendMsgResult, Timestamp) == 0x000028, "Member 'FSendMsgResult::Timestamp' has a wrong offset!");
static_assert(offsetof(FSendMsgResult, Code) == 0x000030, "Member 'FSendMsgResult::Code' has a wrong offset!");
static_assert(offsetof(FSendMsgResult, Msg) == 0x000038, "Member 'FSendMsgResult::Msg' has a wrong offset!");

// ScriptStruct ChatSDK.GameNoLauncherInfo
// 0x0020 (0x0020 - 0x0000)
struct FGameNoLauncherInfo final
{
public:
	class FString                                 uid;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGameNoLauncherInfo) == 0x000008, "Wrong alignment on FGameNoLauncherInfo");
static_assert(sizeof(FGameNoLauncherInfo) == 0x000020, "Wrong size on FGameNoLauncherInfo");
static_assert(offsetof(FGameNoLauncherInfo, uid) == 0x000000, "Member 'FGameNoLauncherInfo::uid' has a wrong offset!");
static_assert(offsetof(FGameNoLauncherInfo, Token) == 0x000010, "Member 'FGameNoLauncherInfo::Token' has a wrong offset!");

// ScriptStruct ChatSDK.KefuInfo
// 0x0068 (0x0068 - 0x0000)
struct FKefuInfo final
{
public:
	bool                                          IsOnline;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ServiceLevel;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServiceName;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServiceAvatar;                                     // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServiceMood;                                       // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServiceGsImId;                                     // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
