#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CitySampleMassCrowd

#include "Basic.hpp"

#include "MassSmartObjects_classes.hpp"
#include "Engine_classes.hpp"
#include "MassCrowd_classes.hpp"
#include "MassEntity_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "CitySampleMassCrowd_structs.hpp"
#include "MassRepresentation_classes.hpp"


namespace SDK
{

// Class CitySampleMassCrowd.CitySampleDebugVisProcessor
// 0x0360 (0x0420 - 0x00C0)
class UCitySampleDebugVisProcessor final : public UMassProcessor
{
public:
	float                                         AgentRadiusToUse;                                  // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C4[0x35C];                                     // 0x00C4(0x035C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CitySampleDebugVisProcessor">();
	}
	static class UCitySampleDebugVisProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCitySampleDebugVisProcessor>();
	}
};
static_assert(alignof(UCitySampleDebugVisProcessor) == 0x000008, "Wrong alignment on UCitySampleDebugVisProcessor");
static_assert(sizeof(UCitySampleDebugVisProcessor) == 0x000420, "Wrong size on UCitySampleDebugVisProcessor");
static_assert(offsetof(UCitySampleDebugVisProcessor, AgentRadiusToUse) == 0x0000C0, "Member 'UCitySampleDebugVisProcessor::AgentRadiusToUse' has a wrong offset!");

// Class CitySampleMassCrowd.CitySampleDisplayEntitiesProcessor
// 0x0018 (0x00D8 - 0x00C0)
class UCitySampleDisplayEntitiesProcessor final : public UMassProcessor
{
public:
	TArray<struct FCitySampleDisplayEntitiesConfig> DisplayConfigs;                                  // 0x00C0(0x0010)(Edit, ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	class UMassRepresentationSubsystem*           RepresentationSubsystem;                           // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CitySampleDisplayEntitiesProcessor">();
	}
	static class UCitySampleDisplayEntitiesProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCitySampleDisplayEntitiesProcessor>();
	}
};
static_assert(alignof(UCitySampleDisplayEntitiesProcessor) == 0x000008, "Wrong alignment on UCitySampleDisplayEntitiesProcessor");
static_assert(sizeof(UCitySampleDisplayEntitiesProcessor) == 0x0000D8, "Wrong size on UCitySampleDisplayEntitiesProcessor");
static_assert(offsetof(UCitySampleDisplayEntitiesProcessor, DisplayConfigs) == 0x0000C0, "Member 'UCitySampleDisplayEntitiesProcessor::DisplayConfigs' has a wrong offset!");
static_assert(offsetof(UCitySampleDisplayEntitiesProcessor, RepresentationSubsystem) == 0x0000D0, "Member 'UCitySampleDisplayEntitiesProcessor::RepresentationSubsystem' has a wrong offset!");

// Class CitySampleMassCrowd.CitySampleMassCrowdRepresentationActorManagement
// 0x0000 (0x0028 - 0x0028)
class UCitySampleMassCrowdRepresentationActorManagement final : public UMassCrowdRepresentationActorManagement
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CitySampleMassCrowdRepresentationActorManagement">();
	}
	static class UCitySampleMassCrowdRepresentationActorManagement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCitySampleMassCrowdRepresentationActorManagement>();
	}
};
static_assert(alignof(UCitySampleMassCrowdRepresentationActorManagement) == 0x000008, "Wrong alignment on UCitySampleMassCrowdRepresentationActorManagement");
static_assert(sizeof(UCitySampleMassCrowdRepresentationActorManagement) == 0x000028, "Wrong size on UCitySampleMassCrowdRepresentationActorManagement");

// Class CitySampleMassCrowd.MassCrowdActorInterface
// 0x0000 (0x0000 - 0x0000)
class IMassCrowdActorInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdActorInterface">();
	}
	static class IMassCrowdActorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMassCrowdActorInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IMassCrowdActorInterface) == 0x000001, "Wrong alignment on IMassCrowdActorInterface");
static_assert(sizeof(IMassCrowdActorInterface) == 0x000001, "Wrong size on IMassCrowdActorInterface");

// Class CitySampleMassCrowd.MassCrowdAnimationSettings
// 0x0020 (0x0048 - 0x0028)
class UMassCrowdAnimationSettings final : public UMassModuleSettings
{
public:
	TArray<int32>                                 CrowdAnimFootLODTraceFrequencyPerLOD;              // 0x0028(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FName>                           CommonCrowdContextualAnimNames;                    // 0x0038(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static TArray<class FString> GetContextualAnimOptions();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdAnimationSettings">();
	}
	static class UMassCrowdAnimationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdAnimationSettings>();
	}
};
static_assert(alignof(UMassCrowdAnimationSettings) == 0x000008, "Wrong alignment on UMassCrowdAnimationSettings");
static_assert(sizeof(UMassCrowdAnimationSettings) == 0x000048, "Wrong size on UMassCrowdAnimationSettings");
static_assert(offsetof(UMassCrowdAnimationSettings, CrowdAnimFootLODTraceFrequencyPerLOD) == 0x000028, "Member 'UMassCrowdAnimationSettings::CrowdAnimFootLODTraceFrequencyPerLOD' has a wrong offset!");
static_assert(offsetof(UMassCrowdAnimationSettings, CommonCrowdContextualAnimNames) == 0x000038, "Member 'UMassCrowdAnimationSettings::CommonCrowdContextualAnimNames' has a wrong offset!");

// Class CitySampleMassCrowd.MassCrowdAnimInstance
// 0x0158 (0x0540 - 0x03E8)
class UMassCrowdAnimInstance : public UAnimInstance
{
public:
	struct FMassCharacterProximity_AnimInput      PlayerProximityData;                               // 0x03E8(0x0068)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, NativeAccessSpecifierPublic)
	struct FMassCharacterStopPrediction_AnimInput StopPredictionData;                                // 0x0450(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, NativeAccessSpecifierPublic)
	struct FMassCharacterMovementInfo_AnimInput   MassMovementInfo;                                  // 0x0458(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bDoFootTraces;                                     // 0x0478(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassCrowdAnimInstanceData             MassCrowdAnimInstanceData;                         // 0x0480(0x00B0)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_530[0x10];                                     // 0x0530(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdAnimInstance">();
	}
	static class UMassCrowdAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdAnimInstance>();
	}
};
static_assert(alignof(UMassCrowdAnimInstance) == 0x000008, "Wrong alignment on UMassCrowdAnimInstance");
static_assert(sizeof(UMassCrowdAnimInstance) == 0x000540, "Wrong size on UMassCrowdAnimInstance");
static_assert(offsetof(UMassCrowdAnimInstance, PlayerProximityData) == 0x0003E8, "Member 'UMassCrowdAnimInstance::PlayerProximityData' has a wrong offset!");
static_assert(offsetof(UMassCrowdAnimInstance, StopPredictionData) == 0x000450, "Member 'UMassCrowdAnimInstance::StopPredictionData' has a wrong offset!");
static_assert(offsetof(UMassCrowdAnimInstance, MassMovementInfo) == 0x000458, "Member 'UMassCrowdAnimInstance::MassMovementInfo' has a wrong offset!");
static_assert(offsetof(UMassCrowdAnimInstance, bDoFootTraces) == 0x000478, "Member 'UMassCrowdAnimInstance::bDoFootTraces' has a wrong offset!");
static_assert(offsetof(UMassCrowdAnimInstance, MassCrowdAnimInstanceData) == 0x000480, "Member 'UMassCrowdAnimInstance::MassCrowdAnimInstanceData' has a wrong offset!");

// Class CitySampleMassCrowd.MassCrowdContextualAnimationDataAsset
// 0x0050 (0x0080 - 0x0030)
class UMassCrowdContextualAnimationDataAsset final : public UDataAsset
{
public:
	TMap<class FName, struct FMassCrowdContextualAnimDescription> AnimsMap;                          // 0x0030(0x0050)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdContextualAnimationDataAsset">();
	}
	static class UMassCrowdContextualAnimationDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdContextualAnimationDataAsset>();
	}
};
static_assert(alignof(UMassCrowdContextualAnimationDataAsset) == 0x000008, "Wrong alignment on UMassCrowdContextualAnimationDataAsset");
static_assert(sizeof(UMassCrowdContextualAnimationDataAsset) == 0x000080, "Wrong size on UMassCrowdContextualAnimationDataAsset");
static_assert(offsetof(UMassCrowdContextualAnimationDataAsset, AnimsMap) == 0x000030, "Member 'UMassCrowdContextualAnimationDataAsset::AnimsMap' has a wrong offset!");

// Class CitySampleMassCrowd.MassCrowdUpdateISMVertexAnimationProcessor
// 0x0000 (0x0410 - 0x0410)
class UMassCrowdUpdateISMVertexAnimationProcessor final : public UMassUpdateISMProcessor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdUpdateISMVertexAnimationProcessor">();
	}
	static class UMassCrowdUpdateISMVertexAnimationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdUpdateISMVertexAnimationProcessor>();
	}
};
static_assert(alignof(UMassCrowdUpdateISMVertexAnimationProcessor) == 0x000008, "Wrong alignment on UMassCrowdUpdateISMVertexAnimationProcessor");
static_assert(sizeof(UMassCrowdUpdateISMVertexAnimationProcessor) == 0x000410, "Wrong size on UMassCrowdUpdateISMVertexAnimationProcessor");

// Class CitySampleMassCrowd.MassPlayerAnimInstance
// 0x0068 (0x0450 - 0x03E8)
class UMassPlayerAnimInstance final : public UAnimInstance
{
public:
	struct FMassCharacterProximity_AnimInput      CrowdProximity;                                    // 0x03E8(0x0068)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassPlayerAnimInstance">();
	}
	static class UMassPlayerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassPlayerAnimInstance>();
	}
};
static_assert(alignof(UMassPlayerAnimInstance) == 0x000008, "Wrong alignment on UMassPlayerAnimInstance");
static_assert(sizeof(UMassPlayerAnimInstance) == 0x000450, "Wrong size on UMassPlayerAnimInstance");
static_assert(offsetof(UMassPlayerAnimInstance, CrowdProximity) == 0x0003E8, "Member 'UMassPlayerAnimInstance::CrowdProximity' has a wrong offset!");

// Class CitySampleMassCrowd.SmartObjectMassInteractionDefinition
// 0x0018 (0x0048 - 0x0030)
class USmartObjectMassInteractionDefinition final : public USmartObjectMassBehaviorDefinition
{
public:
	class UContextualAnimSceneAsset*              ContextualAnimAsset;                               // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   AlignmentTrack;                                    // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   InteractorRole;                                    // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectMassInteractionDefinition">();
	}
	static class USmartObjectMassInteractionDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectMassInteractionDefinition>();
	}
};
static_assert(alignof(USmartObjectMassInteractionDefinition) == 0x000008, "Wrong alignment on USmartObjectMassInteractionDefinition");
static_assert(sizeof(USmartObjectMassInteractionDefinition) == 0x000048, "Wrong size on USmartObjectMassInteractionDefinition");
static_assert(offsetof(USmartObjectMassInteractionDefinition, ContextualAnimAsset) == 0x000030, "Member 'USmartObjectMassInteractionDefinition::ContextualAnimAsset' has a wrong offset!");
static_assert(offsetof(USmartObjectMassInteractionDefinition, AlignmentTrack) == 0x000038, "Member 'USmartObjectMassInteractionDefinition::AlignmentTrack' has a wrong offset!");
static_assert(offsetof(USmartObjectMassInteractionDefinition, InteractorRole) == 0x000040, "Member 'USmartObjectMassInteractionDefinition::InteractorRole' has a wrong offset!");

}

