#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CloudsLighting

#include "Basic.hpp"

#include "CloudsLighting_structs.hpp"


namespace SDK::Params
{

// Function CloudsLighting.CloudsLightingSystem.IsValid
// 0x0001 (0x0001 - 0x0000)
struct CloudsLightingSystem_IsValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CloudsLightingSystem_IsValid) == 0x000001, "Wrong alignment on CloudsLightingSystem_IsValid");
static_assert(sizeof(CloudsLightingSystem_IsValid) == 0x000001, "Wrong size on CloudsLightingSystem_IsValid");
static_assert(offsetof(CloudsLightingSystem_IsValid, ReturnValue) == 0x000000, "Member 'CloudsLightingSystem_IsValid::ReturnValue' has a wrong offset!");

// Function CloudsLighting.VolumetricLightSource.GetType
// 0x0001 (0x0001 - 0x0000)
struct VolumetricLightSource_GetType final
{
public:
	EVLightSourceType                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VolumetricLightSource_GetType) == 0x000001, "Wrong alignment on VolumetricLightSource_GetType");
static_assert(sizeof(VolumetricLightSource_GetType) == 0x000001, "Wrong size on VolumetricLightSource_GetType");
static_assert(offsetof(VolumetricLightSource_GetType, ReturnValue) == 0x000000, "Member 'VolumetricLightSource_GetType::ReturnValue' has a wrong offset!");

}

