#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ColorCorrectRegions

#include "Basic.hpp"

#include "ColorCorrectRegions_structs.hpp"
#include "DisplayClusterLightCardExtender_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class ColorCorrectRegions.ColorCorrectRegion
// 0x04E0 (0x07A8 - 0x02C8)
#pragma pack(push, 0x1)
class alignas(0x08) AColorCorrectRegion : public AActor
{
public:
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           MeshComponents;                                    // 0x02D0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	EColorCorrectRegionsType                      Type;                                              // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Priority;                                          // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Intensity;                                         // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Inner;                                             // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Outer_0;                                           // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Falloff;                                           // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Invert;                                            // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EColorCorrectRegionTemperatureType            TemperatureType;                                   // 0x02F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2FA[0x2];                                      // 0x02FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temperature;                                       // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Tint;                                              // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_304[0xC];                                      // 0x0304(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColorGradingSettings                  ColorGradingSettings;                              // 0x0310(0x0330)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          Enabled;                                           // 0x0640(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnablePerActorCC;                                 // 0x0641(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EColorCorrectRegionStencilType                PerActorColorCorrection;                           // 0x0642(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_643[0x5];                                      // 0x0643(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<TSoftObjectPtr<class AActor>>            AffectedActors;                                    // 0x0648(0x0050)(Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_698[0x50];                                     // 0x0698(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UColorCorrectionInvisibleComponent*     IdentityComponent;                                 // 0x06E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDisplayClusterPositionalParams        PositionalParams;                                  // 0x06F0(0x0048)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_738[0x8];                                      // 0x0738(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Origin;                                            // 0x0740(0x0060)(Edit, BlueprintVisible, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7A0[0x8];                                      // 0x07A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetDistanceFromCenter(double InValue);
	void SetLatitude(double InValue);
	void SetLongitude(double InValue);
	void SetOrigin(const struct FTransform& InOrigin);
	void SetPitch(double InValue);
	void SetPositionalParams(const struct FDisplayClusterPositionalParams& InParams);
	void SetRadialOffset(double InValue);
	void SetScale(const struct FVector2D& InScale);
	void SetSpin(double InValue);
	void SetYaw(double InValue);

	double GetDistanceFromCenter() const;
	double GetLatitude() const;
	double GetLongitude() const;
	struct FTransform GetOrigin() const;
	double GetPitch() const;
	struct FDisplayClusterPositionalParams GetPositionalParams() const;
	double GetRadialOffset() const;
	struct FVector2D GetScale() const;
	double GetSpin() const;
	double GetYaw() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ColorCorrectRegion">();
	}
	static class AColorCorrectRegion* GetDefaultObj()
	{
		return GetDefaultObjImpl<AColorCorrectRegion>();
	}
};
#pragma pack(pop)
static_assert(alignof(AColorCorrectRegion) == 0x000008, "Wrong alignment on AColorCorrectRegion");
static_assert(sizeof(AColorCorrectRegion) == 0x0007A8, "Wrong size on AColorCorrectRegion");
static_assert(offsetof(AColorCorrectRegion, MeshComponents) == 0x0002D0, "Member 'AColorCorrectRegion::MeshComponents' has a wrong offset!");
static_assert(offsetof(AColorCorrectRegion, Type) == 0x0002E0, "Member 'AColorCorrectRegion::Type' has a wrong offset!");
static_assert(offsetof(AColorCorrectRegion, Priority) == 0x0002E4, "Member 'AColorCorrectRegion::Priority' has a wrong offset!");
static_assert(offsetof(AColorCorrectRegion, Intensity) == 0x0002E8, "Member 'AColorCorrectRegion::Intensity' has a wrong offset!");
static_assert(offsetof(AColorCorrectRegion, Inner) == 0x0002EC, "Member 'AColorCorrectRegion::Inner' has a wrong offset!");
static_assert(offsetof(AColorCorrectRegion, Outer_0) == 0x0002F0, "Member 'AColorCorrectRegion::Outer_0' has a wrong offset!");
static_assert(offsetof(AColorCorrectRegion, Falloff) == 0x0002F4, "Member 'AColorCorrectRegion::Falloff' has a wrong offset!");
static_assert(offsetof(AColorCorrectRegion, Invert) == 0x0002F8, "Member 'AColorCorrectRegion::Invert' has a wrong offset!");
static_assert(offsetof(AColorCorrectRegion, TemperatureType) == 0x0002F9, "Member 'AColorCorrectRegion::TemperatureType' has a wrong offset!");
static_assert(offsetof(AColorCorrectRegion, Temperature) == 0x0002FC, "Member 'AColorCorrectRegion::Temperature' has a wrong offset!");
static_assert(offsetof(AColorCorrectRegion, Tint) == 0x000300, "Member 'AColorCorrectRegion::Tint' has a wrong offset!");
static_assert(offsetof(AColorCorrectRegion, ColorGradingSettings) == 0x000310, "Member 'AColorCorrectRegion::ColorGradingSettings' has a wrong offset!");
static_assert(offsetof(AColorCorrectRegion, Enabled) == 0x000640, "Member 'AColorCorrectRegion::Enabled' has a wrong offset!");
static_assert(offsetof(AColorCorrectRegion, bEnablePerActorCC) == 0x000641, "Member 'AColorCorrectRegion::bEnablePerActorCC' has a wrong offset!");
static_assert(offsetof(AColorCorrectRegion, PerActorColorCorrection) == 0x000642, "Member 'AColorCorrectRegion::PerActorColorCorrection' has a wrong offset!");
static_assert(offsetof(AColorCorrectRegion, AffectedActors) == 0x000648, "Member 'AColorCorrectRegion::AffectedActors' has a wrong offset!");
static_assert(offsetof(AColorCorrectRegion, IdentityComponent) == 0x0006E8, "Member 'AColorCorrectRegion::IdentityComponent' has a wrong offset!");
static_assert(offsetof(AColorCorrectRegion, PositionalParams) == 0x0006F0, "Member 'AColorCorrectRegion::PositionalParams' has a wrong offset!");
static_assert(offsetof(AColorCorrectRegion, Origin) == 0x000740, "Member 'AColorCorrectRegion::Origin' has a wrong offset!");

// Class ColorCorrectRegions.ColorCorrectionRegion
// 0x0008 (0x07B0 - 0x07A8)
class AColorCorrectionRegion final : public AColorCorrectRegion
{
public:
	uint8                                         Pad_7A8[0x8];                                      // 0x07A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ColorCorrectionRegion">();
	}
	static class AColorCorrectionRegion* GetDefaultObj()
	{
		return GetDefaultObjImpl<AColorCorrectionRegion>();
	}
};
static_assert(alignof(AColorCorrectionRegion) == 0x000008, "Wrong alignment on AColorCorrectionRegion");
static_assert(sizeof(AColorCorrectionRegion) == 0x0007B0, "Wrong size on AColorCorrectionRegion");

// Class ColorCorrectRegions.ColorCorrectionInvisibleComponent
// 0x0008 (0x0550 - 0x0548)
class UColorCorrectionInvisibleComponent final : public UPrimitiveComponent
{
public:
	uint8                                         Pad_548[0x8];                                      // 0x0548(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ColorCorrectionInvisibleComponent">();
	}
	static class UColorCorrectionInvisibleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UColorCorrectionInvisibleComponent>();
	}
};
static_assert(alignof(UColorCorrectionInvisibleComponent) == 0x000008, "Wrong alignment on UColorCorrectionInvisibleComponent");
static_assert(sizeof(UColorCorrectionInvisibleComponent) == 0x000550, "Wrong size on UColorCorrectionInvisibleComponent");

// Class ColorCorrectRegions.ColorCorrectRegionsSubsystem
// 0x0070 (0x00B0 - 0x0040)
class UColorCorrectRegionsSubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_40[0x70];                                      // 0x0040(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RefreshStenciIdAssignmentForAllCCR();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ColorCorrectRegionsSubsystem">();
	}
	static class UColorCorrectRegionsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UColorCorrectRegionsSubsystem>();
	}
};
static_assert(alignof(UColorCorrectRegionsSubsystem) == 0x000008, "Wrong alignment on UColorCorrectRegionsSubsystem");
static_assert(sizeof(UColorCorrectRegionsSubsystem) == 0x0000B0, "Wrong size on UColorCorrectRegionsSubsystem");

// Class ColorCorrectRegions.ColorCorrectionWindow
// 0x0008 (0x07B0 - 0x07A8)
class AColorCorrectionWindow : public AColorCorrectRegion
{
public:
	EColorCorrectWindowType                       WindowType;                                        // 0x07A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7A9[0x7];                                      // 0x07A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ColorCorrectionWindow">();
	}
	static class AColorCorrectionWindow* GetDefaultObj()
	{
		return GetDefaultObjImpl<AColorCorrectionWindow>();
	}
};
static_assert(alignof(AColorCorrectionWindow) == 0x000008, "Wrong alignment on AColorCorrectionWindow");
static_assert(sizeof(AColorCorrectionWindow) == 0x0007B0, "Wrong size on AColorCorrectionWindow");
static_assert(offsetof(AColorCorrectionWindow, WindowType) == 0x0007A8, "Member 'AColorCorrectionWindow::WindowType' has a wrong offset!");

// Class ColorCorrectRegions.ColorCorrectWindow
// 0x0000 (0x07B0 - 0x07B0)
class AColorCorrectWindow final : public AColorCorrectionWindow
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ColorCorrectWindow">();
	}
	static class AColorCorrectWindow* GetDefaultObj()
	{
		return GetDefaultObjImpl<AColorCorrectWindow>();
	}
};
static_assert(alignof(AColorCorrectWindow) == 0x000008, "Wrong alignment on AColorCorrectWindow");
static_assert(sizeof(AColorCorrectWindow) == 0x0007B0, "Wrong size on AColorCorrectWindow");

}

