#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ColorCorrectRegions

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DisplayClusterLightCardExtender_structs.hpp"


namespace SDK::Params
{

// Function ColorCorrectRegions.ColorCorrectRegion.SetDistanceFromCenter
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_SetDistanceFromCenter final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectRegion_SetDistanceFromCenter) == 0x000008, "Wrong alignment on ColorCorrectRegion_SetDistanceFromCenter");
static_assert(sizeof(ColorCorrectRegion_SetDistanceFromCenter) == 0x000008, "Wrong size on ColorCorrectRegion_SetDistanceFromCenter");
static_assert(offsetof(ColorCorrectRegion_SetDistanceFromCenter, InValue) == 0x000000, "Member 'ColorCorrectRegion_SetDistanceFromCenter::InValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectRegion.SetLatitude
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_SetLatitude final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectRegion_SetLatitude) == 0x000008, "Wrong alignment on ColorCorrectRegion_SetLatitude");
static_assert(sizeof(ColorCorrectRegion_SetLatitude) == 0x000008, "Wrong size on ColorCorrectRegion_SetLatitude");
static_assert(offsetof(ColorCorrectRegion_SetLatitude, InValue) == 0x000000, "Member 'ColorCorrectRegion_SetLatitude::InValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectRegion.SetLongitude
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_SetLongitude final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectRegion_SetLongitude) == 0x000008, "Wrong alignment on ColorCorrectRegion_SetLongitude");
static_assert(sizeof(ColorCorrectRegion_SetLongitude) == 0x000008, "Wrong size on ColorCorrectRegion_SetLongitude");
static_assert(offsetof(ColorCorrectRegion_SetLongitude, InValue) == 0x000000, "Member 'ColorCorrectRegion_SetLongitude::InValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectRegion.SetOrigin
// 0x0060 (0x0060 - 0x0000)
struct ColorCorrectRegion_SetOrigin final
{
public:
	struct FTransform                             InOrigin;                                          // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectRegion_SetOrigin) == 0x000001, "Wrong alignment on ColorCorrectRegion_SetOrigin");
static_assert(sizeof(ColorCorrectRegion_SetOrigin) == 0x000060, "Wrong size on ColorCorrectRegion_SetOrigin");
static_assert(offsetof(ColorCorrectRegion_SetOrigin, InOrigin) == 0x000000, "Member 'ColorCorrectRegion_SetOrigin::InOrigin' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectRegion.SetPitch
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_SetPitch final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectRegion_SetPitch) == 0x000008, "Wrong alignment on ColorCorrectRegion_SetPitch");
static_assert(sizeof(ColorCorrectRegion_SetPitch) == 0x000008, "Wrong size on ColorCorrectRegion_SetPitch");
static_assert(offsetof(ColorCorrectRegion_SetPitch, InValue) == 0x000000, "Member 'ColorCorrectRegion_SetPitch::InValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectRegion.SetPositionalParams
// 0x0048 (0x0048 - 0x0000)
struct ColorCorrectRegion_SetPositionalParams final
{
public:
	struct FDisplayClusterPositionalParams        InParams;                                          // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectRegion_SetPositionalParams) == 0x000001, "Wrong alignment on ColorCorrectRegion_SetPositionalParams");
static_assert(sizeof(ColorCorrectRegion_SetPositionalParams) == 0x000048, "Wrong size on ColorCorrectRegion_SetPositionalParams");
static_assert(offsetof(ColorCorrectRegion_SetPositionalParams, InParams) == 0x000000, "Member 'ColorCorrectRegion_SetPositionalParams::InParams' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectRegion.SetRadialOffset
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_SetRadialOffset final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectRegion_SetRadialOffset) == 0x000008, "Wrong alignment on ColorCorrectRegion_SetRadialOffset");
static_assert(sizeof(ColorCorrectRegion_SetRadialOffset) == 0x000008, "Wrong size on ColorCorrectRegion_SetRadialOffset");
static_assert(offsetof(ColorCorrectRegion_SetRadialOffset, InValue) == 0x000000, "Member 'ColorCorrectRegion_SetRadialOffset::InValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectRegion.SetScale
// 0x0010 (0x0010 - 0x0000)
struct ColorCorrectRegion_SetScale final
{
public:
	struct FVector2D                              InScale;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectRegion_SetScale) == 0x000001, "Wrong alignment on ColorCorrectRegion_SetScale");
static_assert(sizeof(ColorCorrectRegion_SetScale) == 0x000010, "Wrong size on ColorCorrectRegion_SetScale");
static_assert(offsetof(ColorCorrectRegion_SetScale, InScale) == 0x000000, "Member 'ColorCorrectRegion_SetScale::InScale' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectRegion.SetSpin
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_SetSpin final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectRegion_SetSpin) == 0x000008, "Wrong alignment on ColorCorrectRegion_SetSpin");
static_assert(sizeof(ColorCorrectRegion_SetSpin) == 0x000008, "Wrong size on ColorCorrectRegion_SetSpin");
static_assert(offsetof(ColorCorrectRegion_SetSpin, InValue) == 0x000000, "Member 'ColorCorrectRegion_SetSpin::InValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectRegion.SetYaw
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_SetYaw final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectRegion_SetYaw) == 0x000008, "Wrong alignment on ColorCorrectRegion_SetYaw");
static_assert(sizeof(ColorCorrectRegion_SetYaw) == 0x000008, "Wrong size on ColorCorrectRegion_SetYaw");
static_assert(offsetof(ColorCorrectRegion_SetYaw, InValue) == 0x000000, "Member 'ColorCorrectRegion_SetYaw::InValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectRegion.GetDistanceFromCenter
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_GetDistanceFromCenter final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectRegion_GetDistanceFromCenter) == 0x000008, "Wrong alignment on ColorCorrectRegion_GetDistanceFromCenter");
static_assert(sizeof(ColorCorrectRegion_GetDistanceFromCenter) == 0x000008, "Wrong size on ColorCorrectRegion_GetDistanceFromCenter");
static_assert(offsetof(ColorCorrectRegion_GetDistanceFromCenter, ReturnValue) == 0x000000, "Member 'ColorCorrectRegion_GetDistanceFromCenter::ReturnValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectRegion.GetLatitude
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_GetLatitude final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectRegion_GetLatitude) == 0x000008, "Wrong alignment on ColorCorrectRegion_GetLatitude");
static_assert(sizeof(ColorCorrectRegion_GetLatitude) == 0x000008, "Wrong size on ColorCorrectRegion_GetLatitude");
static_assert(offsetof(ColorCorrectRegion_GetLatitude, ReturnValue) == 0x000000, "Member 'ColorCorrectRegion_GetLatitude::ReturnValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectRegion.GetLongitude
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_GetLongitude final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectRegion_GetLongitude) == 0x000008, "Wrong alignment on ColorCorrectRegion_GetLongitude");
static_assert(sizeof(ColorCorrectRegion_GetLongitude) == 0x000008, "Wrong size on ColorCorrectRegion_GetLongitude");
static_assert(offsetof(ColorCorrectRegion_GetLongitude, ReturnValue) == 0x000000, "Member 'ColorCorrectRegion_GetLongitude::ReturnValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectRegion.GetOrigin
// 0x0060 (0x0060 - 0x0000)
struct ColorCorrectRegion_GetOrigin final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectRegion_GetOrigin) == 0x000001, "Wrong alignment on ColorCorrectRegion_GetOrigin");
static_assert(sizeof(ColorCorrectRegion_GetOrigin) == 0x000060, "Wrong size on ColorCorrectRegion_GetOrigin");
static_assert(offsetof(ColorCorrectRegion_GetOrigin, ReturnValue) == 0x000000, "Member 'ColorCorrectRegion_GetOrigin::ReturnValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectRegion.GetPitch
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_GetPitch final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectRegion_GetPitch) == 0x000008, "Wrong alignment on ColorCorrectRegion_GetPitch");
static_assert(sizeof(ColorCorrectRegion_GetPitch) == 0x000008, "Wrong size on ColorCorrectRegion_GetPitch");
static_assert(offsetof(ColorCorrectRegion_GetPitch, ReturnValue) == 0x000000, "Member 'ColorCorrectRegion_GetPitch::ReturnValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectRegion.GetPositionalParams
// 0x0048 (0x0048 - 0x0000)
struct ColorCorrectRegion_GetPositionalParams final
{
public:
	struct FDisplayClusterPositionalParams        ReturnValue;                                       // 0x0000(0x0048)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectRegion_GetPositionalParams) == 0x000001, "Wrong alignment on ColorCorrectRegion_GetPositionalParams");
static_assert(sizeof(ColorCorrectRegion_GetPositionalParams) == 0x000048, "Wrong size on ColorCorrectRegion_GetPositionalParams");
static_assert(offsetof(ColorCorrectRegion_GetPositionalParams, ReturnValue) == 0x000000, "Member 'ColorCorrectRegion_GetPositionalParams::ReturnValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectRegion.GetRadialOffset
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_GetRadialOffset final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectRegion_GetRadialOffset) == 0x000008, "Wrong alignment on ColorCorrectRegion_GetRadialOffset");
static_assert(sizeof(ColorCorrectRegion_GetRadialOffset) == 0x000008, "Wrong size on ColorCorrectRegion_GetRadialOffset");
static_assert(offsetof(ColorCorrectRegion_GetRadialOffset, ReturnValue) == 0x000000, "Member 'ColorCorrectRegion_GetRadialOffset::ReturnValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectRegion.GetScale
// 0x0010 (0x0010 - 0x0000)
struct ColorCorrectRegion_GetScale final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectRegion_GetScale) == 0x000001, "Wrong alignment on ColorCorrectRegion_GetScale");
static_assert(sizeof(ColorCorrectRegion_GetScale) == 0x000010, "Wrong size on ColorCorrectRegion_GetScale");
static_assert(offsetof(ColorCorrectRegion_GetScale, ReturnValue) == 0x000000, "Member 'ColorCorrectRegion_GetScale::ReturnValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectRegion.GetSpin
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_GetSpin final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectRegion_GetSpin) == 0x000008, "Wrong alignment on ColorCorrectRegion_GetSpin");
static_assert(sizeof(ColorCorrectRegion_GetSpin) == 0x000008, "Wrong size on ColorCorrectRegion_GetSpin");
static_assert(offsetof(ColorCorrectRegion_GetSpin, ReturnValue) == 0x000000, "Member 'ColorCorrectRegion_GetSpin::ReturnValue' has a wrong offset!");

// Function ColorCorrectRegions.ColorCorrectRegion.GetYaw
// 0x0008 (0x0008 - 0x0000)
struct ColorCorrectRegion_GetYaw final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ColorCorrectRegion_GetYaw) == 0x000008, "Wrong alignment on ColorCorrectRegion_GetYaw");
static_assert(sizeof(ColorCorrectRegion_GetYaw) == 0x000008, "Wrong size on ColorCorrectRegion_GetYaw");
static_assert(offsetof(ColorCorrectRegion_GetYaw, ReturnValue) == 0x000000, "Member 'ColorCorrectRegion_GetYaw::ReturnValue' has a wrong offset!");

}

