#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonDefine

#include "Basic.hpp"


namespace SDK
{

// Enum CommonDefine.OpActivityState
// NumValues: 0x0006
enum class EOpActivityState : uint8
{
	OP_ACTIVITY_STATE_NONE                   = 0,
	OP_ACTIVITY_STATE_NOTIFY                 = 1,
	OP_ACTIVITY_STATE_OPEN                   = 2,
	OP_ACTIVITY_STATE_CLOSE                  = 3,
	OP_ACTIVITY_STATE_REMOVE                 = 4,
	OP_ACTIVITY_STATE_MAX                    = 5,
};

// Enum CommonDefine.EClockIntervalType
// NumValues: 0x0009
enum class EClockIntervalType : uint8
{
	EVERY_MINUTE                             = 0,
	EVERY_HOUR                               = 1,
	EVERY_DAY                                = 2,
	EVERY_WEEK                               = 3,
	EVERY_MOUTH                              = 4,
	EVERY_YEAR                               = 5,
	INTERVAL_DAYS                            = 6,
	SPECIFY_TIME                             = 7,
	EClockIntervalType_MAX                   = 8,
};

// Enum CommonDefine.FTeamCloneStateType
// NumValues: 0x0005
enum class EFTeamCloneStateType : uint8
{
	TeamCloneState_Normal                    = 0,
	TeamCloneState_Client                    = 1,
	TeamCloneState_Server                    = 2,
	TeamCloneState_Cross                     = 3,
	TeamCloneState_MAX                       = 4,
};

// Enum CommonDefine.FTeamVoiceType
// NumValues: 0x0006
enum class EFTeamVoiceType : uint8
{
	STATE_INVALID                            = 0,
	STATE_RECEIVE_SEND                       = 1,
	STATE_ONLY_RECEIVE                       = 2,
	STATE_ONLY_SEND                          = 4,
	STATE_MUTE                               = 8,
	STATE_MAX                                = 9,
};

// ScriptStruct CommonDefine.ClockData
// 0x0018 (0x0018 - 0x0000)
struct FClockData final
{
public:
	int32                                         Year;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Month;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Day;                                               // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Hour;                                              // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         minute;                                            // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Second;                                            // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FClockData) == 0x000004, "Wrong alignment on FClockData");
static_assert(sizeof(FClockData) == 0x000018, "Wrong size on FClockData");
static_assert(offsetof(FClockData, Year) == 0x000000, "Member 'FClockData::Year' has a wrong offset!");
static_assert(offsetof(FClockData, Month) == 0x000004, "Member 'FClockData::Month' has a wrong offset!");
static_assert(offsetof(FClockData, Day) == 0x000008, "Member 'FClockData::Day' has a wrong offset!");
static_assert(offsetof(FClockData, Hour) == 0x00000C, "Member 'FClockData::Hour' has a wrong offset!");
static_assert(offsetof(FClockData, minute) == 0x000010, "Member 'FClockData::minute' has a wrong offset!");
static_assert(offsetof(FClockData, Second) == 0x000014, "Member 'FClockData::Second' has a wrong offset!");

}

