#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CompositeCore

#include "Basic.hpp"


namespace SDK::Params
{

// Function CompositeCore.CompositeCoreSubsystem.RegisterPrimitive
// 0x0008 (0x0008 - 0x0000)
struct CompositeCoreSubsystem_RegisterPrimitive final
{
public:
	class UPrimitiveComponent*                    InPrimitiveComponent;                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CompositeCoreSubsystem_RegisterPrimitive) == 0x000008, "Wrong alignment on CompositeCoreSubsystem_RegisterPrimitive");
static_assert(sizeof(CompositeCoreSubsystem_RegisterPrimitive) == 0x000008, "Wrong size on CompositeCoreSubsystem_RegisterPrimitive");
static_assert(offsetof(CompositeCoreSubsystem_RegisterPrimitive, InPrimitiveComponent) == 0x000000, "Member 'CompositeCoreSubsystem_RegisterPrimitive::InPrimitiveComponent' has a wrong offset!");

// Function CompositeCore.CompositeCoreSubsystem.UnregisterPrimitive
// 0x0008 (0x0008 - 0x0000)
struct CompositeCoreSubsystem_UnregisterPrimitive final
{
public:
	class UPrimitiveComponent*                    InPrimitiveComponent;                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CompositeCoreSubsystem_UnregisterPrimitive) == 0x000008, "Wrong alignment on CompositeCoreSubsystem_UnregisterPrimitive");
static_assert(sizeof(CompositeCoreSubsystem_UnregisterPrimitive) == 0x000008, "Wrong size on CompositeCoreSubsystem_UnregisterPrimitive");
static_assert(offsetof(CompositeCoreSubsystem_UnregisterPrimitive, InPrimitiveComponent) == 0x000000, "Member 'CompositeCoreSubsystem_UnregisterPrimitive::InPrimitiveComponent' has a wrong offset!");

// Function CompositeCore.HoldoutCompositeComponent.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct HoldoutCompositeComponent_SetEnabled final
{
public:
	bool                                          bInEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoldoutCompositeComponent_SetEnabled) == 0x000001, "Wrong alignment on HoldoutCompositeComponent_SetEnabled");
static_assert(sizeof(HoldoutCompositeComponent_SetEnabled) == 0x000001, "Wrong size on HoldoutCompositeComponent_SetEnabled");
static_assert(offsetof(HoldoutCompositeComponent_SetEnabled, bInEnabled) == 0x000000, "Member 'HoldoutCompositeComponent_SetEnabled::bInEnabled' has a wrong offset!");

// Function CompositeCore.HoldoutCompositeComponent.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct HoldoutCompositeComponent_IsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoldoutCompositeComponent_IsEnabled) == 0x000001, "Wrong alignment on HoldoutCompositeComponent_IsEnabled");
static_assert(sizeof(HoldoutCompositeComponent_IsEnabled) == 0x000001, "Wrong size on HoldoutCompositeComponent_IsEnabled");
static_assert(offsetof(HoldoutCompositeComponent_IsEnabled, ReturnValue) == 0x000000, "Member 'HoldoutCompositeComponent_IsEnabled::ReturnValue' has a wrong offset!");

}

