#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlRig

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ControlRig_structs.hpp"
#include "RigVM_structs.hpp"
#include "AnimationCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ControlRig.ControlRigShapeLibraryLink.SetShapeLibrary
// 0x0028 (0x0028 - 0x0000)
struct ControlRigShapeLibraryLink_SetShapeLibrary final
{
public:
	TSoftObjectPtr<class UControlRigShapeLibrary> InShapeLibrary;                                    // 0x0000(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ControlRigShapeLibraryLink_SetShapeLibrary) == 0x000008, "Wrong alignment on ControlRigShapeLibraryLink_SetShapeLibrary");
static_assert(sizeof(ControlRigShapeLibraryLink_SetShapeLibrary) == 0x000028, "Wrong size on ControlRigShapeLibraryLink_SetShapeLibrary");
static_assert(offsetof(ControlRigShapeLibraryLink_SetShapeLibrary, InShapeLibrary) == 0x000000, "Member 'ControlRigShapeLibraryLink_SetShapeLibrary::InShapeLibrary' has a wrong offset!");

// Function ControlRig.ControlRigShapeLibraryLink.GetShapeLibrary
// 0x0028 (0x0028 - 0x0000)
struct ControlRigShapeLibraryLink_GetShapeLibrary final
{
public:
	TSoftObjectPtr<class UControlRigShapeLibrary> ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ControlRigShapeLibraryLink_GetShapeLibrary) == 0x000008, "Wrong alignment on ControlRigShapeLibraryLink_GetShapeLibrary");
static_assert(sizeof(ControlRigShapeLibraryLink_GetShapeLibrary) == 0x000028, "Wrong size on ControlRigShapeLibraryLink_GetShapeLibrary");
static_assert(offsetof(ControlRigShapeLibraryLink_GetShapeLibrary, ReturnValue) == 0x000000, "Member 'ControlRigShapeLibraryLink_GetShapeLibrary::ReturnValue' has a wrong offset!");

// Function ControlRig.ControlRig.FindControlRigs
// 0x0020 (0x0020 - 0x0000)
struct ControlRig_FindControlRigs final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UControlRig>                OptionalClass;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UControlRig*>                    ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ControlRig_FindControlRigs) == 0x000008, "Wrong alignment on ControlRig_FindControlRigs");
static_assert(sizeof(ControlRig_FindControlRigs) == 0x000020, "Wrong size on ControlRig_FindControlRigs");
static_assert(offsetof(ControlRig_FindControlRigs, Outer_0) == 0x000000, "Member 'ControlRig_FindControlRigs::Outer_0' has a wrong offset!");
static_assert(offsetof(ControlRig_FindControlRigs, OptionalClass) == 0x000008, "Member 'ControlRig_FindControlRigs::OptionalClass' has a wrong offset!");
static_assert(offsetof(ControlRig_FindControlRigs, ReturnValue) == 0x000010, "Member 'ControlRig_FindControlRigs::ReturnValue' has a wrong offset!");

// Function ControlRig.ControlRig.ClearControlSelection
// 0x0002 (0x0002 - 0x0000)
struct ControlRig_ClearControlSelection final
{
public:
	bool                                          bSetupUndo;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ControlRig_ClearControlSelection) == 0x000001, "Wrong alignment on ControlRig_ClearControlSelection");
static_assert(sizeof(ControlRig_ClearControlSelection) == 0x000002, "Wrong size on ControlRig_ClearControlSelection");
static_assert(offsetof(ControlRig_ClearControlSelection, bSetupUndo) == 0x000000, "Member 'ControlRig_ClearControlSelection::bSetupUndo' has a wrong offset!");
static_assert(offsetof(ControlRig_ClearControlSelection, ReturnValue) == 0x000001, "Member 'ControlRig_ClearControlSelection::ReturnValue' has a wrong offset!");

// Function ControlRig.ControlRig.GetHierarchy
// 0x0008 (0x0008 - 0x0000)
struct ControlRig_GetHierarchy final
{
public:
	class URigHierarchy*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ControlRig_GetHierarchy) == 0x000008, "Wrong alignment on ControlRig_GetHierarchy");
static_assert(sizeof(ControlRig_GetHierarchy) == 0x000008, "Wrong size on ControlRig_GetHierarchy");
static_assert(offsetof(ControlRig_GetHierarchy, ReturnValue) == 0x000000, "Member 'ControlRig_GetHierarchy::ReturnValue' has a wrong offset!");

// Function ControlRig.ControlRig.SelectControl
// 0x000C (0x000C - 0x0000)
struct ControlRig_SelectControl final
{
public:
	class FName                                   InControlName;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelect;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetupUndo;                                        // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ControlRig_SelectControl) == 0x000004, "Wrong alignment on ControlRig_SelectControl");
static_assert(sizeof(ControlRig_SelectControl) == 0x00000C, "Wrong size on ControlRig_SelectControl");
static_assert(offsetof(ControlRig_SelectControl, InControlName) == 0x000000, "Member 'ControlRig_SelectControl::InControlName' has a wrong offset!");
static_assert(offsetof(ControlRig_SelectControl, bSelect) == 0x000008, "Member 'ControlRig_SelectControl::bSelect' has a wrong offset!");
static_assert(offsetof(ControlRig_SelectControl, bSetupUndo) == 0x000009, "Member 'ControlRig_SelectControl::bSetupUndo' has a wrong offset!");

// Function ControlRig.ControlRig.SetInteractionRig
// 0x0008 (0x0008 - 0x0000)
struct ControlRig_SetInteractionRig final
{
public:
	class UControlRig*                            InInteractionRig;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ControlRig_SetInteractionRig) == 0x000008, "Wrong alignment on ControlRig_SetInteractionRig");
static_assert(sizeof(ControlRig_SetInteractionRig) == 0x000008, "Wrong size on ControlRig_SetInteractionRig");
static_assert(offsetof(ControlRig_SetInteractionRig, InInteractionRig) == 0x000000, "Member 'ControlRig_SetInteractionRig::InInteractionRig' has a wrong offset!");

// Function ControlRig.ControlRig.SetInteractionRigClass
// 0x0008 (0x0008 - 0x0000)
struct ControlRig_SetInteractionRigClass final
{
public:
	TSubclassOf<class UControlRig>                InInteractionRigClass;                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ControlRig_SetInteractionRigClass) == 0x000008, "Wrong alignment on ControlRig_SetInteractionRigClass");
static_assert(sizeof(ControlRig_SetInteractionRigClass) == 0x000008, "Wrong size on ControlRig_SetInteractionRigClass");
static_assert(offsetof(ControlRig_SetInteractionRigClass, InInteractionRigClass) == 0x000000, "Member 'ControlRig_SetInteractionRigClass::InInteractionRigClass' has a wrong offset!");

// Function ControlRig.ControlRig.CreateTransformableControlHandle
// 0x0010 (0x0010 - 0x0000)
struct ControlRig_CreateTransformableControlHandle final
{
public:
	class FName                                   ControlName;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTransformableControlHandle*            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ControlRig_CreateTransformableControlHandle) == 0x000008, "Wrong alignment on ControlRig_CreateTransformableControlHandle");
static_assert(sizeof(ControlRig_CreateTransformableControlHandle) == 0x000010, "Wrong size on ControlRig_CreateTransformableControlHandle");
static_assert(offsetof(ControlRig_CreateTransformableControlHandle, ControlName) == 0x000000, "Member 'ControlRig_CreateTransformableControlHandle::ControlName' has a wrong offset!");
static_assert(offsetof(ControlRig_CreateTransformableControlHandle, ReturnValue) == 0x000008, "Member 'ControlRig_CreateTransformableControlHandle::ReturnValue' has a wrong offset!");

// Function ControlRig.ControlRig.CurrentControlSelection
// 0x0010 (0x0010 - 0x0000)
struct ControlRig_CurrentControlSelection final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ControlRig_CurrentControlSelection) == 0x000008, "Wrong alignment on ControlRig_CurrentControlSelection");
static_assert(sizeof(ControlRig_CurrentControlSelection) == 0x000010, "Wrong size on ControlRig_CurrentControlSelection");
static_assert(offsetof(ControlRig_CurrentControlSelection, ReturnValue) == 0x000000, "Member 'ControlRig_CurrentControlSelection::ReturnValue' has a wrong offset!");

// Function ControlRig.ControlRig.GetHostingActor
// 0x0008 (0x0008 - 0x0000)
struct ControlRig_GetHostingActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ControlRig_GetHostingActor) == 0x000008, "Wrong alignment on ControlRig_GetHostingActor");
static_assert(sizeof(ControlRig_GetHostingActor) == 0x000008, "Wrong size on ControlRig_GetHostingActor");
static_assert(offsetof(ControlRig_GetHostingActor, ReturnValue) == 0x000000, "Member 'ControlRig_GetHostingActor::ReturnValue' has a wrong offset!");

// Function ControlRig.ControlRig.GetInteractionRig
// 0x0008 (0x0008 - 0x0000)
struct ControlRig_GetInteractionRig final
{
public:
	class UControlRig*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ControlRig_GetInteractionRig) == 0x000008, "Wrong alignment on ControlRig_GetInteractionRig");
static_assert(sizeof(ControlRig_GetInteractionRig) == 0x000008, "Wrong size on ControlRig_GetInteractionRig");
static_assert(offsetof(ControlRig_GetInteractionRig, ReturnValue) == 0x000000, "Member 'ControlRig_GetInteractionRig::ReturnValue' has a wrong offset!");

// Function ControlRig.ControlRig.GetInteractionRigClass
// 0x0008 (0x0008 - 0x0000)
struct ControlRig_GetInteractionRigClass final
{
public:
	TSubclassOf<class UControlRig>                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ControlRig_GetInteractionRigClass) == 0x000008, "Wrong alignment on ControlRig_GetInteractionRigClass");
static_assert(sizeof(ControlRig_GetInteractionRigClass) == 0x000008, "Wrong size on ControlRig_GetInteractionRigClass");
static_assert(offsetof(ControlRig_GetInteractionRigClass, ReturnValue) == 0x000000, "Member 'ControlRig_GetInteractionRigClass::ReturnValue' has a wrong offset!");

// Function ControlRig.ControlRig.IsControlSelected
// 0x000C (0x000C - 0x0000)
struct ControlRig_IsControlSelected final
{
public:
	class FName                                   InControlName;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ControlRig_IsControlSelected) == 0x000004, "Wrong alignment on ControlRig_IsControlSelected");
static_assert(sizeof(ControlRig_IsControlSelected) == 0x00000C, "Wrong size on ControlRig_IsControlSelected");
static_assert(offsetof(ControlRig_IsControlSelected, InControlName) == 0x000000, "Member 'ControlRig_IsControlSelected::InControlName' has a wrong offset!");
static_assert(offsetof(ControlRig_IsControlSelected, ReturnValue) == 0x000008, "Member 'ControlRig_IsControlSelected::ReturnValue' has a wrong offset!");

// Function ControlRig.ControlRig.SupportsBackwardsSolve
// 0x0001 (0x0001 - 0x0000)
struct ControlRig_SupportsBackwardsSolve final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ControlRig_SupportsBackwardsSolve) == 0x000001, "Wrong alignment on ControlRig_SupportsBackwardsSolve");
static_assert(sizeof(ControlRig_SupportsBackwardsSolve) == 0x000001, "Wrong size on ControlRig_SupportsBackwardsSolve");
static_assert(offsetof(ControlRig_SupportsBackwardsSolve, ReturnValue) == 0x000000, "Member 'ControlRig_SupportsBackwardsSolve::ReturnValue' has a wrong offset!");

// Function ControlRig.ModularRig.ExecuteEventOnAllModules
// 0x0018 (0x0018 - 0x0000)
struct ModularRig_ExecuteEventOnAllModules final
{
public:
	class FName                                   InEvent;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularRig_ExecuteEventOnAllModules) == 0x000008, "Wrong alignment on ModularRig_ExecuteEventOnAllModules");
static_assert(sizeof(ModularRig_ExecuteEventOnAllModules) == 0x000018, "Wrong size on ModularRig_ExecuteEventOnAllModules");
static_assert(offsetof(ModularRig_ExecuteEventOnAllModules, InEvent) == 0x000000, "Member 'ModularRig_ExecuteEventOnAllModules::InEvent' has a wrong offset!");
static_assert(offsetof(ModularRig_ExecuteEventOnAllModules, ReturnValue) == 0x000008, "Member 'ModularRig_ExecuteEventOnAllModules::ReturnValue' has a wrong offset!");

// Function ControlRig.ModularRig.ExecuteEventOnModuleByNameForBP
// 0x0014 (0x0014 - 0x0000)
struct ModularRig_ExecuteEventOnModuleByNameForBP final
{
public:
	class FName                                   InEvent;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InModuleName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModularRig_ExecuteEventOnModuleByNameForBP) == 0x000004, "Wrong alignment on ModularRig_ExecuteEventOnModuleByNameForBP");
static_assert(sizeof(ModularRig_ExecuteEventOnModuleByNameForBP) == 0x000014, "Wrong size on ModularRig_ExecuteEventOnModuleByNameForBP");
static_assert(offsetof(ModularRig_ExecuteEventOnModuleByNameForBP, InEvent) == 0x000000, "Member 'ModularRig_ExecuteEventOnModuleByNameForBP::InEvent' has a wrong offset!");
static_assert(offsetof(ModularRig_ExecuteEventOnModuleByNameForBP, InModuleName) == 0x000008, "Member 'ModularRig_ExecuteEventOnModuleByNameForBP::InModuleName' has a wrong offset!");
static_assert(offsetof(ModularRig_ExecuteEventOnModuleByNameForBP, ReturnValue) == 0x000010, "Member 'ModularRig_ExecuteEventOnModuleByNameForBP::ReturnValue' has a wrong offset!");

// Function ControlRig.ModularRig.ExecuteEventOnModuleForBP
// 0x0020 (0x0020 - 0x0000)
struct ModularRig_ExecuteEventOnModuleForBP final
{
public:
	class FName                                   InEvent;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InModulePath;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ModularRig_ExecuteEventOnModuleForBP) == 0x000008, "Wrong alignment on ModularRig_ExecuteEventOnModuleForBP");
static_assert(sizeof(ModularRig_ExecuteEventOnModuleForBP) == 0x000020, "Wrong size on ModularRig_ExecuteEventOnModuleForBP");
static_assert(offsetof(ModularRig_ExecuteEventOnModuleForBP, InEvent) == 0x000000, "Member 'ModularRig_ExecuteEventOnModuleForBP::InEvent' has a wrong offset!");
static_assert(offsetof(ModularRig_ExecuteEventOnModuleForBP, InModulePath) == 0x000008, "Member 'ModularRig_ExecuteEventOnModuleForBP::InModulePath' has a wrong offset!");
static_assert(offsetof(ModularRig_ExecuteEventOnModuleForBP, ReturnValue) == 0x000018, "Member 'ModularRig_ExecuteEventOnModuleForBP::ReturnValue' has a wrong offset!");

// Function ControlRig.ModularRig.GetModuleRig
// 0x0018 (0x0018 - 0x0000)
struct ModularRig_GetModuleRig final
{
public:
	class FString                                 InModulePath;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UControlRig*                            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularRig_GetModuleRig) == 0x000008, "Wrong alignment on ModularRig_GetModuleRig");
static_assert(sizeof(ModularRig_GetModuleRig) == 0x000018, "Wrong size on ModularRig_GetModuleRig");
static_assert(offsetof(ModularRig_GetModuleRig, InModulePath) == 0x000000, "Member 'ModularRig_GetModuleRig::InModulePath' has a wrong offset!");
static_assert(offsetof(ModularRig_GetModuleRig, ReturnValue) == 0x000010, "Member 'ModularRig_GetModuleRig::ReturnValue' has a wrong offset!");

// Function ControlRig.ModularRig.GetModuleRigByName
// 0x0010 (0x0010 - 0x0000)
struct ModularRig_GetModuleRigByName final
{
public:
	class FName                                   InModuleName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UControlRig*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularRig_GetModuleRigByName) == 0x000008, "Wrong alignment on ModularRig_GetModuleRigByName");
static_assert(sizeof(ModularRig_GetModuleRigByName) == 0x000010, "Wrong size on ModularRig_GetModuleRigByName");
static_assert(offsetof(ModularRig_GetModuleRigByName, InModuleName) == 0x000000, "Member 'ModularRig_GetModuleRigByName::InModuleName' has a wrong offset!");
static_assert(offsetof(ModularRig_GetModuleRigByName, ReturnValue) == 0x000008, "Member 'ModularRig_GetModuleRigByName::ReturnValue' has a wrong offset!");

// Function ControlRig.ModularRig.GetEventsForAllModules
// 0x0010 (0x0010 - 0x0000)
struct ModularRig_GetEventsForAllModules final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularRig_GetEventsForAllModules) == 0x000008, "Wrong alignment on ModularRig_GetEventsForAllModules");
static_assert(sizeof(ModularRig_GetEventsForAllModules) == 0x000010, "Wrong size on ModularRig_GetEventsForAllModules");
static_assert(offsetof(ModularRig_GetEventsForAllModules, ReturnValue) == 0x000000, "Member 'ModularRig_GetEventsForAllModules::ReturnValue' has a wrong offset!");

// Function ControlRig.ModularRig.GetEventsForModule
// 0x0020 (0x0020 - 0x0000)
struct ModularRig_GetEventsForModule final
{
public:
	class FString                                 InModulePath;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularRig_GetEventsForModule) == 0x000008, "Wrong alignment on ModularRig_GetEventsForModule");
static_assert(sizeof(ModularRig_GetEventsForModule) == 0x000020, "Wrong size on ModularRig_GetEventsForModule");
static_assert(offsetof(ModularRig_GetEventsForModule, InModulePath) == 0x000000, "Member 'ModularRig_GetEventsForModule::InModulePath' has a wrong offset!");
static_assert(offsetof(ModularRig_GetEventsForModule, ReturnValue) == 0x000010, "Member 'ModularRig_GetEventsForModule::ReturnValue' has a wrong offset!");

// Function ControlRig.ModularRig.GetEventsForModuleByName
// 0x0018 (0x0018 - 0x0000)
struct ModularRig_GetEventsForModuleByName final
{
public:
	class FName                                   InModuleName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularRig_GetEventsForModuleByName) == 0x000008, "Wrong alignment on ModularRig_GetEventsForModuleByName");
static_assert(sizeof(ModularRig_GetEventsForModuleByName) == 0x000018, "Wrong size on ModularRig_GetEventsForModuleByName");
static_assert(offsetof(ModularRig_GetEventsForModuleByName, InModuleName) == 0x000000, "Member 'ModularRig_GetEventsForModuleByName::InModuleName' has a wrong offset!");
static_assert(offsetof(ModularRig_GetEventsForModuleByName, ReturnValue) == 0x000008, "Member 'ModularRig_GetEventsForModuleByName::ReturnValue' has a wrong offset!");

// Function ControlRig.ModularRig.GetModuleNames
// 0x0010 (0x0010 - 0x0000)
struct ModularRig_GetModuleNames final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularRig_GetModuleNames) == 0x000008, "Wrong alignment on ModularRig_GetModuleNames");
static_assert(sizeof(ModularRig_GetModuleNames) == 0x000010, "Wrong size on ModularRig_GetModuleNames");
static_assert(offsetof(ModularRig_GetModuleNames, ReturnValue) == 0x000000, "Member 'ModularRig_GetModuleNames::ReturnValue' has a wrong offset!");

// Function ControlRig.ModularRig.GetModulePaths
// 0x0010 (0x0010 - 0x0000)
struct ModularRig_GetModulePaths final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularRig_GetModulePaths) == 0x000008, "Wrong alignment on ModularRig_GetModulePaths");
static_assert(sizeof(ModularRig_GetModulePaths) == 0x000010, "Wrong size on ModularRig_GetModulePaths");
static_assert(offsetof(ModularRig_GetModulePaths, ReturnValue) == 0x000000, "Member 'ModularRig_GetModulePaths::ReturnValue' has a wrong offset!");

// Function ControlRig.ModularRig.GetParentModuleNameForBP
// 0x0010 (0x0010 - 0x0000)
struct ModularRig_GetParentModuleNameForBP final
{
public:
	class FName                                   InModuleName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularRig_GetParentModuleNameForBP) == 0x000004, "Wrong alignment on ModularRig_GetParentModuleNameForBP");
static_assert(sizeof(ModularRig_GetParentModuleNameForBP) == 0x000010, "Wrong size on ModularRig_GetParentModuleNameForBP");
static_assert(offsetof(ModularRig_GetParentModuleNameForBP, InModuleName) == 0x000000, "Member 'ModularRig_GetParentModuleNameForBP::InModuleName' has a wrong offset!");
static_assert(offsetof(ModularRig_GetParentModuleNameForBP, ReturnValue) == 0x000008, "Member 'ModularRig_GetParentModuleNameForBP::ReturnValue' has a wrong offset!");

// Function ControlRig.ModularRig.GetParentPathForBP
// 0x0020 (0x0020 - 0x0000)
struct ModularRig_GetParentPathForBP final
{
public:
	class FString                                 InModulePath;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ModularRig_GetParentPathForBP) == 0x000008, "Wrong alignment on ModularRig_GetParentPathForBP");
static_assert(sizeof(ModularRig_GetParentPathForBP) == 0x000020, "Wrong size on ModularRig_GetParentPathForBP");
static_assert(offsetof(ModularRig_GetParentPathForBP, InModulePath) == 0x000000, "Member 'ModularRig_GetParentPathForBP::InModulePath' has a wrong offset!");
static_assert(offsetof(ModularRig_GetParentPathForBP, ReturnValue) == 0x000010, "Member 'ModularRig_GetParentPathForBP::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.GetEulerTransformFromControlValue
// 0x00D0 (0x00D0 - 0x0000)
struct RigHierarchy_GetEulerTransformFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEulerTransform                        ReturnValue;                                       // 0x0088(0x0048)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_GetEulerTransformFromControlValue) == 0x000001, "Wrong alignment on RigHierarchy_GetEulerTransformFromControlValue");
static_assert(sizeof(RigHierarchy_GetEulerTransformFromControlValue) == 0x0000D0, "Wrong size on RigHierarchy_GetEulerTransformFromControlValue");
static_assert(offsetof(RigHierarchy_GetEulerTransformFromControlValue, InValue) == 0x000000, "Member 'RigHierarchy_GetEulerTransformFromControlValue::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_GetEulerTransformFromControlValue, ReturnValue) == 0x000088, "Member 'RigHierarchy_GetEulerTransformFromControlValue::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.GetFloatFromControlValue
// 0x0088 (0x0088 - 0x0000)
struct RigHierarchy_GetFloatFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0084(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_GetFloatFromControlValue) == 0x000004, "Wrong alignment on RigHierarchy_GetFloatFromControlValue");
static_assert(sizeof(RigHierarchy_GetFloatFromControlValue) == 0x000088, "Wrong size on RigHierarchy_GetFloatFromControlValue");
static_assert(offsetof(RigHierarchy_GetFloatFromControlValue, InValue) == 0x000000, "Member 'RigHierarchy_GetFloatFromControlValue::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_GetFloatFromControlValue, ReturnValue) == 0x000084, "Member 'RigHierarchy_GetFloatFromControlValue::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.GetIntFromControlValue
// 0x0088 (0x0088 - 0x0000)
struct RigHierarchy_GetIntFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0084(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_GetIntFromControlValue) == 0x000004, "Wrong alignment on RigHierarchy_GetIntFromControlValue");
static_assert(sizeof(RigHierarchy_GetIntFromControlValue) == 0x000088, "Wrong size on RigHierarchy_GetIntFromControlValue");
static_assert(offsetof(RigHierarchy_GetIntFromControlValue, InValue) == 0x000000, "Member 'RigHierarchy_GetIntFromControlValue::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_GetIntFromControlValue, ReturnValue) == 0x000084, "Member 'RigHierarchy_GetIntFromControlValue::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.GetRotatorFromControlValue
// 0x00A0 (0x00A0 - 0x0000)
struct RigHierarchy_GetRotatorFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ReturnValue;                                       // 0x0088(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_GetRotatorFromControlValue) == 0x000001, "Wrong alignment on RigHierarchy_GetRotatorFromControlValue");
static_assert(sizeof(RigHierarchy_GetRotatorFromControlValue) == 0x0000A0, "Wrong size on RigHierarchy_GetRotatorFromControlValue");
static_assert(offsetof(RigHierarchy_GetRotatorFromControlValue, InValue) == 0x000000, "Member 'RigHierarchy_GetRotatorFromControlValue::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_GetRotatorFromControlValue, ReturnValue) == 0x000088, "Member 'RigHierarchy_GetRotatorFromControlValue::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.GetTransformFromControlValue
// 0x00F0 (0x00F0 - 0x0000)
struct RigHierarchy_GetTransformFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0xC];                                       // 0x0084(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0090(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_GetTransformFromControlValue) == 0x000001, "Wrong alignment on RigHierarchy_GetTransformFromControlValue");
static_assert(sizeof(RigHierarchy_GetTransformFromControlValue) == 0x0000F0, "Wrong size on RigHierarchy_GetTransformFromControlValue");
static_assert(offsetof(RigHierarchy_GetTransformFromControlValue, InValue) == 0x000000, "Member 'RigHierarchy_GetTransformFromControlValue::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_GetTransformFromControlValue, ReturnValue) == 0x000090, "Member 'RigHierarchy_GetTransformFromControlValue::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.GetTransformNoScaleFromControlValue
// 0x00D0 (0x00D0 - 0x0000)
struct RigHierarchy_GetTransformNoScaleFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0xC];                                       // 0x0084(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransformNoScale                      ReturnValue;                                       // 0x0090(0x0040)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_GetTransformNoScaleFromControlValue) == 0x000001, "Wrong alignment on RigHierarchy_GetTransformNoScaleFromControlValue");
static_assert(sizeof(RigHierarchy_GetTransformNoScaleFromControlValue) == 0x0000D0, "Wrong size on RigHierarchy_GetTransformNoScaleFromControlValue");
static_assert(offsetof(RigHierarchy_GetTransformNoScaleFromControlValue, InValue) == 0x000000, "Member 'RigHierarchy_GetTransformNoScaleFromControlValue::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_GetTransformNoScaleFromControlValue, ReturnValue) == 0x000090, "Member 'RigHierarchy_GetTransformNoScaleFromControlValue::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.GetVector2DFromControlValue
// 0x0098 (0x0098 - 0x0000)
struct RigHierarchy_GetVector2DFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ReturnValue;                                       // 0x0088(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_GetVector2DFromControlValue) == 0x000001, "Wrong alignment on RigHierarchy_GetVector2DFromControlValue");
static_assert(sizeof(RigHierarchy_GetVector2DFromControlValue) == 0x000098, "Wrong size on RigHierarchy_GetVector2DFromControlValue");
static_assert(offsetof(RigHierarchy_GetVector2DFromControlValue, InValue) == 0x000000, "Member 'RigHierarchy_GetVector2DFromControlValue::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_GetVector2DFromControlValue, ReturnValue) == 0x000088, "Member 'RigHierarchy_GetVector2DFromControlValue::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.GetVectorFromControlValue
// 0x00A0 (0x00A0 - 0x0000)
struct RigHierarchy_GetVectorFromControlValue final
{
public:
	struct FRigControlValue                       InValue;                                           // 0x0000(0x0084)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0088(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_GetVectorFromControlValue) == 0x000001, "Wrong alignment on RigHierarchy_GetVectorFromControlValue");
static_assert(sizeof(RigHierarchy_GetVectorFromControlValue) == 0x0000A0, "Wrong size on RigHierarchy_GetVectorFromControlValue");
static_assert(offsetof(RigHierarchy_GetVectorFromControlValue, InValue) == 0x000000, "Member 'RigHierarchy_GetVectorFromControlValue::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_GetVectorFromControlValue, ReturnValue) == 0x000088, "Member 'RigHierarchy_GetVectorFromControlValue::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.MakeControlValueFromBool
// 0x0088 (0x0088 - 0x0000)
struct RigHierarchy_MakeControlValueFromBool final
{
public:
	bool                                          InValue;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigControlValue                       ReturnValue;                                       // 0x0004(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_MakeControlValueFromBool) == 0x000001, "Wrong alignment on RigHierarchy_MakeControlValueFromBool");
static_assert(sizeof(RigHierarchy_MakeControlValueFromBool) == 0x000088, "Wrong size on RigHierarchy_MakeControlValueFromBool");
static_assert(offsetof(RigHierarchy_MakeControlValueFromBool, InValue) == 0x000000, "Member 'RigHierarchy_MakeControlValueFromBool::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_MakeControlValueFromBool, ReturnValue) == 0x000004, "Member 'RigHierarchy_MakeControlValueFromBool::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.MakeControlValueFromEulerTransform
// 0x00D0 (0x00D0 - 0x0000)
struct RigHierarchy_MakeControlValueFromEulerTransform final
{
public:
	struct FEulerTransform                        InValue;                                           // 0x0000(0x0048)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0048(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_MakeControlValueFromEulerTransform) == 0x000001, "Wrong alignment on RigHierarchy_MakeControlValueFromEulerTransform");
static_assert(sizeof(RigHierarchy_MakeControlValueFromEulerTransform) == 0x0000D0, "Wrong size on RigHierarchy_MakeControlValueFromEulerTransform");
static_assert(offsetof(RigHierarchy_MakeControlValueFromEulerTransform, InValue) == 0x000000, "Member 'RigHierarchy_MakeControlValueFromEulerTransform::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_MakeControlValueFromEulerTransform, ReturnValue) == 0x000048, "Member 'RigHierarchy_MakeControlValueFromEulerTransform::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.MakeControlValueFromFloat
// 0x0088 (0x0088 - 0x0000)
struct RigHierarchy_MakeControlValueFromFloat final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0004(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_MakeControlValueFromFloat) == 0x000004, "Wrong alignment on RigHierarchy_MakeControlValueFromFloat");
static_assert(sizeof(RigHierarchy_MakeControlValueFromFloat) == 0x000088, "Wrong size on RigHierarchy_MakeControlValueFromFloat");
static_assert(offsetof(RigHierarchy_MakeControlValueFromFloat, InValue) == 0x000000, "Member 'RigHierarchy_MakeControlValueFromFloat::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_MakeControlValueFromFloat, ReturnValue) == 0x000004, "Member 'RigHierarchy_MakeControlValueFromFloat::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.MakeControlValueFromInt
// 0x0088 (0x0088 - 0x0000)
struct RigHierarchy_MakeControlValueFromInt final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0004(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_MakeControlValueFromInt) == 0x000004, "Wrong alignment on RigHierarchy_MakeControlValueFromInt");
static_assert(sizeof(RigHierarchy_MakeControlValueFromInt) == 0x000088, "Wrong size on RigHierarchy_MakeControlValueFromInt");
static_assert(offsetof(RigHierarchy_MakeControlValueFromInt, InValue) == 0x000000, "Member 'RigHierarchy_MakeControlValueFromInt::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_MakeControlValueFromInt, ReturnValue) == 0x000004, "Member 'RigHierarchy_MakeControlValueFromInt::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.MakeControlValueFromRotator
// 0x00A0 (0x00A0 - 0x0000)
struct RigHierarchy_MakeControlValueFromRotator final
{
public:
	struct FRotator                               InValue;                                           // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0018(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_MakeControlValueFromRotator) == 0x000001, "Wrong alignment on RigHierarchy_MakeControlValueFromRotator");
static_assert(sizeof(RigHierarchy_MakeControlValueFromRotator) == 0x0000A0, "Wrong size on RigHierarchy_MakeControlValueFromRotator");
static_assert(offsetof(RigHierarchy_MakeControlValueFromRotator, InValue) == 0x000000, "Member 'RigHierarchy_MakeControlValueFromRotator::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_MakeControlValueFromRotator, ReturnValue) == 0x000018, "Member 'RigHierarchy_MakeControlValueFromRotator::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.MakeControlValueFromTransform
// 0x00F0 (0x00F0 - 0x0000)
struct RigHierarchy_MakeControlValueFromTransform final
{
public:
	struct FTransform                             InValue;                                           // 0x0000(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0060(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_E4[0xC];                                       // 0x00E4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_MakeControlValueFromTransform) == 0x000001, "Wrong alignment on RigHierarchy_MakeControlValueFromTransform");
static_assert(sizeof(RigHierarchy_MakeControlValueFromTransform) == 0x0000F0, "Wrong size on RigHierarchy_MakeControlValueFromTransform");
static_assert(offsetof(RigHierarchy_MakeControlValueFromTransform, InValue) == 0x000000, "Member 'RigHierarchy_MakeControlValueFromTransform::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_MakeControlValueFromTransform, ReturnValue) == 0x000060, "Member 'RigHierarchy_MakeControlValueFromTransform::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.MakeControlValueFromTransformNoScale
// 0x00D0 (0x00D0 - 0x0000)
struct RigHierarchy_MakeControlValueFromTransformNoScale final
{
public:
	struct FTransformNoScale                      InValue;                                           // 0x0000(0x0040)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0040(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0xC];                                       // 0x00C4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_MakeControlValueFromTransformNoScale) == 0x000001, "Wrong alignment on RigHierarchy_MakeControlValueFromTransformNoScale");
static_assert(sizeof(RigHierarchy_MakeControlValueFromTransformNoScale) == 0x0000D0, "Wrong size on RigHierarchy_MakeControlValueFromTransformNoScale");
static_assert(offsetof(RigHierarchy_MakeControlValueFromTransformNoScale, InValue) == 0x000000, "Member 'RigHierarchy_MakeControlValueFromTransformNoScale::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_MakeControlValueFromTransformNoScale, ReturnValue) == 0x000040, "Member 'RigHierarchy_MakeControlValueFromTransformNoScale::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.MakeControlValueFromVector
// 0x00A0 (0x00A0 - 0x0000)
struct RigHierarchy_MakeControlValueFromVector final
{
public:
	struct FVector                                InValue;                                           // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0018(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_MakeControlValueFromVector) == 0x000001, "Wrong alignment on RigHierarchy_MakeControlValueFromVector");
static_assert(sizeof(RigHierarchy_MakeControlValueFromVector) == 0x0000A0, "Wrong size on RigHierarchy_MakeControlValueFromVector");
static_assert(offsetof(RigHierarchy_MakeControlValueFromVector, InValue) == 0x000000, "Member 'RigHierarchy_MakeControlValueFromVector::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_MakeControlValueFromVector, ReturnValue) == 0x000018, "Member 'RigHierarchy_MakeControlValueFromVector::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.MakeControlValueFromVector2D
// 0x0098 (0x0098 - 0x0000)
struct RigHierarchy_MakeControlValueFromVector2D final
{
public:
	struct FVector2D                              InValue;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRigControlValue                       ReturnValue;                                       // 0x0010(0x0084)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_MakeControlValueFromVector2D) == 0x000001, "Wrong alignment on RigHierarchy_MakeControlValueFromVector2D");
static_assert(sizeof(RigHierarchy_MakeControlValueFromVector2D) == 0x000098, "Wrong size on RigHierarchy_MakeControlValueFromVector2D");
static_assert(offsetof(RigHierarchy_MakeControlValueFromVector2D, InValue) == 0x000000, "Member 'RigHierarchy_MakeControlValueFromVector2D::InValue' has a wrong offset!");
static_assert(offsetof(RigHierarchy_MakeControlValueFromVector2D, ReturnValue) == 0x000010, "Member 'RigHierarchy_MakeControlValueFromVector2D::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.CopyHierarchy
// 0x0008 (0x0008 - 0x0000)
struct RigHierarchy_CopyHierarchy final
{
public:
	class URigHierarchy*                          InHierarchy;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_CopyHierarchy) == 0x000008, "Wrong alignment on RigHierarchy_CopyHierarchy");
static_assert(sizeof(RigHierarchy_CopyHierarchy) == 0x000008, "Wrong size on RigHierarchy_CopyHierarchy");
static_assert(offsetof(RigHierarchy_CopyHierarchy, InHierarchy) == 0x000000, "Member 'RigHierarchy_CopyHierarchy::InHierarchy' has a wrong offset!");

// Function ControlRig.RigHierarchy.CopyPose
// 0x0010 (0x0010 - 0x0000)
struct RigHierarchy_CopyPose final
{
public:
	class URigHierarchy*                          InHierarchy;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCurrent;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInitial;                                          // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWeights;                                          // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMatchPoseInGlobalIfNeeded;                        // 0x000B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_CopyPose) == 0x000008, "Wrong alignment on RigHierarchy_CopyPose");
static_assert(sizeof(RigHierarchy_CopyPose) == 0x000010, "Wrong size on RigHierarchy_CopyPose");
static_assert(offsetof(RigHierarchy_CopyPose, InHierarchy) == 0x000000, "Member 'RigHierarchy_CopyPose::InHierarchy' has a wrong offset!");
static_assert(offsetof(RigHierarchy_CopyPose, bCurrent) == 0x000008, "Member 'RigHierarchy_CopyPose::bCurrent' has a wrong offset!");
static_assert(offsetof(RigHierarchy_CopyPose, bInitial) == 0x000009, "Member 'RigHierarchy_CopyPose::bInitial' has a wrong offset!");
static_assert(offsetof(RigHierarchy_CopyPose, bWeights) == 0x00000A, "Member 'RigHierarchy_CopyPose::bWeights' has a wrong offset!");
static_assert(offsetof(RigHierarchy_CopyPose, bMatchPoseInGlobalIfNeeded) == 0x00000B, "Member 'RigHierarchy_CopyPose::bMatchPoseInGlobalIfNeeded' has a wrong offset!");

// Function ControlRig.RigHierarchy.GetController
// 0x0010 (0x0010 - 0x0000)
struct RigHierarchy_GetController final
{
public:
	bool                                          bCreateIfNeeded;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URigHierarchyController*                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_GetController) == 0x000008, "Wrong alignment on RigHierarchy_GetController");
static_assert(sizeof(RigHierarchy_GetController) == 0x000010, "Wrong size on RigHierarchy_GetController");
static_assert(offsetof(RigHierarchy_GetController, bCreateIfNeeded) == 0x000000, "Member 'RigHierarchy_GetController::bCreateIfNeeded' has a wrong offset!");
static_assert(offsetof(RigHierarchy_GetController, ReturnValue) == 0x000008, "Member 'RigHierarchy_GetController::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.GetRuleManager
// 0x0010 (0x0010 - 0x0000)
struct RigHierarchy_GetRuleManager final
{
public:
	bool                                          bCreateIfNeeded;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UModularRigRuleManager*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_GetRuleManager) == 0x000008, "Wrong alignment on RigHierarchy_GetRuleManager");
static_assert(sizeof(RigHierarchy_GetRuleManager) == 0x000010, "Wrong size on RigHierarchy_GetRuleManager");
static_assert(offsetof(RigHierarchy_GetRuleManager, bCreateIfNeeded) == 0x000000, "Member 'RigHierarchy_GetRuleManager::bCreateIfNeeded' has a wrong offset!");
static_assert(offsetof(RigHierarchy_GetRuleManager, ReturnValue) == 0x000008, "Member 'RigHierarchy_GetRuleManager::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.RemoveAllMetadata
// 0x0010 (0x0010 - 0x0000)
struct RigHierarchy_RemoveAllMetadata final
{
public:
	struct FRigElementKey                         InItem;                                            // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_RemoveAllMetadata) == 0x000001, "Wrong alignment on RigHierarchy_RemoveAllMetadata");
static_assert(sizeof(RigHierarchy_RemoveAllMetadata) == 0x000010, "Wrong size on RigHierarchy_RemoveAllMetadata");
static_assert(offsetof(RigHierarchy_RemoveAllMetadata, InItem) == 0x000000, "Member 'RigHierarchy_RemoveAllMetadata::InItem' has a wrong offset!");
static_assert(offsetof(RigHierarchy_RemoveAllMetadata, ReturnValue) == 0x00000C, "Member 'RigHierarchy_RemoveAllMetadata::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.RemoveMetadata
// 0x0018 (0x0018 - 0x0000)
struct RigHierarchy_RemoveMetadata final
{
public:
	struct FRigElementKey                         InItem;                                            // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InMetadataName;                                    // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(RigHierarchy_RemoveMetadata) == 0x000004, "Wrong alignment on RigHierarchy_RemoveMetadata");
static_assert(sizeof(RigHierarchy_RemoveMetadata) == 0x000018, "Wrong size on RigHierarchy_RemoveMetadata");
static_assert(offsetof(RigHierarchy_RemoveMetadata, InItem) == 0x000000, "Member 'RigHierarchy_RemoveMetadata::InItem' has a wrong offset!");
static_assert(offsetof(RigHierarchy_RemoveMetadata, InMetadataName) == 0x00000C, "Member 'RigHierarchy_RemoveMetadata::InMetadataName' has a wrong offset!");
static_assert(offsetof(RigHierarchy_RemoveMetadata, ReturnValue) == 0x000014, "Member 'RigHierarchy_RemoveMetadata::ReturnValue' has a wrong offset!");

// Function ControlRig.RigHierarchy.ResetPoseToInitial
// 0x0001 (0x0001 - 0x0000)
struct RigHierarchy_ResetPoseToInitial final
{
public:
	ERigElementType                               InTypeFilter;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(RigHierarchy_ResetPoseToInitial) == 0x000001, "Wrong alignment on RigHierarchy_ResetPoseToInitial");
static_assert(sizeof(RigHierarchy_ResetPoseToInitial) == 0x000001, "Wrong size on RigHierarchy_ResetPoseToInitial");
static_assert(offsetof(RigHierarchy_ResetPoseToInitial, InTypeFilter) == 0x000000, "Member 'RigHierarchy_ResetPoseToInitial::InTypeFilter' has a wrong offset!");

// Function ControlRig.RigHierarchy.RestoreConnectorsFromStates
// 0x0028 (0x0028 - 0x0000)
struct RigHierarchy_RestoreConnectorsFromStates final
{
public:
