#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CriWareLinuxSettings

#include "Basic.hpp"

#include "CriWareCore_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class CriWareLinuxSettings.CriWareLinuxSettings
// 0x0020 (0x0058 - 0x0038)
class UCriWareLinuxSettings final : public UDeveloperSettings
{
public:
	struct FAtomVoicesSettings                    VoicesOverrides;                                   // 0x0038(0x000C)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FCriWareCookOverridesSettings          CookOverrides;                                     // 0x0044(0x0002)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AtomSourceDataOverridePlugin;                      // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CriWareLinuxSettings">();
	}
	static class UCriWareLinuxSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCriWareLinuxSettings>();
	}
};
static_assert(alignof(UCriWareLinuxSettings) == 0x000008, "Wrong alignment on UCriWareLinuxSettings");
static_assert(sizeof(UCriWareLinuxSettings) == 0x000058, "Wrong size on UCriWareLinuxSettings");
static_assert(offsetof(UCriWareLinuxSettings, VoicesOverrides) == 0x000038, "Member 'UCriWareLinuxSettings::VoicesOverrides' has a wrong offset!");
static_assert(offsetof(UCriWareLinuxSettings, CookOverrides) == 0x000044, "Member 'UCriWareLinuxSettings::CookOverrides' has a wrong offset!");
static_assert(offsetof(UCriWareLinuxSettings, AtomSourceDataOverridePlugin) == 0x000048, "Member 'UCriWareLinuxSettings::AtomSourceDataOverridePlugin' has a wrong offset!");

}

