#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CriWareCore

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CriWareCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AudioLinkCore_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class CriWareCore.AnimNotifyState_TimedAtomSound
// 0x0020 (0x0050 - 0x0030)
class UAnimNotifyState_TimedAtomSound final : public UAnimNotifyState
{
public:
	class UAtomSoundBase*                         Sound;                                             // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumeMultiplier;                                  // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchMultiplier;                                   // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bFollow : 1;                                       // 0x0040(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bStatic : 1;                                       // 0x0040(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AttachName;                                        // 0x0044(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_TimedAtomSound">();
	}
	static class UAnimNotifyState_TimedAtomSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_TimedAtomSound>();
	}
};
static_assert(alignof(UAnimNotifyState_TimedAtomSound) == 0x000008, "Wrong alignment on UAnimNotifyState_TimedAtomSound");
static_assert(sizeof(UAnimNotifyState_TimedAtomSound) == 0x000050, "Wrong size on UAnimNotifyState_TimedAtomSound");
static_assert(offsetof(UAnimNotifyState_TimedAtomSound, Sound) == 0x000030, "Member 'UAnimNotifyState_TimedAtomSound::Sound' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_TimedAtomSound, VolumeMultiplier) == 0x000038, "Member 'UAnimNotifyState_TimedAtomSound::VolumeMultiplier' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_TimedAtomSound, PitchMultiplier) == 0x00003C, "Member 'UAnimNotifyState_TimedAtomSound::PitchMultiplier' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_TimedAtomSound, AttachName) == 0x000044, "Member 'UAnimNotifyState_TimedAtomSound::AttachName' has a wrong offset!");

// Class CriWareCore.AnimNotify_PlayAtomSound
// 0x0020 (0x0058 - 0x0038)
class UAnimNotify_PlayAtomSound final : public UAnimNotify
{
public:
	class UAtomSoundBase*                         Sound;                                             // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumeMultiplier;                                  // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchMultiplier;                                   // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bFollow : 1;                                       // 0x0048(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bStatic : 1;                                       // 0x0048(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AttachName;                                        // 0x004C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_PlayAtomSound">();
	}
	static class UAnimNotify_PlayAtomSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_PlayAtomSound>();
	}
};
static_assert(alignof(UAnimNotify_PlayAtomSound) == 0x000008, "Wrong alignment on UAnimNotify_PlayAtomSound");
static_assert(sizeof(UAnimNotify_PlayAtomSound) == 0x000058, "Wrong size on UAnimNotify_PlayAtomSound");
static_assert(offsetof(UAnimNotify_PlayAtomSound, Sound) == 0x000038, "Member 'UAnimNotify_PlayAtomSound::Sound' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayAtomSound, VolumeMultiplier) == 0x000040, "Member 'UAnimNotify_PlayAtomSound::VolumeMultiplier' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayAtomSound, PitchMultiplier) == 0x000044, "Member 'UAnimNotify_PlayAtomSound::PitchMultiplier' has a wrong offset!");
static_assert(offsetof(UAnimNotify_PlayAtomSound, AttachName) == 0x00004C, "Member 'UAnimNotify_PlayAtomSound::AttachName' has a wrong offset!");

// Class CriWareCore.AtomSoundAsset
// 0x0000 (0x0000 - 0x0000)
class IAtomSoundAsset final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomSoundAsset">();
	}
	static class IAtomSoundAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAtomSoundAsset>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IAtomSoundAsset) == 0x000001, "Wrong alignment on IAtomSoundAsset");
static_assert(sizeof(IAtomSoundAsset) == 0x000001, "Wrong size on IAtomSoundAsset");

// Class CriWareCore.AtomAnalyzerSettings
// 0x0000 (0x0028 - 0x0028)
class UAtomAnalyzerSettings final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomAnalyzerSettings">();
	}
	static class UAtomAnalyzerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomAnalyzerSettings>();
	}
};
static_assert(alignof(UAtomAnalyzerSettings) == 0x000008, "Wrong alignment on UAtomAnalyzerSettings");
static_assert(sizeof(UAtomAnalyzerSettings) == 0x000028, "Wrong size on UAtomAnalyzerSettings");

// Class CriWareCore.AtomPlaybackFinishedNotifiedObject
// 0x0000 (0x0000 - 0x0000)
class IAtomPlaybackFinishedNotifiedObject final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomPlaybackFinishedNotifiedObject">();
	}
	static class IAtomPlaybackFinishedNotifiedObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAtomPlaybackFinishedNotifiedObject>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IAtomPlaybackFinishedNotifiedObject) == 0x000001, "Wrong alignment on IAtomPlaybackFinishedNotifiedObject");
static_assert(sizeof(IAtomPlaybackFinishedNotifiedObject) == 0x000001, "Wrong size on IAtomPlaybackFinishedNotifiedObject");

// Class CriWareCore.AtomAisacPatch
// 0x0020 (0x0048 - 0x0028)
class UAtomAisacPatch final : public UObject
{
public:
	class FName                                   Name_0;                                            // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DefaultControlFlag;                                // 0x0030(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultControlValue;                               // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomAisacControl                      Control;                                           // 0x0038(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UAtomConfig* GetConfig() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomAisacPatch">();
	}
	static class UAtomAisacPatch* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomAisacPatch>();
	}
};
static_assert(alignof(UAtomAisacPatch) == 0x000008, "Wrong alignment on UAtomAisacPatch");
static_assert(sizeof(UAtomAisacPatch) == 0x000048, "Wrong size on UAtomAisacPatch");
static_assert(offsetof(UAtomAisacPatch, Name_0) == 0x000028, "Member 'UAtomAisacPatch::Name_0' has a wrong offset!");
static_assert(offsetof(UAtomAisacPatch, DefaultControlFlag) == 0x000030, "Member 'UAtomAisacPatch::DefaultControlFlag' has a wrong offset!");
static_assert(offsetof(UAtomAisacPatch, DefaultControlValue) == 0x000034, "Member 'UAtomAisacPatch::DefaultControlValue' has a wrong offset!");
static_assert(offsetof(UAtomAisacPatch, Control) == 0x000038, "Member 'UAtomAisacPatch::Control' has a wrong offset!");

// Class CriWareCore.AtomGameplayComponent
// 0x0008 (0x00C8 - 0x00C0)
class UAtomGameplayComponent : public UActorComponent
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomGameplayComponent">();
	}
	static class UAtomGameplayComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomGameplayComponent>();
	}
};
static_assert(alignof(UAtomGameplayComponent) == 0x000008, "Wrong alignment on UAtomGameplayComponent");
static_assert(sizeof(UAtomGameplayComponent) == 0x0000C8, "Wrong size on UAtomGameplayComponent");

// Class CriWareCore.AtomGameplayVolumeMutator
// 0x0008 (0x00D0 - 0x00C8)
class UAtomGameplayVolumeMutator : public UAtomGameplayComponent
{
public:
	int32                                         Priority;                                          // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetPriority(int32 InPriority);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomGameplayVolumeMutator">();
	}
	static class UAtomGameplayVolumeMutator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomGameplayVolumeMutator>();
	}
};
static_assert(alignof(UAtomGameplayVolumeMutator) == 0x000008, "Wrong alignment on UAtomGameplayVolumeMutator");
static_assert(sizeof(UAtomGameplayVolumeMutator) == 0x0000D0, "Wrong size on UAtomGameplayVolumeMutator");
static_assert(offsetof(UAtomGameplayVolumeMutator, Priority) == 0x0000C8, "Member 'UAtomGameplayVolumeMutator::Priority' has a wrong offset!");

// Class CriWareCore.AtomAisacVolumeComponent
// 0x0010 (0x00E0 - 0x00D0)
class UAtomAisacVolumeComponent final : public UAtomGameplayVolumeMutator
{
public:
	TArray<struct FAtomVolumeAisacControlSettings> AisacControlSettings;                             // 0x00D0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	void SetAisacControlSettings(const TArray<struct FAtomVolumeAisacControlSettings>& NewAisacControlSettings);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomAisacVolumeComponent">();
	}
	static class UAtomAisacVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomAisacVolumeComponent>();
	}
};
static_assert(alignof(UAtomAisacVolumeComponent) == 0x000008, "Wrong alignment on UAtomAisacVolumeComponent");
static_assert(sizeof(UAtomAisacVolumeComponent) == 0x0000E0, "Wrong size on UAtomAisacVolumeComponent");
static_assert(offsetof(UAtomAisacVolumeComponent, AisacControlSettings) == 0x0000D0, "Member 'UAtomAisacVolumeComponent::AisacControlSettings' has a wrong offset!");

// Class CriWareCore.AtomAssetUserData
// 0x0020 (0x0048 - 0x0028)
class UAtomAssetUserData final : public UAssetUserData
{
public:
	struct FGameplayTagContainer                  MetadataTags;                                      // 0x0028(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomAssetUserData">();
	}
	static class UAtomAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomAssetUserData>();
	}
};
static_assert(alignof(UAtomAssetUserData) == 0x000008, "Wrong alignment on UAtomAssetUserData");
static_assert(sizeof(UAtomAssetUserData) == 0x000048, "Wrong size on UAtomAssetUserData");
static_assert(offsetof(UAtomAssetUserData, MetadataTags) == 0x000028, "Member 'UAtomAssetUserData::MetadataTags' has a wrong offset!");

// Class CriWareCore.AtomGameplayVolumeInteraction
// 0x0000 (0x0000 - 0x0000)
class IAtomGameplayVolumeInteraction final
{
public:
	void OnListenerEnter();
	void OnListenerExit();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomGameplayVolumeInteraction">();
	}
	static class IAtomGameplayVolumeInteraction* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAtomGameplayVolumeInteraction>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IAtomGameplayVolumeInteraction) == 0x000001, "Wrong alignment on IAtomGameplayVolumeInteraction");
static_assert(sizeof(IAtomGameplayVolumeInteraction) == 0x000001, "Wrong size on IAtomGameplayVolumeInteraction");

// Class CriWareCore.AtomAttenuation
// 0x0270 (0x0298 - 0x0028)
class UAtomAttenuation final : public UObject
{
public:
	struct FAtomAttenuationSettings               Attenuation;                                       // 0x0028(0x0270)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomAttenuation">();
	}
	static class UAtomAttenuation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomAttenuation>();
	}
};
static_assert(alignof(UAtomAttenuation) == 0x000008, "Wrong alignment on UAtomAttenuation");
static_assert(sizeof(UAtomAttenuation) == 0x000298, "Wrong size on UAtomAttenuation");
static_assert(offsetof(UAtomAttenuation, Attenuation) == 0x000028, "Member 'UAtomAttenuation::Attenuation' has a wrong offset!");

// Class CriWareCore.AtomAttenuationVolumeComponent
// 0x0010 (0x00E0 - 0x00D0)
class UAtomAttenuationVolumeComponent final : public UAtomGameplayVolumeMutator
{
public:
	float                                         ExteriorVolume;                                    // 0x00D0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ExteriorTime;                                      // 0x00D4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         InteriorVolume;                                    // 0x00D8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         InteriorTime;                                      // 0x00DC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetExteriorVolume(float Volume, float InterpolateTime);
	void SetInteriorVolume(float Volume, float InterpolateTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomAttenuationVolumeComponent">();
	}
	static class UAtomAttenuationVolumeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomAttenuationVolumeComponent>();
	}
};
static_assert(alignof(UAtomAttenuationVolumeComponent) == 0x000008, "Wrong alignment on UAtomAttenuationVolumeComponent");
static_assert(sizeof(UAtomAttenuationVolumeComponent) == 0x0000E0, "Wrong size on UAtomAttenuationVolumeComponent");
static_assert(offsetof(UAtomAttenuationVolumeComponent, ExteriorVolume) == 0x0000D0, "Member 'UAtomAttenuationVolumeComponent::ExteriorVolume' has a wrong offset!");
static_assert(offsetof(UAtomAttenuationVolumeComponent, ExteriorTime) == 0x0000D4, "Member 'UAtomAttenuationVolumeComponent::ExteriorTime' has a wrong offset!");
static_assert(offsetof(UAtomAttenuationVolumeComponent, InteriorVolume) == 0x0000D8, "Member 'UAtomAttenuationVolumeComponent::InteriorVolume' has a wrong offset!");
static_assert(offsetof(UAtomAttenuationVolumeComponent, InteriorTime) == 0x0000DC, "Member 'UAtomAttenuationVolumeComponent::InteriorTime' has a wrong offset!");

// Class CriWareCore.AtomSoundBase
// 0x0330 (0x0358 - 0x0028)
class UAtomSoundBase : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomSoundClass*                        SoundClassObject;                                  // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, AssetRegistrySearchable, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bDebug : 1;                                        // 0x0040(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverrideVirtualizationMode : 1;                   // 0x0040(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverrideConcurrency : 1;                          // 0x0040(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EAtomVirtualizationMode                       VirtualizationMode;                                // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class UAtomConcurrency*>                 ConcurrencySet;                                    // 0x0048(0x0050)(Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FAtomConcurrencySettings               ConcurrencyOverrides;                              // 0x0098(0x0028)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         bEnableSourceBusSends : 1;                         // 0x00C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableBaseRack : 1;                               // 0x00C0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableBusSends : 1;                               // 0x00C0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_C1[0x57];                                      // 0x00C1(0x0057)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         duration;                                          // 0x0118(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistance;                                       // 0x011C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Priority;                                          // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomAttenuation*                       AttenuationSettings;                               // 0x0128(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomRackWithParentBase*                AtomRack;                                          // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAtomSoundToBusSend>            AtomBusSends;                                      // 0x0138(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomSoundSourceBusSendInfo>    PreEffectSourceBusSends;                           // 0x0148(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FAtomSoundModulationRoutingSettings    ModulationSettings;                                // 0x0158(0x0198)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FAtomWaveInfo                          WaveInfo;                                          // 0x02F0(0x0018)(Edit, EditConst, NoDestructor, AssetRegistrySearchable, NativeAccessSpecifierPublic)
	uint8                                         Pad_308[0x8];                                      // 0x0308(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAssetUserData*>                 AssetUserData;                                     // 0x0310(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_320[0x38];                                     // 0x0320(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomSoundBase">();
	}
	static class UAtomSoundBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomSoundBase>();
	}
};
static_assert(alignof(UAtomSoundBase) == 0x000008, "Wrong alignment on UAtomSoundBase");
static_assert(sizeof(UAtomSoundBase) == 0x000358, "Wrong size on UAtomSoundBase");
static_assert(offsetof(UAtomSoundBase, SoundClassObject) == 0x000038, "Member 'UAtomSoundBase::SoundClassObject' has a wrong offset!");
static_assert(offsetof(UAtomSoundBase, VirtualizationMode) == 0x000041, "Member 'UAtomSoundBase::VirtualizationMode' has a wrong offset!");
static_assert(offsetof(UAtomSoundBase, ConcurrencySet) == 0x000048, "Member 'UAtomSoundBase::ConcurrencySet' has a wrong offset!");
static_assert(offsetof(UAtomSoundBase, ConcurrencyOverrides) == 0x000098, "Member 'UAtomSoundBase::ConcurrencyOverrides' has a wrong offset!");
static_assert(offsetof(UAtomSoundBase, duration) == 0x000118, "Member 'UAtomSoundBase::duration' has a wrong offset!");
static_assert(offsetof(UAtomSoundBase, MaxDistance) == 0x00011C, "Member 'UAtomSoundBase::MaxDistance' has a wrong offset!");
static_assert(offsetof(UAtomSoundBase, Priority) == 0x000120, "Member 'UAtomSoundBase::Priority' has a wrong offset!");
static_assert(offsetof(UAtomSoundBase, AttenuationSettings) == 0x000128, "Member 'UAtomSoundBase::AttenuationSettings' has a wrong offset!");
static_assert(offsetof(UAtomSoundBase, AtomRack) == 0x000130, "Member 'UAtomSoundBase::AtomRack' has a wrong offset!");
static_assert(offsetof(UAtomSoundBase, AtomBusSends) == 0x000138, "Member 'UAtomSoundBase::AtomBusSends' has a wrong offset!");
static_assert(offsetof(UAtomSoundBase, PreEffectSourceBusSends) == 0x000148, "Member 'UAtomSoundBase::PreEffectSourceBusSends' has a wrong offset!");
static_assert(offsetof(UAtomSoundBase, ModulationSettings) == 0x000158, "Member 'UAtomSoundBase::ModulationSettings' has a wrong offset!");
static_assert(offsetof(UAtomSoundBase, WaveInfo) == 0x0002F0, "Member 'UAtomSoundBase::WaveInfo' has a wrong offset!");
static_assert(offsetof(UAtomSoundBase, AssetUserData) == 0x000310, "Member 'UAtomSoundBase::AssetUserData' has a wrong offset!");

// Class CriWareCore.AtomSoundWaveProcedural
// 0x0010 (0x0368 - 0x0358)
class UAtomSoundWaveProcedural : public UAtomSoundBase
{
public:
	uint8                                         Pad_358[0x10];                                     // 0x0358(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomSoundWaveProcedural">();
	}
	static class UAtomSoundWaveProcedural* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomSoundWaveProcedural>();
	}
};
static_assert(alignof(UAtomSoundWaveProcedural) == 0x000008, "Wrong alignment on UAtomSoundWaveProcedural");
static_assert(sizeof(UAtomSoundWaveProcedural) == 0x000368, "Wrong size on UAtomSoundWaveProcedural");

// Class CriWareCore.AtomSynthSound
// 0x0018 (0x0380 - 0x0368)
class UAtomSynthSound final : public UAtomSoundWaveProcedural
{
public:
	TWeakObjectPtr<class UAtomSynthComponent>     OwningSynthComponent;                              // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_370[0x10];                                     // 0x0370(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomSynthSound">();
	}
	static class UAtomSynthSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomSynthSound>();
	}
};
static_assert(alignof(UAtomSynthSound) == 0x000008, "Wrong alignment on UAtomSynthSound");
static_assert(sizeof(UAtomSynthSound) == 0x000380, "Wrong size on UAtomSynthSound");
static_assert(offsetof(UAtomSynthSound, OwningSynthComponent) == 0x000368, "Member 'UAtomSynthSound::OwningSynthComponent' has a wrong offset!");

// Class CriWareCore.AtomEngineSubsystem
// 0x0000 (0x0030 - 0x0030)
class UAtomEngineSubsystem : public UDynamicSubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomEngineSubsystem">();
	}
	static class UAtomEngineSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomEngineSubsystem>();
	}
};
static_assert(alignof(UAtomEngineSubsystem) == 0x000008, "Wrong alignment on UAtomEngineSubsystem");
static_assert(sizeof(UAtomEngineSubsystem) == 0x000030, "Wrong size on UAtomEngineSubsystem");

// Class CriWareCore.AtomAudioBusSubsystem
// 0x00D8 (0x0108 - 0x0030)
class UAtomAudioBusSubsystem final : public UAtomEngineSubsystem
{
public:
	uint8                                         Pad_30[0xD8];                                      // 0x0030(0x00D8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomAudioBusSubsystem">();
	}
	static class UAtomAudioBusSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomAudioBusSubsystem>();
	}
};
static_assert(alignof(UAtomAudioBusSubsystem) == 0x000008, "Wrong alignment on UAtomAudioBusSubsystem");
static_assert(sizeof(UAtomAudioBusSubsystem) == 0x000108, "Wrong size on UAtomAudioBusSubsystem");

// Class CriWareCore.AtomAnalyzerSubsystem
// 0x0020 (0x0050 - 0x0030)
class UAtomAnalyzerSubsystem final : public UEngineSubsystem
{
public:
	TArray<class UAtomAnalyzer*>                  AtomAnalyzers;                                     // 0x0030(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomAnalyzerSubsystem">();
	}
	static class UAtomAnalyzerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomAnalyzerSubsystem>();
	}
};
static_assert(alignof(UAtomAnalyzerSubsystem) == 0x000008, "Wrong alignment on UAtomAnalyzerSubsystem");
static_assert(sizeof(UAtomAnalyzerSubsystem) == 0x000050, "Wrong size on UAtomAnalyzerSubsystem");
static_assert(offsetof(UAtomAnalyzerSubsystem, AtomAnalyzers) == 0x000030, "Member 'UAtomAnalyzerSubsystem::AtomAnalyzers' has a wrong offset!");

// Class CriWareCore.AtomSourceDataOverridePluginSourceSettingsBase
// 0x0000 (0x0028 - 0x0028)
class UAtomSourceDataOverridePluginSourceSettingsBase final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomSourceDataOverridePluginSourceSettingsBase">();
	}
	static class UAtomSourceDataOverridePluginSourceSettingsBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomSourceDataOverridePluginSourceSettingsBase>();
	}
};
static_assert(alignof(UAtomSourceDataOverridePluginSourceSettingsBase) == 0x000008, "Wrong alignment on UAtomSourceDataOverridePluginSourceSettingsBase");
static_assert(sizeof(UAtomSourceDataOverridePluginSourceSettingsBase) == 0x000028, "Wrong size on UAtomSourceDataOverridePluginSourceSettingsBase");

// Class CriWareCore.AtomAudioLinkSound
// 0x0018 (0x0380 - 0x0368)
class UAtomAudioLinkSound final : public UAtomSoundWaveProcedural
{
public:
	uint8                                         Pad_368[0x18];                                     // 0x0368(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomAudioLinkSound">();
	}
	static class UAtomAudioLinkSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomAudioLinkSound>();
	}
};
static_assert(alignof(UAtomAudioLinkSound) == 0x000008, "Wrong alignment on UAtomAudioLinkSound");
static_assert(sizeof(UAtomAudioLinkSound) == 0x000380, "Wrong size on UAtomAudioLinkSound");

// Class CriWareCore.AtomSynthComponent
// 0x0510 (0x0760 - 0x0250)
class UAtomSynthComponent : public USceneComponent
{
public:
	uint8                                         bAutoDestroy : 1;                                  // 0x0250(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bStopWhenOwnerDestroyed : 1;                       // 0x0250(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAllowSpatialization : 1;                          // 0x0250(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverrideAttenuation : 1;                          // 0x0250(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_250_4 : 4;                                  // 0x0250(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bEnableSourceBusSends : 1;                         // 0x0254(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableBaseRack : 1;                               // 0x0254(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableBusSends : 1;                               // 0x0254(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomAttenuation*                       AttenuationSettings;                               // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomAttenuationSettings               AttenuationOverrides;                              // 0x0260(0x0270)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSet<class UAtomConcurrency*>                 ConcurrencySet;                                    // 0x04D0(0x0050)(Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FAtomSoundModulationRoutingSettings    ModulationRouting;                                 // 0x0520(0x0198)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UAtomSoundClass*                        SoundClass;                                        // 0x06B8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomRackWithParentBase*                AtomRack;                                          // 0x06C0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAtomSoundToBusSend>            AtomBusSends;                                      // 0x06C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomSoundSourceBusSendInfo>    PreEffectSourceBusSends;                           // 0x06D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TSubclassOf<class UAtomComponent>             AtomComponentClass;                                // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyExtensionSettings;                           // 0x06F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsUISound : 1;                                    // 0x06F1(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsPreviewSound : 1;                               // 0x06F1(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_6F2[0x2];                                      // 0x06F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EnvelopeFollowerAttackTime;                        // 0x06F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EnvelopeFollowerReleaseTime;                       // 0x06F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6FC[0x4];                                      // 0x06FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const float EnvelopeValue)> OnAtomSoundEnvelopeValue;              // 0x0700(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_710[0x20];                                     // 0x0710(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomSynthSound*                        SynthSound;                                        // 0x0730(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAtomComponent*                         AtomComponent;                                     // 0x0738(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAtomComponentExtensionSettings*        ExtensionSettings;                                 // 0x0740(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_748[0x18];                                     // 0x0748(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TSet<class UAtomModulatorBase*> GetModulators(const EAtomModulationDestination Destination);
	void SetAisacControlValue(const struct FAtomAisacControl& AisacControl, float Value);
	void SetAtomBusSend(class UAtomBus* Bus, float SendLevel);
	void SetAtomBusSendPreEffect(class UAtomBus* AtomBus, float AtomBusSendLevel);
	void SetAudioBusSendPreEffect(class UAtomAudioBus* AudioBus, float AudioBusSendLevel);
	void SetLowPassFilterEnabled(bool InLowPassFilterEnabled);
	void SetLowPassFilterFrequency(float InLowPassFilterFrequency);
	void SetModulationRouting(const TSet<class UAtomModulatorBase*>& Modulators, const EAtomModulationDestination Destination, const EAtomModulationRouting RoutingMethod);
	void SetMultiplePositions(const TArray<struct FTransform>& Positions, EAtomMultiPositionType MultiPositionType);
	void SetRackSend(class UAtomRackBase* Rack);
	void SetSourceBusSendPreEffect(class UAtomSoundSourceBus* SoundSourceBus, float SourceBusSendLevel);
	void SetVolumeMultiplier(float VolumeMultiplier);
	void Start();
	void Stop();

	void AdjustVolume(float AdjustVolumeDuration, float AdjustVolumeLevel, const EAtomFaderCurve FadeCurve) const;
	void FadeIn(float FadeInDuration, float FadeVolumeLevel, float StartTime, const EAtomFaderCurve FadeCurve) const;
	void FadeOut(float FadeOutDuration, float FadeVolumeLevel, const EAtomFaderCurve FadeCurve) const;
	TScriptInterface<class IAtomComponentExtension> GetAtomComponentExtension() const;
	bool IsPlaying() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomSynthComponent">();
	}
	static class UAtomSynthComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomSynthComponent>();
	}
};
static_assert(alignof(UAtomSynthComponent) == 0x000008, "Wrong alignment on UAtomSynthComponent");
static_assert(sizeof(UAtomSynthComponent) == 0x000760, "Wrong size on UAtomSynthComponent");
static_assert(offsetof(UAtomSynthComponent, AttenuationSettings) == 0x000258, "Member 'UAtomSynthComponent::AttenuationSettings' has a wrong offset!");
static_assert(offsetof(UAtomSynthComponent, AttenuationOverrides) == 0x000260, "Member 'UAtomSynthComponent::AttenuationOverrides' has a wrong offset!");
static_assert(offsetof(UAtomSynthComponent, ConcurrencySet) == 0x0004D0, "Member 'UAtomSynthComponent::ConcurrencySet' has a wrong offset!");
static_assert(offsetof(UAtomSynthComponent, ModulationRouting) == 0x000520, "Member 'UAtomSynthComponent::ModulationRouting' has a wrong offset!");
static_assert(offsetof(UAtomSynthComponent, SoundClass) == 0x0006B8, "Member 'UAtomSynthComponent::SoundClass' has a wrong offset!");
static_assert(offsetof(UAtomSynthComponent, AtomRack) == 0x0006C0, "Member 'UAtomSynthComponent::AtomRack' has a wrong offset!");
static_assert(offsetof(UAtomSynthComponent, AtomBusSends) == 0x0006C8, "Member 'UAtomSynthComponent::AtomBusSends' has a wrong offset!");
static_assert(offsetof(UAtomSynthComponent, PreEffectSourceBusSends) == 0x0006D8, "Member 'UAtomSynthComponent::PreEffectSourceBusSends' has a wrong offset!");
static_assert(offsetof(UAtomSynthComponent, AtomComponentClass) == 0x0006E8, "Member 'UAtomSynthComponent::AtomComponentClass' has a wrong offset!");
static_assert(offsetof(UAtomSynthComponent, bApplyExtensionSettings) == 0x0006F0, "Member 'UAtomSynthComponent::bApplyExtensionSettings' has a wrong offset!");
static_assert(offsetof(UAtomSynthComponent, EnvelopeFollowerAttackTime) == 0x0006F4, "Member 'UAtomSynthComponent::EnvelopeFollowerAttackTime' has a wrong offset!");
static_assert(offsetof(UAtomSynthComponent, EnvelopeFollowerReleaseTime) == 0x0006F8, "Member 'UAtomSynthComponent::EnvelopeFollowerReleaseTime' has a wrong offset!");
static_assert(offsetof(UAtomSynthComponent, OnAtomSoundEnvelopeValue) == 0x000700, "Member 'UAtomSynthComponent::OnAtomSoundEnvelopeValue' has a wrong offset!");
static_assert(offsetof(UAtomSynthComponent, SynthSound) == 0x000730, "Member 'UAtomSynthComponent::SynthSound' has a wrong offset!");
static_assert(offsetof(UAtomSynthComponent, AtomComponent) == 0x000738, "Member 'UAtomSynthComponent::AtomComponent' has a wrong offset!");
static_assert(offsetof(UAtomSynthComponent, ExtensionSettings) == 0x000740, "Member 'UAtomSynthComponent::ExtensionSettings' has a wrong offset!");

// Class CriWareCore.AtomSubsystemCollectionRoot
// 0x0008 (0x0030 - 0x0028)
class UAtomSubsystemCollectionRoot final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomSubsystemCollectionRoot">();
	}
	static class UAtomSubsystemCollectionRoot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomSubsystemCollectionRoot>();
	}
};
static_assert(alignof(UAtomSubsystemCollectionRoot) == 0x000008, "Wrong alignment on UAtomSubsystemCollectionRoot");
static_assert(sizeof(UAtomSubsystemCollectionRoot) == 0x000030, "Wrong size on UAtomSubsystemCollectionRoot");

// Class CriWareCore.AtomAudioLinkComponent
// 0x0040 (0x07A0 - 0x0760)
class UAtomAudioLinkComponent final : public UAtomSynthComponent
{
public:
	uint8                                         Pad_760[0x8];                                      // 0x0760(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomAudioLinkSettings*                 Settings;                                          // 0x0768(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             Sound;                                             // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoPlay;                                         // 0x0778(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_779[0x7];                                      // 0x0779(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AudioComponent;                                    // 0x0780(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_788[0x18];                                     // 0x0788(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomAudioLinkComponent">();
	}
	static class UAtomAudioLinkComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomAudioLinkComponent>();
	}
};
static_assert(alignof(UAtomAudioLinkComponent) == 0x000008, "Wrong alignment on UAtomAudioLinkComponent");
static_assert(sizeof(UAtomAudioLinkComponent) == 0x0007A0, "Wrong size on UAtomAudioLinkComponent");
static_assert(offsetof(UAtomAudioLinkComponent, Settings) == 0x000768, "Member 'UAtomAudioLinkComponent::Settings' has a wrong offset!");
static_assert(offsetof(UAtomAudioLinkComponent, Sound) == 0x000770, "Member 'UAtomAudioLinkComponent::Sound' has a wrong offset!");
static_assert(offsetof(UAtomAudioLinkComponent, bAutoPlay) == 0x000778, "Member 'UAtomAudioLinkComponent::bAutoPlay' has a wrong offset!");
static_assert(offsetof(UAtomAudioLinkComponent, AudioComponent) == 0x000780, "Member 'UAtomAudioLinkComponent::AudioComponent' has a wrong offset!");

// Class CriWareCore.AtomAudioLinkSettings
// 0x0058 (0x0090 - 0x0038)
class UAtomAudioLinkSettings final : public UAudioLinkSettingsAbstract
{
public:
	EAtomAudioLinkRoute                           DestinationRoute;                                  // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAtomBus>                DestinationBus;                                    // 0x0040(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomBusSendStage                             DestinationBusStage;                               // 0x0068(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldClearBufferOnReceipt;                       // 0x0069(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ProducerToConsumerBufferRatio;                     // 0x006C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitialSilenceFillRatio;                           // 0x0070(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x14];                                      // 0x0074(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class UAtomBus*                               DestinationBusResolved;                            // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomAudioLinkSettings">();
	}
	static class UAtomAudioLinkSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomAudioLinkSettings>();
	}
};
static_assert(alignof(UAtomAudioLinkSettings) == 0x000008, "Wrong alignment on UAtomAudioLinkSettings");
static_assert(sizeof(UAtomAudioLinkSettings) == 0x000090, "Wrong size on UAtomAudioLinkSettings");
static_assert(offsetof(UAtomAudioLinkSettings, DestinationRoute) == 0x000038, "Member 'UAtomAudioLinkSettings::DestinationRoute' has a wrong offset!");
static_assert(offsetof(UAtomAudioLinkSettings, DestinationBus) == 0x000040, "Member 'UAtomAudioLinkSettings::DestinationBus' has a wrong offset!");
static_assert(offsetof(UAtomAudioLinkSettings, DestinationBusStage) == 0x000068, "Member 'UAtomAudioLinkSettings::DestinationBusStage' has a wrong offset!");
static_assert(offsetof(UAtomAudioLinkSettings, bShouldClearBufferOnReceipt) == 0x000069, "Member 'UAtomAudioLinkSettings::bShouldClearBufferOnReceipt' has a wrong offset!");
static_assert(offsetof(UAtomAudioLinkSettings, ProducerToConsumerBufferRatio) == 0x00006C, "Member 'UAtomAudioLinkSettings::ProducerToConsumerBufferRatio' has a wrong offset!");
static_assert(offsetof(UAtomAudioLinkSettings, InitialSilenceFillRatio) == 0x000070, "Member 'UAtomAudioLinkSettings::InitialSilenceFillRatio' has a wrong offset!");
static_assert(offsetof(UAtomAudioLinkSettings, DestinationBusResolved) == 0x000088, "Member 'UAtomAudioLinkSettings::DestinationBusResolved' has a wrong offset!");

// Class CriWareCore.AtomModulatorBase
// 0x0000 (0x0028 - 0x0028)
class UAtomModulatorBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomModulatorBase">();
	}
	static class UAtomModulatorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomModulatorBase>();
	}
};
static_assert(alignof(UAtomModulatorBase) == 0x000008, "Wrong alignment on UAtomModulatorBase");
static_assert(sizeof(UAtomModulatorBase) == 0x000028, "Wrong size on UAtomModulatorBase");

// Class CriWareCore.AtomRuntimeBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UAtomRuntimeBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddGlobalVoicePool(const class UObject* WorldContextObject, class FName PoolName, const struct FAtomVoicesSettings& VoicesSettings, EAtomVoicePoolCodecType CodecType, EAtomVoicePoolStreamingType StreamingType);
	static void ClearBusEffectPresets(const class UObject* WorldContextObject, class UAtomBus* AtomBus);
	static void ClearMasterEffectPresets(const class UObject* WorldContextObject);
	static void ClearRackEffectPresets(const class UObject* WorldContextObject, class UAtomRack* AtomRack);
	static void EnableBinauralizer(const class UObject* WorldContextObject, bool bEnable);
	static void GetAllPlaybacks(const class UAtomComponent* AtomComponent, TArray<struct FAtomSoundPlayback>* Playbacks);
	static void GetCategoryStatusByName(const class UObject* WorldContextObject, class FName CategoryName, const TDelegate<void(const class FName CategoryName, const bool IsPaused, const bool IsMuted, const bool IsSoloed, const float Volume, const int32 PlayCount)> OnGetStatus);
	static void GetGameVariableValueByName(const class UObject* WorldContextObject, class FName CategoryName, const TDelegate<void(const class FName Name, const float Value)> OnGetValue);
	static void GetMagnitudeForFrequencies(const class UObject* WorldContextObject, const TArray<float>& Frequencies, TArray<float>* Magnitudes, class UAtomBus* BusToAnalyze);
	static void GetPhaseForFrequencies(const class UObject* WorldContextObject, const TArray<float>& Frequencies, TArray<float>* Phases, class UAtomBus* BusToAnalyze);
	static bool IsAudioBusActive(const class UObject* WorldContextObject, class UAtomAudioBus* AudioBus);
	static bool IsBinauralizerEnabled(const class UObject* WorldContextObject);
	static TArray<struct FAtomBusSpectralAnalysisBandSettings> MakeFullSpectrumSpectralAnalysisBandSettings(int32 InNumBands, float InMinimumFrequency, float InMaximumFrequency, int32 InAttackTimeMsec, int32 InReleaseTimeMsec);
	static TArray<struct FAtomBusSpectralAnalysisBandSettings> MakeMusicalSpectralAnalysisBandSettings(int32 InNumSemitones, EAtomMusicalNoteName InStartingMusicalNote, int32 InStartingOctave, int32 InAttackTimeMsec, int32 InReleaseTimeMsec);
	static TArray<struct FAtomBusSpectralAnalysisBandSettings> MakePresetSpectralAnalysisBandSettings(EAtomSpectrumBandPresetType InBandPresetType, int32 InNumBands, int32 InAttackTimeMsec, int32 InReleaseTimeMsec);
	static bool MapOutputPortToRack(const class UObject* WorldContextObject, class FName OutputPortName, class UAtomRackWithParentBase* AtomRack);
	static void MuteCategoryByName(const class UObject* WorldContextObject, class FName CategoryName, bool bMute);
	static void PauseCategoryByName(const class UObject* WorldContextObject, class FName CategoryName, bool bPause);
	static void PrimeCueSheetForPlayback(class UAtomCueSheet* CueSheet, const TDelegate<void(const class UAtomCueSheet* LoadedCueSheet, const bool WasCancelled)> OnLoadCompletion);
	static void PrimeSoundForPlayback(class UAtomSoundBase* Sound, const TDelegate<void(const class UAtomSoundBase* LoadedSound, const bool WasCancelled)> OnLoadCompletion);
	static void PrimeWaveBankForPlayback(class UAtomWaveBank* WaveBank, const TDelegate<void(const class UAtomWaveBank* LoadedWaveBank, const bool WasCancelled)> OnLoadCompletion);
	static void RegisterAudioBusToBus(const class UObject* WorldContextObject, class UAtomBus* AtomDspBus, class UAtomAudioBus* AudioBus);
	static void RemoveBusEffectPreset(const class UObject* WorldContextObject, class UAtomBus* AtomBus, int32 EffectIndex);
	static void RemoveGlobalVoicePool(const class UObject* WorldContextObject, class FName PoolName);
	static void RemoveMasterEffectPreset(const class UObject* WorldContextObject, class UAtomBusEffectPreset* BusEffectPreset);
	static void RemoveRackEffectPreset(const class UObject* WorldContextObject, class UAtomRack* AtomRack, class UAtomBusEffectPreset* BusEffectPreset);
	static int32 SetBusEffectPreset(const class UObject* WorldContextObject, class UAtomBus* AtomBus, class UAtomBusEffectPreset* BusEffectPreset);
	static void SetCategoryVolumeByName(const class UObject* WorldContextObject, class FName CategoryName, float VolumeMultiplier);
	static void SetGameVariableValueByName(const class UObject* WorldContextObject, class FName GameVariableName, float Value);
	static void SetMasterEffectPreset(const class UObject* WorldContextObject, class UAtomBusEffectPreset* BusEffectPreset);
	static void SoloCategoryByName(const class UObject* WorldContextObject, class FName CategoryName, bool bSolo, float MuteVolume);
	static void StartAnalyzingOutput(const class UObject* WorldContextObject, class UAtomBus* BusToAnalyze, EAtomFFTSize FFTSize, EAtomFFTPeakInterpolationMethod InterpolationMethod, EAtomFFTWindowType WindowType, float HopSize, EAtomSpectrumType SpectrumType);
	static void StartAudioBus(const class UObject* WorldContextObject, class UAtomAudioBus* AudioBus);
	static void StopAnalyzingOutput(const class UObject* WorldContextObject, class UAtomBus* BusToStopAnalyzing);
	static void StopAudioBus(const class UObject* WorldContextObject, class UAtomAudioBus* AudioBus);
	static void StopCategoryByName(const class UObject* WorldContextObject, class FName CategoryName);
	static void StopPlayback(const class UAtomComponent* AtomComponent, const struct FAtomSoundPlayback& PlaybackToStop);
	static void UnregisterAudioBusFromBus(const class UObject* WorldContextObject, class UAtomBus* AtomDspBus, class UAtomAudioBus* AudioBus);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomRuntimeBlueprintLibrary">();
	}
	static class UAtomRuntimeBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomRuntimeBlueprintLibrary>();
	}
};
static_assert(alignof(UAtomRuntimeBlueprintLibrary) == 0x000008, "Wrong alignment on UAtomRuntimeBlueprintLibrary");
static_assert(sizeof(UAtomRuntimeBlueprintLibrary) == 0x000028, "Wrong size on UAtomRuntimeBlueprintLibrary");

// Class CriWareCore.AtomUtilitiesBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UAtomUtilitiesBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static float ConvertDecibelsToLinear(float InDecibels, const struct FVector2D& InRange);
	static float ConvertDecibelsToLinearSlower(float InDecibels, const struct FVector2D& InRange);
	static float ConvertDecibelsToLinearSlowerFromFloor(float InDecibels, const struct FVector2D& InRange, float InFloor);
	static float ConvertLinearToDecibels(float InLinear, const struct FVector2D& InRange, float InFloor);
	static float ConvertLinearToDecibelsSlower(float InLinear, const struct FVector2D& InRange);
	static float ConvertLinearToDecibelsSlowerFromFloor(float InLinear, const struct FVector2D& InRange, float InFloor);
	static float GetLinearFrequencyClamped(const float InValue, const struct FVector2D& InDomain, const struct FVector2D& InRange);
	static float GetLogFrequencyClamped(const float InValue, const struct FVector2D& InDomain, const struct FVector2D& InRange);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomUtilitiesBlueprintLibrary">();
	}
	static class UAtomUtilitiesBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomUtilitiesBlueprintLibrary>();
	}
};
static_assert(alignof(UAtomUtilitiesBlueprintLibrary) == 0x000008, "Wrong alignment on UAtomUtilitiesBlueprintLibrary");
static_assert(sizeof(UAtomUtilitiesBlueprintLibrary) == 0x000028, "Wrong size on UAtomUtilitiesBlueprintLibrary");

// Class CriWareCore.AtomComponentGroup
// 0x0130 (0x0380 - 0x0250)
class UAtomComponentGroup final : public USceneComponent
{
public:
	uint8                                         Pad_250[0x8];                                      // 0x0250(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnStopped;                                         // 0x0258(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnKilled;                                          // 0x0268(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
