#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CriWareManaPlate

#include "Basic.hpp"


namespace SDK
{

// Enum CriWareManaPlate.EManaPlateResourceType
// NumValues: 0x0004
enum class EManaPlateResourceType : uint8
{
	Playlist                                 = 0,
	External                                 = 1,
	Asset                                    = 2,
	EManaPlateResourceType_MAX               = 3,
};

// Enum CriWareManaPlate.EManaPlateEventState
// NumValues: 0x000A
enum class EManaPlateEventState : uint8
{
	Play                                     = 0,
	Open                                     = 1,
	Close                                    = 2,
	Pause                                    = 3,
	Reverse                                  = 4,
	Forward                                  = 5,
	Rewind                                   = 6,
	Next                                     = 7,
	Previous                                 = 8,
	MAX                                      = 9,
};

// ScriptStruct CriWareManaPlate.ManaPlateResource
// 0x0068 (0x0068 - 0x0000)
struct FManaPlateResource final
{
public:
	EManaPlateResourceType                        Type;                                              // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ExternalManaPath;                                  // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UManaSource>             ManaAsset;                                         // 0x0018(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UManaPlaylist>           SourcePlaylist;                                    // 0x0040(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FManaPlateResource) == 0x000008, "Wrong alignment on FManaPlateResource");
static_assert(sizeof(FManaPlateResource) == 0x000068, "Wrong size on FManaPlateResource");
static_assert(offsetof(FManaPlateResource, Type) == 0x000000, "Member 'FManaPlateResource::Type' has a wrong offset!");
static_assert(offsetof(FManaPlateResource, ExternalManaPath) == 0x000008, "Member 'FManaPlateResource::ExternalManaPath' has a wrong offset!");
static_assert(offsetof(FManaPlateResource, ManaAsset) == 0x000018, "Member 'FManaPlateResource::ManaAsset' has a wrong offset!");
static_assert(offsetof(FManaPlateResource, SourcePlaylist) == 0x000040, "Member 'FManaPlateResource::SourcePlaylist' has a wrong offset!");

// ScriptStruct CriWareManaPlate.ManaTextureResourceSettings
// 0x0001 (0x0001 - 0x0000)
struct FManaTextureResourceSettings final
{
public:
	bool                                          bEnableGenMips;                                    // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FManaTextureResourceSettings) == 0x000001, "Wrong alignment on FManaTextureResourceSettings");
static_assert(sizeof(FManaTextureResourceSettings) == 0x000001, "Wrong size on FManaTextureResourceSettings");
static_assert(offsetof(FManaTextureResourceSettings, bEnableGenMips) == 0x000000, "Member 'FManaTextureResourceSettings::bEnableGenMips' has a wrong offset!");

}

