#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CriWareAppleSettings

#include "Basic.hpp"

#include "CriWareCore_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class CriWareAppleSettings.CriWareAppleSettings
// 0x0020 (0x0058 - 0x0038)
class UCriWareAppleSettings : public UDeveloperSettings
{
public:
	struct FAtomVoicesSettings                    VoicesOverrides;                                   // 0x0038(0x000C)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FCriWareCookOverridesSettings          CookOverrides;                                     // 0x0044(0x0002)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AtomSourceDataOverridePlugin;                      // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CriWareAppleSettings">();
	}
	static class UCriWareAppleSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCriWareAppleSettings>();
	}
};
static_assert(alignof(UCriWareAppleSettings) == 0x000008, "Wrong alignment on UCriWareAppleSettings");
static_assert(sizeof(UCriWareAppleSettings) == 0x000058, "Wrong size on UCriWareAppleSettings");
static_assert(offsetof(UCriWareAppleSettings, VoicesOverrides) == 0x000038, "Member 'UCriWareAppleSettings::VoicesOverrides' has a wrong offset!");
static_assert(offsetof(UCriWareAppleSettings, CookOverrides) == 0x000044, "Member 'UCriWareAppleSettings::CookOverrides' has a wrong offset!");
static_assert(offsetof(UCriWareAppleSettings, AtomSourceDataOverridePlugin) == 0x000048, "Member 'UCriWareAppleSettings::AtomSourceDataOverridePlugin' has a wrong offset!");

// Class CriWareAppleSettings.CriWareIOSSettings
// 0x0000 (0x0058 - 0x0058)
class UCriWareIOSSettings final : public UCriWareAppleSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CriWareIOSSettings">();
	}
	static class UCriWareIOSSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCriWareIOSSettings>();
	}
};
static_assert(alignof(UCriWareIOSSettings) == 0x000008, "Wrong alignment on UCriWareIOSSettings");
static_assert(sizeof(UCriWareIOSSettings) == 0x000058, "Wrong size on UCriWareIOSSettings");

// Class CriWareAppleSettings.CriWareMacSettings
// 0x0000 (0x0058 - 0x0058)
class UCriWareMacSettings final : public UCriWareAppleSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CriWareMacSettings">();
	}
	static class UCriWareMacSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCriWareMacSettings>();
	}
};
static_assert(alignof(UCriWareMacSettings) == 0x000008, "Wrong alignment on UCriWareMacSettings");
static_assert(sizeof(UCriWareMacSettings) == 0x000058, "Wrong size on UCriWareMacSettings");

}

