#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CriWareManaMovieScenes

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class CriWareManaMovieScenes.MovieSceneManaSection
// 0x0160 (0x0268 - 0x0108)
class UMovieSceneManaSection final : public UMovieSceneSection
{
public:
	class UManaSource*                            ManaSource;                                        // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ManaSourceProxyIndex;                              // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLooping;                                          // 0x0114(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameNumber                           StartFrameOffset;                                  // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UManaTexture*                           ManaTexture;                                       // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UManaSoundComponent*                    ManaSoundComponent;                                // 0x0128(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseExternalManaPlayer;                            // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UManaPlayer*                            ExternalManaPlayer;                                // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TextureIndex;                                      // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasManaPlayerProxy;                               // 0x0144(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneBoolChannel                 ChannelCanPlayerBeOpen;                            // 0x0148(0x0108)(NativeAccessSpecifierPublic)
	struct FMovieSceneObjectBindingID             ManaSourceProxyBindingID;                          // 0x0250(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneManaSection">();
	}
	static class UMovieSceneManaSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneManaSection>();
	}
};
static_assert(alignof(UMovieSceneManaSection) == 0x000008, "Wrong alignment on UMovieSceneManaSection");
static_assert(sizeof(UMovieSceneManaSection) == 0x000268, "Wrong size on UMovieSceneManaSection");
static_assert(offsetof(UMovieSceneManaSection, ManaSource) == 0x000108, "Member 'UMovieSceneManaSection::ManaSource' has a wrong offset!");
static_assert(offsetof(UMovieSceneManaSection, ManaSourceProxyIndex) == 0x000110, "Member 'UMovieSceneManaSection::ManaSourceProxyIndex' has a wrong offset!");
static_assert(offsetof(UMovieSceneManaSection, bLooping) == 0x000114, "Member 'UMovieSceneManaSection::bLooping' has a wrong offset!");
static_assert(offsetof(UMovieSceneManaSection, StartFrameOffset) == 0x000118, "Member 'UMovieSceneManaSection::StartFrameOffset' has a wrong offset!");
static_assert(offsetof(UMovieSceneManaSection, ManaTexture) == 0x000120, "Member 'UMovieSceneManaSection::ManaTexture' has a wrong offset!");
static_assert(offsetof(UMovieSceneManaSection, ManaSoundComponent) == 0x000128, "Member 'UMovieSceneManaSection::ManaSoundComponent' has a wrong offset!");
static_assert(offsetof(UMovieSceneManaSection, bUseExternalManaPlayer) == 0x000130, "Member 'UMovieSceneManaSection::bUseExternalManaPlayer' has a wrong offset!");
static_assert(offsetof(UMovieSceneManaSection, ExternalManaPlayer) == 0x000138, "Member 'UMovieSceneManaSection::ExternalManaPlayer' has a wrong offset!");
static_assert(offsetof(UMovieSceneManaSection, TextureIndex) == 0x000140, "Member 'UMovieSceneManaSection::TextureIndex' has a wrong offset!");
static_assert(offsetof(UMovieSceneManaSection, bHasManaPlayerProxy) == 0x000144, "Member 'UMovieSceneManaSection::bHasManaPlayerProxy' has a wrong offset!");
static_assert(offsetof(UMovieSceneManaSection, ChannelCanPlayerBeOpen) == 0x000148, "Member 'UMovieSceneManaSection::ChannelCanPlayerBeOpen' has a wrong offset!");
static_assert(offsetof(UMovieSceneManaSection, ManaSourceProxyBindingID) == 0x000250, "Member 'UMovieSceneManaSection::ManaSourceProxyBindingID' has a wrong offset!");

// Class CriWareManaMovieScenes.MovieSceneManaTrack
// 0x0018 (0x0128 - 0x0110)
class UMovieSceneManaTrack final : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             ManaSections;                                      // 0x0118(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneManaTrack">();
	}
	static class UMovieSceneManaTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneManaTrack>();
	}
};
static_assert(alignof(UMovieSceneManaTrack) == 0x000008, "Wrong alignment on UMovieSceneManaTrack");
static_assert(sizeof(UMovieSceneManaTrack) == 0x000128, "Wrong size on UMovieSceneManaTrack");
static_assert(offsetof(UMovieSceneManaTrack, ManaSections) == 0x000118, "Member 'UMovieSceneManaTrack::ManaSections' has a wrong offset!");

}

