#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CriWareWindowsSettings

#include "Basic.hpp"


namespace SDK
{

// Enum CriWareWindowsSettings.EAtomWindowsHardwareDevices
// NumValues: 0x0005
enum class EAtomWindowsHardwareDevices : uint8
{
	HardwareDevice1                          = 0,
	HardwareDevice2                          = 1,
	HardwareDevice3                          = 2,
	HardwareDevice4                          = 3,
	EAtomWindowsHardwareDevices_MAX          = 4,
};

// ScriptStruct CriWareWindowsSettings.CriWareWASAPISettings
// 0x0014 (0x0014 - 0x0000)
struct FCriWareWASAPISettings final
{
public:
	bool                                          bEnableHardware1;                                  // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableHardware2;                                  // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableHardware3;                                  // 0x0002(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableHardware4;                                  // 0x0003(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWASAPI_IsExclusive;                               // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WASAPI_BitsPerSample;                              // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WASAPI_SamplingRate;                               // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WASAPI_NumChannels;                                // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCriWareWASAPISettings) == 0x000004, "Wrong alignment on FCriWareWASAPISettings");
static_assert(sizeof(FCriWareWASAPISettings) == 0x000014, "Wrong size on FCriWareWASAPISettings");
static_assert(offsetof(FCriWareWASAPISettings, bEnableHardware1) == 0x000000, "Member 'FCriWareWASAPISettings::bEnableHardware1' has a wrong offset!");
static_assert(offsetof(FCriWareWASAPISettings, bEnableHardware2) == 0x000001, "Member 'FCriWareWASAPISettings::bEnableHardware2' has a wrong offset!");
static_assert(offsetof(FCriWareWASAPISettings, bEnableHardware3) == 0x000002, "Member 'FCriWareWASAPISettings::bEnableHardware3' has a wrong offset!");
static_assert(offsetof(FCriWareWASAPISettings, bEnableHardware4) == 0x000003, "Member 'FCriWareWASAPISettings::bEnableHardware4' has a wrong offset!");
static_assert(offsetof(FCriWareWASAPISettings, bWASAPI_IsExclusive) == 0x000004, "Member 'FCriWareWASAPISettings::bWASAPI_IsExclusive' has a wrong offset!");
static_assert(offsetof(FCriWareWASAPISettings, WASAPI_BitsPerSample) == 0x000008, "Member 'FCriWareWASAPISettings::WASAPI_BitsPerSample' has a wrong offset!");
static_assert(offsetof(FCriWareWASAPISettings, WASAPI_SamplingRate) == 0x00000C, "Member 'FCriWareWASAPISettings::WASAPI_SamplingRate' has a wrong offset!");
static_assert(offsetof(FCriWareWASAPISettings, WASAPI_NumChannels) == 0x000010, "Member 'FCriWareWASAPISettings::WASAPI_NumChannels' has a wrong offset!");

}

