#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CriWareManaWindowsSettings

#include "Basic.hpp"

#include "CriWareMana_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class CriWareManaWindowsSettings.CriWareManaWindowsSettings
// 0x0020 (0x0058 - 0x0038)
class UCriWareManaWindowsSettings final : public UDeveloperSettings
{
public:
	bool                                          bEnableH264Decoder;                                // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableVP9Decoder;                                 // 0x0039(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableAV1Decoder;                                 // 0x003A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseHardwareAcceleratedVideoDecoding;              // 0x003B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCriWareManaMovieSettingOverrides      ManaMovieOverrides;                                // 0x003C(0x001C)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CriWareManaWindowsSettings">();
	}
	static class UCriWareManaWindowsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCriWareManaWindowsSettings>();
	}
};
static_assert(alignof(UCriWareManaWindowsSettings) == 0x000008, "Wrong alignment on UCriWareManaWindowsSettings");
static_assert(sizeof(UCriWareManaWindowsSettings) == 0x000058, "Wrong size on UCriWareManaWindowsSettings");
static_assert(offsetof(UCriWareManaWindowsSettings, bEnableH264Decoder) == 0x000038, "Member 'UCriWareManaWindowsSettings::bEnableH264Decoder' has a wrong offset!");
static_assert(offsetof(UCriWareManaWindowsSettings, bEnableVP9Decoder) == 0x000039, "Member 'UCriWareManaWindowsSettings::bEnableVP9Decoder' has a wrong offset!");
static_assert(offsetof(UCriWareManaWindowsSettings, bEnableAV1Decoder) == 0x00003A, "Member 'UCriWareManaWindowsSettings::bEnableAV1Decoder' has a wrong offset!");
static_assert(offsetof(UCriWareManaWindowsSettings, bUseHardwareAcceleratedVideoDecoding) == 0x00003B, "Member 'UCriWareManaWindowsSettings::bUseHardwareAcceleratedVideoDecoding' has a wrong offset!");
static_assert(offsetof(UCriWareManaWindowsSettings, ManaMovieOverrides) == 0x00003C, "Member 'UCriWareManaWindowsSettings::ManaMovieOverrides' has a wrong offset!");

}

