#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CriWareCore

#include "Basic.hpp"

#include "CriWareCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CriWareCore.AtomAisacPatch.GetConfig
// 0x0008 (0x0008 - 0x0000)
struct AtomAisacPatch_GetConfig final
{
public:
	class UAtomConfig*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomAisacPatch_GetConfig) == 0x000008, "Wrong alignment on AtomAisacPatch_GetConfig");
static_assert(sizeof(AtomAisacPatch_GetConfig) == 0x000008, "Wrong size on AtomAisacPatch_GetConfig");
static_assert(offsetof(AtomAisacPatch_GetConfig, ReturnValue) == 0x000000, "Member 'AtomAisacPatch_GetConfig::ReturnValue' has a wrong offset!");

// Function CriWareCore.AtomGameplayVolumeMutator.SetPriority
// 0x0004 (0x0004 - 0x0000)
struct AtomGameplayVolumeMutator_SetPriority final
{
public:
	int32                                         InPriority;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomGameplayVolumeMutator_SetPriority) == 0x000004, "Wrong alignment on AtomGameplayVolumeMutator_SetPriority");
static_assert(sizeof(AtomGameplayVolumeMutator_SetPriority) == 0x000004, "Wrong size on AtomGameplayVolumeMutator_SetPriority");
static_assert(offsetof(AtomGameplayVolumeMutator_SetPriority, InPriority) == 0x000000, "Member 'AtomGameplayVolumeMutator_SetPriority::InPriority' has a wrong offset!");

// Function CriWareCore.AtomAisacVolumeComponent.SetAisacControlSettings
// 0x0010 (0x0010 - 0x0000)
struct AtomAisacVolumeComponent_SetAisacControlSettings final
{
public:
	TArray<struct FAtomVolumeAisacControlSettings> NewAisacControlSettings;                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomAisacVolumeComponent_SetAisacControlSettings) == 0x000008, "Wrong alignment on AtomAisacVolumeComponent_SetAisacControlSettings");
static_assert(sizeof(AtomAisacVolumeComponent_SetAisacControlSettings) == 0x000010, "Wrong size on AtomAisacVolumeComponent_SetAisacControlSettings");
static_assert(offsetof(AtomAisacVolumeComponent_SetAisacControlSettings, NewAisacControlSettings) == 0x000000, "Member 'AtomAisacVolumeComponent_SetAisacControlSettings::NewAisacControlSettings' has a wrong offset!");

// Function CriWareCore.AtomAttenuationVolumeComponent.SetExteriorVolume
// 0x0008 (0x0008 - 0x0000)
struct AtomAttenuationVolumeComponent_SetExteriorVolume final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpolateTime;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomAttenuationVolumeComponent_SetExteriorVolume) == 0x000004, "Wrong alignment on AtomAttenuationVolumeComponent_SetExteriorVolume");
static_assert(sizeof(AtomAttenuationVolumeComponent_SetExteriorVolume) == 0x000008, "Wrong size on AtomAttenuationVolumeComponent_SetExteriorVolume");
static_assert(offsetof(AtomAttenuationVolumeComponent_SetExteriorVolume, Volume) == 0x000000, "Member 'AtomAttenuationVolumeComponent_SetExteriorVolume::Volume' has a wrong offset!");
static_assert(offsetof(AtomAttenuationVolumeComponent_SetExteriorVolume, InterpolateTime) == 0x000004, "Member 'AtomAttenuationVolumeComponent_SetExteriorVolume::InterpolateTime' has a wrong offset!");

// Function CriWareCore.AtomAttenuationVolumeComponent.SetInteriorVolume
// 0x0008 (0x0008 - 0x0000)
struct AtomAttenuationVolumeComponent_SetInteriorVolume final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InterpolateTime;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomAttenuationVolumeComponent_SetInteriorVolume) == 0x000004, "Wrong alignment on AtomAttenuationVolumeComponent_SetInteriorVolume");
static_assert(sizeof(AtomAttenuationVolumeComponent_SetInteriorVolume) == 0x000008, "Wrong size on AtomAttenuationVolumeComponent_SetInteriorVolume");
static_assert(offsetof(AtomAttenuationVolumeComponent_SetInteriorVolume, Volume) == 0x000000, "Member 'AtomAttenuationVolumeComponent_SetInteriorVolume::Volume' has a wrong offset!");
static_assert(offsetof(AtomAttenuationVolumeComponent_SetInteriorVolume, InterpolateTime) == 0x000004, "Member 'AtomAttenuationVolumeComponent_SetInteriorVolume::InterpolateTime' has a wrong offset!");

// Function CriWareCore.AtomSynthComponent.GetModulators
// 0x0058 (0x0058 - 0x0000)
struct AtomSynthComponent_GetModulators final
{
public:
	EAtomModulationDestination                    Destination;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class UAtomModulatorBase*>               ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomSynthComponent_GetModulators) == 0x000008, "Wrong alignment on AtomSynthComponent_GetModulators");
static_assert(sizeof(AtomSynthComponent_GetModulators) == 0x000058, "Wrong size on AtomSynthComponent_GetModulators");
static_assert(offsetof(AtomSynthComponent_GetModulators, Destination) == 0x000000, "Member 'AtomSynthComponent_GetModulators::Destination' has a wrong offset!");
static_assert(offsetof(AtomSynthComponent_GetModulators, ReturnValue) == 0x000008, "Member 'AtomSynthComponent_GetModulators::ReturnValue' has a wrong offset!");

// Function CriWareCore.AtomSynthComponent.SetAisacControlValue
// 0x0010 (0x0010 - 0x0000)
struct AtomSynthComponent_SetAisacControlValue final
{
public:
	struct FAtomAisacControl                      AisacControl;                                      // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomSynthComponent_SetAisacControlValue) == 0x000004, "Wrong alignment on AtomSynthComponent_SetAisacControlValue");
static_assert(sizeof(AtomSynthComponent_SetAisacControlValue) == 0x000010, "Wrong size on AtomSynthComponent_SetAisacControlValue");
static_assert(offsetof(AtomSynthComponent_SetAisacControlValue, AisacControl) == 0x000000, "Member 'AtomSynthComponent_SetAisacControlValue::AisacControl' has a wrong offset!");
static_assert(offsetof(AtomSynthComponent_SetAisacControlValue, Value) == 0x00000C, "Member 'AtomSynthComponent_SetAisacControlValue::Value' has a wrong offset!");

// Function CriWareCore.AtomSynthComponent.SetAtomBusSend
// 0x0010 (0x0010 - 0x0000)
struct AtomSynthComponent_SetAtomBusSend final
{
public:
	class UAtomBus*                               Bus;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SendLevel;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomSynthComponent_SetAtomBusSend) == 0x000008, "Wrong alignment on AtomSynthComponent_SetAtomBusSend");
static_assert(sizeof(AtomSynthComponent_SetAtomBusSend) == 0x000010, "Wrong size on AtomSynthComponent_SetAtomBusSend");
static_assert(offsetof(AtomSynthComponent_SetAtomBusSend, Bus) == 0x000000, "Member 'AtomSynthComponent_SetAtomBusSend::Bus' has a wrong offset!");
static_assert(offsetof(AtomSynthComponent_SetAtomBusSend, SendLevel) == 0x000008, "Member 'AtomSynthComponent_SetAtomBusSend::SendLevel' has a wrong offset!");

// Function CriWareCore.AtomSynthComponent.SetAtomBusSendPreEffect
// 0x0010 (0x0010 - 0x0000)
struct AtomSynthComponent_SetAtomBusSendPreEffect final
{
public:
	class UAtomBus*                               AtomBus;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AtomBusSendLevel;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomSynthComponent_SetAtomBusSendPreEffect) == 0x000008, "Wrong alignment on AtomSynthComponent_SetAtomBusSendPreEffect");
static_assert(sizeof(AtomSynthComponent_SetAtomBusSendPreEffect) == 0x000010, "Wrong size on AtomSynthComponent_SetAtomBusSendPreEffect");
static_assert(offsetof(AtomSynthComponent_SetAtomBusSendPreEffect, AtomBus) == 0x000000, "Member 'AtomSynthComponent_SetAtomBusSendPreEffect::AtomBus' has a wrong offset!");
static_assert(offsetof(AtomSynthComponent_SetAtomBusSendPreEffect, AtomBusSendLevel) == 0x000008, "Member 'AtomSynthComponent_SetAtomBusSendPreEffect::AtomBusSendLevel' has a wrong offset!");

// Function CriWareCore.AtomSynthComponent.SetAudioBusSendPreEffect
// 0x0010 (0x0010 - 0x0000)
struct AtomSynthComponent_SetAudioBusSendPreEffect final
{
public:
	class UAtomAudioBus*                          AudioBus;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AudioBusSendLevel;                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomSynthComponent_SetAudioBusSendPreEffect) == 0x000008, "Wrong alignment on AtomSynthComponent_SetAudioBusSendPreEffect");
static_assert(sizeof(AtomSynthComponent_SetAudioBusSendPreEffect) == 0x000010, "Wrong size on AtomSynthComponent_SetAudioBusSendPreEffect");
static_assert(offsetof(AtomSynthComponent_SetAudioBusSendPreEffect, AudioBus) == 0x000000, "Member 'AtomSynthComponent_SetAudioBusSendPreEffect::AudioBus' has a wrong offset!");
static_assert(offsetof(AtomSynthComponent_SetAudioBusSendPreEffect, AudioBusSendLevel) == 0x000008, "Member 'AtomSynthComponent_SetAudioBusSendPreEffect::AudioBusSendLevel' has a wrong offset!");

// Function CriWareCore.AtomSynthComponent.SetLowPassFilterEnabled
// 0x0001 (0x0001 - 0x0000)
struct AtomSynthComponent_SetLowPassFilterEnabled final
{
public:
	bool                                          InLowPassFilterEnabled;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomSynthComponent_SetLowPassFilterEnabled) == 0x000001, "Wrong alignment on AtomSynthComponent_SetLowPassFilterEnabled");
static_assert(sizeof(AtomSynthComponent_SetLowPassFilterEnabled) == 0x000001, "Wrong size on AtomSynthComponent_SetLowPassFilterEnabled");
static_assert(offsetof(AtomSynthComponent_SetLowPassFilterEnabled, InLowPassFilterEnabled) == 0x000000, "Member 'AtomSynthComponent_SetLowPassFilterEnabled::InLowPassFilterEnabled' has a wrong offset!");

// Function CriWareCore.AtomSynthComponent.SetLowPassFilterFrequency
// 0x0004 (0x0004 - 0x0000)
struct AtomSynthComponent_SetLowPassFilterFrequency final
{
public:
	float                                         InLowPassFilterFrequency;                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomSynthComponent_SetLowPassFilterFrequency) == 0x000004, "Wrong alignment on AtomSynthComponent_SetLowPassFilterFrequency");
static_assert(sizeof(AtomSynthComponent_SetLowPassFilterFrequency) == 0x000004, "Wrong size on AtomSynthComponent_SetLowPassFilterFrequency");
static_assert(offsetof(AtomSynthComponent_SetLowPassFilterFrequency, InLowPassFilterFrequency) == 0x000000, "Member 'AtomSynthComponent_SetLowPassFilterFrequency::InLowPassFilterFrequency' has a wrong offset!");

// Function CriWareCore.AtomSynthComponent.SetModulationRouting
// 0x0058 (0x0058 - 0x0000)
struct AtomSynthComponent_SetModulationRouting final
{
public:
	TSet<class UAtomModulatorBase*>               Modulators;                                        // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EAtomModulationDestination                    Destination;                                       // 0x0050(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomModulationRouting                        RoutingMethod;                                     // 0x0051(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomSynthComponent_SetModulationRouting) == 0x000008, "Wrong alignment on AtomSynthComponent_SetModulationRouting");
static_assert(sizeof(AtomSynthComponent_SetModulationRouting) == 0x000058, "Wrong size on AtomSynthComponent_SetModulationRouting");
static_assert(offsetof(AtomSynthComponent_SetModulationRouting, Modulators) == 0x000000, "Member 'AtomSynthComponent_SetModulationRouting::Modulators' has a wrong offset!");
static_assert(offsetof(AtomSynthComponent_SetModulationRouting, Destination) == 0x000050, "Member 'AtomSynthComponent_SetModulationRouting::Destination' has a wrong offset!");
static_assert(offsetof(AtomSynthComponent_SetModulationRouting, RoutingMethod) == 0x000051, "Member 'AtomSynthComponent_SetModulationRouting::RoutingMethod' has a wrong offset!");

// Function CriWareCore.AtomSynthComponent.SetMultiplePositions
// 0x0018 (0x0018 - 0x0000)
struct AtomSynthComponent_SetMultiplePositions final
{
public:
	TArray<struct FTransform>                     Positions;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	EAtomMultiPositionType                        MultiPositionType;                                 // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomSynthComponent_SetMultiplePositions) == 0x000008, "Wrong alignment on AtomSynthComponent_SetMultiplePositions");
static_assert(sizeof(AtomSynthComponent_SetMultiplePositions) == 0x000018, "Wrong size on AtomSynthComponent_SetMultiplePositions");
static_assert(offsetof(AtomSynthComponent_SetMultiplePositions, Positions) == 0x000000, "Member 'AtomSynthComponent_SetMultiplePositions::Positions' has a wrong offset!");
static_assert(offsetof(AtomSynthComponent_SetMultiplePositions, MultiPositionType) == 0x000010, "Member 'AtomSynthComponent_SetMultiplePositions::MultiPositionType' has a wrong offset!");

// Function CriWareCore.AtomSynthComponent.SetRackSend
// 0x0008 (0x0008 - 0x0000)
struct AtomSynthComponent_SetRackSend final
{
public:
	class UAtomRackBase*                          Rack;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomSynthComponent_SetRackSend) == 0x000008, "Wrong alignment on AtomSynthComponent_SetRackSend");
static_assert(sizeof(AtomSynthComponent_SetRackSend) == 0x000008, "Wrong size on AtomSynthComponent_SetRackSend");
static_assert(offsetof(AtomSynthComponent_SetRackSend, Rack) == 0x000000, "Member 'AtomSynthComponent_SetRackSend::Rack' has a wrong offset!");

// Function CriWareCore.AtomSynthComponent.SetSourceBusSendPreEffect
// 0x0010 (0x0010 - 0x0000)
struct AtomSynthComponent_SetSourceBusSendPreEffect final
{
public:
	class UAtomSoundSourceBus*                    SoundSourceBus;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SourceBusSendLevel;                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomSynthComponent_SetSourceBusSendPreEffect) == 0x000008, "Wrong alignment on AtomSynthComponent_SetSourceBusSendPreEffect");
static_assert(sizeof(AtomSynthComponent_SetSourceBusSendPreEffect) == 0x000010, "Wrong size on AtomSynthComponent_SetSourceBusSendPreEffect");
static_assert(offsetof(AtomSynthComponent_SetSourceBusSendPreEffect, SoundSourceBus) == 0x000000, "Member 'AtomSynthComponent_SetSourceBusSendPreEffect::SoundSourceBus' has a wrong offset!");
static_assert(offsetof(AtomSynthComponent_SetSourceBusSendPreEffect, SourceBusSendLevel) == 0x000008, "Member 'AtomSynthComponent_SetSourceBusSendPreEffect::SourceBusSendLevel' has a wrong offset!");

// Function CriWareCore.AtomSynthComponent.SetVolumeMultiplier
// 0x0004 (0x0004 - 0x0000)
struct AtomSynthComponent_SetVolumeMultiplier final
{
public:
	float                                         VolumeMultiplier;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomSynthComponent_SetVolumeMultiplier) == 0x000004, "Wrong alignment on AtomSynthComponent_SetVolumeMultiplier");
static_assert(sizeof(AtomSynthComponent_SetVolumeMultiplier) == 0x000004, "Wrong size on AtomSynthComponent_SetVolumeMultiplier");
static_assert(offsetof(AtomSynthComponent_SetVolumeMultiplier, VolumeMultiplier) == 0x000000, "Member 'AtomSynthComponent_SetVolumeMultiplier::VolumeMultiplier' has a wrong offset!");

// Function CriWareCore.AtomSynthComponent.AdjustVolume
// 0x000C (0x000C - 0x0000)
struct AtomSynthComponent_AdjustVolume final
{
public:
	float                                         AdjustVolumeDuration;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AdjustVolumeLevel;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomFaderCurve                               FadeCurve;                                         // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomSynthComponent_AdjustVolume) == 0x000004, "Wrong alignment on AtomSynthComponent_AdjustVolume");
static_assert(sizeof(AtomSynthComponent_AdjustVolume) == 0x00000C, "Wrong size on AtomSynthComponent_AdjustVolume");
static_assert(offsetof(AtomSynthComponent_AdjustVolume, AdjustVolumeDuration) == 0x000000, "Member 'AtomSynthComponent_AdjustVolume::AdjustVolumeDuration' has a wrong offset!");
static_assert(offsetof(AtomSynthComponent_AdjustVolume, AdjustVolumeLevel) == 0x000004, "Member 'AtomSynthComponent_AdjustVolume::AdjustVolumeLevel' has a wrong offset!");
static_assert(offsetof(AtomSynthComponent_AdjustVolume, FadeCurve) == 0x000008, "Member 'AtomSynthComponent_AdjustVolume::FadeCurve' has a wrong offset!");

// Function CriWareCore.AtomSynthComponent.FadeIn
// 0x0010 (0x0010 - 0x0000)
struct AtomSynthComponent_FadeIn final
{
public:
	float                                         FadeInDuration;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeVolumeLevel;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomFaderCurve                               FadeCurve;                                         // 0x000C(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomSynthComponent_FadeIn) == 0x000004, "Wrong alignment on AtomSynthComponent_FadeIn");
static_assert(sizeof(AtomSynthComponent_FadeIn) == 0x000010, "Wrong size on AtomSynthComponent_FadeIn");
static_assert(offsetof(AtomSynthComponent_FadeIn, FadeInDuration) == 0x000000, "Member 'AtomSynthComponent_FadeIn::FadeInDuration' has a wrong offset!");
static_assert(offsetof(AtomSynthComponent_FadeIn, FadeVolumeLevel) == 0x000004, "Member 'AtomSynthComponent_FadeIn::FadeVolumeLevel' has a wrong offset!");
static_assert(offsetof(AtomSynthComponent_FadeIn, StartTime) == 0x000008, "Member 'AtomSynthComponent_FadeIn::StartTime' has a wrong offset!");
static_assert(offsetof(AtomSynthComponent_FadeIn, FadeCurve) == 0x00000C, "Member 'AtomSynthComponent_FadeIn::FadeCurve' has a wrong offset!");

// Function CriWareCore.AtomSynthComponent.FadeOut
// 0x000C (0x000C - 0x0000)
struct AtomSynthComponent_FadeOut final
{
public:
	float                                         FadeOutDuration;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeVolumeLevel;                                   // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomFaderCurve                               FadeCurve;                                         // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomSynthComponent_FadeOut) == 0x000004, "Wrong alignment on AtomSynthComponent_FadeOut");
static_assert(sizeof(AtomSynthComponent_FadeOut) == 0x00000C, "Wrong size on AtomSynthComponent_FadeOut");
static_assert(offsetof(AtomSynthComponent_FadeOut, FadeOutDuration) == 0x000000, "Member 'AtomSynthComponent_FadeOut::FadeOutDuration' has a wrong offset!");
static_assert(offsetof(AtomSynthComponent_FadeOut, FadeVolumeLevel) == 0x000004, "Member 'AtomSynthComponent_FadeOut::FadeVolumeLevel' has a wrong offset!");
static_assert(offsetof(AtomSynthComponent_FadeOut, FadeCurve) == 0x000008, "Member 'AtomSynthComponent_FadeOut::FadeCurve' has a wrong offset!");

// Function CriWareCore.AtomSynthComponent.GetAtomComponentExtension
// 0x0010 (0x0010 - 0x0000)
struct AtomSynthComponent_GetAtomComponentExtension final
{
public:
	TScriptInterface<class IAtomComponentExtension> ReturnValue;                                     // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomSynthComponent_GetAtomComponentExtension) == 0x000008, "Wrong alignment on AtomSynthComponent_GetAtomComponentExtension");
static_assert(sizeof(AtomSynthComponent_GetAtomComponentExtension) == 0x000010, "Wrong size on AtomSynthComponent_GetAtomComponentExtension");
static_assert(offsetof(AtomSynthComponent_GetAtomComponentExtension, ReturnValue) == 0x000000, "Member 'AtomSynthComponent_GetAtomComponentExtension::ReturnValue' has a wrong offset!");

// Function CriWareCore.AtomSynthComponent.IsPlaying
// 0x0001 (0x0001 - 0x0000)
struct AtomSynthComponent_IsPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomSynthComponent_IsPlaying) == 0x000001, "Wrong alignment on AtomSynthComponent_IsPlaying");
static_assert(sizeof(AtomSynthComponent_IsPlaying) == 0x000001, "Wrong size on AtomSynthComponent_IsPlaying");
static_assert(offsetof(AtomSynthComponent_IsPlaying, ReturnValue) == 0x000000, "Member 'AtomSynthComponent_IsPlaying::ReturnValue' has a wrong offset!");

// Function CriWareCore.AtomRuntimeBlueprintLibrary.AddGlobalVoicePool
// 0x0020 (0x0020 - 0x0000)
struct AtomRuntimeBlueprintLibrary_AddGlobalVoicePool final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PoolName;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomVoicesSettings                    VoicesSettings;                                    // 0x0010(0x000C)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	EAtomVoicePoolCodecType                       CodecType;                                         // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomVoicePoolStreamingType                   StreamingType;                                     // 0x001D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomRuntimeBlueprintLibrary_AddGlobalVoicePool) == 0x000008, "Wrong alignment on AtomRuntimeBlueprintLibrary_AddGlobalVoicePool");
static_assert(sizeof(AtomRuntimeBlueprintLibrary_AddGlobalVoicePool) == 0x000020, "Wrong size on AtomRuntimeBlueprintLibrary_AddGlobalVoicePool");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_AddGlobalVoicePool, WorldContextObject) == 0x000000, "Member 'AtomRuntimeBlueprintLibrary_AddGlobalVoicePool::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_AddGlobalVoicePool, PoolName) == 0x000008, "Member 'AtomRuntimeBlueprintLibrary_AddGlobalVoicePool::PoolName' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_AddGlobalVoicePool, VoicesSettings) == 0x000010, "Member 'AtomRuntimeBlueprintLibrary_AddGlobalVoicePool::VoicesSettings' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_AddGlobalVoicePool, CodecType) == 0x00001C, "Member 'AtomRuntimeBlueprintLibrary_AddGlobalVoicePool::CodecType' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_AddGlobalVoicePool, StreamingType) == 0x00001D, "Member 'AtomRuntimeBlueprintLibrary_AddGlobalVoicePool::StreamingType' has a wrong offset!");

// Function CriWareCore.AtomRuntimeBlueprintLibrary.ClearBusEffectPresets
// 0x0010 (0x0010 - 0x0000)
struct AtomRuntimeBlueprintLibrary_ClearBusEffectPresets final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomBus*                               AtomBus;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomRuntimeBlueprintLibrary_ClearBusEffectPresets) == 0x000008, "Wrong alignment on AtomRuntimeBlueprintLibrary_ClearBusEffectPresets");
static_assert(sizeof(AtomRuntimeBlueprintLibrary_ClearBusEffectPresets) == 0x000010, "Wrong size on AtomRuntimeBlueprintLibrary_ClearBusEffectPresets");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_ClearBusEffectPresets, WorldContextObject) == 0x000000, "Member 'AtomRuntimeBlueprintLibrary_ClearBusEffectPresets::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_ClearBusEffectPresets, AtomBus) == 0x000008, "Member 'AtomRuntimeBlueprintLibrary_ClearBusEffectPresets::AtomBus' has a wrong offset!");

// Function CriWareCore.AtomRuntimeBlueprintLibrary.ClearMasterEffectPresets
// 0x0008 (0x0008 - 0x0000)
struct AtomRuntimeBlueprintLibrary_ClearMasterEffectPresets final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomRuntimeBlueprintLibrary_ClearMasterEffectPresets) == 0x000008, "Wrong alignment on AtomRuntimeBlueprintLibrary_ClearMasterEffectPresets");
static_assert(sizeof(AtomRuntimeBlueprintLibrary_ClearMasterEffectPresets) == 0x000008, "Wrong size on AtomRuntimeBlueprintLibrary_ClearMasterEffectPresets");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_ClearMasterEffectPresets, WorldContextObject) == 0x000000, "Member 'AtomRuntimeBlueprintLibrary_ClearMasterEffectPresets::WorldContextObject' has a wrong offset!");

// Function CriWareCore.AtomRuntimeBlueprintLibrary.ClearRackEffectPresets
// 0x0010 (0x0010 - 0x0000)
struct AtomRuntimeBlueprintLibrary_ClearRackEffectPresets final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomRack*                              AtomRack;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomRuntimeBlueprintLibrary_ClearRackEffectPresets) == 0x000008, "Wrong alignment on AtomRuntimeBlueprintLibrary_ClearRackEffectPresets");
static_assert(sizeof(AtomRuntimeBlueprintLibrary_ClearRackEffectPresets) == 0x000010, "Wrong size on AtomRuntimeBlueprintLibrary_ClearRackEffectPresets");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_ClearRackEffectPresets, WorldContextObject) == 0x000000, "Member 'AtomRuntimeBlueprintLibrary_ClearRackEffectPresets::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_ClearRackEffectPresets, AtomRack) == 0x000008, "Member 'AtomRuntimeBlueprintLibrary_ClearRackEffectPresets::AtomRack' has a wrong offset!");

// Function CriWareCore.AtomRuntimeBlueprintLibrary.EnableBinauralizer
// 0x0010 (0x0010 - 0x0000)
struct AtomRuntimeBlueprintLibrary_EnableBinauralizer final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomRuntimeBlueprintLibrary_EnableBinauralizer) == 0x000008, "Wrong alignment on AtomRuntimeBlueprintLibrary_EnableBinauralizer");
static_assert(sizeof(AtomRuntimeBlueprintLibrary_EnableBinauralizer) == 0x000010, "Wrong size on AtomRuntimeBlueprintLibrary_EnableBinauralizer");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_EnableBinauralizer, WorldContextObject) == 0x000000, "Member 'AtomRuntimeBlueprintLibrary_EnableBinauralizer::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_EnableBinauralizer, bEnable) == 0x000008, "Member 'AtomRuntimeBlueprintLibrary_EnableBinauralizer::bEnable' has a wrong offset!");

// Function CriWareCore.AtomRuntimeBlueprintLibrary.GetAllPlaybacks
// 0x0018 (0x0018 - 0x0000)
struct AtomRuntimeBlueprintLibrary_GetAllPlaybacks final
{
public:
	const class UAtomComponent*                   AtomComponent;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAtomSoundPlayback>             Playbacks;                                         // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomRuntimeBlueprintLibrary_GetAllPlaybacks) == 0x000008, "Wrong alignment on AtomRuntimeBlueprintLibrary_GetAllPlaybacks");
static_assert(sizeof(AtomRuntimeBlueprintLibrary_GetAllPlaybacks) == 0x000018, "Wrong size on AtomRuntimeBlueprintLibrary_GetAllPlaybacks");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_GetAllPlaybacks, AtomComponent) == 0x000000, "Member 'AtomRuntimeBlueprintLibrary_GetAllPlaybacks::AtomComponent' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_GetAllPlaybacks, Playbacks) == 0x000008, "Member 'AtomRuntimeBlueprintLibrary_GetAllPlaybacks::Playbacks' has a wrong offset!");

// Function CriWareCore.AtomRuntimeBlueprintLibrary.GetCategoryStatusByName
// 0x0020 (0x0020 - 0x0000)
struct AtomRuntimeBlueprintLibrary_GetCategoryStatusByName final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CategoryName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const class FName CategoryName, const bool IsPaused, const bool IsMuted, const bool IsSoloed, const float Volume, const int32 PlayCount)> OnGetStatus; // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomRuntimeBlueprintLibrary_GetCategoryStatusByName) == 0x000008, "Wrong alignment on AtomRuntimeBlueprintLibrary_GetCategoryStatusByName");
static_assert(sizeof(AtomRuntimeBlueprintLibrary_GetCategoryStatusByName) == 0x000020, "Wrong size on AtomRuntimeBlueprintLibrary_GetCategoryStatusByName");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_GetCategoryStatusByName, WorldContextObject) == 0x000000, "Member 'AtomRuntimeBlueprintLibrary_GetCategoryStatusByName::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_GetCategoryStatusByName, CategoryName) == 0x000008, "Member 'AtomRuntimeBlueprintLibrary_GetCategoryStatusByName::CategoryName' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_GetCategoryStatusByName, OnGetStatus) == 0x000010, "Member 'AtomRuntimeBlueprintLibrary_GetCategoryStatusByName::OnGetStatus' has a wrong offset!");

// Function CriWareCore.AtomRuntimeBlueprintLibrary.GetGameVariableValueByName
// 0x0020 (0x0020 - 0x0000)
struct AtomRuntimeBlueprintLibrary_GetGameVariableValueByName final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CategoryName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const class FName Name, const float Value)> OnGetValue;                           // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomRuntimeBlueprintLibrary_GetGameVariableValueByName) == 0x000008, "Wrong alignment on AtomRuntimeBlueprintLibrary_GetGameVariableValueByName");
static_assert(sizeof(AtomRuntimeBlueprintLibrary_GetGameVariableValueByName) == 0x000020, "Wrong size on AtomRuntimeBlueprintLibrary_GetGameVariableValueByName");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_GetGameVariableValueByName, WorldContextObject) == 0x000000, "Member 'AtomRuntimeBlueprintLibrary_GetGameVariableValueByName::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_GetGameVariableValueByName, CategoryName) == 0x000008, "Member 'AtomRuntimeBlueprintLibrary_GetGameVariableValueByName::CategoryName' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_GetGameVariableValueByName, OnGetValue) == 0x000010, "Member 'AtomRuntimeBlueprintLibrary_GetGameVariableValueByName::OnGetValue' has a wrong offset!");

// Function CriWareCore.AtomRuntimeBlueprintLibrary.GetMagnitudeForFrequencies
// 0x0030 (0x0030 - 0x0000)
struct AtomRuntimeBlueprintLibrary_GetMagnitudeForFrequencies final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 Frequencies;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<float>                                 Magnitudes;                                        // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UAtomBus*                               BusToAnalyze;                                      // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomRuntimeBlueprintLibrary_GetMagnitudeForFrequencies) == 0x000008, "Wrong alignment on AtomRuntimeBlueprintLibrary_GetMagnitudeForFrequencies");
static_assert(sizeof(AtomRuntimeBlueprintLibrary_GetMagnitudeForFrequencies) == 0x000030, "Wrong size on AtomRuntimeBlueprintLibrary_GetMagnitudeForFrequencies");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_GetMagnitudeForFrequencies, WorldContextObject) == 0x000000, "Member 'AtomRuntimeBlueprintLibrary_GetMagnitudeForFrequencies::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_GetMagnitudeForFrequencies, Frequencies) == 0x000008, "Member 'AtomRuntimeBlueprintLibrary_GetMagnitudeForFrequencies::Frequencies' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_GetMagnitudeForFrequencies, Magnitudes) == 0x000018, "Member 'AtomRuntimeBlueprintLibrary_GetMagnitudeForFrequencies::Magnitudes' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_GetMagnitudeForFrequencies, BusToAnalyze) == 0x000028, "Member 'AtomRuntimeBlueprintLibrary_GetMagnitudeForFrequencies::BusToAnalyze' has a wrong offset!");

// Function CriWareCore.AtomRuntimeBlueprintLibrary.GetPhaseForFrequencies
// 0x0030 (0x0030 - 0x0000)
struct AtomRuntimeBlueprintLibrary_GetPhaseForFrequencies final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 Frequencies;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<float>                                 Phases;                                            // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UAtomBus*                               BusToAnalyze;                                      // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomRuntimeBlueprintLibrary_GetPhaseForFrequencies) == 0x000008, "Wrong alignment on AtomRuntimeBlueprintLibrary_GetPhaseForFrequencies");
static_assert(sizeof(AtomRuntimeBlueprintLibrary_GetPhaseForFrequencies) == 0x000030, "Wrong size on AtomRuntimeBlueprintLibrary_GetPhaseForFrequencies");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_GetPhaseForFrequencies, WorldContextObject) == 0x000000, "Member 'AtomRuntimeBlueprintLibrary_GetPhaseForFrequencies::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_GetPhaseForFrequencies, Frequencies) == 0x000008, "Member 'AtomRuntimeBlueprintLibrary_GetPhaseForFrequencies::Frequencies' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_GetPhaseForFrequencies, Phases) == 0x000018, "Member 'AtomRuntimeBlueprintLibrary_GetPhaseForFrequencies::Phases' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_GetPhaseForFrequencies, BusToAnalyze) == 0x000028, "Member 'AtomRuntimeBlueprintLibrary_GetPhaseForFrequencies::BusToAnalyze' has a wrong offset!");

// Function CriWareCore.AtomRuntimeBlueprintLibrary.IsAudioBusActive
// 0x0018 (0x0018 - 0x0000)
struct AtomRuntimeBlueprintLibrary_IsAudioBusActive final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomAudioBus*                          AudioBus;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomRuntimeBlueprintLibrary_IsAudioBusActive) == 0x000008, "Wrong alignment on AtomRuntimeBlueprintLibrary_IsAudioBusActive");
static_assert(sizeof(AtomRuntimeBlueprintLibrary_IsAudioBusActive) == 0x000018, "Wrong size on AtomRuntimeBlueprintLibrary_IsAudioBusActive");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_IsAudioBusActive, WorldContextObject) == 0x000000, "Member 'AtomRuntimeBlueprintLibrary_IsAudioBusActive::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_IsAudioBusActive, AudioBus) == 0x000008, "Member 'AtomRuntimeBlueprintLibrary_IsAudioBusActive::AudioBus' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_IsAudioBusActive, ReturnValue) == 0x000010, "Member 'AtomRuntimeBlueprintLibrary_IsAudioBusActive::ReturnValue' has a wrong offset!");

// Function CriWareCore.AtomRuntimeBlueprintLibrary.IsBinauralizerEnabled
// 0x0010 (0x0010 - 0x0000)
struct AtomRuntimeBlueprintLibrary_IsBinauralizerEnabled final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomRuntimeBlueprintLibrary_IsBinauralizerEnabled) == 0x000008, "Wrong alignment on AtomRuntimeBlueprintLibrary_IsBinauralizerEnabled");
static_assert(sizeof(AtomRuntimeBlueprintLibrary_IsBinauralizerEnabled) == 0x000010, "Wrong size on AtomRuntimeBlueprintLibrary_IsBinauralizerEnabled");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_IsBinauralizerEnabled, WorldContextObject) == 0x000000, "Member 'AtomRuntimeBlueprintLibrary_IsBinauralizerEnabled::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_IsBinauralizerEnabled, ReturnValue) == 0x000008, "Member 'AtomRuntimeBlueprintLibrary_IsBinauralizerEnabled::ReturnValue' has a wrong offset!");

// Function CriWareCore.AtomRuntimeBlueprintLibrary.MakeFullSpectrumSpectralAnalysisBandSettings
// 0x0028 (0x0028 - 0x0000)
struct AtomRuntimeBlueprintLibrary_MakeFullSpectrumSpectralAnalysisBandSettings final
{
public:
	int32                                         InNumBands;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InMinimumFrequency;                                // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InMaximumFrequency;                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InAttackTimeMsec;                                  // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InReleaseTimeMsec;                                 // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAtomBusSpectralAnalysisBandSettings> ReturnValue;                                 // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomRuntimeBlueprintLibrary_MakeFullSpectrumSpectralAnalysisBandSettings) == 0x000008, "Wrong alignment on AtomRuntimeBlueprintLibrary_MakeFullSpectrumSpectralAnalysisBandSettings");
static_assert(sizeof(AtomRuntimeBlueprintLibrary_MakeFullSpectrumSpectralAnalysisBandSettings) == 0x000028, "Wrong size on AtomRuntimeBlueprintLibrary_MakeFullSpectrumSpectralAnalysisBandSettings");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_MakeFullSpectrumSpectralAnalysisBandSettings, InNumBands) == 0x000000, "Member 'AtomRuntimeBlueprintLibrary_MakeFullSpectrumSpectralAnalysisBandSettings::InNumBands' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_MakeFullSpectrumSpectralAnalysisBandSettings, InMinimumFrequency) == 0x000004, "Member 'AtomRuntimeBlueprintLibrary_MakeFullSpectrumSpectralAnalysisBandSettings::InMinimumFrequency' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_MakeFullSpectrumSpectralAnalysisBandSettings, InMaximumFrequency) == 0x000008, "Member 'AtomRuntimeBlueprintLibrary_MakeFullSpectrumSpectralAnalysisBandSettings::InMaximumFrequency' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_MakeFullSpectrumSpectralAnalysisBandSettings, InAttackTimeMsec) == 0x00000C, "Member 'AtomRuntimeBlueprintLibrary_MakeFullSpectrumSpectralAnalysisBandSettings::InAttackTimeMsec' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_MakeFullSpectrumSpectralAnalysisBandSettings, InReleaseTimeMsec) == 0x000010, "Member 'AtomRuntimeBlueprintLibrary_MakeFullSpectrumSpectralAnalysisBandSettings::InReleaseTimeMsec' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_MakeFullSpectrumSpectralAnalysisBandSettings, ReturnValue) == 0x000018, "Member 'AtomRuntimeBlueprintLibrary_MakeFullSpectrumSpectralAnalysisBandSettings::ReturnValue' has a wrong offset!");

// Function CriWareCore.AtomRuntimeBlueprintLibrary.MakeMusicalSpectralAnalysisBandSettings
// 0x0028 (0x0028 - 0x0000)
struct AtomRuntimeBlueprintLibrary_MakeMusicalSpectralAnalysisBandSettings final
{
public:
	int32                                         InNumSemitones;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomMusicalNoteName                          InStartingMusicalNote;                             // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InStartingOctave;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InAttackTimeMsec;                                  // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InReleaseTimeMsec;                                 // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAtomBusSpectralAnalysisBandSettings> ReturnValue;                                 // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomRuntimeBlueprintLibrary_MakeMusicalSpectralAnalysisBandSettings) == 0x000008, "Wrong alignment on AtomRuntimeBlueprintLibrary_MakeMusicalSpectralAnalysisBandSettings");
static_assert(sizeof(AtomRuntimeBlueprintLibrary_MakeMusicalSpectralAnalysisBandSettings) == 0x000028, "Wrong size on AtomRuntimeBlueprintLibrary_MakeMusicalSpectralAnalysisBandSettings");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_MakeMusicalSpectralAnalysisBandSettings, InNumSemitones) == 0x000000, "Member 'AtomRuntimeBlueprintLibrary_MakeMusicalSpectralAnalysisBandSettings::InNumSemitones' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_MakeMusicalSpectralAnalysisBandSettings, InStartingMusicalNote) == 0x000004, "Member 'AtomRuntimeBlueprintLibrary_MakeMusicalSpectralAnalysisBandSettings::InStartingMusicalNote' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_MakeMusicalSpectralAnalysisBandSettings, InStartingOctave) == 0x000008, "Member 'AtomRuntimeBlueprintLibrary_MakeMusicalSpectralAnalysisBandSettings::InStartingOctave' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_MakeMusicalSpectralAnalysisBandSettings, InAttackTimeMsec) == 0x00000C, "Member 'AtomRuntimeBlueprintLibrary_MakeMusicalSpectralAnalysisBandSettings::InAttackTimeMsec' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_MakeMusicalSpectralAnalysisBandSettings, InReleaseTimeMsec) == 0x000010, "Member 'AtomRuntimeBlueprintLibrary_MakeMusicalSpectralAnalysisBandSettings::InReleaseTimeMsec' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_MakeMusicalSpectralAnalysisBandSettings, ReturnValue) == 0x000018, "Member 'AtomRuntimeBlueprintLibrary_MakeMusicalSpectralAnalysisBandSettings::ReturnValue' has a wrong offset!");

// Function CriWareCore.AtomRuntimeBlueprintLibrary.MakePresetSpectralAnalysisBandSettings
// 0x0020 (0x0020 - 0x0000)
struct AtomRuntimeBlueprintLibrary_MakePresetSpectralAnalysisBandSettings final
{
public:
	EAtomSpectrumBandPresetType                   InBandPresetType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InNumBands;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InAttackTimeMsec;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InReleaseTimeMsec;                                 // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAtomBusSpectralAnalysisBandSettings> ReturnValue;                                 // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AtomRuntimeBlueprintLibrary_MakePresetSpectralAnalysisBandSettings) == 0x000008, "Wrong alignment on AtomRuntimeBlueprintLibrary_MakePresetSpectralAnalysisBandSettings");
static_assert(sizeof(AtomRuntimeBlueprintLibrary_MakePresetSpectralAnalysisBandSettings) == 0x000020, "Wrong size on AtomRuntimeBlueprintLibrary_MakePresetSpectralAnalysisBandSettings");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_MakePresetSpectralAnalysisBandSettings, InBandPresetType) == 0x000000, "Member 'AtomRuntimeBlueprintLibrary_MakePresetSpectralAnalysisBandSettings::InBandPresetType' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_MakePresetSpectralAnalysisBandSettings, InNumBands) == 0x000004, "Member 'AtomRuntimeBlueprintLibrary_MakePresetSpectralAnalysisBandSettings::InNumBands' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_MakePresetSpectralAnalysisBandSettings, InAttackTimeMsec) == 0x000008, "Member 'AtomRuntimeBlueprintLibrary_MakePresetSpectralAnalysisBandSettings::InAttackTimeMsec' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_MakePresetSpectralAnalysisBandSettings, InReleaseTimeMsec) == 0x00000C, "Member 'AtomRuntimeBlueprintLibrary_MakePresetSpectralAnalysisBandSettings::InReleaseTimeMsec' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_MakePresetSpectralAnalysisBandSettings, ReturnValue) == 0x000010, "Member 'AtomRuntimeBlueprintLibrary_MakePresetSpectralAnalysisBandSettings::ReturnValue' has a wrong offset!");

// Function CriWareCore.AtomRuntimeBlueprintLibrary.MapOutputPortToRack
// 0x0020 (0x0020 - 0x0000)
struct AtomRuntimeBlueprintLibrary_MapOutputPortToRack final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutputPortName;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAtomRackWithParentBase*                AtomRack;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AtomRuntimeBlueprintLibrary_MapOutputPortToRack) == 0x000008, "Wrong alignment on AtomRuntimeBlueprintLibrary_MapOutputPortToRack");
static_assert(sizeof(AtomRuntimeBlueprintLibrary_MapOutputPortToRack) == 0x000020, "Wrong size on AtomRuntimeBlueprintLibrary_MapOutputPortToRack");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_MapOutputPortToRack, WorldContextObject) == 0x000000, "Member 'AtomRuntimeBlueprintLibrary_MapOutputPortToRack::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_MapOutputPortToRack, OutputPortName) == 0x000008, "Member 'AtomRuntimeBlueprintLibrary_MapOutputPortToRack::OutputPortName' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_MapOutputPortToRack, AtomRack) == 0x000010, "Member 'AtomRuntimeBlueprintLibrary_MapOutputPortToRack::AtomRack' has a wrong offset!");
static_assert(offsetof(AtomRuntimeBlueprintLibrary_MapOutputPortToRack, ReturnValue) == 0x000018, "Member 'AtomRuntimeBlueprintLibrary_MapOutputPortToRack::ReturnValue' has a wrong offset!");

// Function CriWareCore.AtomRuntimeBlueprintLibrary.MuteCategoryByName
// 0x0018 (0x0018 - 0x0000)
struct AtomRuntimeBlueprintLibrary_MuteCategoryByName final
{
public:
