#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CriWareAndroidSettings

#include "Basic.hpp"

#include "CriWareCore_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class CriWareAndroidSettings.CriWareAndroidSettings
// 0x0020 (0x0058 - 0x0038)
class UCriWareAndroidSettings final : public UDeveloperSettings
{
public:
	struct FAtomVoicesSettings                    VoicesOverrides;                                   // 0x0038(0x000C)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FCriWareCookOverridesSettings          CookOverrides;                                     // 0x0044(0x0002)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AtomSourceDataOverridePlugin;                      // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CriWareAndroidSettings">();
	}
	static class UCriWareAndroidSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCriWareAndroidSettings>();
	}
};
static_assert(alignof(UCriWareAndroidSettings) == 0x000008, "Wrong alignment on UCriWareAndroidSettings");
static_assert(sizeof(UCriWareAndroidSettings) == 0x000058, "Wrong size on UCriWareAndroidSettings");
static_assert(offsetof(UCriWareAndroidSettings, VoicesOverrides) == 0x000038, "Member 'UCriWareAndroidSettings::VoicesOverrides' has a wrong offset!");
static_assert(offsetof(UCriWareAndroidSettings, CookOverrides) == 0x000044, "Member 'UCriWareAndroidSettings::CookOverrides' has a wrong offset!");
static_assert(offsetof(UCriWareAndroidSettings, AtomSourceDataOverridePlugin) == 0x000048, "Member 'UCriWareAndroidSettings::AtomSourceDataOverridePlugin' has a wrong offset!");

}

