#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CriWareManaPlate

#include "Basic.hpp"

#include "CriWareMana_structs.hpp"
#include "Engine_classes.hpp"
#include "CriWareManaPlate_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class CriWareManaPlate.ManaPlateAssetUserData
// 0x0010 (0x0038 - 0x0028)
class UManaPlateAssetUserData final : public UAssetUserData
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ManaPlateAssetUserData">();
	}
	static class UManaPlateAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UManaPlateAssetUserData>();
	}
};
static_assert(alignof(UManaPlateAssetUserData) == 0x000008, "Wrong alignment on UManaPlateAssetUserData");
static_assert(sizeof(UManaPlateAssetUserData) == 0x000038, "Wrong size on UManaPlateAssetUserData");

// Class CriWareManaPlate.ManaPlate
// 0x0010 (0x02D8 - 0x02C8)
class AManaPlate final : public AActor
{
public:
	class UManaPlateComponent*                    ManaPlateComponent;                                // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x02D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ManaPlate">();
	}
	static class AManaPlate* GetDefaultObj()
	{
		return GetDefaultObjImpl<AManaPlate>();
	}
};
static_assert(alignof(AManaPlate) == 0x000008, "Wrong alignment on AManaPlate");
static_assert(sizeof(AManaPlate) == 0x0002D8, "Wrong size on AManaPlate");
static_assert(offsetof(AManaPlate, ManaPlateComponent) == 0x0002C8, "Member 'AManaPlate::ManaPlateComponent' has a wrong offset!");
static_assert(offsetof(AManaPlate, StaticMeshComponent) == 0x0002D0, "Member 'AManaPlate::StaticMeshComponent' has a wrong offset!");

// Class CriWareManaPlate.ManaPlateComponent
// 0x0198 (0x0258 - 0x00C0)
class UManaPlateComponent final : public UActorComponent
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bPlayOnOpen;                                       // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoPlay;                                         // 0x00C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableAudio;                                      // 0x00CA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartTime;                                         // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UManaSoundComponent*                    SoundComponent;                                    // 0x00D0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x00D8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UStaticMeshComponent*>           Letterboxes;                                       // 0x00E0(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FManaPlateResource                     ManaPlateResource;                                 // 0x00F0(0x0068)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         PlaylistIndex;                                     // 0x0158(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsManaPlatePlaying;                               // 0x015C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_15D[0x13];                                     // 0x015D(0x0013)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bPlayOnlyWhenVisible;                              // 0x0170(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bLoop;                                             // 0x0171(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EManaTextureVisibleMipsTiles                  VisibleMipsTilesCalculations;                      // 0x0172(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_173[0x1];                                      // 0x0173(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MipMapBias;                                        // 0x0174(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsAspectRatioAuto;                                // 0x0178(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnableMipMapUpscaling;                            // 0x0179(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_17A[0x2];                                      // 0x017A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MipLevelToUpscale;                                 // 0x017C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAdaptivePoleMipUpscaling;                         // 0x0180(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LetterboxAspectRatio;                              // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              MeshRange;                                         // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UManaTexture*>                   ManaTextures;                                      // 0x01A0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FManaTextureResourceSettings           ManaTextureSettings;                               // 0x01B0(0x0001)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UManaPlayer*                            ManaPlayer;                                        // 0x01B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UManaMovie*                             ExternalManaSource;                                // 0x01C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UManaPlaylist*                          ActivePlaylist;                                    // 0x01C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D0[0x88];                                     // 0x01D0(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Close();
	float GetLetterboxAspectRatio();
	bool GetLoop();
	class UManaPlayer* GetManaPlayer();
	class UManaTexture* GetManaTexture(int32 Index_0);
	void OnMovieEnd();
	void OnMovieOpened(const class FString& DeviceUrl);
	void OnMovieResumed();
	void OnMovieSuspended();
	void Open();
	void OpenLatent(const class UObject* InWorldContextObject, const struct FLatentActionInfo& InLatentInfo, float InTimeout, bool bInWaitForTexture, bool* bOutSuccess);
	void Pause();
	void Play();
	bool Rewind();
	bool Seek(const struct FTimespan& Time);
	void SelectExternalMovie(const class FString& InFilePath);
	void SelectManaPlaylistAsset(const class UManaPlaylist* InManaPlaylist);
	void SelectManaSourceAsset(const class UManaSource* InManaSource);
	void SetEnableAudio(bool bInEnableAudio);
	void SetIsAspectRatioAuto(bool bInIsAspectRatioAuto);
	void SetLetterboxAspectRatio(float AspectRatio);
	void SetLoop(bool bInLoop);
	void SetMeshRange(const struct FVector2D& InMeshRange);
	void SetPlayOnlyWhenVisible(bool bInPlayOnlyWhenVisible);

	bool GetIsAspectRatioAuto() const;
	struct FVector2D GetMeshRange() const;
	bool IsEventStateChangeAllowed(EManaPlateEventState InRequestEventState) const;
	bool IsManaPlatePlaying() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ManaPlateComponent">();
	}
	static class UManaPlateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UManaPlateComponent>();
	}
};
static_assert(alignof(UManaPlateComponent) == 0x000008, "Wrong alignment on UManaPlateComponent");
static_assert(sizeof(UManaPlateComponent) == 0x000258, "Wrong size on UManaPlateComponent");
static_assert(offsetof(UManaPlateComponent, bPlayOnOpen) == 0x0000C8, "Member 'UManaPlateComponent::bPlayOnOpen' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, bAutoPlay) == 0x0000C9, "Member 'UManaPlateComponent::bAutoPlay' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, bEnableAudio) == 0x0000CA, "Member 'UManaPlateComponent::bEnableAudio' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, StartTime) == 0x0000CC, "Member 'UManaPlateComponent::StartTime' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, SoundComponent) == 0x0000D0, "Member 'UManaPlateComponent::SoundComponent' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, StaticMeshComponent) == 0x0000D8, "Member 'UManaPlateComponent::StaticMeshComponent' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, Letterboxes) == 0x0000E0, "Member 'UManaPlateComponent::Letterboxes' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, ManaPlateResource) == 0x0000F0, "Member 'UManaPlateComponent::ManaPlateResource' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, PlaylistIndex) == 0x000158, "Member 'UManaPlateComponent::PlaylistIndex' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, bIsManaPlatePlaying) == 0x00015C, "Member 'UManaPlateComponent::bIsManaPlatePlaying' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, bPlayOnlyWhenVisible) == 0x000170, "Member 'UManaPlateComponent::bPlayOnlyWhenVisible' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, bLoop) == 0x000171, "Member 'UManaPlateComponent::bLoop' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, VisibleMipsTilesCalculations) == 0x000172, "Member 'UManaPlateComponent::VisibleMipsTilesCalculations' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, MipMapBias) == 0x000174, "Member 'UManaPlateComponent::MipMapBias' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, bIsAspectRatioAuto) == 0x000178, "Member 'UManaPlateComponent::bIsAspectRatioAuto' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, bEnableMipMapUpscaling) == 0x000179, "Member 'UManaPlateComponent::bEnableMipMapUpscaling' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, MipLevelToUpscale) == 0x00017C, "Member 'UManaPlateComponent::MipLevelToUpscale' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, bAdaptivePoleMipUpscaling) == 0x000180, "Member 'UManaPlateComponent::bAdaptivePoleMipUpscaling' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, LetterboxAspectRatio) == 0x000184, "Member 'UManaPlateComponent::LetterboxAspectRatio' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, MeshRange) == 0x000190, "Member 'UManaPlateComponent::MeshRange' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, ManaTextures) == 0x0001A0, "Member 'UManaPlateComponent::ManaTextures' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, ManaTextureSettings) == 0x0001B0, "Member 'UManaPlateComponent::ManaTextureSettings' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, ManaPlayer) == 0x0001B8, "Member 'UManaPlateComponent::ManaPlayer' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, ExternalManaSource) == 0x0001C0, "Member 'UManaPlateComponent::ExternalManaSource' has a wrong offset!");
static_assert(offsetof(UManaPlateComponent, ActivePlaylist) == 0x0001C8, "Member 'UManaPlateComponent::ActivePlaylist' has a wrong offset!");

}

