#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CriWareManaMovieScenes

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct CriWareManaMovieScenes.MovieSceneManaSectionParams
// 0x0050 (0x0050 - 0x0000)
struct FMovieSceneManaSectionParams final
{
public:
	class UManaSoundComponent*                    ManaSoundComponent;                                // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UManaSource*                            ManaSource;                                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneObjectBindingID             ManaSourceProxy;                                   // 0x0010(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ManaSourceProxyIndex;                              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UManaTexture*                           ManaTexture;                                       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UManaPlayer*                            ManaPlayer;                                        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameNumber                           SectionStartFrame;                                 // 0x0040(0x0004)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameNumber                           SectionEndFrame;                                   // 0x0044(0x0004)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLooping;                                          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameNumber                           StartFrameOffset;                                  // 0x004C(0x0004)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMovieSceneManaSectionParams) == 0x000008, "Wrong alignment on FMovieSceneManaSectionParams");
static_assert(sizeof(FMovieSceneManaSectionParams) == 0x000050, "Wrong size on FMovieSceneManaSectionParams");
static_assert(offsetof(FMovieSceneManaSectionParams, ManaSoundComponent) == 0x000000, "Member 'FMovieSceneManaSectionParams::ManaSoundComponent' has a wrong offset!");
static_assert(offsetof(FMovieSceneManaSectionParams, ManaSource) == 0x000008, "Member 'FMovieSceneManaSectionParams::ManaSource' has a wrong offset!");
static_assert(offsetof(FMovieSceneManaSectionParams, ManaSourceProxy) == 0x000010, "Member 'FMovieSceneManaSectionParams::ManaSourceProxy' has a wrong offset!");
static_assert(offsetof(FMovieSceneManaSectionParams, ManaSourceProxyIndex) == 0x000028, "Member 'FMovieSceneManaSectionParams::ManaSourceProxyIndex' has a wrong offset!");
static_assert(offsetof(FMovieSceneManaSectionParams, ManaTexture) == 0x000030, "Member 'FMovieSceneManaSectionParams::ManaTexture' has a wrong offset!");
static_assert(offsetof(FMovieSceneManaSectionParams, ManaPlayer) == 0x000038, "Member 'FMovieSceneManaSectionParams::ManaPlayer' has a wrong offset!");
static_assert(offsetof(FMovieSceneManaSectionParams, SectionStartFrame) == 0x000040, "Member 'FMovieSceneManaSectionParams::SectionStartFrame' has a wrong offset!");
static_assert(offsetof(FMovieSceneManaSectionParams, SectionEndFrame) == 0x000044, "Member 'FMovieSceneManaSectionParams::SectionEndFrame' has a wrong offset!");
static_assert(offsetof(FMovieSceneManaSectionParams, bLooping) == 0x000048, "Member 'FMovieSceneManaSectionParams::bLooping' has a wrong offset!");
static_assert(offsetof(FMovieSceneManaSectionParams, StartFrameOffset) == 0x00004C, "Member 'FMovieSceneManaSectionParams::StartFrameOffset' has a wrong offset!");

// ScriptStruct CriWareManaMovieScenes.MovieSceneManaSectionTemplate
// 0x0058 (0x0078 - 0x0020)
struct FMovieSceneManaSectionTemplate final : public FMovieSceneEvalTemplate
{
public:
	struct FMovieSceneManaSectionParams           Params;                                            // 0x0020(0x0050)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UMovieSceneManaSection*                 ManaSection;                                       // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FMovieSceneManaSectionTemplate) == 0x000008, "Wrong alignment on FMovieSceneManaSectionTemplate");
static_assert(sizeof(FMovieSceneManaSectionTemplate) == 0x000078, "Wrong size on FMovieSceneManaSectionTemplate");
static_assert(offsetof(FMovieSceneManaSectionTemplate, Params) == 0x000020, "Member 'FMovieSceneManaSectionTemplate::Params' has a wrong offset!");
static_assert(offsetof(FMovieSceneManaSectionTemplate, ManaSection) == 0x000070, "Member 'FMovieSceneManaSectionTemplate::ManaSection' has a wrong offset!");

}

