#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CriWareCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "WaveTable_structs.hpp"


namespace SDK
{

// Enum CriWareCore.EAtomComponentPlayState
// NumValues: 0x0007
enum class EAtomComponentPlayState : uint8
{
	Playing                                  = 0,
	Stopped                                  = 1,
	Paused                                   = 2,
	FadingIn                                 = 3,
	FadingOut                                = 4,
	Count                                    = 5,
	EAtomComponentPlayState_MAX              = 6,
};

// Enum CriWareCore.EAtomFormat
// NumValues: 0x000E
enum class EAtomFormat : uint8
{
	None                                     = 0,
	ADX                                      = 1,
	HCA                                      = 2,
	HCAMX                                    = 3,
	AIFF                                     = 4,
	Wave                                     = 5,
	RawPCM                                   = 6,
	Vibration                                = 7,
	AudioBuffer                              = 8,
	Instrument                               = 9,
	Hardware1                                = 10,
	Hardware2                                = 11,
	Num                                      = 12,
	EAtomFormat_MAX                          = 13,
};

// Enum CriWareCore.EAtomSpeaker
// NumValues: 0x0014
enum class EAtomSpeaker : uint8
{
	FrontLeft                                = 0,
	FrontRight                               = 1,
	FrontCenter                              = 2,
	LowFrequency                             = 3,
	SurroundLeft                             = 4,
	SurroundRight                            = 5,
	SurroundBackLeft                         = 6,
	SurroundBackRight                        = 7,
	TopFrontLeft                             = 8,
	TopFrontRight                            = 9,
	TopRearLeft                              = 10,
	TopRearRight                             = 11,
	BottomFrontLeft                          = 12,
	BottomFrontRight                         = 13,
	BottomRearLeft                           = 14,
	BottomRearRight                          = 15,
	Count                                    = 16,
	Unknown                                  = 17,
	DefaultChannel                           = 0,
	EAtomSpeaker_MAX                         = 18,
};

// Enum CriWareCore.EAtomSpeakerChannelMap
// NumValues: 0x000C
enum class EAtomSpeakerChannelMap : uint8
{
	Main                                     = 0,
	EndPoint                                 = 127,
	Parent                                   = 255,
	Mono                                     = 1,
	Stereo                                   = 2,
	FivePointOne                             = 6,
	SevenPointOne                            = 8,
	FivePointOnePointTwo                     = 9,
	SevenPointOnePointTwo                    = 10,
	SevenPointOnePointFour                   = 12,
	SevenPointOnePointFourPointFour          = 16,
	EAtomSpeakerChannelMap_MAX               = 256,
};

// Enum CriWareCore.EAtomPanningMethod
// NumValues: 0x0003
enum class EAtomPanningMethod : uint8
{
	Linear                                   = 0,
	EqualPower                               = 1,
	EAtomPanningMethod_MAX                   = 2,
};

// Enum CriWareCore.EAtomMonoChannelUpmixMethod
// NumValues: 0x0004
enum class EAtomMonoChannelUpmixMethod : uint8
{
	Linear                                   = 0,
	EqualPower                               = 1,
	FullVolume                               = 2,
	EAtomMonoChannelUpmixMethod_MAX          = 3,
};

// Enum CriWareCore.EAtomBusSendStage
// NumValues: 0x0004
enum class EAtomBusSendStage : uint8
{
	PreEffect                                = 0,
	PostEffect                               = 1,
	Count                                    = 2,
	EAtomBusSendStage_MAX                    = 3,
};

// Enum CriWareCore.EAtomPcmBitDepth
// NumValues: 0x0005
enum class EAtomPcmBitDepth : uint8
{
	Unknown                                  = 0,
	Int16                                    = 1,
	Float32                                  = 2,
	Unsupported                              = 3,
	EAtomPcmBitDepth_MAX                     = 4,
};

// Enum CriWareCore.EAtomSoundRendererType
// NumValues: 0x000C
enum class EAtomSoundRendererType : uint8
{
	Default                                  = 0,
	Main                                     = 1,
	BGM                                      = 2,
	Voice                                    = 3,
	Pad                                      = 4,
	Haptic                                   = 5,
	User                                     = 6,
	Aux                                      = 7,
	Asr                                      = 8,
	Muted                                    = 9,
	Num                                      = 10,
	EAtomSoundRendererType_MAX               = 11,
};

// Enum CriWareCore.EAtomSoundfieldRendererType
// NumValues: 0x0007
enum class EAtomSoundfieldRendererType : uint8
{
	Default                                  = 0,
	Spatializer                              = 1,
	Ambisonics                               = 2,
	SoundObject                              = 3,
	Passthrough                              = 4,
	Num                                      = 5,
	EAtomSoundfieldRendererType_MAX          = 6,
};

// Enum CriWareCore.EAtomVoicePoolCodecType
// NumValues: 0x000B
enum class EAtomVoicePoolCodecType : uint8
{
	Standard                                 = 0,
	HcaMx                                    = 1,
	Wave                                     = 2,
	Aiff                                     = 3,
	RawPcm                                   = 4,
	InputPort                                = 5,
	External                                 = 6,
	Audio3d                                  = 7,
	Opus                                     = 8,
	Undefined                                = 255,
	EAtomVoicePoolCodecType_MAX              = 256,
};

// Enum CriWareCore.EAtomVoicePoolStreamingType
// NumValues: 0x0004
enum class EAtomVoicePoolStreamingType : uint8
{
	MemoryOnly                               = 0,
	StreamOnly                               = 1,
	Mixed                                    = 2,
	EAtomVoicePoolStreamingType_MAX          = 3,
};

// Enum CriWareCore.EAtomSoundWaveLoadingBehavior
// NumValues: 0x0007
enum class EAtomSoundWaveLoadingBehavior : uint8
{
	Inherited                                = 0,
	RetainOnLoad                             = 1,
	PrimeOnLoad                              = 2,
	LoadOnDemand                             = 3,
	ForceInline                              = 4,
	Uninitialized                            = 255,
	EAtomSoundWaveLoadingBehavior_MAX        = 256,
};

// Enum CriWareCore.EAtomSoundPlaybackType
// NumValues: 0x0006
enum class EAtomSoundPlaybackType : uint8
{
	Cue                                      = 0,
	Wave                                     = 1,
	InputPort                                = 2,
	RawPCM                                   = 3,
	Unknown                                  = 4,
	EAtomSoundPlaybackType_MAX               = 5,
};

// Enum CriWareCore.EAtomSpatializationAlgorithm
// NumValues: 0x0003
enum class EAtomSpatializationAlgorithm : uint8
{
	Default                                  = 0,
	Binaural                                 = 1,
	EAtomSpatializationAlgorithm_MAX         = 2,
};

// Enum CriWareCore.EAtomAttenuationDistanceModel
// NumValues: 0x0002
enum class EAtomAttenuationDistanceModel : uint8
{
	Logarithmic                              = 0,
	EAtomAttenuationDistanceModel_MAX        = 1,
};

// Enum CriWareCore.EAtomAttenuationShape
// NumValues: 0x0003
enum class EAtomAttenuationShape : uint8
{
	Sphere                                   = 0,
	Cone                                     = 1,
	EAtomAttenuationShape_MAX                = 2,
};

// Enum CriWareCore.EAtomAirAbsorptionMethod
// NumValues: 0x0003
enum class EAtomAirAbsorptionMethod : uint8
{
	Linear                                   = 0,
	CustomCurve                              = 1,
	EAtomAirAbsorptionMethod_MAX             = 2,
};

// Enum CriWareCore.EAtomBusSendMethod
// NumValues: 0x0004
enum class EAtomBusSendMethod : uint8
{
	Linear                                   = 0,
	CustomCurve                              = 1,
	Manual                                   = 2,
	EAtomBusSendMethod_MAX                   = 3,
};

// Enum CriWareCore.EAtomPriorityAttenuationMethod
// NumValues: 0x0004
enum class EAtomPriorityAttenuationMethod : uint8
{
	Linear                                   = 0,
	CustomCurve                              = 1,
	Manual                                   = 2,
	EAtomPriorityAttenuationMethod_MAX       = 3,
};

// Enum CriWareCore.EAtomMultiPositionType
// NumValues: 0x0003
enum class EAtomMultiPositionType : uint8
{
	SingleSource                             = 0,
	MultiSources                             = 1,
	EAtomMultiPositionType_MAX               = 2,
};

// Enum CriWareCore.EAtomNonSpatializedRadiusSpeakerMapMode
// NumValues: 0x0002
enum class EAtomNonSpatializedRadiusSpeakerMapMode : uint8
{
	Direct2D                                 = 0,
	EAtomNonSpatializedRadiusSpeakerMapMode_MAX = 1,
};

// Enum CriWareCore.EAtomAudioLinkRoute
// NumValues: 0x0003
enum class EAtomAudioLinkRoute : uint8
{
	Source                                   = 0,
	Bus                                      = 1,
	EAtomAudioLinkRoute_MAX                  = 2,
};

// Enum CriWareCore.EAtomMusicalNoteName
// NumValues: 0x000D
enum class EAtomMusicalNoteName : uint8
{
	C                                        = 0,
	Db                                       = 1,
	D                                        = 2,
	Eb                                       = 3,
	E                                        = 4,
	F                                        = 5,
	Gb                                       = 6,
	G                                        = 7,
	Ab                                       = 8,
	A                                        = 9,
	Bb                                       = 10,
	B                                        = 11,
	EAtomMusicalNoteName_MAX                 = 12,
};

// Enum CriWareCore.EAtomSpatializationType
// NumValues: 0x0003
enum class EAtomSpatializationType : uint8
{
	Panning                                  = 0,
	SendToChannel                            = 1,
	EAtomSpatializationType_MAX              = 2,
};

// Enum CriWareCore.EAtomBusSendType
// NumValues: 0x0004
enum class EAtomBusSendType : uint8
{
	PreVolume                                = 0,
	PostVolume                               = 1,
	PostPanning                              = 2,
	EAtomBusSendType_MAX                     = 3,
};

// Enum CriWareCore.EAtomFFTSize
// NumValues: 0x0007
enum class EAtomFFTSize : uint8
{
	DefaultSize                              = 0,
	Min                                      = 1,
	Small                                    = 2,
	Medium                                   = 3,
	Large                                    = 4,
	VeryLarge                                = 5,
	Max                                      = 6,
};

// Enum CriWareCore.EAtomFFTPeakInterpolationMethod
// NumValues: 0x0005
enum class EAtomFFTPeakInterpolationMethod : uint8
{
	NearestNeighbor                          = 0,
	Linear                                   = 1,
	Quadratic                                = 2,
	ConstantQ                                = 3,
	EAtomFFTPeakInterpolationMethod_MAX      = 4,
};

// Enum CriWareCore.EAtomFFTWindowType
// NumValues: 0x0005
enum class EAtomFFTWindowType : uint8
{
	None                                     = 0,
	Hamming                                  = 1,
	Hann                                     = 2,
	Blackman                                 = 3,
	EAtomFFTWindowType_MAX                   = 4,
};

// Enum CriWareCore.EAtomSpectrumType
// NumValues: 0x0004
enum class EAtomSpectrumType : uint8
{
	MagnitudeSpectrum                        = 0,
	PowerSpectrum                            = 1,
	Decibel                                  = 2,
	EAtomSpectrumType_MAX                    = 3,
};

// Enum CriWareCore.EAtomBiquadFilterType
// NumValues: 0x0007
enum class EAtomBiquadFilterType : uint8
{
	LowPass                                  = 0,
	HighPass                                 = 1,
	Notch                                    = 2,
	LowShelf                                 = 3,
	HighShelf                                = 4,
	Peaking                                  = 5,
	EAtomBiquadFilterType_MAX                = 6,
};

// Enum CriWareCore.EAtomSplitEQFilterType
// NumValues: 0x0006
enum class EAtomSplitEQFilterType : uint8
{
	None                                     = 0,
	LowPass                                  = 1,
	HighPass                                 = 2,
	BandPass                                 = 3,
	Notch                                    = 4,
	EAtomSplitEQFilterType_MAX               = 5,
};

// Enum CriWareCore.EAtomLimiterType
// NumValues: 0x0003
enum class EAtomLimiterType : uint8
{
	Peak                                     = 0,
	RMS                                      = 1,
	EAtomLimiterType_MAX                     = 2,
};

// Enum CriWareCore.EAtomBandEQFilterType
// NumValues: 0x0004
enum class EAtomBandEQFilterType : uint8
{
	LowShelf                                 = 0,
	HighShelf                                = 1,
	Peaking                                  = 2,
	EAtomBandEQFilterType_MAX                = 3,
};

// Enum CriWareCore.EAtomPitchShifterMode
// NumValues: 0x0005
enum class EAtomPitchShifterMode : uint8
{
	Music                                    = 0,
	Vocal                                    = 1,
	SoundEffects                             = 2,
	Speech                                   = 3,
	EAtomPitchShifterMode_MAX                = 4,
};

// Enum CriWareCore.EAtomSurrounderMode
// NumValues: 0x0004
enum class EAtomSurrounderMode : uint8
{
	Straight                                 = 0,
	Cross                                    = 1,
	Matrix                                   = 2,
	EAtomSurrounderMode_MAX                  = 3,
};

// Enum CriWareCore.EAtomEnvelopeCurve
// NumValues: 0x0007
enum class EAtomEnvelopeCurve : uint8
{
	Linear                                   = 0,
	Exponential                              = 1,
	Logarithmic                              = 2,
	SCurve                                   = 3,
	InvertedSCurve                           = 4,
	Count                                    = 5,
	EAtomEnvelopeCurve_MAX                   = 6,
};

// Enum CriWareCore.EAtomGainParamMode
// NumValues: 0x0003
enum class EAtomGainParamMode : uint8
{
	Linear                                   = 0,
	Decibels                                 = 1,
	EAtomGainParamMode_MAX                   = 2,
};

// Enum CriWareCore.EAtomPortailingMethod
// NumValues: 0x0003
enum class EAtomPortailingMethod : uint8
{
	ClosestPortal                            = 0,
	MultiplePortals                          = 1,
	EAtomPortailingMethod_MAX                = 2,
};

// Enum CriWareCore.EAtomVirtualizationMode
// NumValues: 0x0005
enum class EAtomVirtualizationMode : uint8
{
	Normal                                   = 0,
	StopWhenSilent                           = 1,
	PlayWhenSilent                           = 2,
	Retrigger                                = 3,
	EAtomVirtualizationMode_MAX              = 4,
};

// Enum CriWareCore.EAtomSpectrumBandPresetType
// NumValues: 0x0005
enum class EAtomSpectrumBandPresetType : uint8
{
	KickDrum                                 = 0,
	SnareDrum                                = 1,
	Voice                                    = 2,
	Cymbals                                  = 3,
	EAtomSpectrumBandPresetType_MAX          = 4,
};

// Enum CriWareCore.EAtomSendLevelControlMethod
// NumValues: 0x0004
enum class EAtomSendLevelControlMethod : uint8
{
	Linear                                   = 0,
	CustomCurve                              = 1,
	Manual                                   = 2,
	EAtomSendLevelControlMethod_MAX          = 3,
};

// Enum CriWareCore.EAtomCueType
// NumValues: 0x000A
enum class EAtomCueType : uint8
{
	Polyphonic                               = 0,
	Sequential                               = 1,
	Shuffle                                  = 2,
	Random                                   = 3,
	RandomNoRepeat                           = 4,
	SwitchGameVariable                       = 5,
	ComboSequential                          = 6,
	SwitchSelector                           = 7,
	TrackTransitionBySelector                = 8,
	EAtomCueType_MAX                         = 9,
};

// Enum CriWareCore.EAtomCueSpatializationType
// NumValues: 0x0004
enum class EAtomCueSpatializationType : uint8
{
	Panning                                  = 0,
	Positionning                             = 1,
	Auto                                     = 2,
	EAtomCueSpatializationType_MAX           = 3,
};

// Enum CriWareCore.EAtomSourceBusSendLevelControlMethod
// NumValues: 0x0004
enum class EAtomSourceBusSendLevelControlMethod : uint8
{
	Linear                                   = 0,
	CustomCurve                              = 1,
	Manual                                   = 2,
	EAtomSourceBusSendLevelControlMethod_MAX = 3,
};

// Enum CriWareCore.EAtomSourceVoiceEffectType
// NumValues: 0x0004
enum class EAtomSourceVoiceEffectType : uint8
{
	Disabled                                 = 0,
	PitchShifter                             = 1,
	TimeStretch                              = 2,
	EAtomSourceVoiceEffectType_MAX           = 3,
};

// Enum CriWareCore.EAtomVolumeLocationState
// NumValues: 0x0003
enum class EAtomVolumeLocationState : uint8
{
	InsideTheVolume                          = 0,
	OutsideTheVolume                         = 1,
	EAtomVolumeLocationState_MAX             = 2,
};

// Enum CriWareCore.EAtomFaderCurve
// NumValues: 0x0006
enum class EAtomFaderCurve : uint8
{
	Linear                                   = 0,
	Logarithmic                              = 1,
	SCurve                                   = 2,
	Sin                                      = 3,
	Count                                    = 4,
	EAtomFaderCurve_MAX                      = 5,
};

// Enum CriWareCore.EAtomWavePlayState
// NumValues: 0x0007
enum class EAtomWavePlayState : uint8
{
	Playing                                  = 0,
	Stopped                                  = 1,
	Paused                                   = 2,
	FadingIn                                 = 3,
	FadingOut                                = 4,
	Count                                    = 5,
	EAtomWavePlayState_MAX                   = 6,
};

// Enum CriWareCore.EAtomAudioBusChannels
// NumValues: 0x0007
enum class EAtomAudioBusChannels : uint8
{
	Mono                                     = 0,
	Stereo                                   = 1,
	StereoWithCenter                         = 2,
	Quad                                     = 3,
	FivePointOne                             = 5,
	SevenPointOne                            = 7,
	EAtomAudioBusChannels_MAX                = 8,
};

// Enum CriWareCore.EAtomMaxConcurrentResolutionRule
// NumValues: 0x0009
enum class EAtomMaxConcurrentResolutionRule : uint32
{
	PreventNew                               = 0,
	StopOldest                               = 1,
	StopFarthestThenPreventNew               = 2,
	StopFarthestThenOldest                   = 3,
	StopLowestPriority                       = 4,
	StopQuietest                             = 5,
	StopLowestPriorityThenPreventNew         = 6,
	Count                                    = 7,
	EAtomMaxConcurrentResolutionRule_MAX     = 8,
};

// Enum CriWareCore.EAtomConcurrencyVolumeScaleMode
// NumValues: 0x0004
enum class EAtomConcurrencyVolumeScaleMode : uint32
{
	Default                                  = 0,
	Distance                                 = 1,
	Priority                                 = 2,
	EAtomConcurrencyVolumeScaleMode_MAX      = 3,
};

// Enum CriWareCore.EAtomSourceBusChannels
// NumValues: 0x0003
enum class EAtomSourceBusChannels : uint8
{
	Mono                                     = 0,
	Stereo                                   = 1,
	EAtomSourceBusChannels_MAX               = 2,
};

// Enum CriWareCore.EAtomSourceManagerRenderThreadPhase
// NumValues: 0x000E
enum class EAtomSourceManagerRenderThreadPhase : uint8
{
	Begin                                    = 0,
	PumpMpscCmds                             = 1,
	PumpCmds                                 = 2,
	ProcessModulators                        = 3,
	UpdatePendingReleaseData                 = 4,
	GenerateSrcAudio_WithBusses              = 5,
	ComputeBusses                            = 6,
	GenerateSrcAudio_WithoutBusses           = 7,
	UpdateBusses                             = 8,
	SpatialInterface_OnAllSourcesProcessed   = 9,
	SourceDataOverride_OnAllSourcesProcessed = 10,
	UpdateGameThreadCopies                   = 11,
	Finished                                 = 12,
	EAtomSourceManagerRenderThreadPhase_MAX  = 13,
};

// Enum CriWareCore.EAtomModulationRouting
// NumValues: 0x0006
enum class EAtomModulationRouting : uint8
{
	Disable                                  = 0,
	Inherit                                  = 1,
	Override                                 = 2,
	Union                                    = 3,
	DAW                                      = 4,
	EAtomModulationRouting_MAX               = 5,
};

// Enum CriWareCore.EAtomModulationDestination
// NumValues: 0x0006
enum class EAtomModulationDestination : uint8
{
	Volume                                   = 0,
	Pitch                                    = 1,
	Lowpass                                  = 2,
	Highpass                                 = 3,
	Count                                    = 4,
	EAtomModulationDestination_MAX           = 5,
};

// Enum CriWareCore.EAtomModulationLFOShape
// NumValues: 0x0009
enum class EAtomModulationLFOShape : uint8
{
	Sine                                     = 0,
	UpSaw                                    = 1,
	DownSaw                                  = 2,
	Square                                   = 3,
	Triangle                                 = 4,
	Exponential                              = 5,
	RandomSampleHold                         = 6,
	COUNT                                    = 7,
	EAtomModulationLFOShape_MAX              = 8,
};

// ScriptStruct CriWareCore.AtomAisacControl
// 0x000C (0x000C - 0x0000)
struct FAtomAisacControl final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ID;                                                // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomAisacControl) == 0x000004, "Wrong alignment on FAtomAisacControl");
static_assert(sizeof(FAtomAisacControl) == 0x00000C, "Wrong size on FAtomAisacControl");
static_assert(offsetof(FAtomAisacControl, Name) == 0x000000, "Member 'FAtomAisacControl::Name' has a wrong offset!");
static_assert(offsetof(FAtomAisacControl, ID) == 0x000008, "Member 'FAtomAisacControl::ID' has a wrong offset!");

// ScriptStruct CriWareCore.AtomAisacParameter
// 0x0010 (0x0010 - 0x0000)
struct FAtomAisacParameter final
{
public:
	struct FAtomAisacControl                      Control;                                           // 0x0000(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomAisacParameter) == 0x000004, "Wrong alignment on FAtomAisacParameter");
static_assert(sizeof(FAtomAisacParameter) == 0x000010, "Wrong size on FAtomAisacParameter");
static_assert(offsetof(FAtomAisacParameter, Control) == 0x000000, "Member 'FAtomAisacParameter::Control' has a wrong offset!");
static_assert(offsetof(FAtomAisacParameter, Value) == 0x00000C, "Member 'FAtomAisacParameter::Value' has a wrong offset!");

// ScriptStruct CriWareCore.AtomAttenuationPluginSettings
// 0x0020 (0x0020 - 0x0000)
struct FAtomAttenuationPluginSettings final
{
public:
	TArray<class UAtomSourceDataOverridePluginSourceSettingsBase*> SourceDataOverridePluginSettingsArray; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UAtomRuntimePluginSettingsBase*> RuntimePluginSettingsArray;                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomAttenuationPluginSettings) == 0x000008, "Wrong alignment on FAtomAttenuationPluginSettings");
static_assert(sizeof(FAtomAttenuationPluginSettings) == 0x000020, "Wrong size on FAtomAttenuationPluginSettings");
static_assert(offsetof(FAtomAttenuationPluginSettings, SourceDataOverridePluginSettingsArray) == 0x000000, "Member 'FAtomAttenuationPluginSettings::SourceDataOverridePluginSettingsArray' has a wrong offset!");
static_assert(offsetof(FAtomAttenuationPluginSettings, RuntimePluginSettingsArray) == 0x000010, "Member 'FAtomAttenuationPluginSettings::RuntimePluginSettingsArray' has a wrong offset!");

// ScriptStruct CriWareCore.AtomVoicesSettings
// 0x000C (0x000C - 0x0000)
struct FAtomVoicesSettings final
{
public:
	int32                                         NumVoices;                                         // 0x0000(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumChannels;                                       // 0x0004(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SamplingRate;                                      // 0x0008(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomVoicesSettings) == 0x000004, "Wrong alignment on FAtomVoicesSettings");
static_assert(sizeof(FAtomVoicesSettings) == 0x00000C, "Wrong size on FAtomVoicesSettings");
static_assert(offsetof(FAtomVoicesSettings, NumVoices) == 0x000000, "Member 'FAtomVoicesSettings::NumVoices' has a wrong offset!");
static_assert(offsetof(FAtomVoicesSettings, NumChannels) == 0x000004, "Member 'FAtomVoicesSettings::NumChannels' has a wrong offset!");
static_assert(offsetof(FAtomVoicesSettings, SamplingRate) == 0x000008, "Member 'FAtomVoicesSettings::SamplingRate' has a wrong offset!");

// ScriptStruct CriWareCore.AtomBusEffectBiquadFilterSettings
// 0x0014 (0x0014 - 0x0000)
struct FAtomBusEffectBiquadFilterSettings final
{
public:
	EAtomBiquadFilterType                         FilterType;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Cutoff;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Q;                                                 // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Gain;                                              // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBypass;                                           // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAtomBusEffectBiquadFilterSettings) == 0x000004, "Wrong alignment on FAtomBusEffectBiquadFilterSettings");
static_assert(sizeof(FAtomBusEffectBiquadFilterSettings) == 0x000014, "Wrong size on FAtomBusEffectBiquadFilterSettings");
static_assert(offsetof(FAtomBusEffectBiquadFilterSettings, FilterType) == 0x000000, "Member 'FAtomBusEffectBiquadFilterSettings::FilterType' has a wrong offset!");
static_assert(offsetof(FAtomBusEffectBiquadFilterSettings, Cutoff) == 0x000004, "Member 'FAtomBusEffectBiquadFilterSettings::Cutoff' has a wrong offset!");
static_assert(offsetof(FAtomBusEffectBiquadFilterSettings, Q) == 0x000008, "Member 'FAtomBusEffectBiquadFilterSettings::Q' has a wrong offset!");
static_assert(offsetof(FAtomBusEffectBiquadFilterSettings, Gain) == 0x00000C, "Member 'FAtomBusEffectBiquadFilterSettings::Gain' has a wrong offset!");
static_assert(offsetof(FAtomBusEffectBiquadFilterSettings, bBypass) == 0x000010, "Member 'FAtomBusEffectBiquadFilterSettings::bBypass' has a wrong offset!");

// ScriptStruct CriWareCore.AtomLevelMeterMeasure
// 0x000C (0x000C - 0x0000)
struct FAtomLevelMeterMeasure final
{
public:
	float                                         Level;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PeakLevel;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PeakHoldLevel;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomLevelMeterMeasure) == 0x000004, "Wrong alignment on FAtomLevelMeterMeasure");
static_assert(sizeof(FAtomLevelMeterMeasure) == 0x00000C, "Wrong size on FAtomLevelMeterMeasure");
static_assert(offsetof(FAtomLevelMeterMeasure, Level) == 0x000000, "Member 'FAtomLevelMeterMeasure::Level' has a wrong offset!");
static_assert(offsetof(FAtomLevelMeterMeasure, PeakLevel) == 0x000004, "Member 'FAtomLevelMeterMeasure::PeakLevel' has a wrong offset!");
static_assert(offsetof(FAtomLevelMeterMeasure, PeakHoldLevel) == 0x000008, "Member 'FAtomLevelMeterMeasure::PeakHoldLevel' has a wrong offset!");

// ScriptStruct CriWareCore.AtomVolumeAisacControlSetting
// 0x0010 (0x0010 - 0x0000)
struct FAtomVolumeAisacControlSetting final
{
public:
	struct FAtomAisacControl                      Control;                                           // 0x0000(0x000C)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomVolumeAisacControlSetting) == 0x000004, "Wrong alignment on FAtomVolumeAisacControlSetting");
static_assert(sizeof(FAtomVolumeAisacControlSetting) == 0x000010, "Wrong size on FAtomVolumeAisacControlSetting");
static_assert(offsetof(FAtomVolumeAisacControlSetting, Control) == 0x000000, "Member 'FAtomVolumeAisacControlSetting::Control' has a wrong offset!");
static_assert(offsetof(FAtomVolumeAisacControlSetting, Value) == 0x00000C, "Member 'FAtomVolumeAisacControlSetting::Value' has a wrong offset!");

// ScriptStruct CriWareCore.AtomTruePeakMeterMeasure
// 0x0008 (0x0008 - 0x0000)
struct FAtomTruePeakMeterMeasure final
{
public:
	float                                         Level;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HoldLevel;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomTruePeakMeterMeasure) == 0x000004, "Wrong alignment on FAtomTruePeakMeterMeasure");
static_assert(sizeof(FAtomTruePeakMeterMeasure) == 0x000008, "Wrong size on FAtomTruePeakMeterMeasure");
static_assert(offsetof(FAtomTruePeakMeterMeasure, Level) == 0x000000, "Member 'FAtomTruePeakMeterMeasure::Level' has a wrong offset!");
static_assert(offsetof(FAtomTruePeakMeterMeasure, HoldLevel) == 0x000004, "Member 'FAtomTruePeakMeterMeasure::HoldLevel' has a wrong offset!");

// ScriptStruct CriWareCore.AtomBandEQFilter
// 0x0010 (0x0010 - 0x0000)
struct FAtomBandEQFilter final
{
public:
	EAtomBandEQFilterType                         FilterType;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Frequency;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Q;                                                 // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Gain;                                              // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomBandEQFilter) == 0x000004, "Wrong alignment on FAtomBandEQFilter");
static_assert(sizeof(FAtomBandEQFilter) == 0x000010, "Wrong size on FAtomBandEQFilter");
static_assert(offsetof(FAtomBandEQFilter, FilterType) == 0x000000, "Member 'FAtomBandEQFilter::FilterType' has a wrong offset!");
static_assert(offsetof(FAtomBandEQFilter, Frequency) == 0x000004, "Member 'FAtomBandEQFilter::Frequency' has a wrong offset!");
static_assert(offsetof(FAtomBandEQFilter, Q) == 0x000008, "Member 'FAtomBandEQFilter::Q' has a wrong offset!");
static_assert(offsetof(FAtomBandEQFilter, Gain) == 0x00000C, "Member 'FAtomBandEQFilter::Gain' has a wrong offset!");

// ScriptStruct CriWareCore.AtomLoudnessMeterMeasure
// 0x000C (0x000C - 0x0000)
struct FAtomLoudnessMeterMeasure final
{
public:
	float                                         Momentary;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShortTerm;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Integrated;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomLoudnessMeterMeasure) == 0x000004, "Wrong alignment on FAtomLoudnessMeterMeasure");
static_assert(sizeof(FAtomLoudnessMeterMeasure) == 0x00000C, "Wrong size on FAtomLoudnessMeterMeasure");
static_assert(offsetof(FAtomLoudnessMeterMeasure, Momentary) == 0x000000, "Member 'FAtomLoudnessMeterMeasure::Momentary' has a wrong offset!");
static_assert(offsetof(FAtomLoudnessMeterMeasure, ShortTerm) == 0x000004, "Member 'FAtomLoudnessMeterMeasure::ShortTerm' has a wrong offset!");
static_assert(offsetof(FAtomLoudnessMeterMeasure, Integrated) == 0x000008, "Member 'FAtomLoudnessMeterMeasure::Integrated' has a wrong offset!");

// ScriptStruct CriWareCore.AtomGameVariableInfo
// 0x0018 (0x0018 - 0x0000)
struct FAtomGameVariableInfo final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ID;                                                // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomGameVariableInfo) == 0x000008, "Wrong alignment on FAtomGameVariableInfo");
static_assert(sizeof(FAtomGameVariableInfo) == 0x000018, "Wrong size on FAtomGameVariableInfo");
static_assert(offsetof(FAtomGameVariableInfo, Name) == 0x000000, "Member 'FAtomGameVariableInfo::Name' has a wrong offset!");
static_assert(offsetof(FAtomGameVariableInfo, ID) == 0x000010, "Member 'FAtomGameVariableInfo::ID' has a wrong offset!");
static_assert(offsetof(FAtomGameVariableInfo, Value) == 0x000014, "Member 'FAtomGameVariableInfo::Value' has a wrong offset!");

// ScriptStruct CriWareCore.AtomBeatSyncInfo
// 0x0018 (0x0018 - 0x0000)
struct FAtomBeatSyncInfo final
{
public:
	int32                                         BarCount;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BeatCount;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BeatProgress;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BPM;                                               // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumBeatsPerBar;                                    // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomBeatSyncInfo) == 0x000004, "Wrong alignment on FAtomBeatSyncInfo");
static_assert(sizeof(FAtomBeatSyncInfo) == 0x000018, "Wrong size on FAtomBeatSyncInfo");
static_assert(offsetof(FAtomBeatSyncInfo, BarCount) == 0x000000, "Member 'FAtomBeatSyncInfo::BarCount' has a wrong offset!");
static_assert(offsetof(FAtomBeatSyncInfo, BeatCount) == 0x000004, "Member 'FAtomBeatSyncInfo::BeatCount' has a wrong offset!");
static_assert(offsetof(FAtomBeatSyncInfo, BeatProgress) == 0x000008, "Member 'FAtomBeatSyncInfo::BeatProgress' has a wrong offset!");
static_assert(offsetof(FAtomBeatSyncInfo, BPM) == 0x00000C, "Member 'FAtomBeatSyncInfo::BPM' has a wrong offset!");
static_assert(offsetof(FAtomBeatSyncInfo, Offset) == 0x000010, "Member 'FAtomBeatSyncInfo::Offset' has a wrong offset!");
static_assert(offsetof(FAtomBeatSyncInfo, NumBeatsPerBar) == 0x000014, "Member 'FAtomBeatSyncInfo::NumBeatsPerBar' has a wrong offset!");

// ScriptStruct CriWareCore.AtomBusSendInfo
// 0x0018 (0x0018 - 0x0000)
struct FAtomBusSendInfo final
{
public:
	class FString                                 SendToBusName;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Level;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomBusSendType                              SendType;                                          // 0x0014(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAtomBusSendInfo) == 0x000008, "Wrong alignment on FAtomBusSendInfo");
static_assert(sizeof(FAtomBusSendInfo) == 0x000018, "Wrong size on FAtomBusSendInfo");
static_assert(offsetof(FAtomBusSendInfo, SendToBusName) == 0x000000, "Member 'FAtomBusSendInfo::SendToBusName' has a wrong offset!");
static_assert(offsetof(FAtomBusSendInfo, Level) == 0x000010, "Member 'FAtomBusSendInfo::Level' has a wrong offset!");
static_assert(offsetof(FAtomBusSendInfo, SendType) == 0x000014, "Member 'FAtomBusSendInfo::SendType' has a wrong offset!");

// ScriptStruct CriWareCore.AtomPerformanceMonitorResult
// 0x0028 (0x0028 - 0x0000)
struct FAtomPerformanceMonitorResult final
{
public:
	int32                                         ProcessCount;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastProcessTime;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxProcessTime;                                    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AverageProcessTime;                                // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastProcessInterval;                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxProcessInterval;                                // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AverageProcessInterval;                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastProcessSamples;                                // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxProcessSamples;                                 // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AverageProcessSamples;                             // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomPerformanceMonitorResult) == 0x000004, "Wrong alignment on FAtomPerformanceMonitorResult");
static_assert(sizeof(FAtomPerformanceMonitorResult) == 0x000028, "Wrong size on FAtomPerformanceMonitorResult");
static_assert(offsetof(FAtomPerformanceMonitorResult, ProcessCount) == 0x000000, "Member 'FAtomPerformanceMonitorResult::ProcessCount' has a wrong offset!");
static_assert(offsetof(FAtomPerformanceMonitorResult, LastProcessTime) == 0x000004, "Member 'FAtomPerformanceMonitorResult::LastProcessTime' has a wrong offset!");
static_assert(offsetof(FAtomPerformanceMonitorResult, MaxProcessTime) == 0x000008, "Member 'FAtomPerformanceMonitorResult::MaxProcessTime' has a wrong offset!");
static_assert(offsetof(FAtomPerformanceMonitorResult, AverageProcessTime) == 0x00000C, "Member 'FAtomPerformanceMonitorResult::AverageProcessTime' has a wrong offset!");
static_assert(offsetof(FAtomPerformanceMonitorResult, LastProcessInterval) == 0x000010, "Member 'FAtomPerformanceMonitorResult::LastProcessInterval' has a wrong offset!");
static_assert(offsetof(FAtomPerformanceMonitorResult, MaxProcessInterval) == 0x000014, "Member 'FAtomPerformanceMonitorResult::MaxProcessInterval' has a wrong offset!");
static_assert(offsetof(FAtomPerformanceMonitorResult, AverageProcessInterval) == 0x000018, "Member 'FAtomPerformanceMonitorResult::AverageProcessInterval' has a wrong offset!");
static_assert(offsetof(FAtomPerformanceMonitorResult, LastProcessSamples) == 0x00001C, "Member 'FAtomPerformanceMonitorResult::LastProcessSamples' has a wrong offset!");
static_assert(offsetof(FAtomPerformanceMonitorResult, MaxProcessSamples) == 0x000020, "Member 'FAtomPerformanceMonitorResult::MaxProcessSamples' has a wrong offset!");
static_assert(offsetof(FAtomPerformanceMonitorResult, AverageProcessSamples) == 0x000024, "Member 'FAtomPerformanceMonitorResult::AverageProcessSamples' has a wrong offset!");

// ScriptStruct CriWareCore.AtomPanning
// 0x0014 (0x0014 - 0x0000)
struct FAtomPanning final
{
public:
	float                                         Volume;                                            // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Wideness;                                          // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Spread;                                            // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomPanning) == 0x000004, "Wrong alignment on FAtomPanning");
static_assert(sizeof(FAtomPanning) == 0x000014, "Wrong size on FAtomPanning");
static_assert(offsetof(FAtomPanning, Volume) == 0x000000, "Member 'FAtomPanning::Volume' has a wrong offset!");
static_assert(offsetof(FAtomPanning, Angle) == 0x000004, "Member 'FAtomPanning::Angle' has a wrong offset!");
static_assert(offsetof(FAtomPanning, Distance) == 0x000008, "Member 'FAtomPanning::Distance' has a wrong offset!");
static_assert(offsetof(FAtomPanning, Wideness) == 0x00000C, "Member 'FAtomPanning::Wideness' has a wrong offset!");
static_assert(offsetof(FAtomPanning, Spread) == 0x000010, "Member 'FAtomPanning::Spread' has a wrong offset!");

// ScriptStruct CriWareCore.AtomBusEffectInfo
// 0x0028 (0x0028 - 0x0000)
struct FAtomBusEffectInfo final
{
public:
	class FString                                 BusEffectName;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 Parameters;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	bool                                          bBypass;                                           // 0x0020(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAtomBusEffectInfo) == 0x000008, "Wrong alignment on FAtomBusEffectInfo");
static_assert(sizeof(FAtomBusEffectInfo) == 0x000028, "Wrong size on FAtomBusEffectInfo");
static_assert(offsetof(FAtomBusEffectInfo, BusEffectName) == 0x000000, "Member 'FAtomBusEffectInfo::BusEffectName' has a wrong offset!");
static_assert(offsetof(FAtomBusEffectInfo, Parameters) == 0x000010, "Member 'FAtomBusEffectInfo::Parameters' has a wrong offset!");
static_assert(offsetof(FAtomBusEffectInfo, bBypass) == 0x000020, "Member 'FAtomBusEffectInfo::bBypass' has a wrong offset!");

// ScriptStruct CriWareCore.AtomBusInfo
// 0x0050 (0x0050 - 0x0000)
struct FAtomBusInfo final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Volume;                                            // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAtomPanning                           Panning;                                           // 0x0014(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FAtomBusSendInfo>               Sends;                                             // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FAtomBusEffectInfo>             Effects;                                           // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	EAtomSpeakerChannelMap                        SpeakerChannelMap;                                 // 0x0048(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomSoundRendererType                        SoundRendererType;                                 // 0x0049(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAtomSoundfieldRendererType                   SoundfieldRendererType;                            // 0x004A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         OutputOptions;                                     // 0x004B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAtomBusInfo) == 0x000008, "Wrong alignment on FAtomBusInfo");
static_assert(sizeof(FAtomBusInfo) == 0x000050, "Wrong size on FAtomBusInfo");
static_assert(offsetof(FAtomBusInfo, Name) == 0x000000, "Member 'FAtomBusInfo::Name' has a wrong offset!");
static_assert(offsetof(FAtomBusInfo, Volume) == 0x000010, "Member 'FAtomBusInfo::Volume' has a wrong offset!");
static_assert(offsetof(FAtomBusInfo, Panning) == 0x000014, "Member 'FAtomBusInfo::Panning' has a wrong offset!");
static_assert(offsetof(FAtomBusInfo, Sends) == 0x000028, "Member 'FAtomBusInfo::Sends' has a wrong offset!");
static_assert(offsetof(FAtomBusInfo, Effects) == 0x000038, "Member 'FAtomBusInfo::Effects' has a wrong offset!");
static_assert(offsetof(FAtomBusInfo, SpeakerChannelMap) == 0x000048, "Member 'FAtomBusInfo::SpeakerChannelMap' has a wrong offset!");
static_assert(offsetof(FAtomBusInfo, SoundRendererType) == 0x000049, "Member 'FAtomBusInfo::SoundRendererType' has a wrong offset!");
static_assert(offsetof(FAtomBusInfo, SoundfieldRendererType) == 0x00004A, "Member 'FAtomBusInfo::SoundfieldRendererType' has a wrong offset!");
static_assert(offsetof(FAtomBusInfo, OutputOptions) == 0x00004B, "Member 'FAtomBusInfo::OutputOptions' has a wrong offset!");

// ScriptStruct CriWareCore.AtomDspBusSettingSnapshotInfo
// 0x0030 (0x0030 - 0x0000)
struct FAtomDspBusSettingSnapshotInfo final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAtomBusInfo>                   Buses;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FAtomBusInfo>                   ExtendBuses;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomDspBusSettingSnapshotInfo) == 0x000008, "Wrong alignment on FAtomDspBusSettingSnapshotInfo");
static_assert(sizeof(FAtomDspBusSettingSnapshotInfo) == 0x000030, "Wrong size on FAtomDspBusSettingSnapshotInfo");
static_assert(offsetof(FAtomDspBusSettingSnapshotInfo, Name) == 0x000000, "Member 'FAtomDspBusSettingSnapshotInfo::Name' has a wrong offset!");
static_assert(offsetof(FAtomDspBusSettingSnapshotInfo, Buses) == 0x000010, "Member 'FAtomDspBusSettingSnapshotInfo::Buses' has a wrong offset!");
static_assert(offsetof(FAtomDspBusSettingSnapshotInfo, ExtendBuses) == 0x000020, "Member 'FAtomDspBusSettingSnapshotInfo::ExtendBuses' has a wrong offset!");

// ScriptStruct CriWareCore.AtomDSPSettingInfo
// 0x0048 (0x0048 - 0x0000)
struct FAtomDSPSettingInfo final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAtomBusInfo>                   Buses;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FAtomBusInfo>                   ExtendBuses;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FAtomDspBusSettingSnapshotInfo> Snapshots;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	int32                                         NumMixerAisacs;                                    // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAtomDSPSettingInfo) == 0x000008, "Wrong alignment on FAtomDSPSettingInfo");
static_assert(sizeof(FAtomDSPSettingInfo) == 0x000048, "Wrong size on FAtomDSPSettingInfo");
static_assert(offsetof(FAtomDSPSettingInfo, Name) == 0x000000, "Member 'FAtomDSPSettingInfo::Name' has a wrong offset!");
static_assert(offsetof(FAtomDSPSettingInfo, Buses) == 0x000010, "Member 'FAtomDSPSettingInfo::Buses' has a wrong offset!");
static_assert(offsetof(FAtomDSPSettingInfo, ExtendBuses) == 0x000020, "Member 'FAtomDSPSettingInfo::ExtendBuses' has a wrong offset!");
static_assert(offsetof(FAtomDSPSettingInfo, Snapshots) == 0x000030, "Member 'FAtomDSPSettingInfo::Snapshots' has a wrong offset!");
static_assert(offsetof(FAtomDSPSettingInfo, NumMixerAisacs) == 0x000040, "Member 'FAtomDSPSettingInfo::NumMixerAisacs' has a wrong offset!");

// ScriptStruct CriWareCore.AtomSequencerEventInfo
// 0x0020 (0x0020 - 0x0000)
struct FAtomSequencerEventInfo final
{
public:
	struct FTimespan                              Time;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ID;                                                // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Tag;                                               // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAtomSequencerEventInfo) == 0x000008, "Wrong alignment on FAtomSequencerEventInfo");
static_assert(sizeof(FAtomSequencerEventInfo) == 0x000020, "Wrong size on FAtomSequencerEventInfo");
static_assert(offsetof(FAtomSequencerEventInfo, Time) == 0x000000, "Member 'FAtomSequencerEventInfo::Time' has a wrong offset!");
static_assert(offsetof(FAtomSequencerEventInfo, ID) == 0x000008, "Member 'FAtomSequencerEventInfo::ID' has a wrong offset!");
static_assert(offsetof(FAtomSequencerEventInfo, Tag) == 0x000010, "Member 'FAtomSequencerEventInfo::Tag' has a wrong offset!");

// ScriptStruct CriWareCore.AtomWaveInfo
// 0x0018 (0x0018 - 0x0000)
struct FAtomWaveInfo final
{
