#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CriWareManaPlate

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "CriWareManaPlate_structs.hpp"


namespace SDK::Params
{

// Function CriWareManaPlate.ManaPlateComponent.GetLetterboxAspectRatio
// 0x0004 (0x0004 - 0x0000)
struct ManaPlateComponent_GetLetterboxAspectRatio final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManaPlateComponent_GetLetterboxAspectRatio) == 0x000004, "Wrong alignment on ManaPlateComponent_GetLetterboxAspectRatio");
static_assert(sizeof(ManaPlateComponent_GetLetterboxAspectRatio) == 0x000004, "Wrong size on ManaPlateComponent_GetLetterboxAspectRatio");
static_assert(offsetof(ManaPlateComponent_GetLetterboxAspectRatio, ReturnValue) == 0x000000, "Member 'ManaPlateComponent_GetLetterboxAspectRatio::ReturnValue' has a wrong offset!");

// Function CriWareManaPlate.ManaPlateComponent.GetLoop
// 0x0001 (0x0001 - 0x0000)
struct ManaPlateComponent_GetLoop final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManaPlateComponent_GetLoop) == 0x000001, "Wrong alignment on ManaPlateComponent_GetLoop");
static_assert(sizeof(ManaPlateComponent_GetLoop) == 0x000001, "Wrong size on ManaPlateComponent_GetLoop");
static_assert(offsetof(ManaPlateComponent_GetLoop, ReturnValue) == 0x000000, "Member 'ManaPlateComponent_GetLoop::ReturnValue' has a wrong offset!");

// Function CriWareManaPlate.ManaPlateComponent.GetManaPlayer
// 0x0008 (0x0008 - 0x0000)
struct ManaPlateComponent_GetManaPlayer final
{
public:
	class UManaPlayer*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManaPlateComponent_GetManaPlayer) == 0x000008, "Wrong alignment on ManaPlateComponent_GetManaPlayer");
static_assert(sizeof(ManaPlateComponent_GetManaPlayer) == 0x000008, "Wrong size on ManaPlateComponent_GetManaPlayer");
static_assert(offsetof(ManaPlateComponent_GetManaPlayer, ReturnValue) == 0x000000, "Member 'ManaPlateComponent_GetManaPlayer::ReturnValue' has a wrong offset!");

// Function CriWareManaPlate.ManaPlateComponent.GetManaTexture
// 0x0010 (0x0010 - 0x0000)
struct ManaPlateComponent_GetManaTexture final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UManaTexture*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManaPlateComponent_GetManaTexture) == 0x000008, "Wrong alignment on ManaPlateComponent_GetManaTexture");
static_assert(sizeof(ManaPlateComponent_GetManaTexture) == 0x000010, "Wrong size on ManaPlateComponent_GetManaTexture");
static_assert(offsetof(ManaPlateComponent_GetManaTexture, Index_0) == 0x000000, "Member 'ManaPlateComponent_GetManaTexture::Index_0' has a wrong offset!");
static_assert(offsetof(ManaPlateComponent_GetManaTexture, ReturnValue) == 0x000008, "Member 'ManaPlateComponent_GetManaTexture::ReturnValue' has a wrong offset!");

// Function CriWareManaPlate.ManaPlateComponent.OnMovieOpened
// 0x0010 (0x0010 - 0x0000)
struct ManaPlateComponent_OnMovieOpened final
{
public:
	class FString                                 DeviceUrl;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManaPlateComponent_OnMovieOpened) == 0x000008, "Wrong alignment on ManaPlateComponent_OnMovieOpened");
static_assert(sizeof(ManaPlateComponent_OnMovieOpened) == 0x000010, "Wrong size on ManaPlateComponent_OnMovieOpened");
static_assert(offsetof(ManaPlateComponent_OnMovieOpened, DeviceUrl) == 0x000000, "Member 'ManaPlateComponent_OnMovieOpened::DeviceUrl' has a wrong offset!");

// Function CriWareManaPlate.ManaPlateComponent.OpenLatent
// 0x0028 (0x0028 - 0x0000)
struct ManaPlateComponent_OpenLatent final
{
public:
	const class UObject*                          InWorldContextObject;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      InLatentInfo;                                      // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         InTimeout;                                         // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInWaitForTexture;                                 // 0x0024(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutSuccess;                                       // 0x0025(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ManaPlateComponent_OpenLatent) == 0x000008, "Wrong alignment on ManaPlateComponent_OpenLatent");
static_assert(sizeof(ManaPlateComponent_OpenLatent) == 0x000028, "Wrong size on ManaPlateComponent_OpenLatent");
static_assert(offsetof(ManaPlateComponent_OpenLatent, InWorldContextObject) == 0x000000, "Member 'ManaPlateComponent_OpenLatent::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(ManaPlateComponent_OpenLatent, InLatentInfo) == 0x000008, "Member 'ManaPlateComponent_OpenLatent::InLatentInfo' has a wrong offset!");
static_assert(offsetof(ManaPlateComponent_OpenLatent, InTimeout) == 0x000020, "Member 'ManaPlateComponent_OpenLatent::InTimeout' has a wrong offset!");
static_assert(offsetof(ManaPlateComponent_OpenLatent, bInWaitForTexture) == 0x000024, "Member 'ManaPlateComponent_OpenLatent::bInWaitForTexture' has a wrong offset!");
static_assert(offsetof(ManaPlateComponent_OpenLatent, bOutSuccess) == 0x000025, "Member 'ManaPlateComponent_OpenLatent::bOutSuccess' has a wrong offset!");

// Function CriWareManaPlate.ManaPlateComponent.Rewind
// 0x0001 (0x0001 - 0x0000)
struct ManaPlateComponent_Rewind final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManaPlateComponent_Rewind) == 0x000001, "Wrong alignment on ManaPlateComponent_Rewind");
static_assert(sizeof(ManaPlateComponent_Rewind) == 0x000001, "Wrong size on ManaPlateComponent_Rewind");
static_assert(offsetof(ManaPlateComponent_Rewind, ReturnValue) == 0x000000, "Member 'ManaPlateComponent_Rewind::ReturnValue' has a wrong offset!");

// Function CriWareManaPlate.ManaPlateComponent.Seek
// 0x0010 (0x0010 - 0x0000)
struct ManaPlateComponent_Seek final
{
public:
	struct FTimespan                              Time;                                              // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ManaPlateComponent_Seek) == 0x000001, "Wrong alignment on ManaPlateComponent_Seek");
static_assert(sizeof(ManaPlateComponent_Seek) == 0x000010, "Wrong size on ManaPlateComponent_Seek");
static_assert(offsetof(ManaPlateComponent_Seek, Time) == 0x000000, "Member 'ManaPlateComponent_Seek::Time' has a wrong offset!");
static_assert(offsetof(ManaPlateComponent_Seek, ReturnValue) == 0x000008, "Member 'ManaPlateComponent_Seek::ReturnValue' has a wrong offset!");

// Function CriWareManaPlate.ManaPlateComponent.SelectExternalMovie
// 0x0010 (0x0010 - 0x0000)
struct ManaPlateComponent_SelectExternalMovie final
{
public:
	class FString                                 InFilePath;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManaPlateComponent_SelectExternalMovie) == 0x000008, "Wrong alignment on ManaPlateComponent_SelectExternalMovie");
static_assert(sizeof(ManaPlateComponent_SelectExternalMovie) == 0x000010, "Wrong size on ManaPlateComponent_SelectExternalMovie");
static_assert(offsetof(ManaPlateComponent_SelectExternalMovie, InFilePath) == 0x000000, "Member 'ManaPlateComponent_SelectExternalMovie::InFilePath' has a wrong offset!");

// Function CriWareManaPlate.ManaPlateComponent.SelectManaPlaylistAsset
// 0x0008 (0x0008 - 0x0000)
struct ManaPlateComponent_SelectManaPlaylistAsset final
{
public:
	const class UManaPlaylist*                    InManaPlaylist;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManaPlateComponent_SelectManaPlaylistAsset) == 0x000008, "Wrong alignment on ManaPlateComponent_SelectManaPlaylistAsset");
static_assert(sizeof(ManaPlateComponent_SelectManaPlaylistAsset) == 0x000008, "Wrong size on ManaPlateComponent_SelectManaPlaylistAsset");
static_assert(offsetof(ManaPlateComponent_SelectManaPlaylistAsset, InManaPlaylist) == 0x000000, "Member 'ManaPlateComponent_SelectManaPlaylistAsset::InManaPlaylist' has a wrong offset!");

// Function CriWareManaPlate.ManaPlateComponent.SelectManaSourceAsset
// 0x0008 (0x0008 - 0x0000)
struct ManaPlateComponent_SelectManaSourceAsset final
{
public:
	const class UManaSource*                      InManaSource;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManaPlateComponent_SelectManaSourceAsset) == 0x000008, "Wrong alignment on ManaPlateComponent_SelectManaSourceAsset");
static_assert(sizeof(ManaPlateComponent_SelectManaSourceAsset) == 0x000008, "Wrong size on ManaPlateComponent_SelectManaSourceAsset");
static_assert(offsetof(ManaPlateComponent_SelectManaSourceAsset, InManaSource) == 0x000000, "Member 'ManaPlateComponent_SelectManaSourceAsset::InManaSource' has a wrong offset!");

// Function CriWareManaPlate.ManaPlateComponent.SetEnableAudio
// 0x0001 (0x0001 - 0x0000)
struct ManaPlateComponent_SetEnableAudio final
{
public:
	bool                                          bInEnableAudio;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManaPlateComponent_SetEnableAudio) == 0x000001, "Wrong alignment on ManaPlateComponent_SetEnableAudio");
static_assert(sizeof(ManaPlateComponent_SetEnableAudio) == 0x000001, "Wrong size on ManaPlateComponent_SetEnableAudio");
static_assert(offsetof(ManaPlateComponent_SetEnableAudio, bInEnableAudio) == 0x000000, "Member 'ManaPlateComponent_SetEnableAudio::bInEnableAudio' has a wrong offset!");

// Function CriWareManaPlate.ManaPlateComponent.SetIsAspectRatioAuto
// 0x0001 (0x0001 - 0x0000)
struct ManaPlateComponent_SetIsAspectRatioAuto final
{
public:
	bool                                          bInIsAspectRatioAuto;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManaPlateComponent_SetIsAspectRatioAuto) == 0x000001, "Wrong alignment on ManaPlateComponent_SetIsAspectRatioAuto");
static_assert(sizeof(ManaPlateComponent_SetIsAspectRatioAuto) == 0x000001, "Wrong size on ManaPlateComponent_SetIsAspectRatioAuto");
static_assert(offsetof(ManaPlateComponent_SetIsAspectRatioAuto, bInIsAspectRatioAuto) == 0x000000, "Member 'ManaPlateComponent_SetIsAspectRatioAuto::bInIsAspectRatioAuto' has a wrong offset!");

// Function CriWareManaPlate.ManaPlateComponent.SetLetterboxAspectRatio
// 0x0004 (0x0004 - 0x0000)
struct ManaPlateComponent_SetLetterboxAspectRatio final
{
public:
	float                                         AspectRatio;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManaPlateComponent_SetLetterboxAspectRatio) == 0x000004, "Wrong alignment on ManaPlateComponent_SetLetterboxAspectRatio");
static_assert(sizeof(ManaPlateComponent_SetLetterboxAspectRatio) == 0x000004, "Wrong size on ManaPlateComponent_SetLetterboxAspectRatio");
static_assert(offsetof(ManaPlateComponent_SetLetterboxAspectRatio, AspectRatio) == 0x000000, "Member 'ManaPlateComponent_SetLetterboxAspectRatio::AspectRatio' has a wrong offset!");

// Function CriWareManaPlate.ManaPlateComponent.SetLoop
// 0x0001 (0x0001 - 0x0000)
struct ManaPlateComponent_SetLoop final
{
public:
	bool                                          bInLoop;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManaPlateComponent_SetLoop) == 0x000001, "Wrong alignment on ManaPlateComponent_SetLoop");
static_assert(sizeof(ManaPlateComponent_SetLoop) == 0x000001, "Wrong size on ManaPlateComponent_SetLoop");
static_assert(offsetof(ManaPlateComponent_SetLoop, bInLoop) == 0x000000, "Member 'ManaPlateComponent_SetLoop::bInLoop' has a wrong offset!");

// Function CriWareManaPlate.ManaPlateComponent.SetMeshRange
// 0x0010 (0x0010 - 0x0000)
struct ManaPlateComponent_SetMeshRange final
{
public:
	struct FVector2D                              InMeshRange;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManaPlateComponent_SetMeshRange) == 0x000001, "Wrong alignment on ManaPlateComponent_SetMeshRange");
static_assert(sizeof(ManaPlateComponent_SetMeshRange) == 0x000010, "Wrong size on ManaPlateComponent_SetMeshRange");
static_assert(offsetof(ManaPlateComponent_SetMeshRange, InMeshRange) == 0x000000, "Member 'ManaPlateComponent_SetMeshRange::InMeshRange' has a wrong offset!");

// Function CriWareManaPlate.ManaPlateComponent.SetPlayOnlyWhenVisible
// 0x0001 (0x0001 - 0x0000)
struct ManaPlateComponent_SetPlayOnlyWhenVisible final
{
public:
	bool                                          bInPlayOnlyWhenVisible;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManaPlateComponent_SetPlayOnlyWhenVisible) == 0x000001, "Wrong alignment on ManaPlateComponent_SetPlayOnlyWhenVisible");
static_assert(sizeof(ManaPlateComponent_SetPlayOnlyWhenVisible) == 0x000001, "Wrong size on ManaPlateComponent_SetPlayOnlyWhenVisible");
static_assert(offsetof(ManaPlateComponent_SetPlayOnlyWhenVisible, bInPlayOnlyWhenVisible) == 0x000000, "Member 'ManaPlateComponent_SetPlayOnlyWhenVisible::bInPlayOnlyWhenVisible' has a wrong offset!");

// Function CriWareManaPlate.ManaPlateComponent.GetIsAspectRatioAuto
// 0x0001 (0x0001 - 0x0000)
struct ManaPlateComponent_GetIsAspectRatioAuto final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManaPlateComponent_GetIsAspectRatioAuto) == 0x000001, "Wrong alignment on ManaPlateComponent_GetIsAspectRatioAuto");
static_assert(sizeof(ManaPlateComponent_GetIsAspectRatioAuto) == 0x000001, "Wrong size on ManaPlateComponent_GetIsAspectRatioAuto");
static_assert(offsetof(ManaPlateComponent_GetIsAspectRatioAuto, ReturnValue) == 0x000000, "Member 'ManaPlateComponent_GetIsAspectRatioAuto::ReturnValue' has a wrong offset!");

// Function CriWareManaPlate.ManaPlateComponent.GetMeshRange
// 0x0010 (0x0010 - 0x0000)
struct ManaPlateComponent_GetMeshRange final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManaPlateComponent_GetMeshRange) == 0x000001, "Wrong alignment on ManaPlateComponent_GetMeshRange");
static_assert(sizeof(ManaPlateComponent_GetMeshRange) == 0x000010, "Wrong size on ManaPlateComponent_GetMeshRange");
static_assert(offsetof(ManaPlateComponent_GetMeshRange, ReturnValue) == 0x000000, "Member 'ManaPlateComponent_GetMeshRange::ReturnValue' has a wrong offset!");

// Function CriWareManaPlate.ManaPlateComponent.IsEventStateChangeAllowed
// 0x0002 (0x0002 - 0x0000)
struct ManaPlateComponent_IsEventStateChangeAllowed final
{
public:
	EManaPlateEventState                          InRequestEventState;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManaPlateComponent_IsEventStateChangeAllowed) == 0x000001, "Wrong alignment on ManaPlateComponent_IsEventStateChangeAllowed");
static_assert(sizeof(ManaPlateComponent_IsEventStateChangeAllowed) == 0x000002, "Wrong size on ManaPlateComponent_IsEventStateChangeAllowed");
static_assert(offsetof(ManaPlateComponent_IsEventStateChangeAllowed, InRequestEventState) == 0x000000, "Member 'ManaPlateComponent_IsEventStateChangeAllowed::InRequestEventState' has a wrong offset!");
static_assert(offsetof(ManaPlateComponent_IsEventStateChangeAllowed, ReturnValue) == 0x000001, "Member 'ManaPlateComponent_IsEventStateChangeAllowed::ReturnValue' has a wrong offset!");

// Function CriWareManaPlate.ManaPlateComponent.IsManaPlatePlaying
// 0x0001 (0x0001 - 0x0000)
struct ManaPlateComponent_IsManaPlatePlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ManaPlateComponent_IsManaPlatePlaying) == 0x000001, "Wrong alignment on ManaPlateComponent_IsManaPlatePlaying");
static_assert(sizeof(ManaPlateComponent_IsManaPlatePlaying) == 0x000001, "Wrong size on ManaPlateComponent_IsManaPlatePlaying");
static_assert(offsetof(ManaPlateComponent_IsManaPlatePlaying, ReturnValue) == 0x000000, "Member 'ManaPlateComponent_IsManaPlatePlaying::ReturnValue' has a wrong offset!");

}

