#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CriWareMana

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum CriWareMana.EManaTextureOrientation
// NumValues: 0x0005
enum class EManaTextureOrientation : uint32
{
	Original                                 = 0,
	CW90                                     = 1,
	CW180                                    = 2,
	CW270                                    = 3,
	EManaTextureOrientation_MAX              = 4,
};

// Enum CriWareMana.EManaMovieType
// NumValues: 0x0007
enum class EManaMovieType : uint8
{
	SofdecPrime                              = 0,
	H264                                     = 1,
	VP9                                      = 2,
	AV1                                      = 3,
	Num                                      = 4,
	Unknown                                  = 255,
	EManaMovieType_MAX                       = 256,
};

// Enum CriWareMana.EManaColorSpace
// NumValues: 0x0006
enum class EManaColorSpace : uint8
{
	Rec601                                   = 0,
	Rec601Full                               = 1,
	Rec709                                   = 2,
	Rec709Full                               = 3,
	Num                                      = 4,
	EManaColorSpace_MAX                      = 5,
};

// Enum CriWareMana.EManaSoundType
// NumValues: 0x0006
enum class EManaSoundType : uint8
{
	Adx                                      = 0,
	HCA                                      = 1,
	AAC                                      = 2,
	Num                                      = 3,
	Unknown                                  = 255,
	EManaSoundType_MAX                       = 256,
};

// Enum CriWareMana.EManaSubtitlesEncoding
// NumValues: 0x0007
enum class EManaSubtitlesEncoding : uint8
{
	Default                                  = 0,
	ANSI                                     = 1,
	Utf8                                     = 2,
	Utf16                                    = 3,
	Num                                      = 4,
	Unknown                                  = 255,
	EManaSubtitlesEncoding_MAX               = 256,
};

// Enum CriWareMana.EManaComponentTextureType
// NumValues: 0x000A
enum class EManaComponentTextureType : uint8
{
	Texture_Y                                = 0,
	Texture_U                                = 1,
	Texture_V                                = 2,
	Texture_A                                = 3,
	Texture_E                                = 4,
	Texture_Z                                = 5,
	Texture_UV                               = 6,
	Texture_RGB                              = 7,
	Texture_External                         = 8,
	Texture_MAX                              = 9,
};

// Enum CriWareMana.EManaPlayerOptionBooleanOverride
// NumValues: 0x0004
enum class EManaPlayerOptionBooleanOverride : uint8
{
	UseManaPlayerSetting                     = 0,
	Enabled                                  = 1,
	Disabled                                 = 2,
	EManaPlayerOptionBooleanOverride_MAX     = 3,
};

// Enum CriWareMana.EManaPlayerOptionSeekTimeType
// NumValues: 0x0003
enum class EManaPlayerOptionSeekTimeType : uint8
{
	Ignored                                  = 0,
	RelativeToStartTime                      = 1,
	EManaPlayerOptionSeekTimeType_MAX        = 2,
};

// Enum CriWareMana.EManaPlayerOptionTrackSelectMode
// NumValues: 0x0004
enum class EManaPlayerOptionTrackSelectMode : uint8
{
	UseManaPlayerDefaults                    = 0,
	UseTrackOptionIndices                    = 1,
	UseLanguageCodes                         = 2,
	EManaPlayerOptionTrackSelectMode_MAX     = 3,
};

// Enum CriWareMana.EManaSoundChannels
// NumValues: 0x0004
enum class EManaSoundChannels : uint8
{
	Mono                                     = 0,
	Stereo                                   = 1,
	Surround                                 = 2,
	EManaSoundChannels_MAX                   = 3,
};

// Enum CriWareMana.EManaSoundTracks
// NumValues: 0x0005
enum class EManaSoundTracks : uint32
{
	Disabled                                 = 18446744073709551615,
	Audio                                    = 0,
	SubAudio                                 = 1,
	ExtraAudio                               = 2,
	EManaSoundTracks_MAX                     = 3,
};

// Enum CriWareMana.EManaColorComponentTextureSlots
// NumValues: 0x0005
enum class EManaColorComponentTextureSlots : uint8
{
	Y                                        = 0,
	U                                        = 1,
	V                                        = 2,
	Num                                      = 3,
	EManaColorComponentTextureSlots_MAX      = 4,
};

// Enum CriWareMana.EManaAlphaComponentTextureSlots
// NumValues: 0x0005
enum class EManaAlphaComponentTextureSlots : uint8
{
	A                                        = 0,
	E                                        = 1,
	Z                                        = 2,
	Num                                      = 3,
	EManaAlphaComponentTextureSlots_MAX      = 4,
};

// Enum CriWareMana.EManaPlayerTrack
// NumValues: 0x0008
enum class EManaPlayerTrack : uint8
{
	Audio                                    = 0,
	SubAudio                                 = 1,
	ExtraAudio                               = 2,
	Metadata                                 = 3,
	Subtitle                                 = 4,
	Video                                    = 5,
	Alpha                                    = 6,
	EManaPlayerTrack_MAX                     = 7,
};

// Enum CriWareMana.EManaTimeRangeBPType
// NumValues: 0x0003
enum class EManaTimeRangeBPType : uint8
{
	Absolute                                 = 0,
	Current                                  = 1,
	EManaTimeRangeBPType_MAX                 = 2,
};

// Enum CriWareMana.EManaTextureVisibleMipsTiles
// NumValues: 0x0004
enum class EManaTextureVisibleMipsTiles : uint8
{
	None                                     = 0,
	Plane                                    = 1,
	Sphere                                   = 2,
	EManaTextureVisibleMipsTiles_MAX         = 3,
};

// ScriptStruct CriWareMana.ManaAudioTrackInfo
// 0x0020 (0x0020 - 0x0000)
struct FManaAudioTrackInfo final
{
public:
	int32                                         NumChannels;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SamplingRate;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalSamples;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAmbisonics;                                     // 0x000C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EManaSoundType                                Type;                                              // 0x000D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Language;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FManaAudioTrackInfo) == 0x000008, "Wrong alignment on FManaAudioTrackInfo");
static_assert(sizeof(FManaAudioTrackInfo) == 0x000020, "Wrong size on FManaAudioTrackInfo");
static_assert(offsetof(FManaAudioTrackInfo, NumChannels) == 0x000000, "Member 'FManaAudioTrackInfo::NumChannels' has a wrong offset!");
static_assert(offsetof(FManaAudioTrackInfo, SamplingRate) == 0x000004, "Member 'FManaAudioTrackInfo::SamplingRate' has a wrong offset!");
static_assert(offsetof(FManaAudioTrackInfo, TotalSamples) == 0x000008, "Member 'FManaAudioTrackInfo::TotalSamples' has a wrong offset!");
static_assert(offsetof(FManaAudioTrackInfo, bIsAmbisonics) == 0x00000C, "Member 'FManaAudioTrackInfo::bIsAmbisonics' has a wrong offset!");
static_assert(offsetof(FManaAudioTrackInfo, Type) == 0x00000D, "Member 'FManaAudioTrackInfo::Type' has a wrong offset!");
static_assert(offsetof(FManaAudioTrackInfo, Language) == 0x000010, "Member 'FManaAudioTrackInfo::Language' has a wrong offset!");

// ScriptStruct CriWareMana.ManaEventPointInfo
// 0x0028 (0x0028 - 0x0000)
struct FManaEventPointInfo final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Parameter;                                         // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FManaEventPointInfo) == 0x000008, "Wrong alignment on FManaEventPointInfo");
static_assert(sizeof(FManaEventPointInfo) == 0x000028, "Wrong size on FManaEventPointInfo");
static_assert(offsetof(FManaEventPointInfo, Name) == 0x000000, "Member 'FManaEventPointInfo::Name' has a wrong offset!");
static_assert(offsetof(FManaEventPointInfo, Time) == 0x000010, "Member 'FManaEventPointInfo::Time' has a wrong offset!");
static_assert(offsetof(FManaEventPointInfo, Type) == 0x000014, "Member 'FManaEventPointInfo::Type' has a wrong offset!");
static_assert(offsetof(FManaEventPointInfo, Parameter) == 0x000018, "Member 'FManaEventPointInfo::Parameter' has a wrong offset!");

// ScriptStruct CriWareMana.CriWareManaMovieSettingOverrides
// 0x001C (0x001C - 0x0000)
struct FCriWareManaMovieSettingOverrides final
{
public:
	bool                                          bOverrideMaxMovieDecoderHandles;                   // 0x0000(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxMovieDecoderHandles;                            // 0x0004(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideMaxMovieBitRate;                          // 0x0008(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxMovieBitRate;                                   // 0x000C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideMaxMovieStreams;                          // 0x0010(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxMovieStreams;                                   // 0x0014(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideDoFrameSkipping;                          // 0x0018(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoFrameSkipping;                                  // 0x0019(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCriWareManaMovieSettingOverrides) == 0x000004, "Wrong alignment on FCriWareManaMovieSettingOverrides");
static_assert(sizeof(FCriWareManaMovieSettingOverrides) == 0x00001C, "Wrong size on FCriWareManaMovieSettingOverrides");
static_assert(offsetof(FCriWareManaMovieSettingOverrides, bOverrideMaxMovieDecoderHandles) == 0x000000, "Member 'FCriWareManaMovieSettingOverrides::bOverrideMaxMovieDecoderHandles' has a wrong offset!");
static_assert(offsetof(FCriWareManaMovieSettingOverrides, MaxMovieDecoderHandles) == 0x000004, "Member 'FCriWareManaMovieSettingOverrides::MaxMovieDecoderHandles' has a wrong offset!");
static_assert(offsetof(FCriWareManaMovieSettingOverrides, bOverrideMaxMovieBitRate) == 0x000008, "Member 'FCriWareManaMovieSettingOverrides::bOverrideMaxMovieBitRate' has a wrong offset!");
static_assert(offsetof(FCriWareManaMovieSettingOverrides, MaxMovieBitRate) == 0x00000C, "Member 'FCriWareManaMovieSettingOverrides::MaxMovieBitRate' has a wrong offset!");
static_assert(offsetof(FCriWareManaMovieSettingOverrides, bOverrideMaxMovieStreams) == 0x000010, "Member 'FCriWareManaMovieSettingOverrides::bOverrideMaxMovieStreams' has a wrong offset!");
static_assert(offsetof(FCriWareManaMovieSettingOverrides, MaxMovieStreams) == 0x000014, "Member 'FCriWareManaMovieSettingOverrides::MaxMovieStreams' has a wrong offset!");
static_assert(offsetof(FCriWareManaMovieSettingOverrides, bOverrideDoFrameSkipping) == 0x000018, "Member 'FCriWareManaMovieSettingOverrides::bOverrideDoFrameSkipping' has a wrong offset!");
static_assert(offsetof(FCriWareManaMovieSettingOverrides, bDoFrameSkipping) == 0x000019, "Member 'FCriWareManaMovieSettingOverrides::bDoFrameSkipping' has a wrong offset!");

// ScriptStruct CriWareMana.CriWareManaMovieSettings
// 0x0010 (0x0010 - 0x0000)
struct FCriWareManaMovieSettings final
{
public:
	int32                                         MaxMovieDecoderHandles;                            // 0x0000(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxMovieBitRate;                                   // 0x0004(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxMovieStreams;                                   // 0x0008(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoFrameSkipping;                                  // 0x000C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCriWareManaMovieSettings) == 0x000004, "Wrong alignment on FCriWareManaMovieSettings");
static_assert(sizeof(FCriWareManaMovieSettings) == 0x000010, "Wrong size on FCriWareManaMovieSettings");
static_assert(offsetof(FCriWareManaMovieSettings, MaxMovieDecoderHandles) == 0x000000, "Member 'FCriWareManaMovieSettings::MaxMovieDecoderHandles' has a wrong offset!");
static_assert(offsetof(FCriWareManaMovieSettings, MaxMovieBitRate) == 0x000004, "Member 'FCriWareManaMovieSettings::MaxMovieBitRate' has a wrong offset!");
static_assert(offsetof(FCriWareManaMovieSettings, MaxMovieStreams) == 0x000008, "Member 'FCriWareManaMovieSettings::MaxMovieStreams' has a wrong offset!");
static_assert(offsetof(FCriWareManaMovieSettings, bDoFrameSkipping) == 0x00000C, "Member 'FCriWareManaMovieSettings::bDoFrameSkipping' has a wrong offset!");

// ScriptStruct CriWareMana.ManaVideoTrackInfo
// 0x001C (0x001C - 0x0000)
struct FManaVideoTrackInfo final
{
public:
	struct FIntPoint                              TextureDimensions;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              DisplayDimensions;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FrameRate;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalFrames;                                       // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAlpha;                                          // 0x0018(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EManaMovieType                                Type;                                              // 0x0019(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FManaVideoTrackInfo) == 0x000004, "Wrong alignment on FManaVideoTrackInfo");
static_assert(sizeof(FManaVideoTrackInfo) == 0x00001C, "Wrong size on FManaVideoTrackInfo");
static_assert(offsetof(FManaVideoTrackInfo, TextureDimensions) == 0x000000, "Member 'FManaVideoTrackInfo::TextureDimensions' has a wrong offset!");
static_assert(offsetof(FManaVideoTrackInfo, DisplayDimensions) == 0x000008, "Member 'FManaVideoTrackInfo::DisplayDimensions' has a wrong offset!");
static_assert(offsetof(FManaVideoTrackInfo, FrameRate) == 0x000010, "Member 'FManaVideoTrackInfo::FrameRate' has a wrong offset!");
static_assert(offsetof(FManaVideoTrackInfo, TotalFrames) == 0x000014, "Member 'FManaVideoTrackInfo::TotalFrames' has a wrong offset!");
static_assert(offsetof(FManaVideoTrackInfo, bIsAlpha) == 0x000018, "Member 'FManaVideoTrackInfo::bIsAlpha' has a wrong offset!");
static_assert(offsetof(FManaVideoTrackInfo, Type) == 0x000019, "Member 'FManaVideoTrackInfo::Type' has a wrong offset!");

// ScriptStruct CriWareMana.ManaSubtitleTrackInfo
// 0x0028 (0x0028 - 0x0000)
struct FManaSubtitleTrackInfo final
{
public:
	class FText                                   Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FString                                 Language;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EManaSubtitlesEncoding                        Encoding;                                          // 0x0020(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FManaSubtitleTrackInfo) == 0x000008, "Wrong alignment on FManaSubtitleTrackInfo");
static_assert(sizeof(FManaSubtitleTrackInfo) == 0x000028, "Wrong size on FManaSubtitleTrackInfo");
static_assert(offsetof(FManaSubtitleTrackInfo, Name) == 0x000000, "Member 'FManaSubtitleTrackInfo::Name' has a wrong offset!");
static_assert(offsetof(FManaSubtitleTrackInfo, Language) == 0x000010, "Member 'FManaSubtitleTrackInfo::Language' has a wrong offset!");
static_assert(offsetof(FManaSubtitleTrackInfo, Encoding) == 0x000020, "Member 'FManaSubtitleTrackInfo::Encoding' has a wrong offset!");

// ScriptStruct CriWareMana.ManaPlayerTrackOptions
// 0x001C (0x001C - 0x0000)
struct FManaPlayerTrackOptions final
{
public:
	int32                                         Audio;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubAudio;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExtraAudio;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MetaData;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Subtitle;                                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Video;                                             // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Alpha;                                             // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FManaPlayerTrackOptions) == 0x000004, "Wrong alignment on FManaPlayerTrackOptions");
static_assert(sizeof(FManaPlayerTrackOptions) == 0x00001C, "Wrong size on FManaPlayerTrackOptions");
static_assert(offsetof(FManaPlayerTrackOptions, Audio) == 0x000000, "Member 'FManaPlayerTrackOptions::Audio' has a wrong offset!");
static_assert(offsetof(FManaPlayerTrackOptions, SubAudio) == 0x000004, "Member 'FManaPlayerTrackOptions::SubAudio' has a wrong offset!");
static_assert(offsetof(FManaPlayerTrackOptions, ExtraAudio) == 0x000008, "Member 'FManaPlayerTrackOptions::ExtraAudio' has a wrong offset!");
static_assert(offsetof(FManaPlayerTrackOptions, MetaData) == 0x00000C, "Member 'FManaPlayerTrackOptions::MetaData' has a wrong offset!");
static_assert(offsetof(FManaPlayerTrackOptions, Subtitle) == 0x000010, "Member 'FManaPlayerTrackOptions::Subtitle' has a wrong offset!");
static_assert(offsetof(FManaPlayerTrackOptions, Video) == 0x000014, "Member 'FManaPlayerTrackOptions::Video' has a wrong offset!");
static_assert(offsetof(FManaPlayerTrackOptions, Alpha) == 0x000018, "Member 'FManaPlayerTrackOptions::Alpha' has a wrong offset!");

// ScriptStruct CriWareMana.ManaPlayerInitialTrackLanguageSelection
// 0x0050 (0x0050 - 0x0000)
struct FManaPlayerInitialTrackLanguageSelection final
{
public:
	class FString                                 Video;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Audio;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SubAudio;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ExtraAudio;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Subtitle;                                          // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FManaPlayerInitialTrackLanguageSelection) == 0x000008, "Wrong alignment on FManaPlayerInitialTrackLanguageSelection");
static_assert(sizeof(FManaPlayerInitialTrackLanguageSelection) == 0x000050, "Wrong size on FManaPlayerInitialTrackLanguageSelection");
static_assert(offsetof(FManaPlayerInitialTrackLanguageSelection, Video) == 0x000000, "Member 'FManaPlayerInitialTrackLanguageSelection::Video' has a wrong offset!");
static_assert(offsetof(FManaPlayerInitialTrackLanguageSelection, Audio) == 0x000010, "Member 'FManaPlayerInitialTrackLanguageSelection::Audio' has a wrong offset!");
static_assert(offsetof(FManaPlayerInitialTrackLanguageSelection, SubAudio) == 0x000020, "Member 'FManaPlayerInitialTrackLanguageSelection::SubAudio' has a wrong offset!");
static_assert(offsetof(FManaPlayerInitialTrackLanguageSelection, ExtraAudio) == 0x000030, "Member 'FManaPlayerInitialTrackLanguageSelection::ExtraAudio' has a wrong offset!");
static_assert(offsetof(FManaPlayerInitialTrackLanguageSelection, Subtitle) == 0x000040, "Member 'FManaPlayerInitialTrackLanguageSelection::Subtitle' has a wrong offset!");

// ScriptStruct CriWareMana.ManaPlayerOptions
// 0x00D8 (0x00D8 - 0x0000)
struct FManaPlayerOptions final
{
public:
	struct FManaPlayerTrackOptions                Tracks;                                            // 0x0000(0x001C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FManaPlayerInitialTrackLanguageSelection TracksByLanguage;                                // 0x0020(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EManaPlayerOptionTrackSelectMode              TrackSelection;                                    // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              SeekTime;                                          // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EManaPlayerOptionSeekTimeType                 SeekTimeType;                                      // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EManaPlayerOptionBooleanOverride              PlayOnOpen;                                        // 0x0081(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EManaPlayerOptionBooleanOverride              Loop;                                              // 0x0082(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_83[0x55];                                      // 0x0083(0x0055)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FManaPlayerOptions) == 0x000001, "Wrong alignment on FManaPlayerOptions");
static_assert(sizeof(FManaPlayerOptions) == 0x0000D8, "Wrong size on FManaPlayerOptions");
static_assert(offsetof(FManaPlayerOptions, Tracks) == 0x000000, "Member 'FManaPlayerOptions::Tracks' has a wrong offset!");
static_assert(offsetof(FManaPlayerOptions, TracksByLanguage) == 0x000020, "Member 'FManaPlayerOptions::TracksByLanguage' has a wrong offset!");
static_assert(offsetof(FManaPlayerOptions, TrackSelection) == 0x000070, "Member 'FManaPlayerOptions::TrackSelection' has a wrong offset!");
static_assert(offsetof(FManaPlayerOptions, SeekTime) == 0x000078, "Member 'FManaPlayerOptions::SeekTime' has a wrong offset!");
static_assert(offsetof(FManaPlayerOptions, SeekTimeType) == 0x000080, "Member 'FManaPlayerOptions::SeekTimeType' has a wrong offset!");
static_assert(offsetof(FManaPlayerOptions, PlayOnOpen) == 0x000081, "Member 'FManaPlayerOptions::PlayOnOpen' has a wrong offset!");
static_assert(offsetof(FManaPlayerOptions, Loop) == 0x000082, "Member 'FManaPlayerOptions::Loop' has a wrong offset!");

// ScriptStruct CriWareMana.ManaMetadataItemBPT
// 0x0040 (0x0040 - 0x0000)
struct FManaMetadataItemBPT final
{
public:
	class FString                                 LanguageCode;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 mimetype;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StringData;                                        // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 BinaryData;                                        // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FManaMetadataItemBPT) == 0x000008, "Wrong alignment on FManaMetadataItemBPT");
static_assert(sizeof(FManaMetadataItemBPT) == 0x000040, "Wrong size on FManaMetadataItemBPT");
static_assert(offsetof(FManaMetadataItemBPT, LanguageCode) == 0x000000, "Member 'FManaMetadataItemBPT::LanguageCode' has a wrong offset!");
static_assert(offsetof(FManaMetadataItemBPT, mimetype) == 0x000010, "Member 'FManaMetadataItemBPT::mimetype' has a wrong offset!");
static_assert(offsetof(FManaMetadataItemBPT, StringData) == 0x000020, "Member 'FManaMetadataItemBPT::StringData' has a wrong offset!");
static_assert(offsetof(FManaMetadataItemBPT, BinaryData) == 0x000030, "Member 'FManaMetadataItemBPT::BinaryData' has a wrong offset!");

// ScriptStruct CriWareMana.ManaMetadataItemsBPT
// 0x0010 (0x0010 - 0x0000)
struct FManaMetadataItemsBPT final
{
public:
	TArray<struct FManaMetadataItemBPT>           Items;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FManaMetadataItemsBPT) == 0x000008, "Wrong alignment on FManaMetadataItemsBPT");
static_assert(sizeof(FManaMetadataItemsBPT) == 0x000010, "Wrong size on FManaMetadataItemsBPT");
static_assert(offsetof(FManaMetadataItemsBPT, Items) == 0x000000, "Member 'FManaMetadataItemsBPT::Items' has a wrong offset!");

}

