#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CVarVolume

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CVarVolume_structs.hpp"


namespace SDK
{

// Class CVarVolume.CVarVolumeBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UCVarVolumeBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CVarVolumeBPLibrary">();
	}
	static class UCVarVolumeBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCVarVolumeBPLibrary>();
	}
};
static_assert(alignof(UCVarVolumeBPLibrary) == 0x000008, "Wrong alignment on UCVarVolumeBPLibrary");
static_assert(sizeof(UCVarVolumeBPLibrary) == 0x000028, "Wrong size on UCVarVolumeBPLibrary");

// Class CVarVolume.CVarVolume
// 0x00A0 (0x03A0 - 0x0300)
class ACVarVolume final : public AVolume
{
public:
	uint8                                         bEnable : 1;                                       // 0x0300(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUnbound : 1;                                      // 0x0300(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bInterface : 1;                                    // 0x0300(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EnableMask;                                        // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACVarVolume*                            Parent;                                            // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ACVarVolume*>                    Interfaces;                                        // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            CVarMap;                                           // 0x0320(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         PhysicalVolume;                                    // 0x0370(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DebugNeckName;                                     // 0x0378(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCVarItem>                      CVars;                                             // 0x0388(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_398[0x8];                                      // 0x0398(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CVarVolume">();
	}
	static class ACVarVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACVarVolume>();
	}
};
static_assert(alignof(ACVarVolume) == 0x000008, "Wrong alignment on ACVarVolume");
static_assert(sizeof(ACVarVolume) == 0x0003A0, "Wrong size on ACVarVolume");
static_assert(offsetof(ACVarVolume, EnableMask) == 0x000304, "Member 'ACVarVolume::EnableMask' has a wrong offset!");
static_assert(offsetof(ACVarVolume, Parent) == 0x000308, "Member 'ACVarVolume::Parent' has a wrong offset!");
static_assert(offsetof(ACVarVolume, Interfaces) == 0x000310, "Member 'ACVarVolume::Interfaces' has a wrong offset!");
static_assert(offsetof(ACVarVolume, CVarMap) == 0x000320, "Member 'ACVarVolume::CVarMap' has a wrong offset!");
static_assert(offsetof(ACVarVolume, PhysicalVolume) == 0x000370, "Member 'ACVarVolume::PhysicalVolume' has a wrong offset!");
static_assert(offsetof(ACVarVolume, DebugNeckName) == 0x000378, "Member 'ACVarVolume::DebugNeckName' has a wrong offset!");
static_assert(offsetof(ACVarVolume, CVars) == 0x000388, "Member 'ACVarVolume::CVars' has a wrong offset!");

}

