#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CVarVolume

#include "Basic.hpp"


namespace SDK
{

// Enum CVarVolume.ECVarType
// NumValues: 0x0006
enum class ECVarType : uint8
{
	ENull                                    = 0,
	EBool                                    = 1,
	EInt                                     = 2,
	EFloat                                   = 3,
	EString                                  = 4,
	ECVarType_MAX                            = 5,
};

// ScriptStruct CVarVolume.CVarItem
// 0x0028 (0x0028 - 0x0000)
struct FCVarItem final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECVarType                                     Type;                                              // 0x0020(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCVarItem) == 0x000008, "Wrong alignment on FCVarItem");
static_assert(sizeof(FCVarItem) == 0x000028, "Wrong size on FCVarItem");
static_assert(offsetof(FCVarItem, Key) == 0x000000, "Member 'FCVarItem::Key' has a wrong offset!");
static_assert(offsetof(FCVarItem, Value) == 0x000010, "Member 'FCVarItem::Value' has a wrong offset!");
static_assert(offsetof(FCVarItem, Type) == 0x000020, "Member 'FCVarItem::Type' has a wrong offset!");

}

