#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataflowEngine

#include "Basic.hpp"


namespace SDK::Params
{

// Function DataflowEngine.DataflowBlueprintLibrary.EvaluateTerminalNodeByName
// 0x0018 (0x0018 - 0x0000)
struct DataflowBlueprintLibrary_EvaluateTerminalNodeByName final
{
public:
	class UDataflow*                              Dataflow;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TerminalNodeName;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ResultAsset;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DataflowBlueprintLibrary_EvaluateTerminalNodeByName) == 0x000008, "Wrong alignment on DataflowBlueprintLibrary_EvaluateTerminalNodeByName");
static_assert(sizeof(DataflowBlueprintLibrary_EvaluateTerminalNodeByName) == 0x000018, "Wrong size on DataflowBlueprintLibrary_EvaluateTerminalNodeByName");
static_assert(offsetof(DataflowBlueprintLibrary_EvaluateTerminalNodeByName, Dataflow) == 0x000000, "Member 'DataflowBlueprintLibrary_EvaluateTerminalNodeByName::Dataflow' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_EvaluateTerminalNodeByName, TerminalNodeName) == 0x000008, "Member 'DataflowBlueprintLibrary_EvaluateTerminalNodeByName::TerminalNodeName' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_EvaluateTerminalNodeByName, ResultAsset) == 0x000010, "Member 'DataflowBlueprintLibrary_EvaluateTerminalNodeByName::ResultAsset' has a wrong offset!");

// Function DataflowEngine.DataflowBlueprintLibrary.OverrideDataflowVariableBool
// 0x0018 (0x0018 - 0x0000)
struct DataflowBlueprintLibrary_OverrideDataflowVariableBool final
{
public:
	class UObject*                                Asset;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VariableName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          VariableValue;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DataflowBlueprintLibrary_OverrideDataflowVariableBool) == 0x000008, "Wrong alignment on DataflowBlueprintLibrary_OverrideDataflowVariableBool");
static_assert(sizeof(DataflowBlueprintLibrary_OverrideDataflowVariableBool) == 0x000018, "Wrong size on DataflowBlueprintLibrary_OverrideDataflowVariableBool");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableBool, Asset) == 0x000000, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableBool::Asset' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableBool, VariableName) == 0x000008, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableBool::VariableName' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableBool, VariableValue) == 0x000010, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableBool::VariableValue' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableBool, ReturnValue) == 0x000011, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableBool::ReturnValue' has a wrong offset!");

// Function DataflowEngine.DataflowBlueprintLibrary.OverrideDataflowVariableBoolArray
// 0x0028 (0x0028 - 0x0000)
struct DataflowBlueprintLibrary_OverrideDataflowVariableBoolArray final
{
public:
	class UObject*                                Asset;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VariableName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<bool>                                  VariableArrayValue;                                // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DataflowBlueprintLibrary_OverrideDataflowVariableBoolArray) == 0x000008, "Wrong alignment on DataflowBlueprintLibrary_OverrideDataflowVariableBoolArray");
static_assert(sizeof(DataflowBlueprintLibrary_OverrideDataflowVariableBoolArray) == 0x000028, "Wrong size on DataflowBlueprintLibrary_OverrideDataflowVariableBoolArray");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableBoolArray, Asset) == 0x000000, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableBoolArray::Asset' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableBoolArray, VariableName) == 0x000008, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableBoolArray::VariableName' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableBoolArray, VariableArrayValue) == 0x000010, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableBoolArray::VariableArrayValue' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableBoolArray, ReturnValue) == 0x000020, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableBoolArray::ReturnValue' has a wrong offset!");

// Function DataflowEngine.DataflowBlueprintLibrary.OverrideDataflowVariableFloat
// 0x0018 (0x0018 - 0x0000)
struct DataflowBlueprintLibrary_OverrideDataflowVariableFloat final
{
public:
	class UObject*                                Asset;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VariableName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VariableValue;                                     // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DataflowBlueprintLibrary_OverrideDataflowVariableFloat) == 0x000008, "Wrong alignment on DataflowBlueprintLibrary_OverrideDataflowVariableFloat");
static_assert(sizeof(DataflowBlueprintLibrary_OverrideDataflowVariableFloat) == 0x000018, "Wrong size on DataflowBlueprintLibrary_OverrideDataflowVariableFloat");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableFloat, Asset) == 0x000000, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableFloat::Asset' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableFloat, VariableName) == 0x000008, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableFloat::VariableName' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableFloat, VariableValue) == 0x000010, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableFloat::VariableValue' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableFloat, ReturnValue) == 0x000014, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableFloat::ReturnValue' has a wrong offset!");

// Function DataflowEngine.DataflowBlueprintLibrary.OverrideDataflowVariableFloatArray
// 0x0028 (0x0028 - 0x0000)
struct DataflowBlueprintLibrary_OverrideDataflowVariableFloatArray final
{
public:
	class UObject*                                Asset;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VariableName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 VariableArrayValue;                                // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DataflowBlueprintLibrary_OverrideDataflowVariableFloatArray) == 0x000008, "Wrong alignment on DataflowBlueprintLibrary_OverrideDataflowVariableFloatArray");
static_assert(sizeof(DataflowBlueprintLibrary_OverrideDataflowVariableFloatArray) == 0x000028, "Wrong size on DataflowBlueprintLibrary_OverrideDataflowVariableFloatArray");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableFloatArray, Asset) == 0x000000, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableFloatArray::Asset' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableFloatArray, VariableName) == 0x000008, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableFloatArray::VariableName' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableFloatArray, VariableArrayValue) == 0x000010, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableFloatArray::VariableArrayValue' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableFloatArray, ReturnValue) == 0x000020, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableFloatArray::ReturnValue' has a wrong offset!");

// Function DataflowEngine.DataflowBlueprintLibrary.OverrideDataflowVariableInt
// 0x0020 (0x0020 - 0x0000)
struct DataflowBlueprintLibrary_OverrideDataflowVariableInt final
{
public:
	class UObject*                                Asset;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VariableName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         VariableValue;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DataflowBlueprintLibrary_OverrideDataflowVariableInt) == 0x000008, "Wrong alignment on DataflowBlueprintLibrary_OverrideDataflowVariableInt");
static_assert(sizeof(DataflowBlueprintLibrary_OverrideDataflowVariableInt) == 0x000020, "Wrong size on DataflowBlueprintLibrary_OverrideDataflowVariableInt");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableInt, Asset) == 0x000000, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableInt::Asset' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableInt, VariableName) == 0x000008, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableInt::VariableName' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableInt, VariableValue) == 0x000010, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableInt::VariableValue' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableInt, ReturnValue) == 0x000018, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableInt::ReturnValue' has a wrong offset!");

// Function DataflowEngine.DataflowBlueprintLibrary.OverrideDataflowVariableIntArray
// 0x0028 (0x0028 - 0x0000)
struct DataflowBlueprintLibrary_OverrideDataflowVariableIntArray final
{
public:
	class UObject*                                Asset;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VariableName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 VariableArrayValue;                                // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DataflowBlueprintLibrary_OverrideDataflowVariableIntArray) == 0x000008, "Wrong alignment on DataflowBlueprintLibrary_OverrideDataflowVariableIntArray");
static_assert(sizeof(DataflowBlueprintLibrary_OverrideDataflowVariableIntArray) == 0x000028, "Wrong size on DataflowBlueprintLibrary_OverrideDataflowVariableIntArray");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableIntArray, Asset) == 0x000000, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableIntArray::Asset' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableIntArray, VariableName) == 0x000008, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableIntArray::VariableName' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableIntArray, VariableArrayValue) == 0x000010, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableIntArray::VariableArrayValue' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableIntArray, ReturnValue) == 0x000020, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableIntArray::ReturnValue' has a wrong offset!");

// Function DataflowEngine.DataflowBlueprintLibrary.OverrideDataflowVariableObject
// 0x0020 (0x0020 - 0x0000)
struct DataflowBlueprintLibrary_OverrideDataflowVariableObject final
{
public:
	class UObject*                                Asset;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VariableName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                VariableValue;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DataflowBlueprintLibrary_OverrideDataflowVariableObject) == 0x000008, "Wrong alignment on DataflowBlueprintLibrary_OverrideDataflowVariableObject");
static_assert(sizeof(DataflowBlueprintLibrary_OverrideDataflowVariableObject) == 0x000020, "Wrong size on DataflowBlueprintLibrary_OverrideDataflowVariableObject");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableObject, Asset) == 0x000000, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableObject::Asset' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableObject, VariableName) == 0x000008, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableObject::VariableName' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableObject, VariableValue) == 0x000010, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableObject::VariableValue' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableObject, ReturnValue) == 0x000018, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableObject::ReturnValue' has a wrong offset!");

// Function DataflowEngine.DataflowBlueprintLibrary.OverrideDataflowVariableObjectArray
// 0x0028 (0x0028 - 0x0000)
struct DataflowBlueprintLibrary_OverrideDataflowVariableObjectArray final
{
public:
	class UObject*                                Asset;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VariableName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        VariableArrayValue;                                // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DataflowBlueprintLibrary_OverrideDataflowVariableObjectArray) == 0x000008, "Wrong alignment on DataflowBlueprintLibrary_OverrideDataflowVariableObjectArray");
static_assert(sizeof(DataflowBlueprintLibrary_OverrideDataflowVariableObjectArray) == 0x000028, "Wrong size on DataflowBlueprintLibrary_OverrideDataflowVariableObjectArray");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableObjectArray, Asset) == 0x000000, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableObjectArray::Asset' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableObjectArray, VariableName) == 0x000008, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableObjectArray::VariableName' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableObjectArray, VariableArrayValue) == 0x000010, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableObjectArray::VariableArrayValue' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_OverrideDataflowVariableObjectArray, ReturnValue) == 0x000020, "Member 'DataflowBlueprintLibrary_OverrideDataflowVariableObjectArray::ReturnValue' has a wrong offset!");

// Function DataflowEngine.DataflowBlueprintLibrary.RegenerateAssetFromDataflow
// 0x0010 (0x0010 - 0x0000)
struct DataflowBlueprintLibrary_RegenerateAssetFromDataflow final
{
public:
	class UObject*                                AssetToRegenerate;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRegenerateDependentAssets;                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DataflowBlueprintLibrary_RegenerateAssetFromDataflow) == 0x000008, "Wrong alignment on DataflowBlueprintLibrary_RegenerateAssetFromDataflow");
static_assert(sizeof(DataflowBlueprintLibrary_RegenerateAssetFromDataflow) == 0x000010, "Wrong size on DataflowBlueprintLibrary_RegenerateAssetFromDataflow");
static_assert(offsetof(DataflowBlueprintLibrary_RegenerateAssetFromDataflow, AssetToRegenerate) == 0x000000, "Member 'DataflowBlueprintLibrary_RegenerateAssetFromDataflow::AssetToRegenerate' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_RegenerateAssetFromDataflow, bRegenerateDependentAssets) == 0x000008, "Member 'DataflowBlueprintLibrary_RegenerateAssetFromDataflow::bRegenerateDependentAssets' has a wrong offset!");
static_assert(offsetof(DataflowBlueprintLibrary_RegenerateAssetFromDataflow, ReturnValue) == 0x000009, "Member 'DataflowBlueprintLibrary_RegenerateAssetFromDataflow::ReturnValue' has a wrong offset!");

}

