#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataflowEngine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DataflowCore_structs.hpp"


namespace SDK
{

// Enum DataflowEngine.EDataflowDebugDrawRenderType
// NumValues: 0x0003
enum class EDataflowDebugDrawRenderType : uint8
{
	Wireframe                                = 0,
	Shaded                                   = 1,
	EDataflowDebugDrawRenderType_MAX         = 2,
};

// Enum DataflowEngine.EDataflowSphereCoveringColorMethod
// NumValues: 0x0004
enum class EDataflowSphereCoveringColorMethod : uint8
{
	Single                                   = 0,
	ColorByRadius                            = 1,
	Random                                   = 2,
	EDataflowSphereCoveringColorMethod_MAX   = 3,
};

// Enum DataflowEngine.EDataflowType
// NumValues: 0x0003
enum class EDataflowType : uint8
{
	Construction                             = 0,
	Simulation                               = 1,
	EDataflowType_MAX                        = 2,
};

// ScriptStruct DataflowEngine.DataflowNodeDebugDrawSettings
// 0x0018 (0x0018 - 0x0000)
struct FDataflowNodeDebugDrawSettings final
{
public:
	EDataflowDebugDrawRenderType                  RenderType;                                        // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTranslucent;                                      // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x0004(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LineWidthMultiplier;                               // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowNodeDebugDrawSettings) == 0x000004, "Wrong alignment on FDataflowNodeDebugDrawSettings");
static_assert(sizeof(FDataflowNodeDebugDrawSettings) == 0x000018, "Wrong size on FDataflowNodeDebugDrawSettings");
static_assert(offsetof(FDataflowNodeDebugDrawSettings, RenderType) == 0x000000, "Member 'FDataflowNodeDebugDrawSettings::RenderType' has a wrong offset!");
static_assert(offsetof(FDataflowNodeDebugDrawSettings, bTranslucent) == 0x000001, "Member 'FDataflowNodeDebugDrawSettings::bTranslucent' has a wrong offset!");
static_assert(offsetof(FDataflowNodeDebugDrawSettings, Color) == 0x000004, "Member 'FDataflowNodeDebugDrawSettings::Color' has a wrong offset!");
static_assert(offsetof(FDataflowNodeDebugDrawSettings, LineWidthMultiplier) == 0x000014, "Member 'FDataflowNodeDebugDrawSettings::LineWidthMultiplier' has a wrong offset!");

// ScriptStruct DataflowEngine.DataflowNodeSphereCoveringDebugDrawSettings
// 0x0040 (0x0040 - 0x0000)
struct FDataflowNodeSphereCoveringDebugDrawSettings final
{
public:
	bool                                          bDisplaySphereCovering;                            // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataflowDebugDrawRenderType                  RenderType;                                        // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTranslucent;                                      // 0x0002(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LineWidthMultiplier;                               // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataflowSphereCoveringColorMethod            ColorMethod;                                       // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x000C(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ColorRandomSeed;                                   // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ColorA;                                            // 0x0020(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ColorB;                                            // 0x0030(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowNodeSphereCoveringDebugDrawSettings) == 0x000004, "Wrong alignment on FDataflowNodeSphereCoveringDebugDrawSettings");
static_assert(sizeof(FDataflowNodeSphereCoveringDebugDrawSettings) == 0x000040, "Wrong size on FDataflowNodeSphereCoveringDebugDrawSettings");
static_assert(offsetof(FDataflowNodeSphereCoveringDebugDrawSettings, bDisplaySphereCovering) == 0x000000, "Member 'FDataflowNodeSphereCoveringDebugDrawSettings::bDisplaySphereCovering' has a wrong offset!");
static_assert(offsetof(FDataflowNodeSphereCoveringDebugDrawSettings, RenderType) == 0x000001, "Member 'FDataflowNodeSphereCoveringDebugDrawSettings::RenderType' has a wrong offset!");
static_assert(offsetof(FDataflowNodeSphereCoveringDebugDrawSettings, bTranslucent) == 0x000002, "Member 'FDataflowNodeSphereCoveringDebugDrawSettings::bTranslucent' has a wrong offset!");
static_assert(offsetof(FDataflowNodeSphereCoveringDebugDrawSettings, LineWidthMultiplier) == 0x000004, "Member 'FDataflowNodeSphereCoveringDebugDrawSettings::LineWidthMultiplier' has a wrong offset!");
static_assert(offsetof(FDataflowNodeSphereCoveringDebugDrawSettings, ColorMethod) == 0x000008, "Member 'FDataflowNodeSphereCoveringDebugDrawSettings::ColorMethod' has a wrong offset!");
static_assert(offsetof(FDataflowNodeSphereCoveringDebugDrawSettings, Color) == 0x00000C, "Member 'FDataflowNodeSphereCoveringDebugDrawSettings::Color' has a wrong offset!");
static_assert(offsetof(FDataflowNodeSphereCoveringDebugDrawSettings, ColorRandomSeed) == 0x00001C, "Member 'FDataflowNodeSphereCoveringDebugDrawSettings::ColorRandomSeed' has a wrong offset!");
static_assert(offsetof(FDataflowNodeSphereCoveringDebugDrawSettings, ColorA) == 0x000020, "Member 'FDataflowNodeSphereCoveringDebugDrawSettings::ColorA' has a wrong offset!");
static_assert(offsetof(FDataflowNodeSphereCoveringDebugDrawSettings, ColorB) == 0x000030, "Member 'FDataflowNodeSphereCoveringDebugDrawSettings::ColorB' has a wrong offset!");

// ScriptStruct DataflowEngine.DataflowProxyElement
// 0x0008 (0x0068 - 0x0060)
struct FDataflowProxyElement final : public FDataflowBaseElement
{
public:
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowProxyElement) == 0x000001, "Wrong alignment on FDataflowProxyElement");
static_assert(sizeof(FDataflowProxyElement) == 0x000068, "Wrong size on FDataflowProxyElement");

// ScriptStruct DataflowEngine.DataflowDynamicConnections
// 0x0078 (0x0078 - 0x0000)
struct FDataflowDynamicConnections final
{
public:
	TArray<struct FDataflowAllTypes>              DynamicProperties;                                 // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10[0x68];                                      // 0x0010(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowDynamicConnections) == 0x000008, "Wrong alignment on FDataflowDynamicConnections");
static_assert(sizeof(FDataflowDynamicConnections) == 0x000078, "Wrong size on FDataflowDynamicConnections");
static_assert(offsetof(FDataflowDynamicConnections, DynamicProperties) == 0x000000, "Member 'FDataflowDynamicConnections::DynamicProperties' has a wrong offset!");

// ScriptStruct DataflowEngine.StringValuePair
// 0x0020 (0x0020 - 0x0000)
struct FStringValuePair final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStringValuePair) == 0x000008, "Wrong alignment on FStringValuePair");
static_assert(sizeof(FStringValuePair) == 0x000020, "Wrong size on FStringValuePair");
static_assert(offsetof(FStringValuePair, Key) == 0x000000, "Member 'FStringValuePair::Key' has a wrong offset!");
static_assert(offsetof(FStringValuePair, Value) == 0x000010, "Member 'FStringValuePair::Value' has a wrong offset!");

// ScriptStruct DataflowEngine.DataflowVariableOverrides
// 0x0028 (0x0028 - 0x0000)
struct FDataflowVariableOverrides final
{
public:
	struct FInstancedPropertyBag                  Variables;                                         // 0x0000(0x0010)(Edit, NativeAccessSpecifierPrivate)
	TArray<struct FGuid>                          OverriddenVariableGuids;                           // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_20[0x8];                                       // 0x0020(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowVariableOverrides) == 0x000008, "Wrong alignment on FDataflowVariableOverrides");
static_assert(sizeof(FDataflowVariableOverrides) == 0x000028, "Wrong size on FDataflowVariableOverrides");
static_assert(offsetof(FDataflowVariableOverrides, Variables) == 0x000000, "Member 'FDataflowVariableOverrides::Variables' has a wrong offset!");
static_assert(offsetof(FDataflowVariableOverrides, OverriddenVariableGuids) == 0x000010, "Member 'FDataflowVariableOverrides::OverriddenVariableGuids' has a wrong offset!");

// ScriptStruct DataflowEngine.DataflowInstance
// 0x0040 (0x0040 - 0x0000)
struct FDataflowInstance final
{
public:
	class UDataflow*                              DataflowAsset;                                     // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   DataflowTerminal;                                  // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataflowVariableOverrides             VariableOverrides;                                 // 0x0010(0x0028)(Edit, NativeAccessSpecifierPrivate)
	class UObject*                                Owner;                                             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FDataflowInstance) == 0x000008, "Wrong alignment on FDataflowInstance");
static_assert(sizeof(FDataflowInstance) == 0x000040, "Wrong size on FDataflowInstance");
static_assert(offsetof(FDataflowInstance, DataflowAsset) == 0x000000, "Member 'FDataflowInstance::DataflowAsset' has a wrong offset!");
static_assert(offsetof(FDataflowInstance, DataflowTerminal) == 0x000008, "Member 'FDataflowInstance::DataflowTerminal' has a wrong offset!");
static_assert(offsetof(FDataflowInstance, VariableOverrides) == 0x000010, "Member 'FDataflowInstance::VariableOverrides' has a wrong offset!");
static_assert(offsetof(FDataflowInstance, Owner) == 0x000038, "Member 'FDataflowInstance::Owner' has a wrong offset!");

// ScriptStruct DataflowEngine.DataflowPreviewCacheParams
// 0x0024 (0x0024 - 0x0000)
struct FDataflowPreviewCacheParams final
{
public:
	int32                                         FrameRate;                                         // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubframeRate;                                      // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEditSubframeRate;                              // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2f                              TimeRange;                                         // 0x000C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRestartSimulation;                                // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2f                              RestartTimeRange;                                  // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsyncCaching;                                     // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowPreviewCacheParams) == 0x000004, "Wrong alignment on FDataflowPreviewCacheParams");
static_assert(sizeof(FDataflowPreviewCacheParams) == 0x000024, "Wrong size on FDataflowPreviewCacheParams");
static_assert(offsetof(FDataflowPreviewCacheParams, FrameRate) == 0x000000, "Member 'FDataflowPreviewCacheParams::FrameRate' has a wrong offset!");
static_assert(offsetof(FDataflowPreviewCacheParams, SubframeRate) == 0x000004, "Member 'FDataflowPreviewCacheParams::SubframeRate' has a wrong offset!");
static_assert(offsetof(FDataflowPreviewCacheParams, bCanEditSubframeRate) == 0x000008, "Member 'FDataflowPreviewCacheParams::bCanEditSubframeRate' has a wrong offset!");
static_assert(offsetof(FDataflowPreviewCacheParams, TimeRange) == 0x00000C, "Member 'FDataflowPreviewCacheParams::TimeRange' has a wrong offset!");
static_assert(offsetof(FDataflowPreviewCacheParams, bRestartSimulation) == 0x000014, "Member 'FDataflowPreviewCacheParams::bRestartSimulation' has a wrong offset!");
static_assert(offsetof(FDataflowPreviewCacheParams, RestartTimeRange) == 0x000018, "Member 'FDataflowPreviewCacheParams::RestartTimeRange' has a wrong offset!");
static_assert(offsetof(FDataflowPreviewCacheParams, bAsyncCaching) == 0x000020, "Member 'FDataflowPreviewCacheParams::bAsyncCaching' has a wrong offset!");

// ScriptStruct DataflowEngine.DataflowSubGraphInputNode
// 0x0090 (0x0310 - 0x0280)
struct FDataflowSubGraphInputNode final : public FDataflowNode
{
public:
	uint8                                         Pad_280[0x8];                                      // 0x0280(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataflowDynamicConnections            DynamicConnections;                                // 0x0288(0x0078)(NativeAccessSpecifierPrivate)
	struct FInstancedPropertyBag                  PropertyBag;                                       // 0x0300(0x0010)(Edit, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FDataflowSubGraphInputNode) == 0x000001, "Wrong alignment on FDataflowSubGraphInputNode");
static_assert(sizeof(FDataflowSubGraphInputNode) == 0x000310, "Wrong size on FDataflowSubGraphInputNode");
static_assert(offsetof(FDataflowSubGraphInputNode, DynamicConnections) == 0x000288, "Member 'FDataflowSubGraphInputNode::DynamicConnections' has a wrong offset!");
static_assert(offsetof(FDataflowSubGraphInputNode, PropertyBag) == 0x000300, "Member 'FDataflowSubGraphInputNode::PropertyBag' has a wrong offset!");

// ScriptStruct DataflowEngine.DataflowSubGraphOutputNode
// 0x0090 (0x0310 - 0x0280)
struct FDataflowSubGraphOutputNode final : public FDataflowNode
{
public:
	uint8                                         Pad_280[0x8];                                      // 0x0280(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataflowDynamicConnections            DynamicConnections;                                // 0x0288(0x0078)(NativeAccessSpecifierPrivate)
	struct FInstancedPropertyBag                  PropertyBag;                                       // 0x0300(0x0010)(Edit, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FDataflowSubGraphOutputNode) == 0x000001, "Wrong alignment on FDataflowSubGraphOutputNode");
static_assert(sizeof(FDataflowSubGraphOutputNode) == 0x000310, "Wrong size on FDataflowSubGraphOutputNode");
static_assert(offsetof(FDataflowSubGraphOutputNode, DynamicConnections) == 0x000288, "Member 'FDataflowSubGraphOutputNode::DynamicConnections' has a wrong offset!");
static_assert(offsetof(FDataflowSubGraphOutputNode, PropertyBag) == 0x000300, "Member 'FDataflowSubGraphOutputNode::PropertyBag' has a wrong offset!");

// ScriptStruct DataflowEngine.DataflowSubGraphGetCurrentIndexNode
// 0x0008 (0x0288 - 0x0280)
struct FDataflowSubGraphGetCurrentIndexNode final : public FDataflowNode
{
public:
	int32                                         Index;                                             // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowSubGraphGetCurrentIndexNode) == 0x000004, "Wrong alignment on FDataflowSubGraphGetCurrentIndexNode");
static_assert(sizeof(FDataflowSubGraphGetCurrentIndexNode) == 0x000288, "Wrong size on FDataflowSubGraphGetCurrentIndexNode");
static_assert(offsetof(FDataflowSubGraphGetCurrentIndexNode, Index) == 0x000280, "Member 'FDataflowSubGraphGetCurrentIndexNode::Index' has a wrong offset!");

// ScriptStruct DataflowEngine.DataflowCallSubGraphNode
// 0x0140 (0x03C0 - 0x0280)
struct FDataflowCallSubGraphNode final : public FDataflowNode
{
public:
	uint8                                         Pad_280[0x10];                                     // 0x0280(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  SubGraphGuid;                                      // 0x0290(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataflowDynamicConnections            DynamicInputs;                                     // 0x02A0(0x0078)(NativeAccessSpecifierPrivate)
	struct FInstancedPropertyBag                  InputsPropertyBag;                                 // 0x0318(0x0010)(NativeAccessSpecifierPrivate)
	struct FDataflowDynamicConnections            DynamicOutputs;                                    // 0x0328(0x0078)(NativeAccessSpecifierPrivate)
	struct FInstancedPropertyBag                  OutputsPropertyBag;                                // 0x03A0(0x0010)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_3B0[0x10];                                     // 0x03B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowCallSubGraphNode) == 0x000001, "Wrong alignment on FDataflowCallSubGraphNode");
static_assert(sizeof(FDataflowCallSubGraphNode) == 0x0003C0, "Wrong size on FDataflowCallSubGraphNode");
static_assert(offsetof(FDataflowCallSubGraphNode, SubGraphGuid) == 0x000290, "Member 'FDataflowCallSubGraphNode::SubGraphGuid' has a wrong offset!");
static_assert(offsetof(FDataflowCallSubGraphNode, DynamicInputs) == 0x0002A0, "Member 'FDataflowCallSubGraphNode::DynamicInputs' has a wrong offset!");
static_assert(offsetof(FDataflowCallSubGraphNode, InputsPropertyBag) == 0x000318, "Member 'FDataflowCallSubGraphNode::InputsPropertyBag' has a wrong offset!");
static_assert(offsetof(FDataflowCallSubGraphNode, DynamicOutputs) == 0x000328, "Member 'FDataflowCallSubGraphNode::DynamicOutputs' has a wrong offset!");
static_assert(offsetof(FDataflowCallSubGraphNode, OutputsPropertyBag) == 0x0003A0, "Member 'FDataflowCallSubGraphNode::OutputsPropertyBag' has a wrong offset!");

// ScriptStruct DataflowEngine.DataflowTextureTerminalNode
// 0x0030 (0x02B0 - 0x0280)
struct FDataflowTextureTerminalNode final : public FDataflowTerminalNode
{
public:
	struct FDataflowImage                         Image;                                             // 0x0280(0x0028)(NativeAccessSpecifierPrivate)
	class UTexture2D*                             TextureAsset;                                      // 0x02A8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FDataflowTextureTerminalNode) == 0x000008, "Wrong alignment on FDataflowTextureTerminalNode");
static_assert(sizeof(FDataflowTextureTerminalNode) == 0x0002B0, "Wrong size on FDataflowTextureTerminalNode");
static_assert(offsetof(FDataflowTextureTerminalNode, Image) == 0x000280, "Member 'FDataflowTextureTerminalNode::Image' has a wrong offset!");
static_assert(offsetof(FDataflowTextureTerminalNode, TextureAsset) == 0x0002A8, "Member 'FDataflowTextureTerminalNode::TextureAsset' has a wrong offset!");

// ScriptStruct DataflowEngine.DataflowTextureToImageNode
// 0x0030 (0x02B0 - 0x0280)
struct FDataflowTextureToImageNode final : public FDataflowNode
{
public:
	class UTexture2D*                             TextureAsset;                                      // 0x0280(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataflowImage                         Image;                                             // 0x0288(0x0028)(NativeAccessSpecifierPrivate)
};
static_assert(alignof(FDataflowTextureToImageNode) == 0x000008, "Wrong alignment on FDataflowTextureToImageNode");
static_assert(sizeof(FDataflowTextureToImageNode) == 0x0002B0, "Wrong size on FDataflowTextureToImageNode");
static_assert(offsetof(FDataflowTextureToImageNode, TextureAsset) == 0x000280, "Member 'FDataflowTextureToImageNode::TextureAsset' has a wrong offset!");
static_assert(offsetof(FDataflowTextureToImageNode, Image) == 0x000288, "Member 'FDataflowTextureToImageNode::Image' has a wrong offset!");

// ScriptStruct DataflowEngine.DataflowImageToTextureNode
// 0x0038 (0x02B8 - 0x0280)
struct FDataflowImageToTextureNode final : public FDataflowNode
{
public:
	struct FDataflowImage                         Image;                                             // 0x0280(0x0028)(NativeAccessSpecifierPrivate)
	class FName                                   TextureName;                                       // 0x02A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture2D*                             TransientTexture;                                  // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FDataflowImageToTextureNode) == 0x000008, "Wrong alignment on FDataflowImageToTextureNode");
static_assert(sizeof(FDataflowImageToTextureNode) == 0x0002B8, "Wrong size on FDataflowImageToTextureNode");
static_assert(offsetof(FDataflowImageToTextureNode, Image) == 0x000280, "Member 'FDataflowImageToTextureNode::Image' has a wrong offset!");
static_assert(offsetof(FDataflowImageToTextureNode, TextureName) == 0x0002A8, "Member 'FDataflowImageToTextureNode::TextureName' has a wrong offset!");
static_assert(offsetof(FDataflowImageToTextureNode, TransientTexture) == 0x0002B0, "Member 'FDataflowImageToTextureNode::TransientTexture' has a wrong offset!");

// ScriptStruct DataflowEngine.GetDataflowVariableNode
// 0x0038 (0x02B8 - 0x0280)
struct FGetDataflowVariableNode final : public FDataflowNode
{
public:
	struct FDataflowAnyType                       Value;                                             // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedPropertyBag                  VariablePropertyBag;                               // 0x0288(0x0010)(Edit, NativeAccessSpecifierPrivate)
	class FName                                   VariableName;                                      // 0x0298(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A0[0x18];                                     // 0x02A0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGetDataflowVariableNode) == 0x000004, "Wrong alignment on FGetDataflowVariableNode");
static_assert(sizeof(FGetDataflowVariableNode) == 0x0002B8, "Wrong size on FGetDataflowVariableNode");
static_assert(offsetof(FGetDataflowVariableNode, Value) == 0x000280, "Member 'FGetDataflowVariableNode::Value' has a wrong offset!");
static_assert(offsetof(FGetDataflowVariableNode, VariablePropertyBag) == 0x000288, "Member 'FGetDataflowVariableNode::VariablePropertyBag' has a wrong offset!");
static_assert(offsetof(FGetDataflowVariableNode, VariableName) == 0x000298, "Member 'FGetDataflowVariableNode::VariableName' has a wrong offset!");

}

