#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataflowCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Chaos_structs.hpp"


namespace SDK
{

// Enum DataflowCore.EDataflowImageResolution
// NumValues: 0x000B
enum class EDataflowImageResolution : uint32
{
	Resolution16                             = 16,
	Resolution32                             = 32,
	Resolution64                             = 64,
	Resolution128                            = 128,
	Resolution256                            = 256,
	Resolution512                            = 512,
	Resolution1024                           = 1024,
	Resolution2048                           = 2048,
	Resolution4096                           = 4096,
	Resolution8192                           = 8192,
	EDataflowImageResolution_MAX             = 8193,
};

// Enum DataflowCore.EDataflowImageChannel
// NumValues: 0x0005
enum class EDataflowImageChannel : uint8
{
	Red                                      = 0,
	Green                                    = 1,
	Blue                                     = 2,
	Alpha                                    = 3,
	EDataflowImageChannel_MAX                = 4,
};

// Enum DataflowCore.EDataflowImageCombineResolutionOption
// NumValues: 0x0004
enum class EDataflowImageCombineResolutionOption : uint32
{
	Lowest                                   = 0,
	Highest                                  = 1,
	UserDefined                              = 2,
	EDataflowImageCombineResolutionOption_MAX = 3,
};

// Enum DataflowCore.EDataflowMathConstantsEnum
// NumValues: 0x000E
enum class EDataflowMathConstantsEnum : uint8
{
	Dataflow_Math_Constants_Pi               = 0,
	Dataflow_Math_Constants_HalfPi           = 1,
	Dataflow_Math_Constants_TwoPi            = 2,
	Dataflow_Math_Constants_FourPi           = 3,
	Dataflow_Math_Constants_InvPi            = 4,
	Dataflow_Math_Constants_InvTwoPi         = 5,
	Dataflow_Math_Constants_Sqrt2            = 6,
	Dataflow_Math_Constants_InvSqrt2         = 7,
	Dataflow_Math_Constants_Sqrt3            = 8,
	Dataflow_Math_Constants_InvSqrt3         = 9,
	Dataflow_Math_Constants_E                = 10,
	Dataflow_Math_Constants_Gamma            = 11,
	Dataflow_Math_Constants_GoldenRatio      = 12,
	Dataflow_Math_Constants_Max              = 13,
};

// Enum DataflowCore.EDataflowSelectionType
// NumValues: 0x0005
enum class EDataflowSelectionType : uint8
{
	Transform                                = 0,
	Vertices                                 = 1,
	Faces                                    = 2,
	Geometry                                 = 3,
	EDataflowSelectionType_MAX               = 4,
};

// ScriptStruct DataflowCore.DataflowAnyType
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FDataflowAnyType
{
};
#pragma pack(pop)
static_assert(alignof(FDataflowAnyType) == 0x000001, "Wrong alignment on FDataflowAnyType");
static_assert(sizeof(FDataflowAnyType) == 0x000001, "Wrong size on FDataflowAnyType");

// ScriptStruct DataflowCore.DataflowAllTypes
// 0x0001 (0x0001 - 0x0000)
struct FDataflowAllTypes final : public FDataflowAnyType
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowAllTypes) == 0x000001, "Wrong alignment on FDataflowAllTypes");
static_assert(sizeof(FDataflowAllTypes) == 0x000001, "Wrong size on FDataflowAllTypes");

// ScriptStruct DataflowCore.DataflowArrayTypes
// 0x0001 (0x0001 - 0x0000)
struct FDataflowArrayTypes final : public FDataflowAnyType
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowArrayTypes) == 0x000001, "Wrong alignment on FDataflowArrayTypes");
static_assert(sizeof(FDataflowArrayTypes) == 0x000001, "Wrong size on FDataflowArrayTypes");

// ScriptStruct DataflowCore.DataflowNumericTypes
// 0x0008 (0x0008 - 0x0000)
struct FDataflowNumericTypes final : public FDataflowAnyType
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowNumericTypes) == 0x000008, "Wrong alignment on FDataflowNumericTypes");
static_assert(sizeof(FDataflowNumericTypes) == 0x000008, "Wrong size on FDataflowNumericTypes");
static_assert(offsetof(FDataflowNumericTypes, Value) == 0x000000, "Member 'FDataflowNumericTypes::Value' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowVectorTypes
// 0x0020 (0x0020 - 0x0000)
struct FDataflowVectorTypes final : public FDataflowAnyType
{
public:
	struct FVector4                               Value;                                             // 0x0000(0x0020)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowVectorTypes) == 0x000001, "Wrong alignment on FDataflowVectorTypes");
static_assert(sizeof(FDataflowVectorTypes) == 0x000020, "Wrong size on FDataflowVectorTypes");
static_assert(offsetof(FDataflowVectorTypes, Value) == 0x000000, "Member 'FDataflowVectorTypes::Value' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowStringTypes
// 0x0010 (0x0010 - 0x0000)
struct FDataflowStringTypes final : public FDataflowAnyType
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowStringTypes) == 0x000008, "Wrong alignment on FDataflowStringTypes");
static_assert(sizeof(FDataflowStringTypes) == 0x000010, "Wrong size on FDataflowStringTypes");
static_assert(offsetof(FDataflowStringTypes, Value) == 0x000000, "Member 'FDataflowStringTypes::Value' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowBoolTypes
// 0x0001 (0x0001 - 0x0000)
struct FDataflowBoolTypes final : public FDataflowAnyType
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowBoolTypes) == 0x000001, "Wrong alignment on FDataflowBoolTypes");
static_assert(sizeof(FDataflowBoolTypes) == 0x000001, "Wrong size on FDataflowBoolTypes");
static_assert(offsetof(FDataflowBoolTypes, Value) == 0x000000, "Member 'FDataflowBoolTypes::Value' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowTransformTypes
// 0x0060 (0x0060 - 0x0000)
struct FDataflowTransformTypes final : public FDataflowAnyType
{
public:
	struct FTransform                             Value;                                             // 0x0000(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowTransformTypes) == 0x000001, "Wrong alignment on FDataflowTransformTypes");
static_assert(sizeof(FDataflowTransformTypes) == 0x000060, "Wrong size on FDataflowTransformTypes");
static_assert(offsetof(FDataflowTransformTypes, Value) == 0x000000, "Member 'FDataflowTransformTypes::Value' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowStringConvertibleTypes
// 0x0010 (0x0010 - 0x0000)
struct FDataflowStringConvertibleTypes final : public FDataflowAnyType
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowStringConvertibleTypes) == 0x000008, "Wrong alignment on FDataflowStringConvertibleTypes");
static_assert(sizeof(FDataflowStringConvertibleTypes) == 0x000010, "Wrong size on FDataflowStringConvertibleTypes");
static_assert(offsetof(FDataflowStringConvertibleTypes, Value) == 0x000000, "Member 'FDataflowStringConvertibleTypes::Value' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowUObjectConvertibleTypes
// 0x0008 (0x0008 - 0x0000)
struct FDataflowUObjectConvertibleTypes final : public FDataflowAnyType
{
public:
	class UObject*                                Value;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowUObjectConvertibleTypes) == 0x000008, "Wrong alignment on FDataflowUObjectConvertibleTypes");
static_assert(sizeof(FDataflowUObjectConvertibleTypes) == 0x000008, "Wrong size on FDataflowUObjectConvertibleTypes");
static_assert(offsetof(FDataflowUObjectConvertibleTypes, Value) == 0x000000, "Member 'FDataflowUObjectConvertibleTypes::Value' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowSelection
// 0x0028 (0x0028 - 0x0000)
struct FDataflowSelection
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowSelection) == 0x000001, "Wrong alignment on FDataflowSelection");
static_assert(sizeof(FDataflowSelection) == 0x000028, "Wrong size on FDataflowSelection");

// ScriptStruct DataflowCore.DataflowSelectionTypes
// 0x0028 (0x0028 - 0x0000)
struct FDataflowSelectionTypes final : public FDataflowAnyType
{
public:
	struct FDataflowSelection                     Value;                                             // 0x0000(0x0028)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowSelectionTypes) == 0x000001, "Wrong alignment on FDataflowSelectionTypes");
static_assert(sizeof(FDataflowSelectionTypes) == 0x000028, "Wrong size on FDataflowSelectionTypes");
static_assert(offsetof(FDataflowSelectionTypes, Value) == 0x000000, "Member 'FDataflowSelectionTypes::Value' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowVectorArrayTypes
// 0x0010 (0x0010 - 0x0000)
struct FDataflowVectorArrayTypes final : public FDataflowAnyType
{
public:
	TArray<struct FVector4>                       Value;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowVectorArrayTypes) == 0x000008, "Wrong alignment on FDataflowVectorArrayTypes");
static_assert(sizeof(FDataflowVectorArrayTypes) == 0x000010, "Wrong size on FDataflowVectorArrayTypes");
static_assert(offsetof(FDataflowVectorArrayTypes, Value) == 0x000000, "Member 'FDataflowVectorArrayTypes::Value' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowNumericArrayTypes
// 0x0010 (0x0010 - 0x0000)
struct FDataflowNumericArrayTypes final : public FDataflowAnyType
{
public:
	TArray<double>                                Value;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowNumericArrayTypes) == 0x000008, "Wrong alignment on FDataflowNumericArrayTypes");
static_assert(sizeof(FDataflowNumericArrayTypes) == 0x000010, "Wrong size on FDataflowNumericArrayTypes");
static_assert(offsetof(FDataflowNumericArrayTypes, Value) == 0x000000, "Member 'FDataflowNumericArrayTypes::Value' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowStringArrayTypes
// 0x0010 (0x0010 - 0x0000)
struct FDataflowStringArrayTypes final : public FDataflowAnyType
{
public:
	TArray<class FString>                         Value;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowStringArrayTypes) == 0x000008, "Wrong alignment on FDataflowStringArrayTypes");
static_assert(sizeof(FDataflowStringArrayTypes) == 0x000010, "Wrong size on FDataflowStringArrayTypes");
static_assert(offsetof(FDataflowStringArrayTypes, Value) == 0x000000, "Member 'FDataflowStringArrayTypes::Value' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowBoolArrayTypes
// 0x0010 (0x0010 - 0x0000)
struct FDataflowBoolArrayTypes final : public FDataflowAnyType
{
public:
	TArray<bool>                                  Value;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowBoolArrayTypes) == 0x000008, "Wrong alignment on FDataflowBoolArrayTypes");
static_assert(sizeof(FDataflowBoolArrayTypes) == 0x000010, "Wrong size on FDataflowBoolArrayTypes");
static_assert(offsetof(FDataflowBoolArrayTypes, Value) == 0x000000, "Member 'FDataflowBoolArrayTypes::Value' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowTransformArrayTypes
// 0x0010 (0x0010 - 0x0000)
struct FDataflowTransformArrayTypes final : public FDataflowAnyType
{
public:
	TArray<struct FTransform>                     Value;                                             // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowTransformArrayTypes) == 0x000008, "Wrong alignment on FDataflowTransformArrayTypes");
static_assert(sizeof(FDataflowTransformArrayTypes) == 0x000010, "Wrong size on FDataflowTransformArrayTypes");
static_assert(offsetof(FDataflowTransformArrayTypes, Value) == 0x000000, "Member 'FDataflowTransformArrayTypes::Value' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowRotationTypes
// 0x0018 (0x0018 - 0x0000)
struct FDataflowRotationTypes final : public FDataflowAnyType
{
public:
	struct FRotator                               Value;                                             // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowRotationTypes) == 0x000001, "Wrong alignment on FDataflowRotationTypes");
static_assert(sizeof(FDataflowRotationTypes) == 0x000018, "Wrong size on FDataflowRotationTypes");
static_assert(offsetof(FDataflowRotationTypes, Value) == 0x000000, "Member 'FDataflowRotationTypes::Value' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowNode
// 0x0280 (0x0280 - 0x0000)
struct FDataflowNode
{
public:
	uint8                                         Pad_0[0xD8];                                       // 0x0000(0x00D8)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bActive;                                           // 0x00D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideColor;                                    // 0x00D9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           OverrideColor;                                     // 0x00DC(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x144];                                     // 0x00EC(0x0144)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedPropertyBag                  FrozenProperties;                                  // 0x0230(0x0010)(NativeAccessSpecifierPrivate)
	bool                                          bIsFrozen;                                         // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_241[0x3F];                                     // 0x0241(0x003F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowNode) == 0x000001, "Wrong alignment on FDataflowNode");
static_assert(sizeof(FDataflowNode) == 0x000280, "Wrong size on FDataflowNode");
static_assert(offsetof(FDataflowNode, bActive) == 0x0000D8, "Member 'FDataflowNode::bActive' has a wrong offset!");
static_assert(offsetof(FDataflowNode, bOverrideColor) == 0x0000D9, "Member 'FDataflowNode::bOverrideColor' has a wrong offset!");
static_assert(offsetof(FDataflowNode, OverrideColor) == 0x0000DC, "Member 'FDataflowNode::OverrideColor' has a wrong offset!");
static_assert(offsetof(FDataflowNode, FrozenProperties) == 0x000230, "Member 'FDataflowNode::FrozenProperties' has a wrong offset!");
static_assert(offsetof(FDataflowNode, bIsFrozen) == 0x000240, "Member 'FDataflowNode::bIsFrozen' has a wrong offset!");

// ScriptStruct DataflowCore.ConvertNumericTypesDataflowNode
// 0x0010 (0x0290 - 0x0280)
struct FConvertNumericTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowNumericTypes                  In;                                                // 0x0280(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowNumericTypes                  Out;                                               // 0x0288(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FConvertNumericTypesDataflowNode) == 0x000001, "Wrong alignment on FConvertNumericTypesDataflowNode");
static_assert(sizeof(FConvertNumericTypesDataflowNode) == 0x000290, "Wrong size on FConvertNumericTypesDataflowNode");
static_assert(offsetof(FConvertNumericTypesDataflowNode, In) == 0x000280, "Member 'FConvertNumericTypesDataflowNode::In' has a wrong offset!");
static_assert(offsetof(FConvertNumericTypesDataflowNode, Out) == 0x000288, "Member 'FConvertNumericTypesDataflowNode::Out' has a wrong offset!");

// ScriptStruct DataflowCore.ConvertVectorTypesDataflowNode
// 0x0040 (0x02C0 - 0x0280)
struct FConvertVectorTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowVectorTypes                   In;                                                // 0x0280(0x0020)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowVectorTypes                   Out;                                               // 0x02A0(0x0020)(NoDestructor, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FConvertVectorTypesDataflowNode) == 0x000001, "Wrong alignment on FConvertVectorTypesDataflowNode");
static_assert(sizeof(FConvertVectorTypesDataflowNode) == 0x0002C0, "Wrong size on FConvertVectorTypesDataflowNode");
static_assert(offsetof(FConvertVectorTypesDataflowNode, In) == 0x000280, "Member 'FConvertVectorTypesDataflowNode::In' has a wrong offset!");
static_assert(offsetof(FConvertVectorTypesDataflowNode, Out) == 0x0002A0, "Member 'FConvertVectorTypesDataflowNode::Out' has a wrong offset!");

// ScriptStruct DataflowCore.ConvertStringTypesDataflowNode
// 0x0020 (0x02A0 - 0x0280)
struct FConvertStringTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowStringTypes                   In;                                                // 0x0280(0x0010)(NativeAccessSpecifierPrivate)
	struct FDataflowStringTypes                   Out;                                               // 0x0290(0x0010)(NativeAccessSpecifierPrivate)
};
static_assert(alignof(FConvertStringTypesDataflowNode) == 0x000001, "Wrong alignment on FConvertStringTypesDataflowNode");
static_assert(sizeof(FConvertStringTypesDataflowNode) == 0x0002A0, "Wrong size on FConvertStringTypesDataflowNode");
static_assert(offsetof(FConvertStringTypesDataflowNode, In) == 0x000280, "Member 'FConvertStringTypesDataflowNode::In' has a wrong offset!");
static_assert(offsetof(FConvertStringTypesDataflowNode, Out) == 0x000290, "Member 'FConvertStringTypesDataflowNode::Out' has a wrong offset!");

// ScriptStruct DataflowCore.ConvertBoolTypesDataflowNode
// 0x0008 (0x0288 - 0x0280)
struct FConvertBoolTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowBoolTypes                     In;                                                // 0x0280(0x0001)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowBoolTypes                     Out;                                               // 0x0281(0x0001)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FConvertBoolTypesDataflowNode) == 0x000001, "Wrong alignment on FConvertBoolTypesDataflowNode");
static_assert(sizeof(FConvertBoolTypesDataflowNode) == 0x000288, "Wrong size on FConvertBoolTypesDataflowNode");
static_assert(offsetof(FConvertBoolTypesDataflowNode, In) == 0x000280, "Member 'FConvertBoolTypesDataflowNode::In' has a wrong offset!");
static_assert(offsetof(FConvertBoolTypesDataflowNode, Out) == 0x000281, "Member 'FConvertBoolTypesDataflowNode::Out' has a wrong offset!");

// ScriptStruct DataflowCore.ConvertTransformTypesDataflowNode
// 0x00C0 (0x0340 - 0x0280)
struct FConvertTransformTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowTransformTypes                In;                                                // 0x0280(0x0060)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowTransformTypes                Out;                                               // 0x02E0(0x0060)(NoDestructor, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FConvertTransformTypesDataflowNode) == 0x000001, "Wrong alignment on FConvertTransformTypesDataflowNode");
static_assert(sizeof(FConvertTransformTypesDataflowNode) == 0x000340, "Wrong size on FConvertTransformTypesDataflowNode");
static_assert(offsetof(FConvertTransformTypesDataflowNode, In) == 0x000280, "Member 'FConvertTransformTypesDataflowNode::In' has a wrong offset!");
static_assert(offsetof(FConvertTransformTypesDataflowNode, Out) == 0x0002E0, "Member 'FConvertTransformTypesDataflowNode::Out' has a wrong offset!");

// ScriptStruct DataflowCore.ConvertStringConvertibleTypesDataflowNode
// 0x0020 (0x02A0 - 0x0280)
struct FConvertStringConvertibleTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowStringConvertibleTypes        In;                                                // 0x0280(0x0010)(NativeAccessSpecifierPrivate)
	struct FDataflowStringConvertibleTypes        Out;                                               // 0x0290(0x0010)(NativeAccessSpecifierPrivate)
};
static_assert(alignof(FConvertStringConvertibleTypesDataflowNode) == 0x000001, "Wrong alignment on FConvertStringConvertibleTypesDataflowNode");
static_assert(sizeof(FConvertStringConvertibleTypesDataflowNode) == 0x0002A0, "Wrong size on FConvertStringConvertibleTypesDataflowNode");
static_assert(offsetof(FConvertStringConvertibleTypesDataflowNode, In) == 0x000280, "Member 'FConvertStringConvertibleTypesDataflowNode::In' has a wrong offset!");
static_assert(offsetof(FConvertStringConvertibleTypesDataflowNode, Out) == 0x000290, "Member 'FConvertStringConvertibleTypesDataflowNode::Out' has a wrong offset!");

// ScriptStruct DataflowCore.ConvertUObjectConvertibleTypesDataflowNode
// 0x0010 (0x0290 - 0x0280)
struct FConvertUObjectConvertibleTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowUObjectConvertibleTypes       In;                                                // 0x0280(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowUObjectConvertibleTypes       Out;                                               // 0x0288(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FConvertUObjectConvertibleTypesDataflowNode) == 0x000001, "Wrong alignment on FConvertUObjectConvertibleTypesDataflowNode");
static_assert(sizeof(FConvertUObjectConvertibleTypesDataflowNode) == 0x000290, "Wrong size on FConvertUObjectConvertibleTypesDataflowNode");
static_assert(offsetof(FConvertUObjectConvertibleTypesDataflowNode, In) == 0x000280, "Member 'FConvertUObjectConvertibleTypesDataflowNode::In' has a wrong offset!");
static_assert(offsetof(FConvertUObjectConvertibleTypesDataflowNode, Out) == 0x000288, "Member 'FConvertUObjectConvertibleTypesDataflowNode::Out' has a wrong offset!");

// ScriptStruct DataflowCore.ConvertSelectionTypesDataflowNode
// 0x0108 (0x0388 - 0x0280)
struct FConvertSelectionTypesDataflowNode final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x0280(0x00B0)(NativeAccessSpecifierPrivate)
	struct FDataflowSelectionTypes                In;                                                // 0x0330(0x0028)(NativeAccessSpecifierPrivate)
	bool                                          bAllElementsMustBeSelected;                        // 0x0358(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataflowSelectionTypes                Out;                                               // 0x0360(0x0028)(NativeAccessSpecifierPrivate)
};
static_assert(alignof(FConvertSelectionTypesDataflowNode) == 0x000001, "Wrong alignment on FConvertSelectionTypesDataflowNode");
static_assert(sizeof(FConvertSelectionTypesDataflowNode) == 0x000388, "Wrong size on FConvertSelectionTypesDataflowNode");
static_assert(offsetof(FConvertSelectionTypesDataflowNode, Collection) == 0x000280, "Member 'FConvertSelectionTypesDataflowNode::Collection' has a wrong offset!");
static_assert(offsetof(FConvertSelectionTypesDataflowNode, In) == 0x000330, "Member 'FConvertSelectionTypesDataflowNode::In' has a wrong offset!");
static_assert(offsetof(FConvertSelectionTypesDataflowNode, bAllElementsMustBeSelected) == 0x000358, "Member 'FConvertSelectionTypesDataflowNode::bAllElementsMustBeSelected' has a wrong offset!");
static_assert(offsetof(FConvertSelectionTypesDataflowNode, Out) == 0x000360, "Member 'FConvertSelectionTypesDataflowNode::Out' has a wrong offset!");

// ScriptStruct DataflowCore.ConvertVectorArrayTypesDataflowNode
// 0x0020 (0x02A0 - 0x0280)
struct FConvertVectorArrayTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowVectorArrayTypes              In;                                                // 0x0280(0x0010)(NativeAccessSpecifierPrivate)
	struct FDataflowVectorArrayTypes              Out;                                               // 0x0290(0x0010)(NativeAccessSpecifierPrivate)
};
static_assert(alignof(FConvertVectorArrayTypesDataflowNode) == 0x000001, "Wrong alignment on FConvertVectorArrayTypesDataflowNode");
static_assert(sizeof(FConvertVectorArrayTypesDataflowNode) == 0x0002A0, "Wrong size on FConvertVectorArrayTypesDataflowNode");
static_assert(offsetof(FConvertVectorArrayTypesDataflowNode, In) == 0x000280, "Member 'FConvertVectorArrayTypesDataflowNode::In' has a wrong offset!");
static_assert(offsetof(FConvertVectorArrayTypesDataflowNode, Out) == 0x000290, "Member 'FConvertVectorArrayTypesDataflowNode::Out' has a wrong offset!");

// ScriptStruct DataflowCore.ConvertNumericArrayTypesDataflowNode
// 0x0020 (0x02A0 - 0x0280)
struct FConvertNumericArrayTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowNumericArrayTypes             In;                                                // 0x0280(0x0010)(NativeAccessSpecifierPrivate)
	struct FDataflowNumericArrayTypes             Out;                                               // 0x0290(0x0010)(NativeAccessSpecifierPrivate)
};
static_assert(alignof(FConvertNumericArrayTypesDataflowNode) == 0x000001, "Wrong alignment on FConvertNumericArrayTypesDataflowNode");
static_assert(sizeof(FConvertNumericArrayTypesDataflowNode) == 0x0002A0, "Wrong size on FConvertNumericArrayTypesDataflowNode");
static_assert(offsetof(FConvertNumericArrayTypesDataflowNode, In) == 0x000280, "Member 'FConvertNumericArrayTypesDataflowNode::In' has a wrong offset!");
static_assert(offsetof(FConvertNumericArrayTypesDataflowNode, Out) == 0x000290, "Member 'FConvertNumericArrayTypesDataflowNode::Out' has a wrong offset!");

// ScriptStruct DataflowCore.ConvertStringArrayTypesDataflowNode
// 0x0020 (0x02A0 - 0x0280)
struct FConvertStringArrayTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowStringArrayTypes              In;                                                // 0x0280(0x0010)(NativeAccessSpecifierPrivate)
	struct FDataflowStringArrayTypes              Out;                                               // 0x0290(0x0010)(NativeAccessSpecifierPrivate)
};
static_assert(alignof(FConvertStringArrayTypesDataflowNode) == 0x000001, "Wrong alignment on FConvertStringArrayTypesDataflowNode");
static_assert(sizeof(FConvertStringArrayTypesDataflowNode) == 0x0002A0, "Wrong size on FConvertStringArrayTypesDataflowNode");
static_assert(offsetof(FConvertStringArrayTypesDataflowNode, In) == 0x000280, "Member 'FConvertStringArrayTypesDataflowNode::In' has a wrong offset!");
static_assert(offsetof(FConvertStringArrayTypesDataflowNode, Out) == 0x000290, "Member 'FConvertStringArrayTypesDataflowNode::Out' has a wrong offset!");

// ScriptStruct DataflowCore.ConvertBoolArrayTypesDataflowNode
// 0x0020 (0x02A0 - 0x0280)
struct FConvertBoolArrayTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowBoolArrayTypes                In;                                                // 0x0280(0x0010)(NativeAccessSpecifierPrivate)
	struct FDataflowBoolArrayTypes                Out;                                               // 0x0290(0x0010)(NativeAccessSpecifierPrivate)
};
static_assert(alignof(FConvertBoolArrayTypesDataflowNode) == 0x000001, "Wrong alignment on FConvertBoolArrayTypesDataflowNode");
static_assert(sizeof(FConvertBoolArrayTypesDataflowNode) == 0x0002A0, "Wrong size on FConvertBoolArrayTypesDataflowNode");
static_assert(offsetof(FConvertBoolArrayTypesDataflowNode, In) == 0x000280, "Member 'FConvertBoolArrayTypesDataflowNode::In' has a wrong offset!");
static_assert(offsetof(FConvertBoolArrayTypesDataflowNode, Out) == 0x000290, "Member 'FConvertBoolArrayTypesDataflowNode::Out' has a wrong offset!");

// ScriptStruct DataflowCore.ConvertTransformArrayTypesDataflowNode
// 0x0020 (0x02A0 - 0x0280)
struct FConvertTransformArrayTypesDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowTransformArrayTypes           In;                                                // 0x0280(0x0010)(NativeAccessSpecifierPrivate)
	struct FDataflowTransformArrayTypes           Out;                                               // 0x0290(0x0010)(NativeAccessSpecifierPrivate)
};
static_assert(alignof(FConvertTransformArrayTypesDataflowNode) == 0x000001, "Wrong alignment on FConvertTransformArrayTypesDataflowNode");
static_assert(sizeof(FConvertTransformArrayTypesDataflowNode) == 0x0002A0, "Wrong size on FConvertTransformArrayTypesDataflowNode");
static_assert(offsetof(FConvertTransformArrayTypesDataflowNode, In) == 0x000280, "Member 'FConvertTransformArrayTypesDataflowNode::In' has a wrong offset!");
static_assert(offsetof(FConvertTransformArrayTypesDataflowNode, Out) == 0x000290, "Member 'FConvertTransformArrayTypesDataflowNode::Out' has a wrong offset!");

// ScriptStruct DataflowCore.ConvertRotationDataflowNode
// 0x0030 (0x02B0 - 0x0280)
struct FConvertRotationDataflowNode final : public FDataflowNode
{
public:
	struct FDataflowRotationTypes                 In;                                                // 0x0280(0x0018)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataflowRotationTypes                 Out;                                               // 0x0298(0x0018)(NoDestructor, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FConvertRotationDataflowNode) == 0x000001, "Wrong alignment on FConvertRotationDataflowNode");
static_assert(sizeof(FConvertRotationDataflowNode) == 0x0002B0, "Wrong size on FConvertRotationDataflowNode");
static_assert(offsetof(FConvertRotationDataflowNode, In) == 0x000280, "Member 'FConvertRotationDataflowNode::In' has a wrong offset!");
static_assert(offsetof(FConvertRotationDataflowNode, Out) == 0x000298, "Member 'FConvertRotationDataflowNode::Out' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowReRouteNode
// 0x0008 (0x0288 - 0x0280)
struct FDataflowReRouteNode final : public FDataflowNode
{
public:
	struct FDataflowAnyType                       Value;                                             // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowReRouteNode) == 0x000001, "Wrong alignment on FDataflowReRouteNode");
static_assert(sizeof(FDataflowReRouteNode) == 0x000288, "Wrong size on FDataflowReRouteNode");
static_assert(offsetof(FDataflowReRouteNode, Value) == 0x000280, "Member 'FDataflowReRouteNode::Value' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowBranchNode
// 0x0008 (0x0288 - 0x0280)
struct FDataflowBranchNode final : public FDataflowNode
{
public:
	struct FDataflowAnyType                       TrueValue;                                         // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataflowAnyType                       FalseValue;                                        // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bCondition;                                        // 0x0282(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataflowAnyType                       result;                                            // 0x0283(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowBranchNode) == 0x000001, "Wrong alignment on FDataflowBranchNode");
static_assert(sizeof(FDataflowBranchNode) == 0x000288, "Wrong size on FDataflowBranchNode");
static_assert(offsetof(FDataflowBranchNode, TrueValue) == 0x000280, "Member 'FDataflowBranchNode::TrueValue' has a wrong offset!");
static_assert(offsetof(FDataflowBranchNode, FalseValue) == 0x000281, "Member 'FDataflowBranchNode::FalseValue' has a wrong offset!");
static_assert(offsetof(FDataflowBranchNode, bCondition) == 0x000282, "Member 'FDataflowBranchNode::bCondition' has a wrong offset!");
static_assert(offsetof(FDataflowBranchNode, result) == 0x000283, "Member 'FDataflowBranchNode::result' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowSelectNode
// 0x0018 (0x0298 - 0x0280)
struct FDataflowSelectNode final : public FDataflowNode
{
public:
	TArray<struct FDataflowAnyType>               Inputs;                                            // 0x0280(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         SelectedIndex;                                     // 0x0290(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataflowAnyType                       result;                                            // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowSelectNode) == 0x000008, "Wrong alignment on FDataflowSelectNode");
static_assert(sizeof(FDataflowSelectNode) == 0x000298, "Wrong size on FDataflowSelectNode");
static_assert(offsetof(FDataflowSelectNode, Inputs) == 0x000280, "Member 'FDataflowSelectNode::Inputs' has a wrong offset!");
static_assert(offsetof(FDataflowSelectNode, SelectedIndex) == 0x000290, "Member 'FDataflowSelectNode::SelectedIndex' has a wrong offset!");
static_assert(offsetof(FDataflowSelectNode, result) == 0x000294, "Member 'FDataflowSelectNode::result' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowPrintNode
// 0x0010 (0x0290 - 0x0280)
struct FDataflowPrintNode final : public FDataflowNode
{
public:
	struct FDataflowStringConvertibleTypes        Value;                                             // 0x0280(0x0010)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowPrintNode) == 0x000001, "Wrong alignment on FDataflowPrintNode");
static_assert(sizeof(FDataflowPrintNode) == 0x000290, "Wrong size on FDataflowPrintNode");
static_assert(offsetof(FDataflowPrintNode, Value) == 0x000280, "Member 'FDataflowPrintNode::Value' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowForceDependencyNode
// 0x0008 (0x0288 - 0x0280)
struct FDataflowForceDependencyNode final : public FDataflowNode
{
public:
	struct FDataflowAnyType                       Value;                                             // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataflowAnyType                       DependentValue;                                    // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowForceDependencyNode) == 0x000001, "Wrong alignment on FDataflowForceDependencyNode");
static_assert(sizeof(FDataflowForceDependencyNode) == 0x000288, "Wrong size on FDataflowForceDependencyNode");
static_assert(offsetof(FDataflowForceDependencyNode, Value) == 0x000280, "Member 'FDataflowForceDependencyNode::Value' has a wrong offset!");
static_assert(offsetof(FDataflowForceDependencyNode, DependentValue) == 0x000281, "Member 'FDataflowForceDependencyNode::DependentValue' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowBaseElement
// 0x0060 (0x0060 - 0x0000)
struct FDataflowBaseElement
{
public:
	uint8                                         Pad_0[0x60];                                       // 0x0000(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowBaseElement) == 0x000001, "Wrong alignment on FDataflowBaseElement");
static_assert(sizeof(FDataflowBaseElement) == 0x000060, "Wrong size on FDataflowBaseElement");

// ScriptStruct DataflowCore.DataflowImage
// 0x0028 (0x0028 - 0x0000)
struct FDataflowImage final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowImage) == 0x000001, "Wrong alignment on FDataflowImage");
static_assert(sizeof(FDataflowImage) == 0x000028, "Wrong size on FDataflowImage");

// ScriptStruct DataflowCore.DataflowImageFromColorNode
// 0x0040 (0x02C0 - 0x0280)
struct FDataflowImageFromColorNode final : public FDataflowNode
{
public:
	struct FLinearColor                           FillColor;                                         // 0x0280(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EDataflowImageResolution                      Resolution;                                        // 0x0290(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataflowImage                         Image;                                             // 0x0298(0x0028)(NativeAccessSpecifierPrivate)
};
static_assert(alignof(FDataflowImageFromColorNode) == 0x000004, "Wrong alignment on FDataflowImageFromColorNode");
static_assert(sizeof(FDataflowImageFromColorNode) == 0x0002C0, "Wrong size on FDataflowImageFromColorNode");
static_assert(offsetof(FDataflowImageFromColorNode, FillColor) == 0x000280, "Member 'FDataflowImageFromColorNode::FillColor' has a wrong offset!");
static_assert(offsetof(FDataflowImageFromColorNode, Resolution) == 0x000290, "Member 'FDataflowImageFromColorNode::Resolution' has a wrong offset!");
static_assert(offsetof(FDataflowImageFromColorNode, Image) == 0x000298, "Member 'FDataflowImageFromColorNode::Image' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowImageSplitChannelsNode
// 0x00C8 (0x0348 - 0x0280)
struct FDataflowImageSplitChannelsNode final : public FDataflowNode
{
public:
	struct FDataflowImage                         Image;                                             // 0x0280(0x0028)(NativeAccessSpecifierPrivate)
	struct FDataflowImage                         Red;                                               // 0x02A8(0x0028)(NativeAccessSpecifierPrivate)
	struct FDataflowImage                         green;                                             // 0x02D0(0x0028)(NativeAccessSpecifierPrivate)
	struct FDataflowImage                         Blue;                                              // 0x02F8(0x0028)(NativeAccessSpecifierPrivate)
	struct FDataflowImage                         Alpha;                                             // 0x0320(0x0028)(NativeAccessSpecifierPrivate)
};
static_assert(alignof(FDataflowImageSplitChannelsNode) == 0x000001, "Wrong alignment on FDataflowImageSplitChannelsNode");
static_assert(sizeof(FDataflowImageSplitChannelsNode) == 0x000348, "Wrong size on FDataflowImageSplitChannelsNode");
static_assert(offsetof(FDataflowImageSplitChannelsNode, Image) == 0x000280, "Member 'FDataflowImageSplitChannelsNode::Image' has a wrong offset!");
static_assert(offsetof(FDataflowImageSplitChannelsNode, Red) == 0x0002A8, "Member 'FDataflowImageSplitChannelsNode::Red' has a wrong offset!");
static_assert(offsetof(FDataflowImageSplitChannelsNode, green) == 0x0002D0, "Member 'FDataflowImageSplitChannelsNode::green' has a wrong offset!");
static_assert(offsetof(FDataflowImageSplitChannelsNode, Blue) == 0x0002F8, "Member 'FDataflowImageSplitChannelsNode::Blue' has a wrong offset!");
static_assert(offsetof(FDataflowImageSplitChannelsNode, Alpha) == 0x000320, "Member 'FDataflowImageSplitChannelsNode::Alpha' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowImageCombineChannelsNode
// 0x00D0 (0x0350 - 0x0280)
struct FDataflowImageCombineChannelsNode final : public FDataflowNode
{
public:
	struct FDataflowImage                         Red;                                               // 0x0280(0x0028)(NativeAccessSpecifierPrivate)
	struct FDataflowImage                         green;                                             // 0x02A8(0x0028)(NativeAccessSpecifierPrivate)
	struct FDataflowImage                         Blue;                                              // 0x02D0(0x0028)(NativeAccessSpecifierPrivate)
	struct FDataflowImage                         Alpha;                                             // 0x02F8(0x0028)(NativeAccessSpecifierPrivate)
	struct FDataflowImage                         Image;                                             // 0x0320(0x0028)(NativeAccessSpecifierPrivate)
	EDataflowImageCombineResolutionOption         ResolutionOptions;                                 // 0x0348(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EDataflowImageResolution                      Resolution;                                        // 0x034C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FDataflowImageCombineChannelsNode) == 0x000004, "Wrong alignment on FDataflowImageCombineChannelsNode");
static_assert(sizeof(FDataflowImageCombineChannelsNode) == 0x000350, "Wrong size on FDataflowImageCombineChannelsNode");
static_assert(offsetof(FDataflowImageCombineChannelsNode, Red) == 0x000280, "Member 'FDataflowImageCombineChannelsNode::Red' has a wrong offset!");
static_assert(offsetof(FDataflowImageCombineChannelsNode, green) == 0x0002A8, "Member 'FDataflowImageCombineChannelsNode::green' has a wrong offset!");
static_assert(offsetof(FDataflowImageCombineChannelsNode, Blue) == 0x0002D0, "Member 'FDataflowImageCombineChannelsNode::Blue' has a wrong offset!");
static_assert(offsetof(FDataflowImageCombineChannelsNode, Alpha) == 0x0002F8, "Member 'FDataflowImageCombineChannelsNode::Alpha' has a wrong offset!");
static_assert(offsetof(FDataflowImageCombineChannelsNode, Image) == 0x000320, "Member 'FDataflowImageCombineChannelsNode::Image' has a wrong offset!");
static_assert(offsetof(FDataflowImageCombineChannelsNode, ResolutionOptions) == 0x000348, "Member 'FDataflowImageCombineChannelsNode::ResolutionOptions' has a wrong offset!");
static_assert(offsetof(FDataflowImageCombineChannelsNode, Resolution) == 0x00034C, "Member 'FDataflowImageCombineChannelsNode::Resolution' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowMathOneInputOperatorNode
// 0x0010 (0x0290 - 0x0280)
struct FDataflowMathOneInputOperatorNode : public FDataflowNode
{
public:
	struct FDataflowNumericTypes                  A;                                                 // 0x0280(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataflowNumericTypes                  result;                                            // 0x0288(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowMathOneInputOperatorNode) == 0x000001, "Wrong alignment on FDataflowMathOneInputOperatorNode");
static_assert(sizeof(FDataflowMathOneInputOperatorNode) == 0x000290, "Wrong size on FDataflowMathOneInputOperatorNode");
static_assert(offsetof(FDataflowMathOneInputOperatorNode, A) == 0x000280, "Member 'FDataflowMathOneInputOperatorNode::A' has a wrong offset!");
static_assert(offsetof(FDataflowMathOneInputOperatorNode, result) == 0x000288, "Member 'FDataflowMathOneInputOperatorNode::result' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowMathTwoInputsOperatorNode
// 0x0018 (0x0298 - 0x0280)
struct FDataflowMathTwoInputsOperatorNode : public FDataflowNode
{
public:
	struct FDataflowNumericTypes                  A;                                                 // 0x0280(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataflowNumericTypes                  B;                                                 // 0x0288(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FDataflowNumericTypes                  result;                                            // 0x0290(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowMathTwoInputsOperatorNode) == 0x000001, "Wrong alignment on FDataflowMathTwoInputsOperatorNode");
static_assert(sizeof(FDataflowMathTwoInputsOperatorNode) == 0x000298, "Wrong size on FDataflowMathTwoInputsOperatorNode");
static_assert(offsetof(FDataflowMathTwoInputsOperatorNode, A) == 0x000280, "Member 'FDataflowMathTwoInputsOperatorNode::A' has a wrong offset!");
static_assert(offsetof(FDataflowMathTwoInputsOperatorNode, B) == 0x000288, "Member 'FDataflowMathTwoInputsOperatorNode::B' has a wrong offset!");
static_assert(offsetof(FDataflowMathTwoInputsOperatorNode, result) == 0x000290, "Member 'FDataflowMathTwoInputsOperatorNode::result' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowMathAddNode
// 0x0000 (0x0298 - 0x0298)
struct FDataflowMathAddNode final : public FDataflowMathTwoInputsOperatorNode
{
};
static_assert(alignof(FDataflowMathAddNode) == 0x000001, "Wrong alignment on FDataflowMathAddNode");
static_assert(sizeof(FDataflowMathAddNode) == 0x000298, "Wrong size on FDataflowMathAddNode");

// ScriptStruct DataflowCore.DataflowMathSubtractNode
// 0x0000 (0x0298 - 0x0298)
struct FDataflowMathSubtractNode final : public FDataflowMathTwoInputsOperatorNode
{
};
static_assert(alignof(FDataflowMathSubtractNode) == 0x000001, "Wrong alignment on FDataflowMathSubtractNode");
static_assert(sizeof(FDataflowMathSubtractNode) == 0x000298, "Wrong size on FDataflowMathSubtractNode");

// ScriptStruct DataflowCore.DataflowMathMultiplyNode
// 0x0000 (0x0298 - 0x0298)
struct FDataflowMathMultiplyNode final : public FDataflowMathTwoInputsOperatorNode
{
};
static_assert(alignof(FDataflowMathMultiplyNode) == 0x000001, "Wrong alignment on FDataflowMathMultiplyNode");
static_assert(sizeof(FDataflowMathMultiplyNode) == 0x000298, "Wrong size on FDataflowMathMultiplyNode");

// ScriptStruct DataflowCore.DataflowMathDivideNode
// 0x0008 (0x02A0 - 0x0298)
struct FDataflowMathDivideNode final : public FDataflowMathTwoInputsOperatorNode
{
public:
	struct FDataflowNumericTypes                  Fallback;                                          // 0x0298(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowMathDivideNode) == 0x000001, "Wrong alignment on FDataflowMathDivideNode");
static_assert(sizeof(FDataflowMathDivideNode) == 0x0002A0, "Wrong size on FDataflowMathDivideNode");
static_assert(offsetof(FDataflowMathDivideNode, Fallback) == 0x000298, "Member 'FDataflowMathDivideNode::Fallback' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowMathMinimumNode
// 0x0000 (0x0298 - 0x0298)
struct FDataflowMathMinimumNode final : public FDataflowMathTwoInputsOperatorNode
{
};
static_assert(alignof(FDataflowMathMinimumNode) == 0x000001, "Wrong alignment on FDataflowMathMinimumNode");
static_assert(sizeof(FDataflowMathMinimumNode) == 0x000298, "Wrong size on FDataflowMathMinimumNode");

// ScriptStruct DataflowCore.DataflowMathMinimumNode_v2
// 0x0018 (0x0298 - 0x0280)
struct FDataflowMathMinimumNode_v2 final : public FDataflowNode
{
public:
	TArray<struct FDataflowNumericTypes>          Inputs;                                            // 0x0280(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FDataflowNumericTypes                  result;                                            // 0x0290(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FDataflowMathMinimumNode_v2) == 0x000008, "Wrong alignment on FDataflowMathMinimumNode_v2");
static_assert(sizeof(FDataflowMathMinimumNode_v2) == 0x000298, "Wrong size on FDataflowMathMinimumNode_v2");
static_assert(offsetof(FDataflowMathMinimumNode_v2, Inputs) == 0x000280, "Member 'FDataflowMathMinimumNode_v2::Inputs' has a wrong offset!");
static_assert(offsetof(FDataflowMathMinimumNode_v2, result) == 0x000290, "Member 'FDataflowMathMinimumNode_v2::result' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowMathMaximumNode
// 0x0000 (0x0298 - 0x0298)
struct FDataflowMathMaximumNode final : public FDataflowMathTwoInputsOperatorNode
{
};
static_assert(alignof(FDataflowMathMaximumNode) == 0x000001, "Wrong alignment on FDataflowMathMaximumNode");
static_assert(sizeof(FDataflowMathMaximumNode) == 0x000298, "Wrong size on FDataflowMathMaximumNode");

// ScriptStruct DataflowCore.DataflowMathMaximumNode_v2
// 0x0018 (0x0298 - 0x0280)
struct FDataflowMathMaximumNode_v2 final : public FDataflowNode
{
public:
	TArray<struct FDataflowNumericTypes>          Inputs;                                            // 0x0280(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FDataflowNumericTypes                  result;                                            // 0x0290(0x0008)(NoDestructor, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FDataflowMathMaximumNode_v2) == 0x000008, "Wrong alignment on FDataflowMathMaximumNode_v2");
static_assert(sizeof(FDataflowMathMaximumNode_v2) == 0x000298, "Wrong size on FDataflowMathMaximumNode_v2");
static_assert(offsetof(FDataflowMathMaximumNode_v2, Inputs) == 0x000280, "Member 'FDataflowMathMaximumNode_v2::Inputs' has a wrong offset!");
static_assert(offsetof(FDataflowMathMaximumNode_v2, result) == 0x000290, "Member 'FDataflowMathMaximumNode_v2::result' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowMathReciprocalNode
// 0x0008 (0x0298 - 0x0290)
struct FDataflowMathReciprocalNode final : public FDataflowMathOneInputOperatorNode
{
public:
	struct FDataflowNumericTypes                  Fallback;                                          // 0x0290(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowMathReciprocalNode) == 0x000001, "Wrong alignment on FDataflowMathReciprocalNode");
static_assert(sizeof(FDataflowMathReciprocalNode) == 0x000298, "Wrong size on FDataflowMathReciprocalNode");
static_assert(offsetof(FDataflowMathReciprocalNode, Fallback) == 0x000290, "Member 'FDataflowMathReciprocalNode::Fallback' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowMathSquareNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathSquareNode final : public FDataflowMathOneInputOperatorNode
{
};
static_assert(alignof(FDataflowMathSquareNode) == 0x000001, "Wrong alignment on FDataflowMathSquareNode");
static_assert(sizeof(FDataflowMathSquareNode) == 0x000290, "Wrong size on FDataflowMathSquareNode");

// ScriptStruct DataflowCore.DataflowMathCubeNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathCubeNode final : public FDataflowMathOneInputOperatorNode
{
};
static_assert(alignof(FDataflowMathCubeNode) == 0x000001, "Wrong alignment on FDataflowMathCubeNode");
static_assert(sizeof(FDataflowMathCubeNode) == 0x000290, "Wrong size on FDataflowMathCubeNode");

// ScriptStruct DataflowCore.DataflowMathSquareRootNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathSquareRootNode final : public FDataflowMathOneInputOperatorNode
{
};
static_assert(alignof(FDataflowMathSquareRootNode) == 0x000001, "Wrong alignment on FDataflowMathSquareRootNode");
static_assert(sizeof(FDataflowMathSquareRootNode) == 0x000290, "Wrong size on FDataflowMathSquareRootNode");

// ScriptStruct DataflowCore.DataflowMathInverseSquareRootNode
// 0x0008 (0x0298 - 0x0290)
struct FDataflowMathInverseSquareRootNode final : public FDataflowMathOneInputOperatorNode
{
public:
	struct FDataflowNumericTypes                  Fallback;                                          // 0x0290(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowMathInverseSquareRootNode) == 0x000001, "Wrong alignment on FDataflowMathInverseSquareRootNode");
static_assert(sizeof(FDataflowMathInverseSquareRootNode) == 0x000298, "Wrong size on FDataflowMathInverseSquareRootNode");
static_assert(offsetof(FDataflowMathInverseSquareRootNode, Fallback) == 0x000290, "Member 'FDataflowMathInverseSquareRootNode::Fallback' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowMathNegateNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathNegateNode final : public FDataflowMathOneInputOperatorNode
{
};
static_assert(alignof(FDataflowMathNegateNode) == 0x000001, "Wrong alignment on FDataflowMathNegateNode");
static_assert(sizeof(FDataflowMathNegateNode) == 0x000290, "Wrong size on FDataflowMathNegateNode");

// ScriptStruct DataflowCore.DataflowMathAbsNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathAbsNode final : public FDataflowMathOneInputOperatorNode
{
};
static_assert(alignof(FDataflowMathAbsNode) == 0x000001, "Wrong alignment on FDataflowMathAbsNode");
static_assert(sizeof(FDataflowMathAbsNode) == 0x000290, "Wrong size on FDataflowMathAbsNode");

// ScriptStruct DataflowCore.DataflowMathFloorNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathFloorNode final : public FDataflowMathOneInputOperatorNode
{
};
static_assert(alignof(FDataflowMathFloorNode) == 0x000001, "Wrong alignment on FDataflowMathFloorNode");
static_assert(sizeof(FDataflowMathFloorNode) == 0x000290, "Wrong size on FDataflowMathFloorNode");

// ScriptStruct DataflowCore.DataflowMathCeilNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathCeilNode final : public FDataflowMathOneInputOperatorNode
{
};
static_assert(alignof(FDataflowMathCeilNode) == 0x000001, "Wrong alignment on FDataflowMathCeilNode");
static_assert(sizeof(FDataflowMathCeilNode) == 0x000290, "Wrong size on FDataflowMathCeilNode");

// ScriptStruct DataflowCore.DataflowMathRoundNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathRoundNode final : public FDataflowMathOneInputOperatorNode
{
};
static_assert(alignof(FDataflowMathRoundNode) == 0x000001, "Wrong alignment on FDataflowMathRoundNode");
static_assert(sizeof(FDataflowMathRoundNode) == 0x000290, "Wrong size on FDataflowMathRoundNode");

// ScriptStruct DataflowCore.DataflowMathTruncNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathTruncNode final : public FDataflowMathOneInputOperatorNode
{
};
static_assert(alignof(FDataflowMathTruncNode) == 0x000001, "Wrong alignment on FDataflowMathTruncNode");
static_assert(sizeof(FDataflowMathTruncNode) == 0x000290, "Wrong size on FDataflowMathTruncNode");

// ScriptStruct DataflowCore.DataflowMathFracNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathFracNode final : public FDataflowMathOneInputOperatorNode
{
};
static_assert(alignof(FDataflowMathFracNode) == 0x000001, "Wrong alignment on FDataflowMathFracNode");
static_assert(sizeof(FDataflowMathFracNode) == 0x000290, "Wrong size on FDataflowMathFracNode");

// ScriptStruct DataflowCore.DataflowMathPowNode
// 0x0000 (0x0298 - 0x0298)
struct FDataflowMathPowNode final : public FDataflowMathTwoInputsOperatorNode
{
};
static_assert(alignof(FDataflowMathPowNode) == 0x000001, "Wrong alignment on FDataflowMathPowNode");
static_assert(sizeof(FDataflowMathPowNode) == 0x000298, "Wrong size on FDataflowMathPowNode");

// ScriptStruct DataflowCore.DataflowMathLogXNode
// 0x0008 (0x0298 - 0x0290)
struct FDataflowMathLogXNode final : public FDataflowMathOneInputOperatorNode
{
public:
	struct FDataflowNumericTypes                  base;                                              // 0x0290(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowMathLogXNode) == 0x000001, "Wrong alignment on FDataflowMathLogXNode");
static_assert(sizeof(FDataflowMathLogXNode) == 0x000298, "Wrong size on FDataflowMathLogXNode");
static_assert(offsetof(FDataflowMathLogXNode, base) == 0x000290, "Member 'FDataflowMathLogXNode::base' has a wrong offset!");

// ScriptStruct DataflowCore.DataflowMathLogNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathLogNode final : public FDataflowMathOneInputOperatorNode
{
};
static_assert(alignof(FDataflowMathLogNode) == 0x000001, "Wrong alignment on FDataflowMathLogNode");
static_assert(sizeof(FDataflowMathLogNode) == 0x000290, "Wrong size on FDataflowMathLogNode");

// ScriptStruct DataflowCore.DataflowMathExpNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathExpNode final : public FDataflowMathOneInputOperatorNode
{
};
static_assert(alignof(FDataflowMathExpNode) == 0x000001, "Wrong alignment on FDataflowMathExpNode");
static_assert(sizeof(FDataflowMathExpNode) == 0x000290, "Wrong size on FDataflowMathExpNode");

// ScriptStruct DataflowCore.DataflowMathSignNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathSignNode final : public FDataflowMathOneInputOperatorNode
{
};
static_assert(alignof(FDataflowMathSignNode) == 0x000001, "Wrong alignment on FDataflowMathSignNode");
static_assert(sizeof(FDataflowMathSignNode) == 0x000290, "Wrong size on FDataflowMathSignNode");

// ScriptStruct DataflowCore.DataflowMathOneMinusNode
// 0x0000 (0x0290 - 0x0290)
struct FDataflowMathOneMinusNode final : public FDataflowMathOneInputOperatorNode
{
};
static_assert(alignof(FDataflowMathOneMinusNode) == 0x000001, "Wrong alignment on FDataflowMathOneMinusNode");
