#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataflowNodes

#include "Basic.hpp"

#include "DataflowCore_structs.hpp"
#include "DataflowEnginePlugin_structs.hpp"
#include "Chaos_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum DataflowNodes.EDataflowWeightMapOverrideType
// NumValues: 0x0004
enum class EDataflowWeightMapOverrideType : uint8
{
	ReplaceAll                               = 0,
	AddDifference                            = 1,
	ReplaceChanged                           = 2,
	EDataflowWeightMapOverrideType_MAX       = 3,
};

// ScriptStruct DataflowNodes.DataflowFunctionProperty
// 0x0010 (0x0010 - 0x0000)
struct FDataflowFunctionProperty final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowFunctionProperty) == 0x000001, "Wrong alignment on FDataflowFunctionProperty");
static_assert(sizeof(FDataflowFunctionProperty) == 0x000010, "Wrong size on FDataflowFunctionProperty");

// ScriptStruct DataflowNodes.DataflowPrimitiveNode
// 0x0000 (0x0280 - 0x0280)
struct FDataflowPrimitiveNode : public FDataflowNode
{
};
static_assert(alignof(FDataflowPrimitiveNode) == 0x000001, "Wrong alignment on FDataflowPrimitiveNode");
static_assert(sizeof(FDataflowPrimitiveNode) == 0x000280, "Wrong size on FDataflowPrimitiveNode");

// ScriptStruct DataflowNodes.ScalarVertexPropertyGroup
// 0x0008 (0x0008 - 0x0000)
struct FScalarVertexPropertyGroup final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FScalarVertexPropertyGroup) == 0x000004, "Wrong alignment on FScalarVertexPropertyGroup");
static_assert(sizeof(FScalarVertexPropertyGroup) == 0x000008, "Wrong size on FScalarVertexPropertyGroup");
static_assert(offsetof(FScalarVertexPropertyGroup, Name) == 0x000000, "Member 'FScalarVertexPropertyGroup::Name' has a wrong offset!");

// ScriptStruct DataflowNodes.DataflowCollectionAddScalarVertexPropertyNode
// 0x0100 (0x0380 - 0x0280)
struct FDataflowCollectionAddScalarVertexPropertyNode final : public FDataflowNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x0280(0x00B0)(NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0330(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCollectionAttributeKey                AttributeKey;                                      // 0x0340(0x0020)(NativeAccessSpecifierPublic)
	TArray<float>                                 VertexWeights;                                     // 0x0360(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FScalarVertexPropertyGroup             TargetGroup;                                       // 0x0370(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	EDataflowWeightMapOverrideType                OverrideType;                                      // 0x0378(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowCollectionAddScalarVertexPropertyNode) == 0x000008, "Wrong alignment on FDataflowCollectionAddScalarVertexPropertyNode");
static_assert(sizeof(FDataflowCollectionAddScalarVertexPropertyNode) == 0x000380, "Wrong size on FDataflowCollectionAddScalarVertexPropertyNode");
static_assert(offsetof(FDataflowCollectionAddScalarVertexPropertyNode, Collection) == 0x000280, "Member 'FDataflowCollectionAddScalarVertexPropertyNode::Collection' has a wrong offset!");
static_assert(offsetof(FDataflowCollectionAddScalarVertexPropertyNode, Name) == 0x000330, "Member 'FDataflowCollectionAddScalarVertexPropertyNode::Name' has a wrong offset!");
static_assert(offsetof(FDataflowCollectionAddScalarVertexPropertyNode, AttributeKey) == 0x000340, "Member 'FDataflowCollectionAddScalarVertexPropertyNode::AttributeKey' has a wrong offset!");
static_assert(offsetof(FDataflowCollectionAddScalarVertexPropertyNode, VertexWeights) == 0x000360, "Member 'FDataflowCollectionAddScalarVertexPropertyNode::VertexWeights' has a wrong offset!");
static_assert(offsetof(FDataflowCollectionAddScalarVertexPropertyNode, TargetGroup) == 0x000370, "Member 'FDataflowCollectionAddScalarVertexPropertyNode::TargetGroup' has a wrong offset!");
static_assert(offsetof(FDataflowCollectionAddScalarVertexPropertyNode, OverrideType) == 0x000378, "Member 'FDataflowCollectionAddScalarVertexPropertyNode::OverrideType' has a wrong offset!");

// ScriptStruct DataflowNodes.MakeAttributeKeyDataflowNode
// 0x0040 (0x02C0 - 0x0280)
struct FMakeAttributeKeyDataflowNode final : public FDataflowNode
{
public:
	class FString                                 GroupIn;                                           // 0x0280(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AttributeIn;                                       // 0x0290(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCollectionAttributeKey                AttributeKeyOut;                                   // 0x02A0(0x0020)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FMakeAttributeKeyDataflowNode) == 0x000008, "Wrong alignment on FMakeAttributeKeyDataflowNode");
static_assert(sizeof(FMakeAttributeKeyDataflowNode) == 0x0002C0, "Wrong size on FMakeAttributeKeyDataflowNode");
static_assert(offsetof(FMakeAttributeKeyDataflowNode, GroupIn) == 0x000280, "Member 'FMakeAttributeKeyDataflowNode::GroupIn' has a wrong offset!");
static_assert(offsetof(FMakeAttributeKeyDataflowNode, AttributeIn) == 0x000290, "Member 'FMakeAttributeKeyDataflowNode::AttributeIn' has a wrong offset!");
static_assert(offsetof(FMakeAttributeKeyDataflowNode, AttributeKeyOut) == 0x0002A0, "Member 'FMakeAttributeKeyDataflowNode::AttributeKeyOut' has a wrong offset!");

// ScriptStruct DataflowNodes.BreakAttributeKeyDataflowNode
// 0x0040 (0x02C0 - 0x0280)
struct FBreakAttributeKeyDataflowNode final : public FDataflowNode
{
public:
	struct FCollectionAttributeKey                AttributeKeyIn;                                    // 0x0280(0x0020)(NativeAccessSpecifierPublic)
	class FString                                 AttributeOut;                                      // 0x02A0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GroupOut;                                          // 0x02B0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBreakAttributeKeyDataflowNode) == 0x000008, "Wrong alignment on FBreakAttributeKeyDataflowNode");
static_assert(sizeof(FBreakAttributeKeyDataflowNode) == 0x0002C0, "Wrong size on FBreakAttributeKeyDataflowNode");
static_assert(offsetof(FBreakAttributeKeyDataflowNode, AttributeKeyIn) == 0x000280, "Member 'FBreakAttributeKeyDataflowNode::AttributeKeyIn' has a wrong offset!");
static_assert(offsetof(FBreakAttributeKeyDataflowNode, AttributeOut) == 0x0002A0, "Member 'FBreakAttributeKeyDataflowNode::AttributeOut' has a wrong offset!");
static_assert(offsetof(FBreakAttributeKeyDataflowNode, GroupOut) == 0x0002B0, "Member 'FBreakAttributeKeyDataflowNode::GroupOut' has a wrong offset!");

// ScriptStruct DataflowNodes.DataflowSkinWeightData
// 0x0020 (0x0020 - 0x0000)
struct FDataflowSkinWeightData final
{
public:
	TArray<float>                                 BoneWeights;                                       // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 BoneIndices;                                       // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDataflowSkinWeightData) == 0x000008, "Wrong alignment on FDataflowSkinWeightData");
static_assert(sizeof(FDataflowSkinWeightData) == 0x000020, "Wrong size on FDataflowSkinWeightData");
static_assert(offsetof(FDataflowSkinWeightData, BoneWeights) == 0x000000, "Member 'FDataflowSkinWeightData::BoneWeights' has a wrong offset!");
static_assert(offsetof(FDataflowSkinWeightData, BoneIndices) == 0x000010, "Member 'FDataflowSkinWeightData::BoneIndices' has a wrong offset!");

// ScriptStruct DataflowNodes.DataflowCollectionEditSkinWeightsNode
// 0x0168 (0x03E8 - 0x0280)
struct FDataflowCollectionEditSkinWeightsNode final : public FDataflowPrimitiveNode
{
public:
	struct FManagedArrayCollection                Collection;                                        // 0x0280(0x00B0)(NativeAccessSpecifierPublic)
	class FString                                 BoneIndicesName;                                   // 0x0330(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BoneWeightsName;                                   // 0x0340(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalarVertexPropertyGroup             VertexGroup;                                       // 0x0350(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCollectionAttributeKey                BoneIndicesKey;                                    // 0x0358(0x0020)(NativeAccessSpecifierPublic)
	struct FCollectionAttributeKey                BoneWeightsKey;                                    // 0x0378(0x0020)(NativeAccessSpecifierPublic)
	class USkeleton*                              ObjectSkeleton;                                    // 0x0398(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCompressSkinWeights;                              // 0x03A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDataflowSkinWeightData>        SkinWeights;                                       // 0x03A8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B8[0x18];                                     // 0x03B8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMesh*>                  SkeletalMeshes;                                    // 0x03D0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3E0[0x8];                                      // 0x03E0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataflowCollectionEditSkinWeightsNode) == 0x000008, "Wrong alignment on FDataflowCollectionEditSkinWeightsNode");
static_assert(sizeof(FDataflowCollectionEditSkinWeightsNode) == 0x0003E8, "Wrong size on FDataflowCollectionEditSkinWeightsNode");
static_assert(offsetof(FDataflowCollectionEditSkinWeightsNode, Collection) == 0x000280, "Member 'FDataflowCollectionEditSkinWeightsNode::Collection' has a wrong offset!");
static_assert(offsetof(FDataflowCollectionEditSkinWeightsNode, BoneIndicesName) == 0x000330, "Member 'FDataflowCollectionEditSkinWeightsNode::BoneIndicesName' has a wrong offset!");
static_assert(offsetof(FDataflowCollectionEditSkinWeightsNode, BoneWeightsName) == 0x000340, "Member 'FDataflowCollectionEditSkinWeightsNode::BoneWeightsName' has a wrong offset!");
static_assert(offsetof(FDataflowCollectionEditSkinWeightsNode, VertexGroup) == 0x000350, "Member 'FDataflowCollectionEditSkinWeightsNode::VertexGroup' has a wrong offset!");
static_assert(offsetof(FDataflowCollectionEditSkinWeightsNode, BoneIndicesKey) == 0x000358, "Member 'FDataflowCollectionEditSkinWeightsNode::BoneIndicesKey' has a wrong offset!");
static_assert(offsetof(FDataflowCollectionEditSkinWeightsNode, BoneWeightsKey) == 0x000378, "Member 'FDataflowCollectionEditSkinWeightsNode::BoneWeightsKey' has a wrong offset!");
static_assert(offsetof(FDataflowCollectionEditSkinWeightsNode, ObjectSkeleton) == 0x000398, "Member 'FDataflowCollectionEditSkinWeightsNode::ObjectSkeleton' has a wrong offset!");
static_assert(offsetof(FDataflowCollectionEditSkinWeightsNode, bCompressSkinWeights) == 0x0003A0, "Member 'FDataflowCollectionEditSkinWeightsNode::bCompressSkinWeights' has a wrong offset!");
static_assert(offsetof(FDataflowCollectionEditSkinWeightsNode, SkinWeights) == 0x0003A8, "Member 'FDataflowCollectionEditSkinWeightsNode::SkinWeights' has a wrong offset!");
static_assert(offsetof(FDataflowCollectionEditSkinWeightsNode, SkeletalMeshes) == 0x0003D0, "Member 'FDataflowCollectionEditSkinWeightsNode::SkeletalMeshes' has a wrong offset!");

// ScriptStruct DataflowNodes.FloatOverrideDataflowNode
// 0x0018 (0x0298 - 0x0280)
struct FFloatOverrideDataflowNode final : public FDataflowNode
{
public:
	class FName                                   PropertyName;                                      // 0x0280(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   KeyName;                                           // 0x0288(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ValueOut;                                          // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFloatOverrideDataflowNode) == 0x000004, "Wrong alignment on FFloatOverrideDataflowNode");
static_assert(sizeof(FFloatOverrideDataflowNode) == 0x000298, "Wrong size on FFloatOverrideDataflowNode");
static_assert(offsetof(FFloatOverrideDataflowNode, PropertyName) == 0x000280, "Member 'FFloatOverrideDataflowNode::PropertyName' has a wrong offset!");
static_assert(offsetof(FFloatOverrideDataflowNode, KeyName) == 0x000288, "Member 'FFloatOverrideDataflowNode::KeyName' has a wrong offset!");
static_assert(offsetof(FFloatOverrideDataflowNode, ValueOut) == 0x000290, "Member 'FFloatOverrideDataflowNode::ValueOut' has a wrong offset!");

// ScriptStruct DataflowNodes.SelectionSetDataflowNode
// 0x0020 (0x02A0 - 0x0280)
struct FSelectionSetDataflowNode final : public FDataflowNode
{
public:
	class FString                                 Indices;                                           // 0x0280(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 IndicesOut;                                        // 0x0290(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSelectionSetDataflowNode) == 0x000008, "Wrong alignment on FSelectionSetDataflowNode");
static_assert(sizeof(FSelectionSetDataflowNode) == 0x0002A0, "Wrong size on FSelectionSetDataflowNode");
static_assert(offsetof(FSelectionSetDataflowNode, Indices) == 0x000280, "Member 'FSelectionSetDataflowNode::Indices' has a wrong offset!");
static_assert(offsetof(FSelectionSetDataflowNode, IndicesOut) == 0x000290, "Member 'FSelectionSetDataflowNode::IndicesOut' has a wrong offset!");

// ScriptStruct DataflowNodes.GetSkeletalMeshDataflowNode
// 0x0010 (0x0290 - 0x0280)
struct FGetSkeletalMeshDataflowNode final : public FDataflowNode
{
public:
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0280(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x0288(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGetSkeletalMeshDataflowNode) == 0x000008, "Wrong alignment on FGetSkeletalMeshDataflowNode");
static_assert(sizeof(FGetSkeletalMeshDataflowNode) == 0x000290, "Wrong size on FGetSkeletalMeshDataflowNode");
static_assert(offsetof(FGetSkeletalMeshDataflowNode, SkeletalMesh) == 0x000280, "Member 'FGetSkeletalMeshDataflowNode::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(FGetSkeletalMeshDataflowNode, PropertyName) == 0x000288, "Member 'FGetSkeletalMeshDataflowNode::PropertyName' has a wrong offset!");

// ScriptStruct DataflowNodes.GetSkeletonDataflowNode
// 0x0010 (0x0290 - 0x0280)
struct FGetSkeletonDataflowNode final : public FDataflowNode
{
public:
	class USkeleton*                              Skeleton;                                          // 0x0280(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x0288(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGetSkeletonDataflowNode) == 0x000008, "Wrong alignment on FGetSkeletonDataflowNode");
static_assert(sizeof(FGetSkeletonDataflowNode) == 0x000290, "Wrong size on FGetSkeletonDataflowNode");
static_assert(offsetof(FGetSkeletonDataflowNode, Skeleton) == 0x000280, "Member 'FGetSkeletonDataflowNode::Skeleton' has a wrong offset!");
static_assert(offsetof(FGetSkeletonDataflowNode, PropertyName) == 0x000288, "Member 'FGetSkeletonDataflowNode::PropertyName' has a wrong offset!");

// ScriptStruct DataflowNodes.SkeletalMeshBoneDataflowNode
// 0x0020 (0x02A0 - 0x0280)
struct FSkeletalMeshBoneDataflowNode final : public FDataflowNode
{
public:
	class FName                                   BoneName;                                          // 0x0280(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0288(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BoneIndexOut;                                      // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x0294(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSkeletalMeshBoneDataflowNode) == 0x000008, "Wrong alignment on FSkeletalMeshBoneDataflowNode");
static_assert(sizeof(FSkeletalMeshBoneDataflowNode) == 0x0002A0, "Wrong size on FSkeletalMeshBoneDataflowNode");
static_assert(offsetof(FSkeletalMeshBoneDataflowNode, BoneName) == 0x000280, "Member 'FSkeletalMeshBoneDataflowNode::BoneName' has a wrong offset!");
static_assert(offsetof(FSkeletalMeshBoneDataflowNode, SkeletalMesh) == 0x000288, "Member 'FSkeletalMeshBoneDataflowNode::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(FSkeletalMeshBoneDataflowNode, BoneIndexOut) == 0x000290, "Member 'FSkeletalMeshBoneDataflowNode::BoneIndexOut' has a wrong offset!");
static_assert(offsetof(FSkeletalMeshBoneDataflowNode, PropertyName) == 0x000294, "Member 'FSkeletalMeshBoneDataflowNode::PropertyName' has a wrong offset!");

// ScriptStruct DataflowNodes.SkeletalMeshReferenceTransformDataflowNode
// 0x0070 (0x02F0 - 0x0280)
struct FSkeletalMeshReferenceTransformDataflowNode final : public FDataflowNode
{
public:
	class USkeletalMesh*                          SkeletalMeshIn;                                    // 0x0280(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BoneIndexIn;                                       // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TransformOut;                                      // 0x0290(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSkeletalMeshReferenceTransformDataflowNode) == 0x000008, "Wrong alignment on FSkeletalMeshReferenceTransformDataflowNode");
static_assert(sizeof(FSkeletalMeshReferenceTransformDataflowNode) == 0x0002F0, "Wrong size on FSkeletalMeshReferenceTransformDataflowNode");
static_assert(offsetof(FSkeletalMeshReferenceTransformDataflowNode, SkeletalMeshIn) == 0x000280, "Member 'FSkeletalMeshReferenceTransformDataflowNode::SkeletalMeshIn' has a wrong offset!");
static_assert(offsetof(FSkeletalMeshReferenceTransformDataflowNode, BoneIndexIn) == 0x000288, "Member 'FSkeletalMeshReferenceTransformDataflowNode::BoneIndexIn' has a wrong offset!");
static_assert(offsetof(FSkeletalMeshReferenceTransformDataflowNode, TransformOut) == 0x000290, "Member 'FSkeletalMeshReferenceTransformDataflowNode::TransformOut' has a wrong offset!");

// ScriptStruct DataflowNodes.GetPhysicsAssetFromSkeletalMeshDataflowNode
// 0x0010 (0x0290 - 0x0280)
struct FGetPhysicsAssetFromSkeletalMeshDataflowNode final : public FDataflowNode
{
public:
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0280(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicsAsset*                          PhysicsAsset;                                      // 0x0288(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGetPhysicsAssetFromSkeletalMeshDataflowNode) == 0x000008, "Wrong alignment on FGetPhysicsAssetFromSkeletalMeshDataflowNode");
static_assert(sizeof(FGetPhysicsAssetFromSkeletalMeshDataflowNode) == 0x000290, "Wrong size on FGetPhysicsAssetFromSkeletalMeshDataflowNode");
static_assert(offsetof(FGetPhysicsAssetFromSkeletalMeshDataflowNode, SkeletalMesh) == 0x000280, "Member 'FGetPhysicsAssetFromSkeletalMeshDataflowNode::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(FGetPhysicsAssetFromSkeletalMeshDataflowNode, PhysicsAsset) == 0x000288, "Member 'FGetPhysicsAssetFromSkeletalMeshDataflowNode::PhysicsAsset' has a wrong offset!");

// ScriptStruct DataflowNodes.GetStaticMeshDataflowNode
// 0x0010 (0x0290 - 0x0280)
struct FGetStaticMeshDataflowNode final : public FDataflowNode
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0280(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x0288(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGetStaticMeshDataflowNode) == 0x000008, "Wrong alignment on FGetStaticMeshDataflowNode");
static_assert(sizeof(FGetStaticMeshDataflowNode) == 0x000290, "Wrong size on FGetStaticMeshDataflowNode");
static_assert(offsetof(FGetStaticMeshDataflowNode, StaticMesh) == 0x000280, "Member 'FGetStaticMeshDataflowNode::StaticMesh' has a wrong offset!");
static_assert(offsetof(FGetStaticMeshDataflowNode, PropertyName) == 0x000288, "Member 'FGetStaticMeshDataflowNode::PropertyName' has a wrong offset!");

}

