#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DialogInteractEntryWidget_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DialogInteractEntryWidget_BP.DialogInteractEntryWidget_BP_C
// 0x159DE790 (0x159DF000 - 0x0870)
class alignas(0x159DF000) UDialogInteractEntryWidget_BP_C final : public UHTInteractEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0870(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScaleBox*                              ScaleBox_0;                                        // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgCheck_Naviable;                                 // 0x0880(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Select;                                      // 0x0888(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Round;                                       // 0x0890(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Click_Fx;                                    // 0x0898(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Click;                                       // 0x08A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_01;                                          // 0x08A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         GamepadIcons;                                      // 0x08B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnPressedAnim;                                     // 0x08B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnRreleasedAnim;                                   // 0x08C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Shortcut_Key_Widget;                               // 0x08C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Language;                                          // 0x08D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__DialogInteractEntryWidget_BP_InteractButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__DialogInteractEntryWidget_BP_InteractButton_K2Node_ComponentBoundEvent_0_OnUIButtonReleasedDelegate__DelegateSignature(class UHTUI_Button* Button);
	void BP_InitState(bool bNeedSelected);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Construct();
	void ExecuteUbergraph_DialogInteractEntryWidget_BP(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void SequenceEvent();
	void SequenceEvent_0();
	void SequenceEvent__ENTRYPOINTDialogInteractEntryWidget_BP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DialogInteractEntryWidget_BP_C">();
	}
	static class UDialogInteractEntryWidget_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDialogInteractEntryWidget_BP_C>();
	}
};
static_assert(alignof(UDialogInteractEntryWidget_BP_C) == 0x159DF000, "Wrong alignment on UDialogInteractEntryWidget_BP_C");
static_assert(sizeof(UDialogInteractEntryWidget_BP_C) == 0x159DF000, "Wrong size on UDialogInteractEntryWidget_BP_C");
static_assert(offsetof(UDialogInteractEntryWidget_BP_C, UberGraphFrame) == 0x000870, "Member 'UDialogInteractEntryWidget_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDialogInteractEntryWidget_BP_C, ScaleBox_0) == 0x000878, "Member 'UDialogInteractEntryWidget_BP_C::ScaleBox_0' has a wrong offset!");
static_assert(offsetof(UDialogInteractEntryWidget_BP_C, ImgCheck_Naviable) == 0x000880, "Member 'UDialogInteractEntryWidget_BP_C::ImgCheck_Naviable' has a wrong offset!");
static_assert(offsetof(UDialogInteractEntryWidget_BP_C, Image_Select) == 0x000888, "Member 'UDialogInteractEntryWidget_BP_C::Image_Select' has a wrong offset!");
static_assert(offsetof(UDialogInteractEntryWidget_BP_C, Image_Round) == 0x000890, "Member 'UDialogInteractEntryWidget_BP_C::Image_Round' has a wrong offset!");
static_assert(offsetof(UDialogInteractEntryWidget_BP_C, Image_Click_Fx) == 0x000898, "Member 'UDialogInteractEntryWidget_BP_C::Image_Click_Fx' has a wrong offset!");
static_assert(offsetof(UDialogInteractEntryWidget_BP_C, Image_Click) == 0x0008A0, "Member 'UDialogInteractEntryWidget_BP_C::Image_Click' has a wrong offset!");
static_assert(offsetof(UDialogInteractEntryWidget_BP_C, Image_01) == 0x0008A8, "Member 'UDialogInteractEntryWidget_BP_C::Image_01' has a wrong offset!");
static_assert(offsetof(UDialogInteractEntryWidget_BP_C, GamepadIcons) == 0x0008B0, "Member 'UDialogInteractEntryWidget_BP_C::GamepadIcons' has a wrong offset!");
static_assert(offsetof(UDialogInteractEntryWidget_BP_C, OnPressedAnim) == 0x0008B8, "Member 'UDialogInteractEntryWidget_BP_C::OnPressedAnim' has a wrong offset!");
static_assert(offsetof(UDialogInteractEntryWidget_BP_C, OnRreleasedAnim) == 0x0008C0, "Member 'UDialogInteractEntryWidget_BP_C::OnRreleasedAnim' has a wrong offset!");
static_assert(offsetof(UDialogInteractEntryWidget_BP_C, Shortcut_Key_Widget) == 0x0008C8, "Member 'UDialogInteractEntryWidget_BP_C::Shortcut_Key_Widget' has a wrong offset!");
static_assert(offsetof(UDialogInteractEntryWidget_BP_C, Language) == 0x0008D0, "Member 'UDialogInteractEntryWidget_BP_C::Language' has a wrong offset!");

}

