#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DlgSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "DlgSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class DlgSystem.DlgObject
// 0x0000 (0x0028 - 0x0028)
class UDlgObject : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DlgObject">();
	}
	static class UDlgObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgObject>();
	}
};
static_assert(alignof(UDlgObject) == 0x000008, "Wrong alignment on UDlgObject");
static_assert(sizeof(UDlgObject) == 0x000028, "Wrong size on UDlgObject");

// Class DlgSystem.DlgConditionCustom
// 0x0000 (0x0028 - 0x0028)
class UDlgConditionCustom : public UDlgObject
{
public:
	class FString GetEditorDisplayString(class UDlgDialogue* OwnerDialogue, class FName ParticipantName);
	bool IsConditionMet(const class UDlgContext* Context, const class UObject* Participant);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DlgConditionCustom">();
	}
	static class UDlgConditionCustom* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgConditionCustom>();
	}
};
static_assert(alignof(UDlgConditionCustom) == 0x000008, "Wrong alignment on UDlgConditionCustom");
static_assert(sizeof(UDlgConditionCustom) == 0x000028, "Wrong size on UDlgConditionCustom");

// Class DlgSystem.DlgConditionCustomHideCategories
// 0x0000 (0x0028 - 0x0028)
class UDlgConditionCustomHideCategories final : public UDlgConditionCustom
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DlgConditionCustomHideCategories">();
	}
	static class UDlgConditionCustomHideCategories* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgConditionCustomHideCategories>();
	}
};
static_assert(alignof(UDlgConditionCustomHideCategories) == 0x000008, "Wrong alignment on UDlgConditionCustomHideCategories");
static_assert(sizeof(UDlgConditionCustomHideCategories) == 0x000028, "Wrong size on UDlgConditionCustomHideCategories");

// Class DlgSystem.DlgContext
// 0x0188 (0x01B0 - 0x0028)
class UDlgContext final : public UDlgObject
{
public:
	class UDlgDialogue*                           Dialogue;                                          // 0x0028(0x0008)(Net, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UObject*>                        SerializedParticipants;                            // 0x0030(0x0010)(Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, class UObject*>             Participants;                                      // 0x0040(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_90[0x120];                                     // 0x0090(0x0120)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool ChooseChild(int32 OptionIndex);
	bool ChooseOption(int32 OptionIndex);
	bool ChooseOptionFromAll(int32 Index_0);
	bool ChooseSpeechSequenceOptionFromReplicated(int32 OptionIndex);
	class UObject* GetParticipantFromName(const struct FDlgParticipantName& Participant);
	void OnRep_SerializedParticipants();
	bool ReevaluateChildren();
	bool ReevaluateOptions();

	class UDlgNodeData* GetActiveNodeData() const;
	class UObject* GetActiveNodeGenericData() const;
	struct FGuid GetActiveNodeGUID() const;
	int32 GetActiveNodeIndex() const;
	bool GetActiveNodeIsSelfTalk() const;
	class UObject* GetActiveNodeParticipant(bool bLog) const;
	class FText GetActiveNodeParticipantDisplayName() const;
	class UTexture2D* GetActiveNodeParticipantIcon() const;
	class FName GetActiveNodeParticipantName() const;
	float GetActiveNodeShowButtonWaitTime() const;
	int32 GetActiveNodeSkipOptionIndex() const;
	class FName GetActiveNodeSpeakerState() const;
	const class FText GetActiveNodeText() const;
	class UDialogueWave* GetActiveNodeVoiceDialogueWave() const;
	class USoundBase* GetActiveNodeVoiceSoundBase() const;
	class USoundWave* GetActiveNodeVoiceSoundWave() const;
	const TArray<struct FDlgEdgeData> GetAllOptionsArray() const;
	int32 GetAllOptionsNum() const;
	struct FDlgAutoPlayConfig GetAutoPlayConfig() const;
	int32 GetAvailableIndex(int32 OptionIndex) const;
	bool GetBlackFade() const;
	class FString GetContextString() const;
	class UDlgDialogue* GetDialogue() const;
	struct FGuid GetDialogueGUID() const;
	class FName GetDialogueName() const;
	class FString GetDialoguePathName() const;
	float GetFaceToTargetDelay() const;
	float GetFadeStayTime() const;
	class UDlgNode* GetMutableActiveNode() const;
	class UDlgNode_SpeechSequence* GetMutableActiveNodeAsSpeechSequence() const;
	class UDlgNode* GetMutableNodeFromGUID(const struct FGuid& NodeGuid) const;
	class UDlgNode* GetMutableNodeFromIndex(int32 NodeIndex) const;
	class UObject* GetMutableParticipant(class FName ParticipantName) const;
	class FText GetNickname() const;
	struct FGuid GetNodeGUIDForIndex(int32 NodeIndex) const;
	int32 GetNodeIndexForGUID(const struct FGuid& NodeGuid) const;
	const struct FDlgEdge GetOption(int32 OptionIndex) const;
	TSoftObjectPtr<class UTexture2D> GetOptionalButtonBottom(int32 OptionIndex) const;
	TSoftObjectPtr<class UTexture2D> GetOptionalButtonIcon(int32 OptionIndex) const;
	struct FWidgetTransform GetOptionButtonRenderTransform(int32 OptionIndex) const;
	const TArray<struct FDlgCondition> GetOptionEnterConditions(int32 OptionIndex) const;
	const struct FDlgEdgeData GetOptionFromAll(int32 Index_0) const;
	const TArray<struct FDlgEdge> GetOptionsArray() const;
	int32 GetOptionsNum() const;
	class FName GetOptionSpeakerState(int32 OptionIndex) const;
	class FName GetOptionSpeakerStateFromAll(int32 Index_0) const;
	const class FText GetOptionText(int32 OptionIndex) const;
	const class FText GetOptionTextFromAll(int32 Index_0) const;
	ETextJustify GetOverrideJustify() const;
	class FText GetOverrideSelfName() const;
	class FText GetOverrideSpeakerName() const;
	const TMap<class FName, class UObject*> GetParticipants() const;
	const TMap<class FName, class UObject*> GetParticipantsMap() const;
	const TArray<struct FDlgSequenceActorConfig> GetSequenceActorConfigs() const;
	const struct FDlgSequence GetSequenceConfig() const;
	class FText GetSkipDesc() const;
	const TSet<struct FGuid> GetVisitedNodeGUIDs() const;
	const TSet<int32> GetVisitedNodeIndices() const;
	bool HasDialogueEnded() const;
	bool IsActiveNodeCanAutoContinue() const;
	bool IsActiveNodeCanSkip() const;
	bool IsActiveNodeEventNode() const;
	bool IsActiveNodeInEndDlg() const;
	bool IsForceMainAvatar() const;
	bool IsForceNotChangeAvatar() const;
	bool IsForceShowOptionalButton(int32 OptionIndex) const;
	bool IsForceWalk() const;
	bool IsHideName() const;
	bool IsHideUI() const;
	bool IsNeedFaceToTarget() const;
	bool IsNeedShowFashion() const;
	bool IsNextNodeEnd() const;
	bool IsNodeVisited(int32 NodeIndex, const struct FGuid& NodeGuid, bool bLocalHistory) const;
	bool IsOptionConnectedToEndNode(int32 Index_0, bool bIndexSkipsUnsatisfiedEdges) const;
	bool IsOptionConnectedToVisitedNode(int32 Index_0, bool bLocalHistory, bool bIndexSkipsUnsatisfiedEdges) const;
	bool IsOptionSatisfied(int32 Index_0) const;
	bool IsValidAllOptionIndex(int32 Index_0) const;
	bool IsValidNodeGUID(const struct FGuid& NodeGuid) const;
	bool IsValidNodeIndex(int32 NodeIndex) const;
	bool IsValidOptionIndex(int32 OptionIndex) const;
	bool WasNodeGUIDVisitedInThisContext(const struct FGuid& NodeGuid) const;
	bool WasNodeIndexVisitedInThisContext(int32 NodeIndex) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DlgContext">();
	}
	static class UDlgContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgContext>();
	}
};
static_assert(alignof(UDlgContext) == 0x000008, "Wrong alignment on UDlgContext");
static_assert(sizeof(UDlgContext) == 0x0001B0, "Wrong size on UDlgContext");
static_assert(offsetof(UDlgContext, Dialogue) == 0x000028, "Member 'UDlgContext::Dialogue' has a wrong offset!");
static_assert(offsetof(UDlgContext, SerializedParticipants) == 0x000030, "Member 'UDlgContext::SerializedParticipants' has a wrong offset!");
static_assert(offsetof(UDlgContext, Participants) == 0x000040, "Member 'UDlgContext::Participants' has a wrong offset!");

// Class DlgSystem.DlgDialogue
// 0x0180 (0x01A8 - 0x0028)
class UDlgDialogue final : public UObject
{
public:
	int32                                         Version;                                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   Name_0;                                            // 0x002C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  Guid;                                              // 0x0034(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDlgParticipantClass>           ParticipantsClasses;                               // 0x0048(0x0010)(Edit, EditFixedSize, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, struct FDlgParticipantData> ParticipantsData;                                  // 0x0058(0x0050)(Edit, EditConst, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	TSet<class FName>                             AllSpeakerStates;                                  // 0x00A8(0x0050)(Edit, EditConst, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	class UDlgNode*                               StartNode;                                         // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, Deprecated, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UDlgNode*>                       StartNodes;                                        // 0x0100(0x0010)(Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UDlgNode*>                       Nodes;                                             // 0x0110(0x0010)(ExportObject, EditFixedSize, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGuid, int32>                     NodesGUIDToIndexMap;                               // 0x0120(0x0050)(Edit, EditConst, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_170[0x4];                                      // 0x0170(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ParticipantsSearchRange;                           // 0x0174(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDlgType                                      DialogueType;                                      // 0x0178(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanLoop;                                          // 0x0179(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           ExtraParticipants;                                 // 0x0180(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bRotatorToPlayer;                                  // 0x0190(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           KeepMontageParticipants;                           // 0x0198(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	const TArray<class UDlgNode*> GetMutableStartNodes();

	void GetAllParticipantNames(TSet<class FName>* Outset) const;
	void GetAllSpeakerStates(TSet<class FName>* Outset) const;
	void GetBoolNames(class FName ParticipantName, TSet<class FName>* Outset) const;
	void GetClassBoolNames(class FName ParticipantName, TSet<class FName>* Outset) const;
	void GetClassFloatNames(class FName ParticipantName, TSet<class FName>* Outset) const;
	void GetClassIntNames(class FName ParticipantName, TSet<class FName>* Outset) const;
	void GetClassNameNames(class FName ParticipantName, TSet<class FName>* Outset) const;
	void GetClassTextNames(class FName ParticipantName, TSet<class FName>* Outset) const;
	void GetConditions(class FName ParticipantName, TSet<class FName>* Outset) const;
	void GetCustomEvents(class FName ParticipantName, TSet<class UClass*>* Outset) const;
	class FName GetDialogueFName() const;
	class FString GetDialogueName() const;
	int32 GetDialogueVersion() const;
	void GetEvents(class FName ParticipantName, TSet<class FName>* Outset) const;
	void GetFloatNames(class FName ParticipantName, TSet<class FName>* Outset) const;
	struct FGuid GetGUID() const;
	void GetIntNames(class FName ParticipantName, TSet<class FName>* Outset) const;
	class UDlgNode* GetMutableNodeFromGUID(const struct FGuid& NodeGuid) const;
	class UDlgNode* GetMutableNodeFromIndex(int32 NodeIndex) const;
	class UDlgNode* GetMutableStartNode() const;
	void GetNameNames(class FName ParticipantName, TSet<class FName>* Outset) const;
	struct FGuid GetNodeGUIDForIndex(int32 NodeIndex) const;
	int32 GetNodeIndexForGUID(const struct FGuid& NodeGuid) const;
	const TArray<class UDlgNode*> GetNodes() const;
	TSet<class FName> GetParticipantBoolNames(class FName ParticipantName) const;
	class UClass* GetParticipantClass(class FName ParticipantName) const;
	TSet<class FName> GetParticipantClassBoolNames(class FName ParticipantName) const;
	const TArray<struct FDlgParticipantClass> GetParticipantClasses() const;
	TSet<class FName> GetParticipantClassFloatNames(class FName ParticipantName) const;
	TSet<class FName> GetParticipantClassFNameNames(class FName ParticipantName) const;
	TSet<class FName> GetParticipantClassFTextNames(class FName ParticipantName) const;
	TSet<class FName> GetParticipantClassIntNames(class FName ParticipantName) const;
	TSet<class FName> GetParticipantConditionNames(class FName ParticipantName) const;
	TSet<class UClass*> GetParticipantCustomConditions(class FName ParticipantName) const;
	TSet<class UClass*> GetParticipantCustomEvents(class FName ParticipantName) const;
	TSet<class UClass*> GetParticipantCustomTextArguments(class FName ParticipantName) const;
	TSet<class FName> GetParticipantEventNames(class FName ParticipantName) const;
	TSet<class FName> GetParticipantFloatNames(class FName ParticipantName) const;
	TSet<class FName> GetParticipantFNameNames(class FName ParticipantName) const;
	TSet<class FName> GetParticipantFunctionNames(class FName ParticipantName) const;
	TSet<class FName> GetParticipantIntNames(class FName ParticipantName) const;
	TSet<class FName> GetParticipantNames() const;
	const TMap<class FName, struct FDlgParticipantData> GetParticipantsData() const;
	int32 GetParticipantsNum() const;
	TSet<class FName> GetSpeakerStates() const;
	bool HasGUID() const;
	bool HasParticipant(class FName ParticipantName) const;
	bool IsValidNodeGUID(const struct FGuid& NodeGuid) const;
	bool IsValidNodeIndex(int32 NodeIndex) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DlgDialogue">();
	}
	static class UDlgDialogue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgDialogue>();
	}
};
static_assert(alignof(UDlgDialogue) == 0x000008, "Wrong alignment on UDlgDialogue");
static_assert(sizeof(UDlgDialogue) == 0x0001A8, "Wrong size on UDlgDialogue");
static_assert(offsetof(UDlgDialogue, Version) == 0x000028, "Member 'UDlgDialogue::Version' has a wrong offset!");
static_assert(offsetof(UDlgDialogue, Name_0) == 0x00002C, "Member 'UDlgDialogue::Name_0' has a wrong offset!");
static_assert(offsetof(UDlgDialogue, Guid) == 0x000034, "Member 'UDlgDialogue::Guid' has a wrong offset!");
static_assert(offsetof(UDlgDialogue, ParticipantsClasses) == 0x000048, "Member 'UDlgDialogue::ParticipantsClasses' has a wrong offset!");
static_assert(offsetof(UDlgDialogue, ParticipantsData) == 0x000058, "Member 'UDlgDialogue::ParticipantsData' has a wrong offset!");
static_assert(offsetof(UDlgDialogue, AllSpeakerStates) == 0x0000A8, "Member 'UDlgDialogue::AllSpeakerStates' has a wrong offset!");
static_assert(offsetof(UDlgDialogue, StartNode) == 0x0000F8, "Member 'UDlgDialogue::StartNode' has a wrong offset!");
static_assert(offsetof(UDlgDialogue, StartNodes) == 0x000100, "Member 'UDlgDialogue::StartNodes' has a wrong offset!");
static_assert(offsetof(UDlgDialogue, Nodes) == 0x000110, "Member 'UDlgDialogue::Nodes' has a wrong offset!");
static_assert(offsetof(UDlgDialogue, NodesGUIDToIndexMap) == 0x000120, "Member 'UDlgDialogue::NodesGUIDToIndexMap' has a wrong offset!");
static_assert(offsetof(UDlgDialogue, ParticipantsSearchRange) == 0x000174, "Member 'UDlgDialogue::ParticipantsSearchRange' has a wrong offset!");
static_assert(offsetof(UDlgDialogue, DialogueType) == 0x000178, "Member 'UDlgDialogue::DialogueType' has a wrong offset!");
static_assert(offsetof(UDlgDialogue, bCanLoop) == 0x000179, "Member 'UDlgDialogue::bCanLoop' has a wrong offset!");
static_assert(offsetof(UDlgDialogue, ExtraParticipants) == 0x000180, "Member 'UDlgDialogue::ExtraParticipants' has a wrong offset!");
static_assert(offsetof(UDlgDialogue, bRotatorToPlayer) == 0x000190, "Member 'UDlgDialogue::bRotatorToPlayer' has a wrong offset!");
static_assert(offsetof(UDlgDialogue, KeepMontageParticipants) == 0x000198, "Member 'UDlgDialogue::KeepMontageParticipants' has a wrong offset!");

// Class DlgSystem.DlgDialogueParticipant
// 0x0000 (0x0000 - 0x0000)
class IDlgDialogueParticipant final
{
public:
	bool ModifyBoolValue(class FName ValueName, bool bNewValue);
	bool ModifyFloatValue(class FName ValueName, bool bDelta, float Value);
	bool ModifyIntValue(class FName ValueName, bool bDelta, int32 Value);
	bool ModifyNameValue(class FName ValueName, class FName NameValue);
	bool OnDialogueEvent(class UDlgContext* Context, class FName EventName);

	bool CheckCondition(const class UDlgContext* Context, class FName ConditionName) const;
	bool GetBoolValue(class FName ValueName) const;
	float GetFloatValue(class FName ValueName) const;
	int64 GetInt64Value(class FName ValueName) const;
	int32 GetIntValue(class FName ValueName) const;
	class FName GetNameValue(class FName ValueName) const;
	class FText GetParticipantDisplayName(class FName ActiveSpeaker) const;
	ETextGender GetParticipantGender() const;
	class UTexture2D* GetParticipantIcon(class FName ActiveSpeaker, class FName ActiveSpeakerState) const;
	class FName GetParticipantName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DlgDialogueParticipant">();
	}
	static class IDlgDialogueParticipant* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDlgDialogueParticipant>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IDlgDialogueParticipant) == 0x000001, "Wrong alignment on IDlgDialogueParticipant");
static_assert(sizeof(IDlgDialogueParticipant) == 0x000001, "Wrong size on IDlgDialogueParticipant");

// Class DlgSystem.DlgEventCustom
// 0x0000 (0x0028 - 0x0028)
class UDlgEventCustom : public UDlgObject
{
public:
	void EnterEvent(class UDlgContext* Context, class UObject* Participant);
	class FString GetEditorDisplayString(class UDlgDialogue* OwnerDialogue, class FName ParticipantName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DlgEventCustom">();
	}
	static class UDlgEventCustom* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgEventCustom>();
	}
};
static_assert(alignof(UDlgEventCustom) == 0x000008, "Wrong alignment on UDlgEventCustom");
static_assert(sizeof(UDlgEventCustom) == 0x000028, "Wrong size on UDlgEventCustom");

// Class DlgSystem.DlgEventCustomHideCategories
// 0x0000 (0x0028 - 0x0028)
class UDlgEventCustomHideCategories final : public UDlgEventCustom
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DlgEventCustomHideCategories">();
	}
	static class UDlgEventCustomHideCategories* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgEventCustomHideCategories>();
	}
};
static_assert(alignof(UDlgEventCustomHideCategories) == 0x000008, "Wrong alignment on UDlgEventCustomHideCategories");
static_assert(sizeof(UDlgEventCustomHideCategories) == 0x000028, "Wrong size on UDlgEventCustomHideCategories");

// Class DlgSystem.DlgTestObjectPrimitivesBase
// 0x0020 (0x0048 - 0x0028)
class UDlgTestObjectPrimitivesBase : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Integer;                                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 String;                                            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DlgTestObjectPrimitivesBase">();
	}
	static class UDlgTestObjectPrimitivesBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgTestObjectPrimitivesBase>();
	}
};
static_assert(alignof(UDlgTestObjectPrimitivesBase) == 0x000008, "Wrong alignment on UDlgTestObjectPrimitivesBase");
static_assert(sizeof(UDlgTestObjectPrimitivesBase) == 0x000048, "Wrong size on UDlgTestObjectPrimitivesBase");
static_assert(offsetof(UDlgTestObjectPrimitivesBase, Integer) == 0x000030, "Member 'UDlgTestObjectPrimitivesBase::Integer' has a wrong offset!");
static_assert(offsetof(UDlgTestObjectPrimitivesBase, String) == 0x000038, "Member 'UDlgTestObjectPrimitivesBase::String' has a wrong offset!");

// Class DlgSystem.DlgTestObjectPrimitives_DefaultToInstanced
// 0x0010 (0x0058 - 0x0048)
class UDlgTestObjectPrimitives_DefaultToInstanced final : public UDlgTestObjectPrimitivesBase
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InstancedChild;                                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DlgTestObjectPrimitives_DefaultToInstanced">();
	}
	static class UDlgTestObjectPrimitives_DefaultToInstanced* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgTestObjectPrimitives_DefaultToInstanced>();
	}
};
static_assert(alignof(UDlgTestObjectPrimitives_DefaultToInstanced) == 0x000008, "Wrong alignment on UDlgTestObjectPrimitives_DefaultToInstanced");
static_assert(sizeof(UDlgTestObjectPrimitives_DefaultToInstanced) == 0x000058, "Wrong size on UDlgTestObjectPrimitives_DefaultToInstanced");
static_assert(offsetof(UDlgTestObjectPrimitives_DefaultToInstanced, InstancedChild) == 0x000050, "Member 'UDlgTestObjectPrimitives_DefaultToInstanced::InstancedChild' has a wrong offset!");

// Class DlgSystem.DlgTestObjectPrimitives_ChildA
// 0x0010 (0x0058 - 0x0048)
class UDlgTestObjectPrimitives_ChildA : public UDlgTestObjectPrimitivesBase
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IntegerChildA;                                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DlgTestObjectPrimitives_ChildA">();
	}
	static class UDlgTestObjectPrimitives_ChildA* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgTestObjectPrimitives_ChildA>();
	}
};
static_assert(alignof(UDlgTestObjectPrimitives_ChildA) == 0x000008, "Wrong alignment on UDlgTestObjectPrimitives_ChildA");
static_assert(sizeof(UDlgTestObjectPrimitives_ChildA) == 0x000058, "Wrong size on UDlgTestObjectPrimitives_ChildA");
static_assert(offsetof(UDlgTestObjectPrimitives_ChildA, IntegerChildA) == 0x000050, "Member 'UDlgTestObjectPrimitives_ChildA::IntegerChildA' has a wrong offset!");

// Class DlgSystem.DlgTestObjectPrimitives_ChildB
// 0x0018 (0x0060 - 0x0048)
class UDlgTestObjectPrimitives_ChildB final : public UDlgTestObjectPrimitivesBase
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StringChildB;                                      // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DlgTestObjectPrimitives_ChildB">();
	}
	static class UDlgTestObjectPrimitives_ChildB* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgTestObjectPrimitives_ChildB>();
	}
};
static_assert(alignof(UDlgTestObjectPrimitives_ChildB) == 0x000008, "Wrong alignment on UDlgTestObjectPrimitives_ChildB");
static_assert(sizeof(UDlgTestObjectPrimitives_ChildB) == 0x000060, "Wrong size on UDlgTestObjectPrimitives_ChildB");
static_assert(offsetof(UDlgTestObjectPrimitives_ChildB, StringChildB) == 0x000050, "Member 'UDlgTestObjectPrimitives_ChildB::StringChildB' has a wrong offset!");

// Class DlgSystem.DlgTestObjectPrimitives_GrandChildA_Of_ChildA
// 0x0010 (0x0068 - 0x0058)
class UDlgTestObjectPrimitives_GrandChildA_Of_ChildA final : public UDlgTestObjectPrimitives_ChildA
{
public:
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IntegerGrandChildA_Of_ChildA;                      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DlgTestObjectPrimitives_GrandChildA_Of_ChildA">();
	}
	static class UDlgTestObjectPrimitives_GrandChildA_Of_ChildA* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgTestObjectPrimitives_GrandChildA_Of_ChildA>();
	}
};
static_assert(alignof(UDlgTestObjectPrimitives_GrandChildA_Of_ChildA) == 0x000008, "Wrong alignment on UDlgTestObjectPrimitives_GrandChildA_Of_ChildA");
static_assert(sizeof(UDlgTestObjectPrimitives_GrandChildA_Of_ChildA) == 0x000068, "Wrong size on UDlgTestObjectPrimitives_GrandChildA_Of_ChildA");
static_assert(offsetof(UDlgTestObjectPrimitives_GrandChildA_Of_ChildA, IntegerGrandChildA_Of_ChildA) == 0x000060, "Member 'UDlgTestObjectPrimitives_GrandChildA_Of_ChildA::IntegerGrandChildA_Of_ChildA' has a wrong offset!");

// Class DlgSystem.DlgManager
// 0x0000 (0x0028 - 0x0028)
class UDlgManager final : public UBlueprintFunctionLibrary
{
public:
	static bool CanStartDialogue(class UDlgDialogue* Dialogue, const TArray<class UObject*>& Participants);
	static void ClearDialogueHistory();
	static void ClearDialoguePersistentWorldContextObject();
	static bool DoesObjectImplementDialogueParticipantInterface(const class UObject* Object);
	static void GetAllDialoguesBoolNames(class FName ParticipantName, TArray<class FName>* OutArray);
	static void GetAllDialoguesConditionNames(class FName ParticipantName, TArray<class FName>* OutArray);
	static void GetAllDialoguesEventNames(class FName ParticipantName, TArray<class FName>* OutArray);
	static void GetAllDialoguesFloatNames(class FName ParticipantName, TArray<class FName>* OutArray);
	static void GetAllDialoguesIntNames(class FName ParticipantName, TArray<class FName>* OutArray);
	static void GetAllDialoguesNameNames(class FName ParticipantName, TArray<class FName>* OutArray);
	static void GetAllDialoguesParticipantNames(TArray<class FName>* OutArray);
	static void GetAllDialoguesSpeakerStates(TArray<class FName>* OutArray);
	static const TMap<struct FGuid, struct FDlgHistory> GetDialogueHistory();
	static TArray<class FName> GetDialoguesConditionNames();
	static TArray<class FName> GetDialoguesEventNames();
	static TArray<class FName> GetDialoguesParticipantBoolNames(class FName ParticipantName);
	static TArray<class FName> GetDialoguesParticipantConditionNames(class FName ParticipantName);
	static TArray<class FName> GetDialoguesParticipantEventNames(class FName ParticipantName);
	static TArray<class FName> GetDialoguesParticipantFloatNames(class FName ParticipantName);
	static TArray<class FName> GetDialoguesParticipantFNameNames(class FName ParticipantName);
	static TArray<class FName> GetDialoguesParticipantIntNames(class FName ParticipantName);
	static TArray<class FName> GetDialoguesParticipantNames();
	static TArray<class FName> GetDialoguesSpeakerStates();
	static class UWorld* GetDialogueWorld();
	static TMap<class FName, struct FDlgObjectsArray> GetObjectsMapWithDialogueParticipantInterface(class UObject* WorldContextObject);
	static TArray<class UObject*> GetObjectsWithDialogueParticipantInterface(class UObject* WorldContextObject);
	static bool IsObjectACustomCondition(const class UObject* Object);
	static bool IsObjectACustomEvent(const class UObject* Object);
	static bool IsObjectACustomTextArgument(const class UObject* Object);
	static bool IsObjectANodeData(const class UObject* Object);
	static bool RegisterDialogueConsoleCommands();
	static class UDlgContext* ResumeDialogueFromNodeGUID(class UDlgDialogue* Dialogue, const TArray<class UObject*>& Participants, const struct FGuid& StartNodeGUID, const TSet<struct FGuid>& AlreadyVisitedNodes, bool bFireEnterEvents);
	static class UDlgContext* ResumeDialogueFromNodeIndex(class UDlgDialogue* Dialogue, const TArray<class UObject*>& Participants, int32 StartIndex, const TSet<int32>& AlreadyVisitedNodes, bool bFireEnterEvents);
	static void SetDialogueHistory(const TMap<struct FGuid, struct FDlgHistory>& DlgHistory);
	static void SetDialoguePersistentWorldContextObject(const class UObject* WorldContextObject);
	static class UDlgContext* StartDialogue(class UDlgDialogue* Dialogue, const TArray<class UObject*>& Participants);
	static class UDlgContext* StartDialogue2(class UDlgDialogue* Dialogue, class UObject* Participant0, class UObject* Participant1);
	static class UDlgContext* StartDialogue3(class UDlgDialogue* Dialogue, class UObject* Participant0, class UObject* Participant1, class UObject* Participant2);
	static class UDlgContext* StartDialogue4(class UDlgDialogue* Dialogue, class UObject* Participant0, class UObject* Participant1, class UObject* Participant2, class UObject* Participant3);
	static class UDlgContext* StartDialogueWithDefaultParticipants(class UObject* WorldContextObject, class UDlgDialogue* Dialogue);
	static class UDlgContext* StartMonologue(class UDlgDialogue* Dialogue, class UObject* Participant);
	static bool UnregisterDialogueConsoleCommands();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DlgManager">();
	}
	static class UDlgManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgManager>();
	}
};
static_assert(alignof(UDlgManager) == 0x000008, "Wrong alignment on UDlgManager");
static_assert(sizeof(UDlgManager) == 0x000028, "Wrong size on UDlgManager");

// Class DlgSystem.DlgNode
// 0x01A8 (0x01D0 - 0x0028)
class UDlgNode : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   OwnerName;                                         // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEventNode;                                        // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInEndDlg;                                         // 0x0049(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanSkip;                                          // 0x004A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SkipOptionIndex;                                   // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanAutoContinue;                                  // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ShowButtonWaitTime;                                // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   OverrideSelfName;                                  // 0x0058(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   OverrideSpeakerName;                               // 0x0068(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   Nickname;                                          // 0x0078(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                   SkipDesc;                                          // 0x0088(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          bForceMainAvatar;                                  // 0x0098(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceNotChangeAvatar;                             // 0x0099(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bNeedShowFashion;                                  // 0x009A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFaceToTarget;                                     // 0x009B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FaceToTargetDelay;                                 // 0x009C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDlgAutoPlayConfig                     AutoPlayConfig;                                    // 0x00A0(0x0008)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          BlackFade;                                         // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeStayTime;                                      // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FInstancedStruct                       SequenceInfo;                                      // 0x00B0(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          bForceWalk;                                        // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       HideNPCVolumeConfig;                               // 0x00C8(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           ForbidInDialogueNpcArray;                          // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDlgSequenceActorConfig>        SequenceActorConfigs;                              // 0x00E8(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FInstancedStruct                       CameraInfo;                                        // 0x00F8(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FInstancedStruct                       CameraFade;                                        // 0x0108(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          HideUI;                                            // 0x0118(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          HideName;                                          // 0x0119(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETextJustify                                  OverrideJustify;                                   // 0x011A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_11B[0x5];                                      // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       CartoonInfo;                                       // 0x0120(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FInstancedStruct                       UIConfig;                                          // 0x0130(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDlgEndTransform>               EndTransforms;                                     // 0x0140(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FInstancedStruct                       ChapterConfig;                                     // 0x0150(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FInstancedStruct                       BGMConfig;                                         // 0x0160(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FInstancedStruct                       IntroductionConfig;                                // 0x0170(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          bCheckChildrenOnEvaluation;                        // 0x0180(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDlgCondition>                  EnterConditions;                                   // 0x0188(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	EDlgEntryRestriction                          EnterRestriction;                                  // 0x0198(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDlgEvent>                      EnterEvents;                                       // 0x01A0(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FGuid                                  NodeGuid;                                          // 0x01B0(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FDlgEdge>                       Children;                                          // 0x01C0(0x0010)(Edit, EditFixedSize, ZeroConstructor, EditConst, ContainsInstancedReference, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)

public:
	bool GetCheckChildrenOnEvaluation() const;
	struct FGuid GetGUID() const;
	const struct FDlgEdge GetNodeChildAt(int32 EdgeIndex) const;
	const TArray<struct FDlgEdge> GetNodeChildren() const;
	class UDlgNodeData* GetNodeData() const;
	const TArray<struct FDlgCondition> GetNodeEnterConditions() const;
	const TArray<struct FDlgEvent> GetNodeEnterEvents() const;
	class UObject* GetNodeGenericData() const;
	class FName GetNodeParticipantName() const;
	const class FText GetNodeText() const;
	const class FText GetNodeUnformattedText() const;
	class UDialogueWave* GetNodeVoiceDialogueWave() const;
	class USoundBase* GetNodeVoiceSoundBase() const;
	class USoundWave* GetNodeVoiceSoundWave() const;
	int32 GetNumNodeChildren() const;
	class FName GetSpeakerState() const;
	const TArray<struct FDlgTextArgument> GetTextArguments() const;
	bool HasAnyEnterConditions() const;
	bool HasAnyEnterEvents() const;
	bool HasGUID() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DlgNode">();
	}
	static class UDlgNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgNode>();
	}
};
static_assert(alignof(UDlgNode) == 0x000008, "Wrong alignment on UDlgNode");
static_assert(sizeof(UDlgNode) == 0x0001D0, "Wrong size on UDlgNode");
static_assert(offsetof(UDlgNode, OwnerName) == 0x000040, "Member 'UDlgNode::OwnerName' has a wrong offset!");
static_assert(offsetof(UDlgNode, bEventNode) == 0x000048, "Member 'UDlgNode::bEventNode' has a wrong offset!");
static_assert(offsetof(UDlgNode, bInEndDlg) == 0x000049, "Member 'UDlgNode::bInEndDlg' has a wrong offset!");
static_assert(offsetof(UDlgNode, bCanSkip) == 0x00004A, "Member 'UDlgNode::bCanSkip' has a wrong offset!");
static_assert(offsetof(UDlgNode, SkipOptionIndex) == 0x00004C, "Member 'UDlgNode::SkipOptionIndex' has a wrong offset!");
static_assert(offsetof(UDlgNode, bCanAutoContinue) == 0x000050, "Member 'UDlgNode::bCanAutoContinue' has a wrong offset!");
static_assert(offsetof(UDlgNode, ShowButtonWaitTime) == 0x000054, "Member 'UDlgNode::ShowButtonWaitTime' has a wrong offset!");
static_assert(offsetof(UDlgNode, OverrideSelfName) == 0x000058, "Member 'UDlgNode::OverrideSelfName' has a wrong offset!");
static_assert(offsetof(UDlgNode, OverrideSpeakerName) == 0x000068, "Member 'UDlgNode::OverrideSpeakerName' has a wrong offset!");
static_assert(offsetof(UDlgNode, Nickname) == 0x000078, "Member 'UDlgNode::Nickname' has a wrong offset!");
static_assert(offsetof(UDlgNode, SkipDesc) == 0x000088, "Member 'UDlgNode::SkipDesc' has a wrong offset!");
static_assert(offsetof(UDlgNode, bForceMainAvatar) == 0x000098, "Member 'UDlgNode::bForceMainAvatar' has a wrong offset!");
static_assert(offsetof(UDlgNode, bForceNotChangeAvatar) == 0x000099, "Member 'UDlgNode::bForceNotChangeAvatar' has a wrong offset!");
static_assert(offsetof(UDlgNode, bNeedShowFashion) == 0x00009A, "Member 'UDlgNode::bNeedShowFashion' has a wrong offset!");
static_assert(offsetof(UDlgNode, bFaceToTarget) == 0x00009B, "Member 'UDlgNode::bFaceToTarget' has a wrong offset!");
static_assert(offsetof(UDlgNode, FaceToTargetDelay) == 0x00009C, "Member 'UDlgNode::FaceToTargetDelay' has a wrong offset!");
static_assert(offsetof(UDlgNode, AutoPlayConfig) == 0x0000A0, "Member 'UDlgNode::AutoPlayConfig' has a wrong offset!");
static_assert(offsetof(UDlgNode, BlackFade) == 0x0000A8, "Member 'UDlgNode::BlackFade' has a wrong offset!");
static_assert(offsetof(UDlgNode, FadeStayTime) == 0x0000AC, "Member 'UDlgNode::FadeStayTime' has a wrong offset!");
static_assert(offsetof(UDlgNode, SequenceInfo) == 0x0000B0, "Member 'UDlgNode::SequenceInfo' has a wrong offset!");
static_assert(offsetof(UDlgNode, bForceWalk) == 0x0000C0, "Member 'UDlgNode::bForceWalk' has a wrong offset!");
static_assert(offsetof(UDlgNode, HideNPCVolumeConfig) == 0x0000C8, "Member 'UDlgNode::HideNPCVolumeConfig' has a wrong offset!");
static_assert(offsetof(UDlgNode, ForbidInDialogueNpcArray) == 0x0000D8, "Member 'UDlgNode::ForbidInDialogueNpcArray' has a wrong offset!");
static_assert(offsetof(UDlgNode, SequenceActorConfigs) == 0x0000E8, "Member 'UDlgNode::SequenceActorConfigs' has a wrong offset!");
static_assert(offsetof(UDlgNode, CameraInfo) == 0x0000F8, "Member 'UDlgNode::CameraInfo' has a wrong offset!");
static_assert(offsetof(UDlgNode, CameraFade) == 0x000108, "Member 'UDlgNode::CameraFade' has a wrong offset!");
static_assert(offsetof(UDlgNode, HideUI) == 0x000118, "Member 'UDlgNode::HideUI' has a wrong offset!");
static_assert(offsetof(UDlgNode, HideName) == 0x000119, "Member 'UDlgNode::HideName' has a wrong offset!");
static_assert(offsetof(UDlgNode, OverrideJustify) == 0x00011A, "Member 'UDlgNode::OverrideJustify' has a wrong offset!");
static_assert(offsetof(UDlgNode, CartoonInfo) == 0x000120, "Member 'UDlgNode::CartoonInfo' has a wrong offset!");
static_assert(offsetof(UDlgNode, UIConfig) == 0x000130, "Member 'UDlgNode::UIConfig' has a wrong offset!");
static_assert(offsetof(UDlgNode, EndTransforms) == 0x000140, "Member 'UDlgNode::EndTransforms' has a wrong offset!");
static_assert(offsetof(UDlgNode, ChapterConfig) == 0x000150, "Member 'UDlgNode::ChapterConfig' has a wrong offset!");
static_assert(offsetof(UDlgNode, BGMConfig) == 0x000160, "Member 'UDlgNode::BGMConfig' has a wrong offset!");
static_assert(offsetof(UDlgNode, IntroductionConfig) == 0x000170, "Member 'UDlgNode::IntroductionConfig' has a wrong offset!");
static_assert(offsetof(UDlgNode, bCheckChildrenOnEvaluation) == 0x000180, "Member 'UDlgNode::bCheckChildrenOnEvaluation' has a wrong offset!");
static_assert(offsetof(UDlgNode, EnterConditions) == 0x000188, "Member 'UDlgNode::EnterConditions' has a wrong offset!");
static_assert(offsetof(UDlgNode, EnterRestriction) == 0x000198, "Member 'UDlgNode::EnterRestriction' has a wrong offset!");
static_assert(offsetof(UDlgNode, EnterEvents) == 0x0001A0, "Member 'UDlgNode::EnterEvents' has a wrong offset!");
static_assert(offsetof(UDlgNode, NodeGuid) == 0x0001B0, "Member 'UDlgNode::NodeGuid' has a wrong offset!");
static_assert(offsetof(UDlgNode, Children) == 0x0001C0, "Member 'UDlgNode::Children' has a wrong offset!");

// Class DlgSystem.DlgNodeData
// 0x0000 (0x0028 - 0x0028)
class UDlgNodeData : public UDlgObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DlgNodeData">();
	}
	static class UDlgNodeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgNodeData>();
	}
};
static_assert(alignof(UDlgNodeData) == 0x000008, "Wrong alignment on UDlgNodeData");
static_assert(sizeof(UDlgNodeData) == 0x000028, "Wrong size on UDlgNodeData");

// Class DlgSystem.DlgNodeDataHideCategories
// 0x0000 (0x0028 - 0x0028)
class UDlgNodeDataHideCategories final : public UDlgNodeData
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DlgNodeDataHideCategories">();
	}
	static class UDlgNodeDataHideCategories* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgNodeDataHideCategories>();
	}
};
static_assert(alignof(UDlgNodeDataHideCategories) == 0x000008, "Wrong alignment on UDlgNodeDataHideCategories");
static_assert(sizeof(UDlgNodeDataHideCategories) == 0x000028, "Wrong size on UDlgNodeDataHideCategories");

// Class DlgSystem.DlgNode_Custom
// 0x0000 (0x01D0 - 0x01D0)
class UDlgNode_Custom final : public UDlgNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DlgNode_Custom">();
	}
	static class UDlgNode_Custom* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgNode_Custom>();
	}
};
static_assert(alignof(UDlgNode_Custom) == 0x000008, "Wrong alignment on UDlgNode_Custom");
static_assert(sizeof(UDlgNode_Custom) == 0x0001D0, "Wrong size on UDlgNode_Custom");

// Class DlgSystem.DlgNode_End
// 0x0000 (0x01D0 - 0x01D0)
class UDlgNode_End final : public UDlgNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DlgNode_End">();
	}
	static class UDlgNode_End* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgNode_End>();
	}
};
static_assert(alignof(UDlgNode_End) == 0x000008, "Wrong alignment on UDlgNode_End");
static_assert(sizeof(UDlgNode_End) == 0x0001D0, "Wrong size on UDlgNode_End");

// Class DlgSystem.DlgNode_Proxy
// 0x0008 (0x01D8 - 0x01D0)
class UDlgNode_Proxy final : public UDlgNode
{
public:
	int32                                         NodeIndex;                                         // 0x01D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DlgNode_Proxy">();
	}
	static class UDlgNode_Proxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgNode_Proxy>();
	}
};
static_assert(alignof(UDlgNode_Proxy) == 0x000008, "Wrong alignment on UDlgNode_Proxy");
static_assert(sizeof(UDlgNode_Proxy) == 0x0001D8, "Wrong size on UDlgNode_Proxy");
static_assert(offsetof(UDlgNode_Proxy, NodeIndex) == 0x0001D0, "Member 'UDlgNode_Proxy::NodeIndex' has a wrong offset!");

// Class DlgSystem.DlgNode_Selector
// 0x0018 (0x01E8 - 0x01D0)
class UDlgNode_Selector final : public UDlgNode
{
public:
	EDlgNodeSelectorType                          SelectorType;                                      // 0x01D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAvoidPickingSameOptionTwiceInARow;                // 0x01D1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCycleThroughSatisfiedOptionsWithoutRepetition;    // 0x01D2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D3[0x5];                                      // 0x01D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DynamicDisplayText;                                // 0x01D8(0x0010)(Transient, Protected, NativeAccessSpecifierProtected)

public:
	EDlgNodeSelectorType GetSelectorType() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DlgNode_Selector">();
	}
	static class UDlgNode_Selector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgNode_Selector>();
	}
};
static_assert(alignof(UDlgNode_Selector) == 0x000008, "Wrong alignment on UDlgNode_Selector");
static_assert(sizeof(UDlgNode_Selector) == 0x0001E8, "Wrong size on UDlgNode_Selector");
static_assert(offsetof(UDlgNode_Selector, SelectorType) == 0x0001D0, "Member 'UDlgNode_Selector::SelectorType' has a wrong offset!");
static_assert(offsetof(UDlgNode_Selector, bAvoidPickingSameOptionTwiceInARow) == 0x0001D1, "Member 'UDlgNode_Selector::bAvoidPickingSameOptionTwiceInARow' has a wrong offset!");
static_assert(offsetof(UDlgNode_Selector, bCycleThroughSatisfiedOptionsWithoutRepetition) == 0x0001D2, "Member 'UDlgNode_Selector::bCycleThroughSatisfiedOptionsWithoutRepetition' has a wrong offset!");
static_assert(offsetof(UDlgNode_Selector, DynamicDisplayText) == 0x0001D8, "Member 'UDlgNode_Selector::DynamicDisplayText' has a wrong offset!");

// Class DlgSystem.DlgNode_Speech
// 0x0068 (0x0238 - 0x01D0)
class UDlgNode_Speech final : public UDlgNode
{
public:
	bool                                          bIsVirtualParent;                                  // 0x01D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bVirtualParentFireDirectChildEnterEvents;          // 0x01D1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D2[0x6];                                      // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x01D8(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDlgTextArgument>               TextArguments;                                     // 0x01E8(0x0010)(Edit, EditFixedSize, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class FName                                   SpeakerState;                                      // 0x01F8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDlgNodeData*                           NodeData;                                          // 0x0200(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                             VoiceSoundWave;                                    // 0x0208(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDialogueWave*                          VoiceDialogueWave;                                 // 0x0210(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                                GenericData;                                       // 0x0218(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_220[0x14];                                     // 0x0220(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsSelfTalk;                                       // 0x0234(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsVirtualParent() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DlgNode_Speech">();
	}
	static class UDlgNode_Speech* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgNode_Speech>();
	}
};
static_assert(alignof(UDlgNode_Speech) == 0x000008, "Wrong alignment on UDlgNode_Speech");
static_assert(sizeof(UDlgNode_Speech) == 0x000238, "Wrong size on UDlgNode_Speech");
static_assert(offsetof(UDlgNode_Speech, bIsVirtualParent) == 0x0001D0, "Member 'UDlgNode_Speech::bIsVirtualParent' has a wrong offset!");
static_assert(offsetof(UDlgNode_Speech, bVirtualParentFireDirectChildEnterEvents) == 0x0001D1, "Member 'UDlgNode_Speech::bVirtualParentFireDirectChildEnterEvents' has a wrong offset!");
static_assert(offsetof(UDlgNode_Speech, Text) == 0x0001D8, "Member 'UDlgNode_Speech::Text' has a wrong offset!");
static_assert(offsetof(UDlgNode_Speech, TextArguments) == 0x0001E8, "Member 'UDlgNode_Speech::TextArguments' has a wrong offset!");
static_assert(offsetof(UDlgNode_Speech, SpeakerState) == 0x0001F8, "Member 'UDlgNode_Speech::SpeakerState' has a wrong offset!");
static_assert(offsetof(UDlgNode_Speech, NodeData) == 0x000200, "Member 'UDlgNode_Speech::NodeData' has a wrong offset!");
static_assert(offsetof(UDlgNode_Speech, VoiceSoundWave) == 0x000208, "Member 'UDlgNode_Speech::VoiceSoundWave' has a wrong offset!");
static_assert(offsetof(UDlgNode_Speech, VoiceDialogueWave) == 0x000210, "Member 'UDlgNode_Speech::VoiceDialogueWave' has a wrong offset!");
static_assert(offsetof(UDlgNode_Speech, GenericData) == 0x000218, "Member 'UDlgNode_Speech::GenericData' has a wrong offset!");
static_assert(offsetof(UDlgNode_Speech, bIsSelfTalk) == 0x000234, "Member 'UDlgNode_Speech::bIsSelfTalk' has a wrong offset!");

// Class DlgSystem.DlgNode_SpeechSequence
// 0x0028 (0x01F8 - 0x01D0)
class UDlgNode_SpeechSequence final : public UDlgNode
{
public:
	TArray<struct FDlgSpeechSequenceEntry>        SpeechSequence;                                    // 0x01D0(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDlgEdge>                       InnerEdges;                                        // 0x01E0(0x0010)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1F0[0x8];                                      // 0x01F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const TArray<struct FDlgSpeechSequenceEntry> GetNodeSpeechSequence() const;
