#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DlgSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// Enum DlgSystem.EDlgConditionStrength
// NumValues: 0x0003
enum class EDlgConditionStrength : uint8
{
	Strong                                   = 0,
	Weak                                     = 1,
	EDlgConditionStrength_MAX                = 2,
};

// Enum DlgSystem.EDlgConditionType
// NumValues: 0x000E
enum class EDlgConditionType : uint8
{
	IntCall                                  = 0,
	FloatCall                                = 1,
	BoolCall                                 = 2,
	NameCall                                 = 3,
	EventCall                                = 4,
	ClassIntVariable                         = 5,
	ClassFloatVariable                       = 6,
	ClassBoolVariable                        = 7,
	ClassNameVariable                        = 8,
	ClassInt64Variable                       = 9,
	WasNodeVisited                           = 10,
	HasSatisfiedChild                        = 11,
	Custom                                   = 12,
	EDlgConditionType_MAX                    = 13,
};

// Enum DlgSystem.EDlgOperation
// NumValues: 0x0009
enum class EDlgOperation : uint8
{
	Equal                                    = 0,
	NotEqual                                 = 1,
	Less                                     = 2,
	LessOrEqual                              = 3,
	Greater                                  = 4,
	GreaterOrEqual                           = 5,
	BitContain                               = 6,
	BitNotContain                            = 7,
	EDlgOperation_MAX                        = 8,
};

// Enum DlgSystem.EDlgCompare
// NumValues: 0x0004
enum class EDlgCompare : uint8
{
	ToConst                                  = 0,
	ToVariable                               = 1,
	ToClassVariable                          = 2,
	EDlgCompare_MAX                          = 3,
};

// Enum DlgSystem.EDlgValidateStatus
// NumValues: 0x0006
enum class EDlgValidateStatus : uint8
{
	Valid                                    = 0,
	ParticipantIsNull                        = 1,
	DialogueIsNull                           = 2,
	ParticipantDoesNotImplementInterface     = 3,
	ParticipantIsABlueprintClassAndDoesNotImplementInterface = 4,
	EDlgValidateStatus_MAX                   = 5,
};

// Enum DlgSystem.EDlgType
// NumValues: 0x0005
enum class EDlgType : uint8
{
	Dialogue                                 = 0,
	SideDialogue                             = 1,
	Interaction                              = 2,
	GalGame                                  = 3,
	EDlgType_MAX                             = 4,
};

// Enum DlgSystem.EDlgEventType
// NumValues: 0x000C
enum class EDlgEventType : uint8
{
	Event                                    = 0,
	ModifyInt                                = 1,
	ModifyFloat                              = 2,
	ModifyBool                               = 3,
	ModifyName                               = 4,
	ModifyClassIntVariable                   = 5,
	ModifyClassFloatVariable                 = 6,
	ModifyClassBoolVariable                  = 7,
	ModifyClassNameVariable                  = 8,
	Custom                                   = 9,
	UnrealFunction                           = 10,
	EDlgEventType_MAX                        = 11,
};

// Enum DlgSystem.EDlgTestEnum
// NumValues: 0x0005
enum class EDlgTestEnum : uint8
{
	First                                    = 0,
	Second                                   = 1,
	Third                                    = 2,
	NumOf                                    = 3,
	EDlgTestEnum_MAX                         = 4,
};

// Enum DlgSystem.EDlgEntryRestriction
// NumValues: 0x0004
enum class EDlgEntryRestriction : uint8
{
	None                                     = 0,
	OncePerContext                           = 1,
	Once                                     = 2,
	EDlgEntryRestriction_MAX                 = 3,
};

// Enum DlgSystem.EDlgNodeSelectorType
// NumValues: 0x0003
enum class EDlgNodeSelectorType : uint8
{
	First                                    = 0,
	Random                                   = 1,
	EDlgNodeSelectorType_MAX                 = 2,
};

// Enum DlgSystem.EDlgDialogueTextFormat
// NumValues: 0x0007
enum class EDlgDialogueTextFormat : uint8
{
	None                                     = 0,
	All                                      = 1,
	DialogueDEPRECATED                       = 2,
	StartTextFormats                         = 2,
	JSON                                     = 3,
	NumTextFormats                           = 4,
	EDlgDialogueTextFormat_MAX               = 5,
};

// Enum DlgSystem.EDlgVoiceDisplayedFields
// NumValues: 0x0005
enum class EDlgVoiceDisplayedFields : uint8
{
	None                                     = 0,
	SoundWave                                = 1,
	DialogueWave                             = 2,
	SoundWaveAndDialogueWave                 = 3,
	EDlgVoiceDisplayedFields_MAX             = 4,
};

// Enum DlgSystem.EDlgSpeakerStateVisibility
// NumValues: 0x0005
enum class EDlgSpeakerStateVisibility : uint8
{
	HideAll                                  = 0,
	ShowOnEdge                               = 1,
	ShowOnNode                               = 2,
	ShowOnNodeAndEdge                        = 3,
	EDlgSpeakerStateVisibility_MAX           = 4,
};

// Enum DlgSystem.EDlgTextInputKeyForNewLine
// NumValues: 0x0003
enum class EDlgTextInputKeyForNewLine : uint8
{
	Enter                                    = 0,
	ShiftPlusEnter                           = 1,
	EDlgTextInputKeyForNewLine_MAX           = 2,
};

// Enum DlgSystem.EDlgTextNamespaceLocalization
// NumValues: 0x0005
enum class EDlgTextNamespaceLocalization : uint8
{
	Ignore                                   = 0,
	PerDialogue                              = 1,
	WithPrefixPerDialogue                    = 2,
	Global                                   = 3,
	EDlgTextNamespaceLocalization_MAX        = 4,
};

// Enum DlgSystem.EDlgClassPickerDisplayMode
// NumValues: 0x0004
enum class EDlgClassPickerDisplayMode : uint8
{
	DefaultView                              = 0,
	TreeView                                 = 1,
	ListView                                 = 2,
	EDlgClassPickerDisplayMode_MAX           = 3,
};

// Enum DlgSystem.EDlgNoSatisfiedChildBehavior
// NumValues: 0x0004
enum class EDlgNoSatisfiedChildBehavior : uint8
{
	PrintErrorAndEndDialogue                 = 0,
	EndDialogue                              = 1,
	ContinueDialogue                         = 2,
	EDlgNoSatisfiedChildBehavior_MAX         = 3,
};

// Enum DlgSystem.EDlgTextArgumentType
// NumValues: 0x0009
enum class EDlgTextArgumentType : uint8
{
	DisplayName                              = 0,
	Gender                                   = 1,
	DialogueInt                              = 2,
	DialogueFloat                            = 3,
	ClassInt                                 = 4,
	ClassFloat                               = 5,
	ClassText                                = 6,
	Custom                                   = 7,
	EDlgTextArgumentType_MAX                 = 8,
};

// Enum DlgSystem.ENYLoggerLogLevel
// NumValues: 0x0007
enum class ENYLoggerLogLevel : uint8
{
	NoLogging                                = 0,
	Error                                    = 1,
	Warning                                  = 2,
	Info                                     = 3,
	Debug                                    = 4,
	Trace                                    = 5,
	ENYLoggerLogLevel_MAX                    = 6,
};

// ScriptStruct DlgSystem.DlgBGMConfig
// 0x0050 (0x0050 - 0x0000)
struct FDlgBGMConfig final
{
public:
	class FName                                   TempBGMID;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StopBGM;                                           // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DelayStopTime;                                     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        BGMStateValueTemplate;                             // 0x0010(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        BGMTriggerTemplate;                                // 0x0030(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDlgBGMConfig) == 0x000004, "Wrong alignment on FDlgBGMConfig");
static_assert(sizeof(FDlgBGMConfig) == 0x000050, "Wrong size on FDlgBGMConfig");
static_assert(offsetof(FDlgBGMConfig, TempBGMID) == 0x000000, "Member 'FDlgBGMConfig::TempBGMID' has a wrong offset!");
static_assert(offsetof(FDlgBGMConfig, StopBGM) == 0x000008, "Member 'FDlgBGMConfig::StopBGM' has a wrong offset!");
static_assert(offsetof(FDlgBGMConfig, DelayStopTime) == 0x00000C, "Member 'FDlgBGMConfig::DelayStopTime' has a wrong offset!");
static_assert(offsetof(FDlgBGMConfig, BGMStateValueTemplate) == 0x000010, "Member 'FDlgBGMConfig::BGMStateValueTemplate' has a wrong offset!");
static_assert(offsetof(FDlgBGMConfig, BGMTriggerTemplate) == 0x000030, "Member 'FDlgBGMConfig::BGMTriggerTemplate' has a wrong offset!");

// ScriptStruct DlgSystem.DlgCamera
// 0x0024 (0x0024 - 0x0000)
struct FDlgCamera final
{
public:
	bool                                          bCameraActor;                                      // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayer;                                           // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CameraOwnerName;                                   // 0x0004(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CameraName;                                        // 0x000C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MaleCameraName;                                    // 0x0014(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MotionBlurAmount;                                  // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCameraDirForCharacterLight;                       // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDlgCamera) == 0x000004, "Wrong alignment on FDlgCamera");
static_assert(sizeof(FDlgCamera) == 0x000024, "Wrong size on FDlgCamera");
static_assert(offsetof(FDlgCamera, bCameraActor) == 0x000000, "Member 'FDlgCamera::bCameraActor' has a wrong offset!");
static_assert(offsetof(FDlgCamera, bPlayer) == 0x000001, "Member 'FDlgCamera::bPlayer' has a wrong offset!");
static_assert(offsetof(FDlgCamera, CameraOwnerName) == 0x000004, "Member 'FDlgCamera::CameraOwnerName' has a wrong offset!");
static_assert(offsetof(FDlgCamera, CameraName) == 0x00000C, "Member 'FDlgCamera::CameraName' has a wrong offset!");
static_assert(offsetof(FDlgCamera, MaleCameraName) == 0x000014, "Member 'FDlgCamera::MaleCameraName' has a wrong offset!");
static_assert(offsetof(FDlgCamera, MotionBlurAmount) == 0x00001C, "Member 'FDlgCamera::MotionBlurAmount' has a wrong offset!");
static_assert(offsetof(FDlgCamera, bCameraDirForCharacterLight) == 0x000020, "Member 'FDlgCamera::bCameraDirForCharacterLight' has a wrong offset!");

// ScriptStruct DlgSystem.DlgCameraConfig
// 0x0058 (0x0058 - 0x0000)
struct FDlgCameraConfig final
{
public:
	struct FDlgCamera                             Camera1;                                           // 0x0000(0x0024)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bCameraBlend;                                      // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDlgCamera                             Camera2;                                           // 0x0028(0x0024)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         BlendTime;                                         // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EViewTargetBlendFunction                      BlendFunc;                                         // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendExp;                                          // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDlgCameraConfig) == 0x000004, "Wrong alignment on FDlgCameraConfig");
static_assert(sizeof(FDlgCameraConfig) == 0x000058, "Wrong size on FDlgCameraConfig");
static_assert(offsetof(FDlgCameraConfig, Camera1) == 0x000000, "Member 'FDlgCameraConfig::Camera1' has a wrong offset!");
static_assert(offsetof(FDlgCameraConfig, bCameraBlend) == 0x000024, "Member 'FDlgCameraConfig::bCameraBlend' has a wrong offset!");
static_assert(offsetof(FDlgCameraConfig, Camera2) == 0x000028, "Member 'FDlgCameraConfig::Camera2' has a wrong offset!");
static_assert(offsetof(FDlgCameraConfig, BlendTime) == 0x00004C, "Member 'FDlgCameraConfig::BlendTime' has a wrong offset!");
static_assert(offsetof(FDlgCameraConfig, BlendFunc) == 0x000050, "Member 'FDlgCameraConfig::BlendFunc' has a wrong offset!");
static_assert(offsetof(FDlgCameraConfig, BlendExp) == 0x000054, "Member 'FDlgCameraConfig::BlendExp' has a wrong offset!");

// ScriptStruct DlgSystem.DlgMidCameraConfig
// 0x0038 (0x0038 - 0x0000)
struct FDlgMidCameraConfig final
{
public:
	struct FDlgCamera                             Camera;                                            // 0x0000(0x0024)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         BlendTime;                                         // 0x0024(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EViewTargetBlendFunction                      BlendFunc;                                         // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendExp;                                          // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaittingTime;                                      // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceWait;                                        // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDlgMidCameraConfig) == 0x000004, "Wrong alignment on FDlgMidCameraConfig");
static_assert(sizeof(FDlgMidCameraConfig) == 0x000038, "Wrong size on FDlgMidCameraConfig");
static_assert(offsetof(FDlgMidCameraConfig, Camera) == 0x000000, "Member 'FDlgMidCameraConfig::Camera' has a wrong offset!");
static_assert(offsetof(FDlgMidCameraConfig, BlendTime) == 0x000024, "Member 'FDlgMidCameraConfig::BlendTime' has a wrong offset!");
static_assert(offsetof(FDlgMidCameraConfig, BlendFunc) == 0x000028, "Member 'FDlgMidCameraConfig::BlendFunc' has a wrong offset!");
static_assert(offsetof(FDlgMidCameraConfig, BlendExp) == 0x00002C, "Member 'FDlgMidCameraConfig::BlendExp' has a wrong offset!");
static_assert(offsetof(FDlgMidCameraConfig, WaittingTime) == 0x000030, "Member 'FDlgMidCameraConfig::WaittingTime' has a wrong offset!");
static_assert(offsetof(FDlgMidCameraConfig, bForceWait) == 0x000034, "Member 'FDlgMidCameraConfig::bForceWait' has a wrong offset!");

// ScriptStruct DlgSystem.DlgCameraFade
// 0x0024 (0x0024 - 0x0000)
struct FDlgCameraFade final
{
public:
	float                                         FromAlpha;                                         // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ToAlpha;                                           // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InFadeTime;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           InFadeColor;                                       // 0x000C(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndStayTime;                                       // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeOutTime;                                       // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDlgCameraFade) == 0x000004, "Wrong alignment on FDlgCameraFade");
static_assert(sizeof(FDlgCameraFade) == 0x000024, "Wrong size on FDlgCameraFade");
static_assert(offsetof(FDlgCameraFade, FromAlpha) == 0x000000, "Member 'FDlgCameraFade::FromAlpha' has a wrong offset!");
static_assert(offsetof(FDlgCameraFade, ToAlpha) == 0x000004, "Member 'FDlgCameraFade::ToAlpha' has a wrong offset!");
static_assert(offsetof(FDlgCameraFade, InFadeTime) == 0x000008, "Member 'FDlgCameraFade::InFadeTime' has a wrong offset!");
static_assert(offsetof(FDlgCameraFade, InFadeColor) == 0x00000C, "Member 'FDlgCameraFade::InFadeColor' has a wrong offset!");
static_assert(offsetof(FDlgCameraFade, EndStayTime) == 0x00001C, "Member 'FDlgCameraFade::EndStayTime' has a wrong offset!");
static_assert(offsetof(FDlgCameraFade, FadeOutTime) == 0x000020, "Member 'FDlgCameraFade::FadeOutTime' has a wrong offset!");

// ScriptStruct DlgSystem.DlgCondition
// 0x0058 (0x0058 - 0x0000)
struct FDlgCondition final
{
public:
	EDlgConditionStrength                         strength;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDlgConditionType                             ConditionType;                                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ParticipantName;                                   // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CallbackName;                                      // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDlgOperation                                 Operation;                                         // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDlgCompare                                   CompareType;                                       // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   OtherParticipantName;                              // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OtherVariableName;                                 // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IntValue;                                          // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatValue;                                        // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NameValue;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBoolValue;                                        // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLongTermMemory;                                   // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  Guid;                                              // 0x003C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDlgConditionCustom*                    CustomCondition;                                   // 0x0050(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDlgCondition) == 0x000008, "Wrong alignment on FDlgCondition");
static_assert(sizeof(FDlgCondition) == 0x000058, "Wrong size on FDlgCondition");
static_assert(offsetof(FDlgCondition, strength) == 0x000000, "Member 'FDlgCondition::strength' has a wrong offset!");
static_assert(offsetof(FDlgCondition, ConditionType) == 0x000001, "Member 'FDlgCondition::ConditionType' has a wrong offset!");
static_assert(offsetof(FDlgCondition, ParticipantName) == 0x000004, "Member 'FDlgCondition::ParticipantName' has a wrong offset!");
static_assert(offsetof(FDlgCondition, CallbackName) == 0x00000C, "Member 'FDlgCondition::CallbackName' has a wrong offset!");
static_assert(offsetof(FDlgCondition, Operation) == 0x000014, "Member 'FDlgCondition::Operation' has a wrong offset!");
static_assert(offsetof(FDlgCondition, CompareType) == 0x000015, "Member 'FDlgCondition::CompareType' has a wrong offset!");
static_assert(offsetof(FDlgCondition, OtherParticipantName) == 0x000018, "Member 'FDlgCondition::OtherParticipantName' has a wrong offset!");
static_assert(offsetof(FDlgCondition, OtherVariableName) == 0x000020, "Member 'FDlgCondition::OtherVariableName' has a wrong offset!");
static_assert(offsetof(FDlgCondition, IntValue) == 0x000028, "Member 'FDlgCondition::IntValue' has a wrong offset!");
static_assert(offsetof(FDlgCondition, FloatValue) == 0x00002C, "Member 'FDlgCondition::FloatValue' has a wrong offset!");
static_assert(offsetof(FDlgCondition, NameValue) == 0x000030, "Member 'FDlgCondition::NameValue' has a wrong offset!");
static_assert(offsetof(FDlgCondition, bBoolValue) == 0x000038, "Member 'FDlgCondition::bBoolValue' has a wrong offset!");
static_assert(offsetof(FDlgCondition, bLongTermMemory) == 0x000039, "Member 'FDlgCondition::bLongTermMemory' has a wrong offset!");
static_assert(offsetof(FDlgCondition, Guid) == 0x00003C, "Member 'FDlgCondition::Guid' has a wrong offset!");
static_assert(offsetof(FDlgCondition, CustomCondition) == 0x000050, "Member 'FDlgCondition::CustomCondition' has a wrong offset!");

// ScriptStruct DlgSystem.DlgTextArgument
// 0x0030 (0x0030 - 0x0000)
struct FDlgTextArgument final
{
public:
	class FString                                 DisplayString;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDlgTextArgumentType                          Type;                                              // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ParticipantName;                                   // 0x0014(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VariableName;                                      // 0x001C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDlgTextArgumentCustom*                 CustomTextArgument;                                // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDlgTextArgument) == 0x000008, "Wrong alignment on FDlgTextArgument");
static_assert(sizeof(FDlgTextArgument) == 0x000030, "Wrong size on FDlgTextArgument");
static_assert(offsetof(FDlgTextArgument, DisplayString) == 0x000000, "Member 'FDlgTextArgument::DisplayString' has a wrong offset!");
static_assert(offsetof(FDlgTextArgument, Type) == 0x000010, "Member 'FDlgTextArgument::Type' has a wrong offset!");
static_assert(offsetof(FDlgTextArgument, ParticipantName) == 0x000014, "Member 'FDlgTextArgument::ParticipantName' has a wrong offset!");
static_assert(offsetof(FDlgTextArgument, VariableName) == 0x00001C, "Member 'FDlgTextArgument::VariableName' has a wrong offset!");
static_assert(offsetof(FDlgTextArgument, CustomTextArgument) == 0x000028, "Member 'FDlgTextArgument::CustomTextArgument' has a wrong offset!");

// ScriptStruct DlgSystem.DlgEdge
// 0x00F0 (0x00F0 - 0x0000)
struct FDlgEdge final
{
public:
	int32                                         TargetIndex;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EdgeIndex;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDlgCondition>                  Conditions;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class FName                                   SpeakerState;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeInAllOptionListIfUnsatisfied;              // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDlgNodeData*                           EdgeData;                                          // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceShow;                                        // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              OptionIcon;                                        // 0x0038(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              OptionBottom;                                      // 0x0060(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWidgetTransform                       OptionRenderTransform;                             // 0x0088(0x0038)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class FText                                   Text;                                              // 0x00C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDlgTextArgument>               TextArguments;                                     // 0x00D0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_E0[0x10];                                      // 0x00E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDlgEdge) == 0x000008, "Wrong alignment on FDlgEdge");
static_assert(sizeof(FDlgEdge) == 0x0000F0, "Wrong size on FDlgEdge");
static_assert(offsetof(FDlgEdge, TargetIndex) == 0x000000, "Member 'FDlgEdge::TargetIndex' has a wrong offset!");
static_assert(offsetof(FDlgEdge, EdgeIndex) == 0x000004, "Member 'FDlgEdge::EdgeIndex' has a wrong offset!");
static_assert(offsetof(FDlgEdge, Conditions) == 0x000008, "Member 'FDlgEdge::Conditions' has a wrong offset!");
static_assert(offsetof(FDlgEdge, SpeakerState) == 0x000018, "Member 'FDlgEdge::SpeakerState' has a wrong offset!");
static_assert(offsetof(FDlgEdge, bIncludeInAllOptionListIfUnsatisfied) == 0x000020, "Member 'FDlgEdge::bIncludeInAllOptionListIfUnsatisfied' has a wrong offset!");
static_assert(offsetof(FDlgEdge, EdgeData) == 0x000028, "Member 'FDlgEdge::EdgeData' has a wrong offset!");
static_assert(offsetof(FDlgEdge, bForceShow) == 0x000030, "Member 'FDlgEdge::bForceShow' has a wrong offset!");
static_assert(offsetof(FDlgEdge, OptionIcon) == 0x000038, "Member 'FDlgEdge::OptionIcon' has a wrong offset!");
static_assert(offsetof(FDlgEdge, OptionBottom) == 0x000060, "Member 'FDlgEdge::OptionBottom' has a wrong offset!");
static_assert(offsetof(FDlgEdge, OptionRenderTransform) == 0x000088, "Member 'FDlgEdge::OptionRenderTransform' has a wrong offset!");
static_assert(offsetof(FDlgEdge, Text) == 0x0000C0, "Member 'FDlgEdge::Text' has a wrong offset!");
static_assert(offsetof(FDlgEdge, TextArguments) == 0x0000D0, "Member 'FDlgEdge::TextArguments' has a wrong offset!");

// ScriptStruct DlgSystem.DlgEdgeData
// 0x00F8 (0x00F8 - 0x0000)
struct FDlgEdgeData final
{
public:
	bool                                          bSatisfied;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDlgEdge                               Edge;                                              // 0x0008(0x00F0)(BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
};
static_assert(alignof(FDlgEdgeData) == 0x000001, "Wrong alignment on FDlgEdgeData");
static_assert(sizeof(FDlgEdgeData) == 0x0000F8, "Wrong size on FDlgEdgeData");
static_assert(offsetof(FDlgEdgeData, bSatisfied) == 0x000000, "Member 'FDlgEdgeData::bSatisfied' has a wrong offset!");
static_assert(offsetof(FDlgEdgeData, Edge) == 0x000008, "Member 'FDlgEdgeData::Edge' has a wrong offset!");

// ScriptStruct DlgSystem.DlgNodeInfo
// 0x00C0 (0x00C8 - 0x0008)
struct FDlgNodeInfo final : public FTableRowBase
{
public:
	int32                                         Index;                                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParentNode;                                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NpcID;                                             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsSelfTalk;                                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DlgTextTablePath;                                  // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DlgTextKey;                                        // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DlgTextSource;                                     // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DlgSelfNameTablePath;                              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DlgSelfNameKey;                                    // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DlgSelfNameSource;                                 // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DlgSpeakerNameTablePath;                           // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DlgSpeakerNameKey;                                 // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DlgSpeakerNameSource;                              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DlgComment;                                        // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDlgNodeInfo) == 0x000008, "Wrong alignment on FDlgNodeInfo");
static_assert(sizeof(FDlgNodeInfo) == 0x0000C8, "Wrong size on FDlgNodeInfo");
static_assert(offsetof(FDlgNodeInfo, Index) == 0x000008, "Member 'FDlgNodeInfo::Index' has a wrong offset!");
static_assert(offsetof(FDlgNodeInfo, ParentNode) == 0x00000C, "Member 'FDlgNodeInfo::ParentNode' has a wrong offset!");
static_assert(offsetof(FDlgNodeInfo, NpcID) == 0x000010, "Member 'FDlgNodeInfo::NpcID' has a wrong offset!");
static_assert(offsetof(FDlgNodeInfo, IsSelfTalk) == 0x000020, "Member 'FDlgNodeInfo::IsSelfTalk' has a wrong offset!");
static_assert(offsetof(FDlgNodeInfo, DlgTextTablePath) == 0x000028, "Member 'FDlgNodeInfo::DlgTextTablePath' has a wrong offset!");
static_assert(offsetof(FDlgNodeInfo, DlgTextKey) == 0x000038, "Member 'FDlgNodeInfo::DlgTextKey' has a wrong offset!");
static_assert(offsetof(FDlgNodeInfo, DlgTextSource) == 0x000048, "Member 'FDlgNodeInfo::DlgTextSource' has a wrong offset!");
static_assert(offsetof(FDlgNodeInfo, DlgSelfNameTablePath) == 0x000058, "Member 'FDlgNodeInfo::DlgSelfNameTablePath' has a wrong offset!");
static_assert(offsetof(FDlgNodeInfo, DlgSelfNameKey) == 0x000068, "Member 'FDlgNodeInfo::DlgSelfNameKey' has a wrong offset!");
static_assert(offsetof(FDlgNodeInfo, DlgSelfNameSource) == 0x000078, "Member 'FDlgNodeInfo::DlgSelfNameSource' has a wrong offset!");
static_assert(offsetof(FDlgNodeInfo, DlgSpeakerNameTablePath) == 0x000088, "Member 'FDlgNodeInfo::DlgSpeakerNameTablePath' has a wrong offset!");
static_assert(offsetof(FDlgNodeInfo, DlgSpeakerNameKey) == 0x000098, "Member 'FDlgNodeInfo::DlgSpeakerNameKey' has a wrong offset!");
static_assert(offsetof(FDlgNodeInfo, DlgSpeakerNameSource) == 0x0000A8, "Member 'FDlgNodeInfo::DlgSpeakerNameSource' has a wrong offset!");
static_assert(offsetof(FDlgNodeInfo, DlgComment) == 0x0000B8, "Member 'FDlgNodeInfo::DlgComment' has a wrong offset!");

// ScriptStruct DlgSystem.DlgParticipantClass
// 0x0010 (0x0010 - 0x0000)
struct FDlgParticipantClass final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ParticipantClass;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDlgParticipantClass) == 0x000008, "Wrong alignment on FDlgParticipantClass");
static_assert(sizeof(FDlgParticipantClass) == 0x000010, "Wrong size on FDlgParticipantClass");
static_assert(offsetof(FDlgParticipantClass, ParticipantName) == 0x000000, "Member 'FDlgParticipantClass::ParticipantName' has a wrong offset!");
static_assert(offsetof(FDlgParticipantClass, ParticipantClass) == 0x000008, "Member 'FDlgParticipantClass::ParticipantClass' has a wrong offset!");

// ScriptStruct DlgSystem.DlgParticipantData
// 0x04B0 (0x04B0 - 0x0000)
struct FDlgParticipantData final
{
public:
	TSet<class FName>                             Conditions;                                        // 0x0000(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class UClass*>                           CustomConditions;                                  // 0x0050(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class FName>                             Events;                                            // 0x00A0(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class FName>                             UnrealFunctions;                                   // 0x00F0(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class UClass*>                           CustomEvents;                                      // 0x0140(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class UClass*>                           CustomTextArguments;                               // 0x0190(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class FName>                             IntVariableNames;                                  // 0x01E0(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class FName>                             FloatVariableNames;                                // 0x0230(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class FName>                             BoolVariableNames;                                 // 0x0280(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class FName>                             NameVariableNames;                                 // 0x02D0(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class FName>                             ClassIntVariableNames;                             // 0x0320(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class FName>                             ClassFloatVariableNames;                           // 0x0370(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class FName>                             ClassBoolVariableNames;                            // 0x03C0(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class FName>                             ClassNameVariableNames;                            // 0x0410(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class FName>                             ClassTextVariableNames;                            // 0x0460(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDlgParticipantData) == 0x000008, "Wrong alignment on FDlgParticipantData");
static_assert(sizeof(FDlgParticipantData) == 0x0004B0, "Wrong size on FDlgParticipantData");
static_assert(offsetof(FDlgParticipantData, Conditions) == 0x000000, "Member 'FDlgParticipantData::Conditions' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, CustomConditions) == 0x000050, "Member 'FDlgParticipantData::CustomConditions' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, Events) == 0x0000A0, "Member 'FDlgParticipantData::Events' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, UnrealFunctions) == 0x0000F0, "Member 'FDlgParticipantData::UnrealFunctions' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, CustomEvents) == 0x000140, "Member 'FDlgParticipantData::CustomEvents' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, CustomTextArguments) == 0x000190, "Member 'FDlgParticipantData::CustomTextArguments' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, IntVariableNames) == 0x0001E0, "Member 'FDlgParticipantData::IntVariableNames' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, FloatVariableNames) == 0x000230, "Member 'FDlgParticipantData::FloatVariableNames' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, BoolVariableNames) == 0x000280, "Member 'FDlgParticipantData::BoolVariableNames' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, NameVariableNames) == 0x0002D0, "Member 'FDlgParticipantData::NameVariableNames' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, ClassIntVariableNames) == 0x000320, "Member 'FDlgParticipantData::ClassIntVariableNames' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, ClassFloatVariableNames) == 0x000370, "Member 'FDlgParticipantData::ClassFloatVariableNames' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, ClassBoolVariableNames) == 0x0003C0, "Member 'FDlgParticipantData::ClassBoolVariableNames' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, ClassNameVariableNames) == 0x000410, "Member 'FDlgParticipantData::ClassNameVariableNames' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, ClassTextVariableNames) == 0x000460, "Member 'FDlgParticipantData::ClassTextVariableNames' has a wrong offset!");

// ScriptStruct DlgSystem.DlgEvent
// 0x0030 (0x0030 - 0x0000)
struct FDlgEvent final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDlgEventType                                 EventType;                                         // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   EventName;                                         // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IntValue;                                          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatValue;                                        // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NameValue;                                         // 0x001C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDelta;                                            // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValue;                                            // 0x0025(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UDlgEventCustom*                        CustomEvent;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDlgEvent) == 0x000008, "Wrong alignment on FDlgEvent");
static_assert(sizeof(FDlgEvent) == 0x000030, "Wrong size on FDlgEvent");
static_assert(offsetof(FDlgEvent, ParticipantName) == 0x000000, "Member 'FDlgEvent::ParticipantName' has a wrong offset!");
static_assert(offsetof(FDlgEvent, EventType) == 0x000008, "Member 'FDlgEvent::EventType' has a wrong offset!");
static_assert(offsetof(FDlgEvent, EventName) == 0x00000C, "Member 'FDlgEvent::EventName' has a wrong offset!");
static_assert(offsetof(FDlgEvent, IntValue) == 0x000014, "Member 'FDlgEvent::IntValue' has a wrong offset!");
static_assert(offsetof(FDlgEvent, FloatValue) == 0x000018, "Member 'FDlgEvent::FloatValue' has a wrong offset!");
static_assert(offsetof(FDlgEvent, NameValue) == 0x00001C, "Member 'FDlgEvent::NameValue' has a wrong offset!");
static_assert(offsetof(FDlgEvent, bDelta) == 0x000024, "Member 'FDlgEvent::bDelta' has a wrong offset!");
static_assert(offsetof(FDlgEvent, bValue) == 0x000025, "Member 'FDlgEvent::bValue' has a wrong offset!");
static_assert(offsetof(FDlgEvent, CustomEvent) == 0x000028, "Member 'FDlgEvent::CustomEvent' has a wrong offset!");

// ScriptStruct DlgSystem.DlgClassAndObject
// 0x0010 (0x0010 - 0x0000)
struct FDlgClassAndObject final
{
public:
	class UClass*                                 Class;                                             // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Object;                                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDlgClassAndObject) == 0x000008, "Wrong alignment on FDlgClassAndObject");
static_assert(sizeof(FDlgClassAndObject) == 0x000010, "Wrong size on FDlgClassAndObject");
static_assert(offsetof(FDlgClassAndObject, Class) == 0x000000, "Member 'FDlgClassAndObject::Class' has a wrong offset!");
static_assert(offsetof(FDlgClassAndObject, Object) == 0x000008, "Member 'FDlgClassAndObject::Object' has a wrong offset!");

// ScriptStruct DlgSystem.DlgIOTesterOptions
// 0x0005 (0x0005 - 0x0000)
struct FDlgIOTesterOptions final
{
public:
	bool                                          bSupportsPureEnumContainer;                        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSupportsNonPrimitiveInSet;                        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSupportsColorPrimitives;                          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSupportsDatePrimitive;                            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSupportsUObjectValueInMap;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDlgIOTesterOptions) == 0x000001, "Wrong alignment on FDlgIOTesterOptions");
static_assert(sizeof(FDlgIOTesterOptions) == 0x000005, "Wrong size on FDlgIOTesterOptions");
static_assert(offsetof(FDlgIOTesterOptions, bSupportsPureEnumContainer) == 0x000000, "Member 'FDlgIOTesterOptions::bSupportsPureEnumContainer' has a wrong offset!");
static_assert(offsetof(FDlgIOTesterOptions, bSupportsNonPrimitiveInSet) == 0x000001, "Member 'FDlgIOTesterOptions::bSupportsNonPrimitiveInSet' has a wrong offset!");
static_assert(offsetof(FDlgIOTesterOptions, bSupportsColorPrimitives) == 0x000002, "Member 'FDlgIOTesterOptions::bSupportsColorPrimitives' has a wrong offset!");
static_assert(offsetof(FDlgIOTesterOptions, bSupportsDatePrimitive) == 0x000003, "Member 'FDlgIOTesterOptions::bSupportsDatePrimitive' has a wrong offset!");
static_assert(offsetof(FDlgIOTesterOptions, bSupportsUObjectValueInMap) == 0x000004, "Member 'FDlgIOTesterOptions::bSupportsUObjectValueInMap' has a wrong offset!");

// ScriptStruct DlgSystem.DlgTestStructPrimitives
// 0x0250 (0x0250 - 0x0000)
struct FDlgTestStructPrimitives final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Integer32;                                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Integer64;                                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBoolean;                                          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDlgTestEnum                                  Enum;                                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         float_0;                                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 String;                                            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EmptyString;                                       // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Text;                                              // 0x0048(0x0010)(NativeAccessSpecifierPublic)
	struct FColor                                 Color;                                             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           LinearColor;                                       // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              DateTime;                                          // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              IntPoint;                                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Vector3;                                           // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Vector2;                                           // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               Vector4;                                           // 0x00B0(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotator;                                           // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatrix                                Matrix;                                            // 0x00F0(0x0080)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             Transform;                                         // 0x0170(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x01D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 Class;                                             // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                EmptyObjectInitialized;                            // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                EmptyObjectInitializedReference;                   // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             ConstTexture2D;                                    // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             Texture2DReference;                                // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDlgTestObjectPrimitivesBase*           ObjectPrimitivesBase;                              // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
