#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicRoadKit

#include "Basic.hpp"

#include "ZoneGraph_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum DynamicRoadKit.EMeshPlacementPathMode
// NumValues: 0x0004
enum class EMeshPlacementPathMode : uint8
{
	CenterPath                               = 0,
	RightBoundaryPath                        = 1,
	LeftBoundaryPath                         = 2,
	EMeshPlacementPathMode_MAX               = 3,
};

// Enum DynamicRoadKit.ERoadGraphElementType
// NumValues: 0x0003
enum class ERoadGraphElementType : uint8
{
	Segment                                  = 0,
	Node                                     = 1,
	ERoadGraphElementType_MAX                = 2,
};

// Enum DynamicRoadKit.ERoadEndLockType
// NumValues: 0x0004
enum class ERoadEndLockType : uint8
{
	None                                     = 0,
	Node                                     = 1,
	PrefabSlot                               = 2,
	ERoadEndLockType_MAX                     = 3,
};

// Enum DynamicRoadKit.ERoadSegmentType
// NumValues: 0x0007
enum class ERoadSegmentType : uint8
{
	Trunk                                    = 0,
	TrunkIntersection                        = 1,
	LeftSide                                 = 2,
	RightSide                                = 3,
	SideIntersection                         = 4,
	CrosswalkIntersection                    = 5,
	ERoadSegmentType_MAX                     = 6,
};

// Enum DynamicRoadKit.FRoadType
// NumValues: 0x0003
enum class EFRoadType : uint8
{
	TrunkRoad                                = 0,
	Sidewalk                                 = 1,
	FRoadType_MAX                            = 2,
};

// Enum DynamicRoadKit.EDecorationMethod
// NumValues: 0x0005
enum class EDecorationMethod : uint8
{
	Single                                   = 0,
	Random                                   = 1,
	Sequential                               = 2,
	StartAndEnd                              = 3,
	EDecorationMethod_MAX                    = 4,
};

// Enum DynamicRoadKit.EMeshPlacementMode
// NumValues: 0x0005
enum class EMeshPlacementMode : uint8
{
	EvenlyDistributed                        = 0,
	Start                                    = 1,
	End                                      = 2,
	StartAndEnd                              = 3,
	EMeshPlacementMode_MAX                   = 4,
};

// Enum DynamicRoadKit.ELaneDirection
// NumValues: 0x0004
enum class ELaneDirection : uint8
{
	None                                     = 0,
	Forward                                  = 1,
	Backward                                 = 2,
	ELaneDirection_MAX                       = 3,
};

// Enum DynamicRoadKit.ELinkRoadType
// NumValues: 0x0003
enum class ELinkRoadType : uint8
{
	TrunkRoad                                = 0,
	SideRoad                                 = 1,
	ELinkRoadType_MAX                        = 2,
};

// Enum DynamicRoadKit.EPointType
// NumValues: 0x0003
enum class EPointType : uint8
{
	Linear                                   = 0,
	Curve                                    = 1,
	EPointType_MAX                           = 2,
};

// Enum DynamicRoadKit.ERoadEdge
// NumValues: 0x0003
enum class ERoadEdge : uint8
{
	Left                                     = 0,
	Right                                    = 1,
	ERoadEdge_MAX                            = 2,
};

// Enum DynamicRoadKit.ERoadMeshType
// NumValues: 0x0004
enum class ERoadMeshType : uint8
{
	SplineMesh                               = 0,
	SweepPolylineMesh                        = 1,
	TriangulatedPolygonMesh                  = 2,
	ERoadMeshType_MAX                        = 3,
};

// Enum DynamicRoadKit.ERoadGeneratorType
// NumValues: 0x0005
enum class ERoadGeneratorType : uint8
{
	TrunkRoad                                = 0,
	LeftSideRoad                             = 1,
	RightSideRoad                            = 2,
	IntersectionRoad                         = 3,
	ERoadGeneratorType_MAX                   = 4,
};

// Enum DynamicRoadKit.ERoadEditPointElement
// NumValues: 0x0004
enum class ERoadEditPointElement : uint8
{
	LaneLine                                 = 0,
	LaneIntervalPoint                        = 1,
	CustomPoint                              = 2,
	ERoadEditPointElement_MAX                = 3,
};

// Enum DynamicRoadKit.ERoadEditCurveType
// NumValues: 0x0004
enum class ERoadEditCurveType : uint8
{
	Bezier                                   = 0,
	Dubins                                   = 1,
	Straight                                 = 2,
	ERoadEditCurveType_MAX                   = 3,
};

// Enum DynamicRoadKit.ERoadEditSegmentStyleType
// NumValues: 0x0002
enum class ERoadEditSegmentStyleType : uint8
{
	StaticMesh                               = 0,
	ERoadEditSegmentStyleType_MAX            = 1,
};

// Enum DynamicRoadKit.ERoadEditSegmentGenerateType
// NumValues: 0x0003
enum class ERoadEditSegmentGenerateType : uint8
{
	NormalModel                              = 0,
	SplineMeshModel                          = 1,
	ERoadEditSegmentGenerateType_MAX         = 2,
};

// Enum DynamicRoadKit.ERoadIntersectionDecorationConnectionMode
// NumValues: 0x0003
enum class ERoadIntersectionDecorationConnectionMode : uint8
{
	Manual                                   = 0,
	ZoneShapeAuto                            = 1,
	ERoadIntersectionDecorationConnectionMode_MAX = 2,
};

// ScriptStruct DynamicRoadKit.RoadIntersectionDecorationLaneRow
// 0x0098 (0x0098 - 0x0000)
struct FRoadIntersectionDecorationLaneRow final
{
public:
	class FString                                 DisplayName;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERoadIntersectionDecorationConnectionMode     ConnectionMode;                                    // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERoadEditPointElement                         StartPointElement;                                 // 0x0011(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StartPointIndex;                                   // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERoadEditPointElement                         EndPointElement;                                   // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EndPointIndex;                                     // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERoadEditSegmentStyleType                     Style;                                             // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            StaticMesh;                                        // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERoadEditSegmentGenerateType                  GenerateType;                                      // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocalOffset;                                       // 0x0038(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeightOffset;                                      // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCastShadow;                                       // 0x0054(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERoadEditCurveType                            CurveType;                                         // 0x0055(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IntervalCm;                                        // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MeshXYZScale;                                      // 0x0060(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartParamOffset;                                  // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndParamOffset;                                    // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              SplineMeshYZScale;                                 // 0x0080(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DubinsInnerRadiusCm;                               // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSplineMeshFlipY;                                  // 0x0094(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRoadIntersectionDecorationLaneRow) == 0x000008, "Wrong alignment on FRoadIntersectionDecorationLaneRow");
static_assert(sizeof(FRoadIntersectionDecorationLaneRow) == 0x000098, "Wrong size on FRoadIntersectionDecorationLaneRow");
static_assert(offsetof(FRoadIntersectionDecorationLaneRow, DisplayName) == 0x000000, "Member 'FRoadIntersectionDecorationLaneRow::DisplayName' has a wrong offset!");
static_assert(offsetof(FRoadIntersectionDecorationLaneRow, ConnectionMode) == 0x000010, "Member 'FRoadIntersectionDecorationLaneRow::ConnectionMode' has a wrong offset!");
static_assert(offsetof(FRoadIntersectionDecorationLaneRow, StartPointElement) == 0x000011, "Member 'FRoadIntersectionDecorationLaneRow::StartPointElement' has a wrong offset!");
static_assert(offsetof(FRoadIntersectionDecorationLaneRow, StartPointIndex) == 0x000014, "Member 'FRoadIntersectionDecorationLaneRow::StartPointIndex' has a wrong offset!");
static_assert(offsetof(FRoadIntersectionDecorationLaneRow, EndPointElement) == 0x000018, "Member 'FRoadIntersectionDecorationLaneRow::EndPointElement' has a wrong offset!");
static_assert(offsetof(FRoadIntersectionDecorationLaneRow, EndPointIndex) == 0x00001C, "Member 'FRoadIntersectionDecorationLaneRow::EndPointIndex' has a wrong offset!");
static_assert(offsetof(FRoadIntersectionDecorationLaneRow, Style) == 0x000020, "Member 'FRoadIntersectionDecorationLaneRow::Style' has a wrong offset!");
static_assert(offsetof(FRoadIntersectionDecorationLaneRow, StaticMesh) == 0x000028, "Member 'FRoadIntersectionDecorationLaneRow::StaticMesh' has a wrong offset!");
static_assert(offsetof(FRoadIntersectionDecorationLaneRow, GenerateType) == 0x000030, "Member 'FRoadIntersectionDecorationLaneRow::GenerateType' has a wrong offset!");
static_assert(offsetof(FRoadIntersectionDecorationLaneRow, LocalOffset) == 0x000038, "Member 'FRoadIntersectionDecorationLaneRow::LocalOffset' has a wrong offset!");
static_assert(offsetof(FRoadIntersectionDecorationLaneRow, HeightOffset) == 0x000050, "Member 'FRoadIntersectionDecorationLaneRow::HeightOffset' has a wrong offset!");
static_assert(offsetof(FRoadIntersectionDecorationLaneRow, bCastShadow) == 0x000054, "Member 'FRoadIntersectionDecorationLaneRow::bCastShadow' has a wrong offset!");
static_assert(offsetof(FRoadIntersectionDecorationLaneRow, CurveType) == 0x000055, "Member 'FRoadIntersectionDecorationLaneRow::CurveType' has a wrong offset!");
static_assert(offsetof(FRoadIntersectionDecorationLaneRow, IntervalCm) == 0x000058, "Member 'FRoadIntersectionDecorationLaneRow::IntervalCm' has a wrong offset!");
static_assert(offsetof(FRoadIntersectionDecorationLaneRow, MeshXYZScale) == 0x000060, "Member 'FRoadIntersectionDecorationLaneRow::MeshXYZScale' has a wrong offset!");
static_assert(offsetof(FRoadIntersectionDecorationLaneRow, StartParamOffset) == 0x000078, "Member 'FRoadIntersectionDecorationLaneRow::StartParamOffset' has a wrong offset!");
static_assert(offsetof(FRoadIntersectionDecorationLaneRow, EndParamOffset) == 0x00007C, "Member 'FRoadIntersectionDecorationLaneRow::EndParamOffset' has a wrong offset!");
static_assert(offsetof(FRoadIntersectionDecorationLaneRow, SplineMeshYZScale) == 0x000080, "Member 'FRoadIntersectionDecorationLaneRow::SplineMeshYZScale' has a wrong offset!");
static_assert(offsetof(FRoadIntersectionDecorationLaneRow, DubinsInnerRadiusCm) == 0x000090, "Member 'FRoadIntersectionDecorationLaneRow::DubinsInnerRadiusCm' has a wrong offset!");
static_assert(offsetof(FRoadIntersectionDecorationLaneRow, bSplineMeshFlipY) == 0x000094, "Member 'FRoadIntersectionDecorationLaneRow::bSplineMeshFlipY' has a wrong offset!");

// ScriptStruct DynamicRoadKit.IntersectionCrosswalkInfo
// 0x0030 (0x0030 - 0x0000)
struct FIntersectionCrosswalkInfo final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FZoneShapePoint>                Points;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FZoneLaneProfileRef                    LaneProfile;                                       // 0x0018(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FIntersectionCrosswalkInfo) == 0x000008, "Wrong alignment on FIntersectionCrosswalkInfo");
static_assert(sizeof(FIntersectionCrosswalkInfo) == 0x000030, "Wrong size on FIntersectionCrosswalkInfo");
static_assert(offsetof(FIntersectionCrosswalkInfo, Name) == 0x000000, "Member 'FIntersectionCrosswalkInfo::Name' has a wrong offset!");
static_assert(offsetof(FIntersectionCrosswalkInfo, Points) == 0x000008, "Member 'FIntersectionCrosswalkInfo::Points' has a wrong offset!");
static_assert(offsetof(FIntersectionCrosswalkInfo, LaneProfile) == 0x000018, "Member 'FIntersectionCrosswalkInfo::LaneProfile' has a wrong offset!");

// ScriptStruct DynamicRoadKit.RoadEditLaneLine
// 0x0020 (0x0020 - 0x0000)
struct FRoadEditLaneLine final
{
public:
	struct FVector                                position;                                          // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Width;                                             // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRoadEditLaneLine) == 0x000004, "Wrong alignment on FRoadEditLaneLine");
static_assert(sizeof(FRoadEditLaneLine) == 0x000020, "Wrong size on FRoadEditLaneLine");
static_assert(offsetof(FRoadEditLaneLine, position) == 0x000000, "Member 'FRoadEditLaneLine::position' has a wrong offset!");
static_assert(offsetof(FRoadEditLaneLine, Width) == 0x000018, "Member 'FRoadEditLaneLine::Width' has a wrong offset!");

// ScriptStruct DynamicRoadKit.RoadEditCustomPointLocal
// 0x0020 (0x0020 - 0x0000)
struct FRoadEditCustomPointLocal final
{
public:
	struct FVector                                LocalOffsetCm;                                     // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YawOffsetDeg;                                      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRoadEditCustomPointLocal) == 0x000004, "Wrong alignment on FRoadEditCustomPointLocal");
static_assert(sizeof(FRoadEditCustomPointLocal) == 0x000020, "Wrong size on FRoadEditCustomPointLocal");
static_assert(offsetof(FRoadEditCustomPointLocal, LocalOffsetCm) == 0x000000, "Member 'FRoadEditCustomPointLocal::LocalOffsetCm' has a wrong offset!");
static_assert(offsetof(FRoadEditCustomPointLocal, YawOffsetDeg) == 0x000018, "Member 'FRoadEditCustomPointLocal::YawOffsetDeg' has a wrong offset!");

// ScriptStruct DynamicRoadKit.RoadEditRoadMouth
// 0x0088 (0x0088 - 0x0000)
struct FRoadEditRoadMouth final
{
public:
	TArray<struct FRoadEditLaneLine>              LaneLines;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        LaneIntervalPoints;                                // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FVector                                MouthAnchorWorld;                                  // 0x0020(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TrunkLaneMeshWorldOffsetApplied;                   // 0x0038(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRoadEditCustomPointLocal>      CustomPointsLocal;                                 // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FZoneLaneProfile                       TessellationLaneProfile;                           // 0x0060(0x0028)(Edit, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRoadEditRoadMouth) == 0x000008, "Wrong alignment on FRoadEditRoadMouth");
static_assert(sizeof(FRoadEditRoadMouth) == 0x000088, "Wrong size on FRoadEditRoadMouth");
static_assert(offsetof(FRoadEditRoadMouth, LaneLines) == 0x000000, "Member 'FRoadEditRoadMouth::LaneLines' has a wrong offset!");
static_assert(offsetof(FRoadEditRoadMouth, LaneIntervalPoints) == 0x000010, "Member 'FRoadEditRoadMouth::LaneIntervalPoints' has a wrong offset!");
static_assert(offsetof(FRoadEditRoadMouth, MouthAnchorWorld) == 0x000020, "Member 'FRoadEditRoadMouth::MouthAnchorWorld' has a wrong offset!");
static_assert(offsetof(FRoadEditRoadMouth, TrunkLaneMeshWorldOffsetApplied) == 0x000038, "Member 'FRoadEditRoadMouth::TrunkLaneMeshWorldOffsetApplied' has a wrong offset!");
static_assert(offsetof(FRoadEditRoadMouth, CustomPointsLocal) == 0x000050, "Member 'FRoadEditRoadMouth::CustomPointsLocal' has a wrong offset!");
static_assert(offsetof(FRoadEditRoadMouth, TessellationLaneProfile) == 0x000060, "Member 'FRoadEditRoadMouth::TessellationLaneProfile' has a wrong offset!");

// ScriptStruct DynamicRoadKit.ZoneShapeNetwork
// 0x0050 (0x0050 - 0x0000)
struct FZoneShapeNetwork final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FZoneGraphTagMask                      LaneTags;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FZoneShapePoint>                Points;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FZoneLaneProfileRef>            PerProfileRefs;                                    // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FZoneLaneProfileRef                    LaneProfile;                                       // 0x0030(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	EZoneShapePolygonRoutingType                  PolygonRoutingType;                                // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFZoneShapeType                               ZoneShapeType;                                     // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FZoneShapeNetwork) == 0x000008, "Wrong alignment on FZoneShapeNetwork");
static_assert(sizeof(FZoneShapeNetwork) == 0x000050, "Wrong size on FZoneShapeNetwork");
static_assert(offsetof(FZoneShapeNetwork, Name) == 0x000000, "Member 'FZoneShapeNetwork::Name' has a wrong offset!");
static_assert(offsetof(FZoneShapeNetwork, LaneTags) == 0x000008, "Member 'FZoneShapeNetwork::LaneTags' has a wrong offset!");
static_assert(offsetof(FZoneShapeNetwork, Points) == 0x000010, "Member 'FZoneShapeNetwork::Points' has a wrong offset!");
static_assert(offsetof(FZoneShapeNetwork, PerProfileRefs) == 0x000020, "Member 'FZoneShapeNetwork::PerProfileRefs' has a wrong offset!");
static_assert(offsetof(FZoneShapeNetwork, LaneProfile) == 0x000030, "Member 'FZoneShapeNetwork::LaneProfile' has a wrong offset!");
static_assert(offsetof(FZoneShapeNetwork, PolygonRoutingType) == 0x000048, "Member 'FZoneShapeNetwork::PolygonRoutingType' has a wrong offset!");
static_assert(offsetof(FZoneShapeNetwork, ZoneShapeType) == 0x000049, "Member 'FZoneShapeNetwork::ZoneShapeType' has a wrong offset!");

// ScriptStruct DynamicRoadKit.RoadPathMesh
// 0x0010 (0x0010 - 0x0000)
struct FRoadPathMesh final
{
public:
	class USweepPolyMeshAsset*                    SweepPolyMesh;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            StaticMesh;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRoadPathMesh) == 0x000008, "Wrong alignment on FRoadPathMesh");
static_assert(sizeof(FRoadPathMesh) == 0x000010, "Wrong size on FRoadPathMesh");
static_assert(offsetof(FRoadPathMesh, SweepPolyMesh) == 0x000000, "Member 'FRoadPathMesh::SweepPolyMesh' has a wrong offset!");
static_assert(offsetof(FRoadPathMesh, StaticMesh) == 0x000008, "Member 'FRoadPathMesh::StaticMesh' has a wrong offset!");

// ScriptStruct DynamicRoadKit.RoadSegmentConnection
// 0x000C (0x000C - 0x0000)
struct FRoadSegmentConnection final
{
public:
	TWeakObjectPtr<class URoadSegmentComponent>   SegmentComponent;                                  // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ConnectorIndex;                                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRoadSegmentConnection) == 0x000004, "Wrong alignment on FRoadSegmentConnection");
static_assert(sizeof(FRoadSegmentConnection) == 0x00000C, "Wrong size on FRoadSegmentConnection");
static_assert(offsetof(FRoadSegmentConnection, SegmentComponent) == 0x000000, "Member 'FRoadSegmentConnection::SegmentComponent' has a wrong offset!");
static_assert(offsetof(FRoadSegmentConnection, ConnectorIndex) == 0x000008, "Member 'FRoadSegmentConnection::ConnectorIndex' has a wrong offset!");

// ScriptStruct DynamicRoadKit.RoadSegmentConnectorConnections
// 0x0010 (0x0010 - 0x0000)
struct FRoadSegmentConnectorConnections final
{
public:
	TArray<struct FRoadSegmentConnection>         List;                                              // 0x0000(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRoadSegmentConnectorConnections) == 0x000008, "Wrong alignment on FRoadSegmentConnectorConnections");
static_assert(sizeof(FRoadSegmentConnectorConnections) == 0x000010, "Wrong size on FRoadSegmentConnectorConnections");
static_assert(offsetof(FRoadSegmentConnectorConnections, List) == 0x000000, "Member 'FRoadSegmentConnectorConnections::List' has a wrong offset!");

// ScriptStruct DynamicRoadKit.RoadMesh
// 0x0040 (0x0040 - 0x0000)
struct FRoadMesh final
{
public:
	struct FRoadPathMesh                          PathMesh;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Offset;                                            // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              YZScale;                                           // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlipY;                                            // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRoadMesh) == 0x000001, "Wrong alignment on FRoadMesh");
static_assert(sizeof(FRoadMesh) == 0x000040, "Wrong size on FRoadMesh");
static_assert(offsetof(FRoadMesh, PathMesh) == 0x000000, "Member 'FRoadMesh::PathMesh' has a wrong offset!");
static_assert(offsetof(FRoadMesh, Offset) == 0x000010, "Member 'FRoadMesh::Offset' has a wrong offset!");
static_assert(offsetof(FRoadMesh, YZScale) == 0x000028, "Member 'FRoadMesh::YZScale' has a wrong offset!");
static_assert(offsetof(FRoadMesh, bFlipY) == 0x000038, "Member 'FRoadMesh::bFlipY' has a wrong offset!");

// ScriptStruct DynamicRoadKit.RoadLaneline
// 0x0020 (0x0020 - 0x0000)
struct FRoadLaneline final
{
public:
	struct FRoadPathMesh                          PathMesh;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	double                                        CenterOffset;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSymmetricalGeneration;                            // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRoadLaneline) == 0x000008, "Wrong alignment on FRoadLaneline");
static_assert(sizeof(FRoadLaneline) == 0x000020, "Wrong size on FRoadLaneline");
static_assert(offsetof(FRoadLaneline, PathMesh) == 0x000000, "Member 'FRoadLaneline::PathMesh' has a wrong offset!");
static_assert(offsetof(FRoadLaneline, CenterOffset) == 0x000010, "Member 'FRoadLaneline::CenterOffset' has a wrong offset!");
static_assert(offsetof(FRoadLaneline, bSymmetricalGeneration) == 0x000018, "Member 'FRoadLaneline::bSymmetricalGeneration' has a wrong offset!");

// ScriptStruct DynamicRoadKit.RoadEditPointRef
// 0x000C (0x000C - 0x0000)
struct FRoadEditPointRef final
{
public:
	ERoadEditPointElement                         Element;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MouthIndex;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ElementIndex;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRoadEditPointRef) == 0x000004, "Wrong alignment on FRoadEditPointRef");
static_assert(sizeof(FRoadEditPointRef) == 0x00000C, "Wrong size on FRoadEditPointRef");
static_assert(offsetof(FRoadEditPointRef, Element) == 0x000000, "Member 'FRoadEditPointRef::Element' has a wrong offset!");
static_assert(offsetof(FRoadEditPointRef, MouthIndex) == 0x000004, "Member 'FRoadEditPointRef::MouthIndex' has a wrong offset!");
static_assert(offsetof(FRoadEditPointRef, ElementIndex) == 0x000008, "Member 'FRoadEditPointRef::ElementIndex' has a wrong offset!");

// ScriptStruct DynamicRoadKit.RoadEditFillPatternPanelConfig
// 0x0070 (0x0070 - 0x0000)
struct FRoadEditFillPatternPanelConfig final
{
public:
	class FString                                 DisplayName;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRoadEditPointRef>              Points;                                            // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	ERoadEditCurveType                            CurveType;                                         // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DubinsInnerRadiusCm;                               // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IntervalCm;                                        // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocalOffsetCm;                                     // 0x0038(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              UVPlanarScaleCm;                                   // 0x0050(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UVRotationDeg;                                     // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFillCastShadow;                                   // 0x0064(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     OverrideMaterial;                                  // 0x0068(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRoadEditFillPatternPanelConfig) == 0x000008, "Wrong alignment on FRoadEditFillPatternPanelConfig");
static_assert(sizeof(FRoadEditFillPatternPanelConfig) == 0x000070, "Wrong size on FRoadEditFillPatternPanelConfig");
static_assert(offsetof(FRoadEditFillPatternPanelConfig, DisplayName) == 0x000000, "Member 'FRoadEditFillPatternPanelConfig::DisplayName' has a wrong offset!");
static_assert(offsetof(FRoadEditFillPatternPanelConfig, bEnabled) == 0x000010, "Member 'FRoadEditFillPatternPanelConfig::bEnabled' has a wrong offset!");
static_assert(offsetof(FRoadEditFillPatternPanelConfig, Points) == 0x000018, "Member 'FRoadEditFillPatternPanelConfig::Points' has a wrong offset!");
static_assert(offsetof(FRoadEditFillPatternPanelConfig, CurveType) == 0x000028, "Member 'FRoadEditFillPatternPanelConfig::CurveType' has a wrong offset!");
static_assert(offsetof(FRoadEditFillPatternPanelConfig, DubinsInnerRadiusCm) == 0x00002C, "Member 'FRoadEditFillPatternPanelConfig::DubinsInnerRadiusCm' has a wrong offset!");
static_assert(offsetof(FRoadEditFillPatternPanelConfig, IntervalCm) == 0x000030, "Member 'FRoadEditFillPatternPanelConfig::IntervalCm' has a wrong offset!");
static_assert(offsetof(FRoadEditFillPatternPanelConfig, LocalOffsetCm) == 0x000038, "Member 'FRoadEditFillPatternPanelConfig::LocalOffsetCm' has a wrong offset!");
static_assert(offsetof(FRoadEditFillPatternPanelConfig, UVPlanarScaleCm) == 0x000050, "Member 'FRoadEditFillPatternPanelConfig::UVPlanarScaleCm' has a wrong offset!");
static_assert(offsetof(FRoadEditFillPatternPanelConfig, UVRotationDeg) == 0x000060, "Member 'FRoadEditFillPatternPanelConfig::UVRotationDeg' has a wrong offset!");
static_assert(offsetof(FRoadEditFillPatternPanelConfig, bFillCastShadow) == 0x000064, "Member 'FRoadEditFillPatternPanelConfig::bFillCastShadow' has a wrong offset!");
static_assert(offsetof(FRoadEditFillPatternPanelConfig, OverrideMaterial) == 0x000068, "Member 'FRoadEditFillPatternPanelConfig::OverrideMaterial' has a wrong offset!");

// ScriptStruct DynamicRoadKit.RoadEndMesh
// 0x0050 (0x0050 - 0x0000)
struct FRoadEndMesh final
{
public:
	struct FRoadPathMesh                          PathMesh;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bStar;                                             // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnd;                                              // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        PathStartRightOffset;                              // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        PathEndRightOffset;                                // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Offset;                                            // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              YZScale;                                           // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRoadEndMesh) == 0x000008, "Wrong alignment on FRoadEndMesh");
static_assert(sizeof(FRoadEndMesh) == 0x000050, "Wrong size on FRoadEndMesh");
static_assert(offsetof(FRoadEndMesh, PathMesh) == 0x000000, "Member 'FRoadEndMesh::PathMesh' has a wrong offset!");
static_assert(offsetof(FRoadEndMesh, bStar) == 0x000010, "Member 'FRoadEndMesh::bStar' has a wrong offset!");
static_assert(offsetof(FRoadEndMesh, bEnd) == 0x000011, "Member 'FRoadEndMesh::bEnd' has a wrong offset!");
static_assert(offsetof(FRoadEndMesh, PathStartRightOffset) == 0x000018, "Member 'FRoadEndMesh::PathStartRightOffset' has a wrong offset!");
static_assert(offsetof(FRoadEndMesh, PathEndRightOffset) == 0x000020, "Member 'FRoadEndMesh::PathEndRightOffset' has a wrong offset!");
static_assert(offsetof(FRoadEndMesh, Offset) == 0x000028, "Member 'FRoadEndMesh::Offset' has a wrong offset!");
static_assert(offsetof(FRoadEndMesh, YZScale) == 0x000040, "Member 'FRoadEndMesh::YZScale' has a wrong offset!");

// ScriptStruct DynamicRoadKit.IntersectionEnding
// 0x0038 (0x0038 - 0x0000)
struct FIntersectionEnding final
{
public:
	struct FRoadPathMesh                          PathMesh;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	double                                        PathStartRightOffset;                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        PathEndRightOffset;                                // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Offset;                                            // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FIntersectionEnding) == 0x000008, "Wrong alignment on FIntersectionEnding");
static_assert(sizeof(FIntersectionEnding) == 0x000038, "Wrong size on FIntersectionEnding");
static_assert(offsetof(FIntersectionEnding, PathMesh) == 0x000000, "Member 'FIntersectionEnding::PathMesh' has a wrong offset!");
static_assert(offsetof(FIntersectionEnding, PathStartRightOffset) == 0x000010, "Member 'FIntersectionEnding::PathStartRightOffset' has a wrong offset!");
static_assert(offsetof(FIntersectionEnding, PathEndRightOffset) == 0x000018, "Member 'FIntersectionEnding::PathEndRightOffset' has a wrong offset!");
static_assert(offsetof(FIntersectionEnding, Offset) == 0x000020, "Member 'FIntersectionEnding::Offset' has a wrong offset!");

// ScriptStruct DynamicRoadKit.RoadTriangulatedPolygon3D
// 0x0028 (0x0028 - 0x0000)
struct FRoadTriangulatedPolygon3D final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        PolygonVertices;                                   // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      PolygonVerticesUV;                                 // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRoadTriangulatedPolygon3D) == 0x000008, "Wrong alignment on FRoadTriangulatedPolygon3D");
static_assert(sizeof(FRoadTriangulatedPolygon3D) == 0x000028, "Wrong size on FRoadTriangulatedPolygon3D");
static_assert(offsetof(FRoadTriangulatedPolygon3D, Material) == 0x000000, "Member 'FRoadTriangulatedPolygon3D::Material' has a wrong offset!");
static_assert(offsetof(FRoadTriangulatedPolygon3D, PolygonVertices) == 0x000008, "Member 'FRoadTriangulatedPolygon3D::PolygonVertices' has a wrong offset!");
static_assert(offsetof(FRoadTriangulatedPolygon3D, PolygonVerticesUV) == 0x000018, "Member 'FRoadTriangulatedPolygon3D::PolygonVerticesUV' has a wrong offset!");

// ScriptStruct DynamicRoadKit.RoadPolygon3DMesh
// 0x0090 (0x0090 - 0x0000)
struct FRoadPolygon3DMesh final
{
public:
	struct FRoadTriangulatedPolygon3D             TriangulatedPolygonVertices;                       // 0x0000(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UStaticMesh*                            Mesh;                                              // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             Offset;                                            // 0x0030(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRoadPolygon3DMesh) == 0x000008, "Wrong alignment on FRoadPolygon3DMesh");
static_assert(sizeof(FRoadPolygon3DMesh) == 0x000090, "Wrong size on FRoadPolygon3DMesh");
static_assert(offsetof(FRoadPolygon3DMesh, TriangulatedPolygonVertices) == 0x000000, "Member 'FRoadPolygon3DMesh::TriangulatedPolygonVertices' has a wrong offset!");
static_assert(offsetof(FRoadPolygon3DMesh, Mesh) == 0x000028, "Member 'FRoadPolygon3DMesh::Mesh' has a wrong offset!");
static_assert(offsetof(FRoadPolygon3DMesh, Offset) == 0x000030, "Member 'FRoadPolygon3DMesh::Offset' has a wrong offset!");

// ScriptStruct DynamicRoadKit.RoadPathDeformationMesh
// 0x0040 (0x0040 - 0x0000)
struct FRoadPathDeformationMesh final
{
public:
	struct FRoadPathMesh                          PathMesh;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                MeshOffset;                                        // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MeshScale;                                         // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRoadPathDeformationMesh) == 0x000001, "Wrong alignment on FRoadPathDeformationMesh");
static_assert(sizeof(FRoadPathDeformationMesh) == 0x000040, "Wrong size on FRoadPathDeformationMesh");
static_assert(offsetof(FRoadPathDeformationMesh, PathMesh) == 0x000000, "Member 'FRoadPathDeformationMesh::PathMesh' has a wrong offset!");
static_assert(offsetof(FRoadPathDeformationMesh, MeshOffset) == 0x000010, "Member 'FRoadPathDeformationMesh::MeshOffset' has a wrong offset!");
static_assert(offsetof(FRoadPathDeformationMesh, MeshScale) == 0x000028, "Member 'FRoadPathDeformationMesh::MeshScale' has a wrong offset!");

// ScriptStruct DynamicRoadKit.BlindPathElement
// 0x0038 (0x0038 - 0x0000)
struct FBlindPathElement final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MeshOffset;                                        // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MeshScale;                                         // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBlindPathElement) == 0x000008, "Wrong alignment on FBlindPathElement");
static_assert(sizeof(FBlindPathElement) == 0x000038, "Wrong size on FBlindPathElement");
static_assert(offsetof(FBlindPathElement, StaticMesh) == 0x000000, "Member 'FBlindPathElement::StaticMesh' has a wrong offset!");
static_assert(offsetof(FBlindPathElement, MeshOffset) == 0x000008, "Member 'FBlindPathElement::MeshOffset' has a wrong offset!");
static_assert(offsetof(FBlindPathElement, MeshScale) == 0x000020, "Member 'FBlindPathElement::MeshScale' has a wrong offset!");

// ScriptStruct DynamicRoadKit.BlindPathSplineMeshConfig
// 0x0048 (0x0048 - 0x0000)
struct FBlindPathSplineMeshConfig final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        StartIntersectionOffset;                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        EndIntersectionOffset;                             // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Offset;                                            // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlipY;                                            // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              YZScale;                                           // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBlindPathSplineMeshConfig) == 0x000008, "Wrong alignment on FBlindPathSplineMeshConfig");
static_assert(sizeof(FBlindPathSplineMeshConfig) == 0x000048, "Wrong size on FBlindPathSplineMeshConfig");
static_assert(offsetof(FBlindPathSplineMeshConfig, StaticMesh) == 0x000000, "Member 'FBlindPathSplineMeshConfig::StaticMesh' has a wrong offset!");
static_assert(offsetof(FBlindPathSplineMeshConfig, StartIntersectionOffset) == 0x000008, "Member 'FBlindPathSplineMeshConfig::StartIntersectionOffset' has a wrong offset!");
static_assert(offsetof(FBlindPathSplineMeshConfig, EndIntersectionOffset) == 0x000010, "Member 'FBlindPathSplineMeshConfig::EndIntersectionOffset' has a wrong offset!");
static_assert(offsetof(FBlindPathSplineMeshConfig, Offset) == 0x000018, "Member 'FBlindPathSplineMeshConfig::Offset' has a wrong offset!");
static_assert(offsetof(FBlindPathSplineMeshConfig, bFlipY) == 0x000030, "Member 'FBlindPathSplineMeshConfig::bFlipY' has a wrong offset!");
static_assert(offsetof(FBlindPathSplineMeshConfig, YZScale) == 0x000038, "Member 'FBlindPathSplineMeshConfig::YZScale' has a wrong offset!");

// ScriptStruct DynamicRoadKit.RoadSectionReplaceNetwork
// 0x0054 (0x0054 - 0x0000)
struct FRoadSectionReplaceNetwork final
{
public:
	bool                                          bLeftLink;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneLaneProfileRef                    LeftProfile;                                       // 0x0004(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bRightLink;                                        // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneLaneProfileRef                    RightProfile;                                      // 0x0020(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bCrosswalk;                                        // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneLaneProfileRef                    CrosswalkProfile;                                  // 0x003C(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRoadSectionReplaceNetwork) == 0x000001, "Wrong alignment on FRoadSectionReplaceNetwork");
static_assert(sizeof(FRoadSectionReplaceNetwork) == 0x000054, "Wrong size on FRoadSectionReplaceNetwork");
static_assert(offsetof(FRoadSectionReplaceNetwork, bLeftLink) == 0x000000, "Member 'FRoadSectionReplaceNetwork::bLeftLink' has a wrong offset!");
static_assert(offsetof(FRoadSectionReplaceNetwork, LeftProfile) == 0x000004, "Member 'FRoadSectionReplaceNetwork::LeftProfile' has a wrong offset!");
static_assert(offsetof(FRoadSectionReplaceNetwork, bRightLink) == 0x00001C, "Member 'FRoadSectionReplaceNetwork::bRightLink' has a wrong offset!");
static_assert(offsetof(FRoadSectionReplaceNetwork, RightProfile) == 0x000020, "Member 'FRoadSectionReplaceNetwork::RightProfile' has a wrong offset!");
static_assert(offsetof(FRoadSectionReplaceNetwork, bCrosswalk) == 0x000038, "Member 'FRoadSectionReplaceNetwork::bCrosswalk' has a wrong offset!");
static_assert(offsetof(FRoadSectionReplaceNetwork, CrosswalkProfile) == 0x00003C, "Member 'FRoadSectionReplaceNetwork::CrosswalkProfile' has a wrong offset!");

// ScriptStruct DynamicRoadKit.ReplaceMeshInfo
// 0x0080 (0x0080 - 0x0000)
struct FReplaceMeshInfo final
{
public:
	TArray<struct FTransform>                     MeshPoints;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UStaticMesh*                            Mesh;                                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              YZScale;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRoadSectionReplaceNetwork             Network;                                           // 0x0028(0x0054)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FReplaceMeshInfo) == 0x000008, "Wrong alignment on FReplaceMeshInfo");
static_assert(sizeof(FReplaceMeshInfo) == 0x000080, "Wrong size on FReplaceMeshInfo");
static_assert(offsetof(FReplaceMeshInfo, MeshPoints) == 0x000000, "Member 'FReplaceMeshInfo::MeshPoints' has a wrong offset!");
static_assert(offsetof(FReplaceMeshInfo, Mesh) == 0x000010, "Member 'FReplaceMeshInfo::Mesh' has a wrong offset!");
static_assert(offsetof(FReplaceMeshInfo, YZScale) == 0x000018, "Member 'FReplaceMeshInfo::YZScale' has a wrong offset!");
static_assert(offsetof(FReplaceMeshInfo, Network) == 0x000028, "Member 'FReplaceMeshInfo::Network' has a wrong offset!");

// ScriptStruct DynamicRoadKit.BlindPathConfig
// 0x0128 (0x0128 - 0x0000)
struct FBlindPathConfig final
{
public:
	struct FBlindPathSplineMeshConfig             BlindPath;                                         // 0x0000(0x0048)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FBlindPathElement                      BlindPathTurn;                                     // 0x0048(0x0038)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FBlindPathElement                      BlindPathBigNode;                                  // 0x0080(0x0038)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FBlindPathElement                      BlindPathSmallNode;                                // 0x00B8(0x0038)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FBlindPathElement                      BlindPathExit;                                     // 0x00F0(0x0038)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBlindPathConfig) == 0x000001, "Wrong alignment on FBlindPathConfig");
static_assert(sizeof(FBlindPathConfig) == 0x000128, "Wrong size on FBlindPathConfig");
static_assert(offsetof(FBlindPathConfig, BlindPath) == 0x000000, "Member 'FBlindPathConfig::BlindPath' has a wrong offset!");
static_assert(offsetof(FBlindPathConfig, BlindPathTurn) == 0x000048, "Member 'FBlindPathConfig::BlindPathTurn' has a wrong offset!");
static_assert(offsetof(FBlindPathConfig, BlindPathBigNode) == 0x000080, "Member 'FBlindPathConfig::BlindPathBigNode' has a wrong offset!");
static_assert(offsetof(FBlindPathConfig, BlindPathSmallNode) == 0x0000B8, "Member 'FBlindPathConfig::BlindPathSmallNode' has a wrong offset!");
static_assert(offsetof(FBlindPathConfig, BlindPathExit) == 0x0000F0, "Member 'FBlindPathConfig::BlindPathExit' has a wrong offset!");

// ScriptStruct DynamicRoadKit.IntersectionConnectedSector
// 0x0040 (0x0040 - 0x0000)
struct FIntersectionConnectedSector final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MeshXSize;                                         // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              UVSize;                                            // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MeshOffset;                                        // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FIntersectionConnectedSector) == 0x000008, "Wrong alignment on FIntersectionConnectedSector");
static_assert(sizeof(FIntersectionConnectedSector) == 0x000040, "Wrong size on FIntersectionConnectedSector");
static_assert(offsetof(FIntersectionConnectedSector, Material) == 0x000000, "Member 'FIntersectionConnectedSector::Material' has a wrong offset!");
static_assert(offsetof(FIntersectionConnectedSector, MeshXSize) == 0x000008, "Member 'FIntersectionConnectedSector::MeshXSize' has a wrong offset!");
static_assert(offsetof(FIntersectionConnectedSector, UVSize) == 0x000018, "Member 'FIntersectionConnectedSector::UVSize' has a wrong offset!");
static_assert(offsetof(FIntersectionConnectedSector, MeshOffset) == 0x000028, "Member 'FIntersectionConnectedSector::MeshOffset' has a wrong offset!");

// ScriptStruct DynamicRoadKit.RoadSectionReplace
// 0x0070 (0x0070 - 0x0000)
struct FRoadSectionReplace final
{
public:
	class URoadReplaceSection*                    ReplaceSection;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRoadSectionReplace) == 0x000008, "Wrong alignment on FRoadSectionReplace");
static_assert(sizeof(FRoadSectionReplace) == 0x000070, "Wrong size on FRoadSectionReplace");
static_assert(offsetof(FRoadSectionReplace, ReplaceSection) == 0x000000, "Member 'FRoadSectionReplace::ReplaceSection' has a wrong offset!");
static_assert(offsetof(FRoadSectionReplace, Transform) == 0x000010, "Member 'FRoadSectionReplace::Transform' has a wrong offset!");

// ScriptStruct DynamicRoadKit.IntersectionMesh
// 0x0018 (0x0018 - 0x0000)
struct FIntersectionMesh final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
