#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DynamicRoadKit

#include "Basic.hpp"

#include "DynamicRoadKit_structs.hpp"
#include "Landscape_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "ZoneGraph_structs.hpp"
#include "ZoneGraph_classes.hpp"


namespace SDK
{

// Class DynamicRoadKit.ComponentPool
// 0x0028 (0x0050 - 0x0028)
class UComponentPool final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UActorComponent*>                FreePool;                                          // 0x0030(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UActorComponent*>                UsedPool;                                          // 0x0040(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ComponentPool">();
	}
	static class UComponentPool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComponentPool>();
	}
};
static_assert(alignof(UComponentPool) == 0x000008, "Wrong alignment on UComponentPool");
static_assert(sizeof(UComponentPool) == 0x000050, "Wrong size on UComponentPool");
static_assert(offsetof(UComponentPool, FreePool) == 0x000030, "Member 'UComponentPool::FreePool' has a wrong offset!");
static_assert(offsetof(UComponentPool, UsedPool) == 0x000040, "Member 'UComponentPool::UsedPool' has a wrong offset!");

// Class DynamicRoadKit.FoundationActor
// 0x0078 (0x0340 - 0x02C8)
class AFoundationActor final : public AActor
{
public:
	class URoadMeshGeneratorComponent*            MeshGeneratorComponent;                            // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineComponent*                       SplineComp;                                        // 0x02D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     FoundationMaterial;                                // 0x02D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             UVPlanarTransform;                                 // 0x02E0(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FoundationActor">();
	}
	static class AFoundationActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFoundationActor>();
	}
};
static_assert(alignof(AFoundationActor) == 0x000008, "Wrong alignment on AFoundationActor");
static_assert(sizeof(AFoundationActor) == 0x000340, "Wrong size on AFoundationActor");
static_assert(offsetof(AFoundationActor, MeshGeneratorComponent) == 0x0002C8, "Member 'AFoundationActor::MeshGeneratorComponent' has a wrong offset!");
static_assert(offsetof(AFoundationActor, SplineComp) == 0x0002D0, "Member 'AFoundationActor::SplineComp' has a wrong offset!");
static_assert(offsetof(AFoundationActor, FoundationMaterial) == 0x0002D8, "Member 'AFoundationActor::FoundationMaterial' has a wrong offset!");
static_assert(offsetof(AFoundationActor, UVPlanarTransform) == 0x0002E0, "Member 'AFoundationActor::UVPlanarTransform' has a wrong offset!");

// Class DynamicRoadKit.LandscapeEditLayerRoads
// 0x0000 (0x0030 - 0x0030)
class ULandscapeEditLayerRoads final : public ULandscapeEditLayer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeEditLayerRoads">();
	}
	static class ULandscapeEditLayerRoads* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeEditLayerRoads>();
	}
};
static_assert(alignof(ULandscapeEditLayerRoads) == 0x000008, "Wrong alignment on ULandscapeEditLayerRoads");
static_assert(sizeof(ULandscapeEditLayerRoads) == 0x000030, "Wrong size on ULandscapeEditLayerRoads");

// Class DynamicRoadKit.RoadBaseActor
// 0x0010 (0x02D8 - 0x02C8)
class ARoadBaseActor : public AActor
{
public:
	TArray<class URoadZoneShapeComponent*>        ZoneRoadShapes;                                    // 0x02C8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RoadBaseActor">();
	}
	static class ARoadBaseActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARoadBaseActor>();
	}
};
static_assert(alignof(ARoadBaseActor) == 0x000008, "Wrong alignment on ARoadBaseActor");
static_assert(sizeof(ARoadBaseActor) == 0x0002D8, "Wrong size on ARoadBaseActor");
static_assert(offsetof(ARoadBaseActor, ZoneRoadShapes) == 0x0002C8, "Member 'ARoadBaseActor::ZoneRoadShapes' has a wrong offset!");

// Class DynamicRoadKit.SweepPolyMeshAsset
// 0x0030 (0x0060 - 0x0030)
class USweepPolyMeshAsset final : public UDataAsset
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      PolylineVertices;                                  // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 PolylineTexParamU;                                 // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         OddSweepPathTexParamV;                             // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EvenSweepPathTexParamV;                            // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SweepPolyMeshAsset">();
	}
	static class USweepPolyMeshAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USweepPolyMeshAsset>();
	}
};
static_assert(alignof(USweepPolyMeshAsset) == 0x000008, "Wrong alignment on USweepPolyMeshAsset");
static_assert(sizeof(USweepPolyMeshAsset) == 0x000060, "Wrong size on USweepPolyMeshAsset");
static_assert(offsetof(USweepPolyMeshAsset, Material) == 0x000030, "Member 'USweepPolyMeshAsset::Material' has a wrong offset!");
static_assert(offsetof(USweepPolyMeshAsset, PolylineVertices) == 0x000038, "Member 'USweepPolyMeshAsset::PolylineVertices' has a wrong offset!");
static_assert(offsetof(USweepPolyMeshAsset, PolylineTexParamU) == 0x000048, "Member 'USweepPolyMeshAsset::PolylineTexParamU' has a wrong offset!");
static_assert(offsetof(USweepPolyMeshAsset, OddSweepPathTexParamV) == 0x000058, "Member 'USweepPolyMeshAsset::OddSweepPathTexParamV' has a wrong offset!");
static_assert(offsetof(USweepPolyMeshAsset, EvenSweepPathTexParamV) == 0x00005C, "Member 'USweepPolyMeshAsset::EvenSweepPathTexParamV' has a wrong offset!");

// Class DynamicRoadKit.RoadGuideArrowDataAsset
// 0x0360 (0x0390 - 0x0030)
class URoadGuideArrowDataAsset final : public UDataAsset
{
public:
	struct FRoadPolygon3DMesh                     StraightArrow;                                     // 0x0030(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRoadPolygon3DMesh                     LeftTurnArrow;                                     // 0x00C0(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRoadPolygon3DMesh                     RightTurnArrow;                                    // 0x0150(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRoadPolygon3DMesh                     StraightAndLeftArrow;                              // 0x01E0(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRoadPolygon3DMesh                     StraightAndRightArrow;                             // 0x0270(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRoadPolygon3DMesh                     AllDirectionsArrow;                                // 0x0300(0x0090)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RoadGuideArrowDataAsset">();
	}
	static class URoadGuideArrowDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoadGuideArrowDataAsset>();
	}
};
static_assert(alignof(URoadGuideArrowDataAsset) == 0x000008, "Wrong alignment on URoadGuideArrowDataAsset");
static_assert(sizeof(URoadGuideArrowDataAsset) == 0x000390, "Wrong size on URoadGuideArrowDataAsset");
static_assert(offsetof(URoadGuideArrowDataAsset, StraightArrow) == 0x000030, "Member 'URoadGuideArrowDataAsset::StraightArrow' has a wrong offset!");
static_assert(offsetof(URoadGuideArrowDataAsset, LeftTurnArrow) == 0x0000C0, "Member 'URoadGuideArrowDataAsset::LeftTurnArrow' has a wrong offset!");
static_assert(offsetof(URoadGuideArrowDataAsset, RightTurnArrow) == 0x000150, "Member 'URoadGuideArrowDataAsset::RightTurnArrow' has a wrong offset!");
static_assert(offsetof(URoadGuideArrowDataAsset, StraightAndLeftArrow) == 0x0001E0, "Member 'URoadGuideArrowDataAsset::StraightAndLeftArrow' has a wrong offset!");
static_assert(offsetof(URoadGuideArrowDataAsset, StraightAndRightArrow) == 0x000270, "Member 'URoadGuideArrowDataAsset::StraightAndRightArrow' has a wrong offset!");
static_assert(offsetof(URoadGuideArrowDataAsset, AllDirectionsArrow) == 0x000300, "Member 'URoadGuideArrowDataAsset::AllDirectionsArrow' has a wrong offset!");

// Class DynamicRoadKit.RoadConfigDataAsset
// 0x0010 (0x0040 - 0x0030)
class URoadConfigDataAsset final : public UPrimaryDataAsset
{
public:
	TMulticastInlineDelegate<void()>              OnDataAssetUpdated;                                // 0x0030(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RoadConfigDataAsset">();
	}
	static class URoadConfigDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoadConfigDataAsset>();
	}
};
static_assert(alignof(URoadConfigDataAsset) == 0x000008, "Wrong alignment on URoadConfigDataAsset");
static_assert(sizeof(URoadConfigDataAsset) == 0x000040, "Wrong size on URoadConfigDataAsset");
static_assert(offsetof(URoadConfigDataAsset, OnDataAssetUpdated) == 0x000030, "Member 'URoadConfigDataAsset::OnDataAssetUpdated' has a wrong offset!");

// Class DynamicRoadKit.RoadIntersectionDecorationConfig
// 0x0120 (0x0150 - 0x0030)
class URoadIntersectionDecorationConfig final : public UPrimaryDataAsset
{
public:
	TArray<struct FRoadIntersectionDecorationLaneRow> Lanes;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         TurnThresholdAngleDeg;                             // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExitDistanceCm;                                    // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EntryDistanceCm;                                   // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            StraightArrowMesh;                                 // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StraightArrowLocalOffset;                          // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            LeftArrowMesh;                                     // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LeftArrowLocalOffset;                              // 0x0078(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            RightArrowMesh;                                    // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RightArrowLocalOffset;                             // 0x0098(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            UTurnArrowMesh;                                    // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                UTurnArrowLocalOffset;                             // 0x00B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            StraightLeftArrowMesh;                             // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StraightLeftArrowLocalOffset;                      // 0x00D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            StraightRightArrowMesh;                            // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StraightRightArrowLocalOffset;                     // 0x00F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            LeftRightArrowMesh;                                // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LeftRightArrowLocalOffset;                         // 0x0118(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            StraightLeftRightArrowMesh;                        // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StraightLeftRightArrowLocalOffset;                 // 0x0138(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RoadIntersectionDecorationConfig">();
	}
	static class URoadIntersectionDecorationConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoadIntersectionDecorationConfig>();
	}
};
static_assert(alignof(URoadIntersectionDecorationConfig) == 0x000008, "Wrong alignment on URoadIntersectionDecorationConfig");
static_assert(sizeof(URoadIntersectionDecorationConfig) == 0x000150, "Wrong size on URoadIntersectionDecorationConfig");
static_assert(offsetof(URoadIntersectionDecorationConfig, Lanes) == 0x000030, "Member 'URoadIntersectionDecorationConfig::Lanes' has a wrong offset!");
static_assert(offsetof(URoadIntersectionDecorationConfig, TurnThresholdAngleDeg) == 0x000040, "Member 'URoadIntersectionDecorationConfig::TurnThresholdAngleDeg' has a wrong offset!");
static_assert(offsetof(URoadIntersectionDecorationConfig, ExitDistanceCm) == 0x000044, "Member 'URoadIntersectionDecorationConfig::ExitDistanceCm' has a wrong offset!");
static_assert(offsetof(URoadIntersectionDecorationConfig, EntryDistanceCm) == 0x000048, "Member 'URoadIntersectionDecorationConfig::EntryDistanceCm' has a wrong offset!");
static_assert(offsetof(URoadIntersectionDecorationConfig, StraightArrowMesh) == 0x000050, "Member 'URoadIntersectionDecorationConfig::StraightArrowMesh' has a wrong offset!");
static_assert(offsetof(URoadIntersectionDecorationConfig, StraightArrowLocalOffset) == 0x000058, "Member 'URoadIntersectionDecorationConfig::StraightArrowLocalOffset' has a wrong offset!");
static_assert(offsetof(URoadIntersectionDecorationConfig, LeftArrowMesh) == 0x000070, "Member 'URoadIntersectionDecorationConfig::LeftArrowMesh' has a wrong offset!");
static_assert(offsetof(URoadIntersectionDecorationConfig, LeftArrowLocalOffset) == 0x000078, "Member 'URoadIntersectionDecorationConfig::LeftArrowLocalOffset' has a wrong offset!");
static_assert(offsetof(URoadIntersectionDecorationConfig, RightArrowMesh) == 0x000090, "Member 'URoadIntersectionDecorationConfig::RightArrowMesh' has a wrong offset!");
static_assert(offsetof(URoadIntersectionDecorationConfig, RightArrowLocalOffset) == 0x000098, "Member 'URoadIntersectionDecorationConfig::RightArrowLocalOffset' has a wrong offset!");
static_assert(offsetof(URoadIntersectionDecorationConfig, UTurnArrowMesh) == 0x0000B0, "Member 'URoadIntersectionDecorationConfig::UTurnArrowMesh' has a wrong offset!");
static_assert(offsetof(URoadIntersectionDecorationConfig, UTurnArrowLocalOffset) == 0x0000B8, "Member 'URoadIntersectionDecorationConfig::UTurnArrowLocalOffset' has a wrong offset!");
static_assert(offsetof(URoadIntersectionDecorationConfig, StraightLeftArrowMesh) == 0x0000D0, "Member 'URoadIntersectionDecorationConfig::StraightLeftArrowMesh' has a wrong offset!");
static_assert(offsetof(URoadIntersectionDecorationConfig, StraightLeftArrowLocalOffset) == 0x0000D8, "Member 'URoadIntersectionDecorationConfig::StraightLeftArrowLocalOffset' has a wrong offset!");
static_assert(offsetof(URoadIntersectionDecorationConfig, StraightRightArrowMesh) == 0x0000F0, "Member 'URoadIntersectionDecorationConfig::StraightRightArrowMesh' has a wrong offset!");
static_assert(offsetof(URoadIntersectionDecorationConfig, StraightRightArrowLocalOffset) == 0x0000F8, "Member 'URoadIntersectionDecorationConfig::StraightRightArrowLocalOffset' has a wrong offset!");
static_assert(offsetof(URoadIntersectionDecorationConfig, LeftRightArrowMesh) == 0x000110, "Member 'URoadIntersectionDecorationConfig::LeftRightArrowMesh' has a wrong offset!");
static_assert(offsetof(URoadIntersectionDecorationConfig, LeftRightArrowLocalOffset) == 0x000118, "Member 'URoadIntersectionDecorationConfig::LeftRightArrowLocalOffset' has a wrong offset!");
static_assert(offsetof(URoadIntersectionDecorationConfig, StraightLeftRightArrowMesh) == 0x000130, "Member 'URoadIntersectionDecorationConfig::StraightLeftRightArrowMesh' has a wrong offset!");
static_assert(offsetof(URoadIntersectionDecorationConfig, StraightLeftRightArrowLocalOffset) == 0x000138, "Member 'URoadIntersectionDecorationConfig::StraightLeftRightArrowLocalOffset' has a wrong offset!");

// Class DynamicRoadKit.TrunkRoadDataAsset
// 0x0118 (0x0148 - 0x0030)
class UTrunkRoadDataAsset final : public UPrimaryDataAsset
{
public:
	struct FZoneLaneProfileRef                    LaneProfile;                                       // 0x0030(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FZoneGraphTagMask                      LaneTags;                                          // 0x0048(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RightBoundaryWidth;                                // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        LeftBoundaryWidth;                                 // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        LaneMeshSampleInterval;                            // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LaneProfileOffset;                                 // 0x0068(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRoadMesh>                      LaneMeshs;                                         // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRoadEndMesh>                   EndPathMesh;                                       // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRoadViaductPier>               ViaductPier;                                       // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRoadDecoration>                RoadPathDecoration;                                // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FRoadTrafficLight                      TrafficLight;                                      // 0x00C0(0x0028)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class URoadGuideArrowDataAsset*               LaneGuide;                                         // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRoadLandscapeConfig                   LandscapeConfig;                                   // 0x00F0(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FIntersectionMesh                      IntersectionMesh;                                  // 0x0110(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FRoadDecoration>                IntersectionEdgePathDecorations;                   // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FZoneGraphTagMask                      IntersectionLaneTags;                              // 0x0138(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URoadIntersectionDecorationConfig*      IntersectionDecorationConfig;                      // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TrunkRoadDataAsset">();
	}
	static class UTrunkRoadDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrunkRoadDataAsset>();
	}
};
static_assert(alignof(UTrunkRoadDataAsset) == 0x000008, "Wrong alignment on UTrunkRoadDataAsset");
static_assert(sizeof(UTrunkRoadDataAsset) == 0x000148, "Wrong size on UTrunkRoadDataAsset");
static_assert(offsetof(UTrunkRoadDataAsset, LaneProfile) == 0x000030, "Member 'UTrunkRoadDataAsset::LaneProfile' has a wrong offset!");
static_assert(offsetof(UTrunkRoadDataAsset, LaneTags) == 0x000048, "Member 'UTrunkRoadDataAsset::LaneTags' has a wrong offset!");
static_assert(offsetof(UTrunkRoadDataAsset, RightBoundaryWidth) == 0x000050, "Member 'UTrunkRoadDataAsset::RightBoundaryWidth' has a wrong offset!");
static_assert(offsetof(UTrunkRoadDataAsset, LeftBoundaryWidth) == 0x000058, "Member 'UTrunkRoadDataAsset::LeftBoundaryWidth' has a wrong offset!");
static_assert(offsetof(UTrunkRoadDataAsset, LaneMeshSampleInterval) == 0x000060, "Member 'UTrunkRoadDataAsset::LaneMeshSampleInterval' has a wrong offset!");
static_assert(offsetof(UTrunkRoadDataAsset, LaneProfileOffset) == 0x000068, "Member 'UTrunkRoadDataAsset::LaneProfileOffset' has a wrong offset!");
static_assert(offsetof(UTrunkRoadDataAsset, LaneMeshs) == 0x000080, "Member 'UTrunkRoadDataAsset::LaneMeshs' has a wrong offset!");
static_assert(offsetof(UTrunkRoadDataAsset, EndPathMesh) == 0x000090, "Member 'UTrunkRoadDataAsset::EndPathMesh' has a wrong offset!");
static_assert(offsetof(UTrunkRoadDataAsset, ViaductPier) == 0x0000A0, "Member 'UTrunkRoadDataAsset::ViaductPier' has a wrong offset!");
static_assert(offsetof(UTrunkRoadDataAsset, RoadPathDecoration) == 0x0000B0, "Member 'UTrunkRoadDataAsset::RoadPathDecoration' has a wrong offset!");
static_assert(offsetof(UTrunkRoadDataAsset, TrafficLight) == 0x0000C0, "Member 'UTrunkRoadDataAsset::TrafficLight' has a wrong offset!");
static_assert(offsetof(UTrunkRoadDataAsset, LaneGuide) == 0x0000E8, "Member 'UTrunkRoadDataAsset::LaneGuide' has a wrong offset!");
static_assert(offsetof(UTrunkRoadDataAsset, LandscapeConfig) == 0x0000F0, "Member 'UTrunkRoadDataAsset::LandscapeConfig' has a wrong offset!");
static_assert(offsetof(UTrunkRoadDataAsset, IntersectionMesh) == 0x000110, "Member 'UTrunkRoadDataAsset::IntersectionMesh' has a wrong offset!");
static_assert(offsetof(UTrunkRoadDataAsset, IntersectionEdgePathDecorations) == 0x000128, "Member 'UTrunkRoadDataAsset::IntersectionEdgePathDecorations' has a wrong offset!");
static_assert(offsetof(UTrunkRoadDataAsset, IntersectionLaneTags) == 0x000138, "Member 'UTrunkRoadDataAsset::IntersectionLaneTags' has a wrong offset!");
static_assert(offsetof(UTrunkRoadDataAsset, IntersectionDecorationConfig) == 0x000140, "Member 'UTrunkRoadDataAsset::IntersectionDecorationConfig' has a wrong offset!");

// Class DynamicRoadKit.SideRoadMeshDataAsset
// 0x01E0 (0x0210 - 0x0030)
class USideRoadMeshDataAsset final : public UPrimaryDataAsset
{
public:
	struct FZoneLaneProfileRef                    LaneProfile;                                       // 0x0030(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FZoneGraphTagMask                      LaneTags;                                          // 0x0048(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        LaneMeshTotalWidth;                                // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LaneProfileOffset;                                 // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRoadMesh>                      LaneMeshs;                                         // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FBlindPathConfig                       BlindPathConfig;                                   // 0x0080(0x0128)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FRoadDecoration>                RoadPathDecoration;                                // 0x01A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bAffectLandscape;                                  // 0x01B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FIntersectionConnectedSector>   SidewalkSectorMesh;                                // 0x01C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRoadPathDeformationMesh>       SidewalkPathDeformationMesh;                       // 0x01D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRoadDecoration>                SidewalkPathDecoration;                            // 0x01E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRoadDecoration>                CrossWalkPathDecoration;                           // 0x01F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FZoneGraphTagMask                      CrosswalkLaneTags;                                 // 0x0200(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FZoneGraphTagMask                      IntersectionLaneTags;                              // 0x0208(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SideRoadMeshDataAsset">();
	}
	static class USideRoadMeshDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USideRoadMeshDataAsset>();
	}
};
static_assert(alignof(USideRoadMeshDataAsset) == 0x000008, "Wrong alignment on USideRoadMeshDataAsset");
static_assert(sizeof(USideRoadMeshDataAsset) == 0x000210, "Wrong size on USideRoadMeshDataAsset");
static_assert(offsetof(USideRoadMeshDataAsset, LaneProfile) == 0x000030, "Member 'USideRoadMeshDataAsset::LaneProfile' has a wrong offset!");
static_assert(offsetof(USideRoadMeshDataAsset, LaneTags) == 0x000048, "Member 'USideRoadMeshDataAsset::LaneTags' has a wrong offset!");
static_assert(offsetof(USideRoadMeshDataAsset, LaneMeshTotalWidth) == 0x000050, "Member 'USideRoadMeshDataAsset::LaneMeshTotalWidth' has a wrong offset!");
static_assert(offsetof(USideRoadMeshDataAsset, LaneProfileOffset) == 0x000058, "Member 'USideRoadMeshDataAsset::LaneProfileOffset' has a wrong offset!");
static_assert(offsetof(USideRoadMeshDataAsset, LaneMeshs) == 0x000070, "Member 'USideRoadMeshDataAsset::LaneMeshs' has a wrong offset!");
static_assert(offsetof(USideRoadMeshDataAsset, BlindPathConfig) == 0x000080, "Member 'USideRoadMeshDataAsset::BlindPathConfig' has a wrong offset!");
static_assert(offsetof(USideRoadMeshDataAsset, RoadPathDecoration) == 0x0001A8, "Member 'USideRoadMeshDataAsset::RoadPathDecoration' has a wrong offset!");
static_assert(offsetof(USideRoadMeshDataAsset, bAffectLandscape) == 0x0001B8, "Member 'USideRoadMeshDataAsset::bAffectLandscape' has a wrong offset!");
static_assert(offsetof(USideRoadMeshDataAsset, SidewalkSectorMesh) == 0x0001C0, "Member 'USideRoadMeshDataAsset::SidewalkSectorMesh' has a wrong offset!");
static_assert(offsetof(USideRoadMeshDataAsset, SidewalkPathDeformationMesh) == 0x0001D0, "Member 'USideRoadMeshDataAsset::SidewalkPathDeformationMesh' has a wrong offset!");
static_assert(offsetof(USideRoadMeshDataAsset, SidewalkPathDecoration) == 0x0001E0, "Member 'USideRoadMeshDataAsset::SidewalkPathDecoration' has a wrong offset!");
static_assert(offsetof(USideRoadMeshDataAsset, CrossWalkPathDecoration) == 0x0001F0, "Member 'USideRoadMeshDataAsset::CrossWalkPathDecoration' has a wrong offset!");
static_assert(offsetof(USideRoadMeshDataAsset, CrosswalkLaneTags) == 0x000200, "Member 'USideRoadMeshDataAsset::CrosswalkLaneTags' has a wrong offset!");
static_assert(offsetof(USideRoadMeshDataAsset, IntersectionLaneTags) == 0x000208, "Member 'USideRoadMeshDataAsset::IntersectionLaneTags' has a wrong offset!");

// Class DynamicRoadKit.RoadDecorationDataAsset
// 0x0030 (0x0060 - 0x0030)
class URoadDecorationDataAsset final : public UPrimaryDataAsset
{
public:
	TArray<struct FRoadDecoration>                RoadPathDecoration;                                // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRoadDecoration>                IntersectionSidewalkPathDecoration;                // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRoadDecoration>                IntersectionCrossWalkPathDecoration;               // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RoadDecorationDataAsset">();
	}
	static class URoadDecorationDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoadDecorationDataAsset>();
	}
};
static_assert(alignof(URoadDecorationDataAsset) == 0x000008, "Wrong alignment on URoadDecorationDataAsset");
static_assert(sizeof(URoadDecorationDataAsset) == 0x000060, "Wrong size on URoadDecorationDataAsset");
static_assert(offsetof(URoadDecorationDataAsset, RoadPathDecoration) == 0x000030, "Member 'URoadDecorationDataAsset::RoadPathDecoration' has a wrong offset!");
static_assert(offsetof(URoadDecorationDataAsset, IntersectionSidewalkPathDecoration) == 0x000040, "Member 'URoadDecorationDataAsset::IntersectionSidewalkPathDecoration' has a wrong offset!");
static_assert(offsetof(URoadDecorationDataAsset, IntersectionCrossWalkPathDecoration) == 0x000050, "Member 'URoadDecorationDataAsset::IntersectionCrossWalkPathDecoration' has a wrong offset!");

// Class DynamicRoadKit.DynamicRoadConfig
// 0x0018 (0x0048 - 0x0030)
class UDynamicRoadConfig final : public UDataAsset
{
public:
	class UTrunkRoadDataAsset*                    TrunkRoad;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USideRoadMeshDataAsset*                 RightRoad;                                         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USideRoadMeshDataAsset*                 LeftRoad;                                          // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicRoadConfig">();
	}
	static class UDynamicRoadConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicRoadConfig>();
	}
};
static_assert(alignof(UDynamicRoadConfig) == 0x000008, "Wrong alignment on UDynamicRoadConfig");
static_assert(sizeof(UDynamicRoadConfig) == 0x000048, "Wrong size on UDynamicRoadConfig");
static_assert(offsetof(UDynamicRoadConfig, TrunkRoad) == 0x000030, "Member 'UDynamicRoadConfig::TrunkRoad' has a wrong offset!");
static_assert(offsetof(UDynamicRoadConfig, RightRoad) == 0x000038, "Member 'UDynamicRoadConfig::RightRoad' has a wrong offset!");
static_assert(offsetof(UDynamicRoadConfig, LeftRoad) == 0x000040, "Member 'UDynamicRoadConfig::LeftRoad' has a wrong offset!");

// Class DynamicRoadKit.RoadReplaceSection
// 0x0060 (0x0090 - 0x0030)
class URoadReplaceSection final : public UDataAsset
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRoadSectionReplaceNetwork             Network;                                           // 0x0038(0x0054)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RoadReplaceSection">();
	}
	static class URoadReplaceSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoadReplaceSection>();
	}
};
static_assert(alignof(URoadReplaceSection) == 0x000008, "Wrong alignment on URoadReplaceSection");
static_assert(sizeof(URoadReplaceSection) == 0x000090, "Wrong size on URoadReplaceSection");
static_assert(offsetof(URoadReplaceSection, StaticMesh) == 0x000030, "Member 'URoadReplaceSection::StaticMesh' has a wrong offset!");
static_assert(offsetof(URoadReplaceSection, Network) == 0x000038, "Member 'URoadReplaceSection::Network' has a wrong offset!");

// Class DynamicRoadKit.RoadEditComponent
// 0x0008 (0x00C8 - 0x00C0)
class URoadEditComponent final : public UActorComponent
{
public:
	bool                                          bEnableRoadEdit;                                   // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RoadEditComponent">();
	}
	static class URoadEditComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoadEditComponent>();
	}
};
static_assert(alignof(URoadEditComponent) == 0x000008, "Wrong alignment on URoadEditComponent");
static_assert(sizeof(URoadEditComponent) == 0x0000C8, "Wrong size on URoadEditComponent");
static_assert(offsetof(URoadEditComponent, bEnableRoadEdit) == 0x0000C0, "Member 'URoadEditComponent::bEnableRoadEdit' has a wrong offset!");

// Class DynamicRoadKit.RoadGraphElementInterface
// 0x0000 (0x0000 - 0x0000)
class IRoadGraphElementInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RoadGraphElementInterface">();
	}
	static class IRoadGraphElementInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IRoadGraphElementInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IRoadGraphElementInterface) == 0x000001, "Wrong alignment on IRoadGraphElementInterface");
static_assert(sizeof(IRoadGraphElementInterface) == 0x000001, "Wrong size on IRoadGraphElementInterface");

// Class DynamicRoadKit.RoadGraphSubsystem
// 0x0038 (0x0068 - 0x0030)
class URoadGraphSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class URoadSegmentComponent>> ShapeComponents;                             // 0x0038(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class URoadNodeComponent>> RoadNodeComponents;                             // 0x0048(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class ARoadSegmentActor>> PrefabSlotLockedRoads;                           // 0x0058(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RoadGraphSubsystem">();
	}
	static class URoadGraphSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoadGraphSubsystem>();
	}
};
static_assert(alignof(URoadGraphSubsystem) == 0x000008, "Wrong alignment on URoadGraphSubsystem");
static_assert(sizeof(URoadGraphSubsystem) == 0x000068, "Wrong size on URoadGraphSubsystem");
static_assert(offsetof(URoadGraphSubsystem, ShapeComponents) == 0x000038, "Member 'URoadGraphSubsystem::ShapeComponents' has a wrong offset!");
static_assert(offsetof(URoadGraphSubsystem, RoadNodeComponents) == 0x000048, "Member 'URoadGraphSubsystem::RoadNodeComponents' has a wrong offset!");
static_assert(offsetof(URoadGraphSubsystem, PrefabSlotLockedRoads) == 0x000058, "Member 'URoadGraphSubsystem::PrefabSlotLockedRoads' has a wrong offset!");

// Class DynamicRoadKit.RoadMeshGeneratorComponent
// 0x00D8 (0x0198 - 0x00C0)
class URoadMeshGeneratorComponent final : public UActorComponent
{
public:
	TArray<struct FTransform>                     RoadLinePoints;                                    // 0x00C0(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRoadMeshSweepVertices>         RoadMeshSweepVertices;                             // 0x00D0(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRoadEndTriangulatedVertices>   RoadEndTriangulatedVertices;                       // 0x00E0(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRoadPathElement>               RoadPathElements;                                  // 0x00F0(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRoadSigleElement>              RoadSigleElements;                                 // 0x0100(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRoadSplineMesh>                RoadSplineMeshs;                                   // 0x0110(0x0010)(BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FRoadTriangulatedPolygon3DVertices> RoadTriangulatedPolygon3DVertices;             // 0x0120(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UDynamicMeshComponent*                  RoadDynamicMeshComp;                               // 0x0130(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RoadGeneratorStaticMeshTag;                        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USplineMeshComponent*>           SplineMeshComps;                                   // 0x0140(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UStaticMeshComponent*>           StaticMeshComps;                                   // 0x0150(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UChildActorComponent*>           ChildActorComps;                                   // 0x0160(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UComponentPool*                         StaticMeshCompPool;                                // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UComponentPool*                         ChildActorCompPool;                                // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UComponentPool*                         SplineMeshCompPool;                                // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_188[0x10];                                     // 0x0188(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ApplyDynamicMeshMaterials();
	void BuildRoad();
	void SetRoadLinePoints(const TArray<struct FTransform>& InRoadLinePoints);
	void UpdateRoadDynamicMesh();
	void UpdateRoadPathElements();
	void UpdateRoadSigleElements();
	void UpdateRoadSplineMesh();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RoadMeshGeneratorComponent">();
	}
	static class URoadMeshGeneratorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoadMeshGeneratorComponent>();
	}
};
static_assert(alignof(URoadMeshGeneratorComponent) == 0x000008, "Wrong alignment on URoadMeshGeneratorComponent");
static_assert(sizeof(URoadMeshGeneratorComponent) == 0x000198, "Wrong size on URoadMeshGeneratorComponent");
static_assert(offsetof(URoadMeshGeneratorComponent, RoadLinePoints) == 0x0000C0, "Member 'URoadMeshGeneratorComponent::RoadLinePoints' has a wrong offset!");
static_assert(offsetof(URoadMeshGeneratorComponent, RoadMeshSweepVertices) == 0x0000D0, "Member 'URoadMeshGeneratorComponent::RoadMeshSweepVertices' has a wrong offset!");
static_assert(offsetof(URoadMeshGeneratorComponent, RoadEndTriangulatedVertices) == 0x0000E0, "Member 'URoadMeshGeneratorComponent::RoadEndTriangulatedVertices' has a wrong offset!");
static_assert(offsetof(URoadMeshGeneratorComponent, RoadPathElements) == 0x0000F0, "Member 'URoadMeshGeneratorComponent::RoadPathElements' has a wrong offset!");
static_assert(offsetof(URoadMeshGeneratorComponent, RoadSigleElements) == 0x000100, "Member 'URoadMeshGeneratorComponent::RoadSigleElements' has a wrong offset!");
static_assert(offsetof(URoadMeshGeneratorComponent, RoadSplineMeshs) == 0x000110, "Member 'URoadMeshGeneratorComponent::RoadSplineMeshs' has a wrong offset!");
static_assert(offsetof(URoadMeshGeneratorComponent, RoadTriangulatedPolygon3DVertices) == 0x000120, "Member 'URoadMeshGeneratorComponent::RoadTriangulatedPolygon3DVertices' has a wrong offset!");
static_assert(offsetof(URoadMeshGeneratorComponent, RoadDynamicMeshComp) == 0x000130, "Member 'URoadMeshGeneratorComponent::RoadDynamicMeshComp' has a wrong offset!");
static_assert(offsetof(URoadMeshGeneratorComponent, RoadGeneratorStaticMeshTag) == 0x000138, "Member 'URoadMeshGeneratorComponent::RoadGeneratorStaticMeshTag' has a wrong offset!");
static_assert(offsetof(URoadMeshGeneratorComponent, SplineMeshComps) == 0x000140, "Member 'URoadMeshGeneratorComponent::SplineMeshComps' has a wrong offset!");
static_assert(offsetof(URoadMeshGeneratorComponent, StaticMeshComps) == 0x000150, "Member 'URoadMeshGeneratorComponent::StaticMeshComps' has a wrong offset!");
static_assert(offsetof(URoadMeshGeneratorComponent, ChildActorComps) == 0x000160, "Member 'URoadMeshGeneratorComponent::ChildActorComps' has a wrong offset!");
static_assert(offsetof(URoadMeshGeneratorComponent, StaticMeshCompPool) == 0x000170, "Member 'URoadMeshGeneratorComponent::StaticMeshCompPool' has a wrong offset!");
static_assert(offsetof(URoadMeshGeneratorComponent, ChildActorCompPool) == 0x000178, "Member 'URoadMeshGeneratorComponent::ChildActorCompPool' has a wrong offset!");
static_assert(offsetof(URoadMeshGeneratorComponent, SplineMeshCompPool) == 0x000180, "Member 'URoadMeshGeneratorComponent::SplineMeshCompPool' has a wrong offset!");

// Class DynamicRoadKit.RoadNodeActor
// 0x0118 (0x03F0 - 0x02D8)
class ARoadNodeActor final : public ARoadBaseActor
{
public:
	uint8                                         Pad_2D8[0x8];                                      // 0x02D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class URoadMeshGeneratorComponent*            RoadMeshGeneratorComponent;                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URoadNodeComponent*                     RoadNodeComponent;                                 // 0x02E8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URoadEditComponent*                     RoadEditComponent;                                 // 0x02F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULandscapeSplinesComponent*             LandscapeSplinesComponent;                         // 0x02F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VertexSampleInterval;                              // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RoadReduceHeight;                                  // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FIntersectionRoadConfig>        IntersectionRoadConfigs;                           // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_318[0x4];                                      // 0x0318(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  LandscapeGuid;                                     // 0x031C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntersectionInfo                      IntersectionInfo;                                  // 0x0330(0x0090)(NativeAccessSpecifierPrivate)
	TArray<struct FSideRoadExtraInfo>             SideRoadExtraInfos;                                // 0x03C0(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FIntersectionSideInfo>          IntersectionSideInfos;                             // 0x03D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FZoneShapeNetwork>              Networks;                                          // 0x03E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	void ApplyRoadSplineToLandscape();
	void RemoveRoadSplineFromLandscape();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RoadNodeActor">();
	}
	static class ARoadNodeActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARoadNodeActor>();
	}
};
static_assert(alignof(ARoadNodeActor) == 0x000008, "Wrong alignment on ARoadNodeActor");
static_assert(sizeof(ARoadNodeActor) == 0x0003F0, "Wrong size on ARoadNodeActor");
static_assert(offsetof(ARoadNodeActor, RoadMeshGeneratorComponent) == 0x0002E0, "Member 'ARoadNodeActor::RoadMeshGeneratorComponent' has a wrong offset!");
static_assert(offsetof(ARoadNodeActor, RoadNodeComponent) == 0x0002E8, "Member 'ARoadNodeActor::RoadNodeComponent' has a wrong offset!");
static_assert(offsetof(ARoadNodeActor, RoadEditComponent) == 0x0002F0, "Member 'ARoadNodeActor::RoadEditComponent' has a wrong offset!");
static_assert(offsetof(ARoadNodeActor, LandscapeSplinesComponent) == 0x0002F8, "Member 'ARoadNodeActor::LandscapeSplinesComponent' has a wrong offset!");
static_assert(offsetof(ARoadNodeActor, VertexSampleInterval) == 0x000300, "Member 'ARoadNodeActor::VertexSampleInterval' has a wrong offset!");
static_assert(offsetof(ARoadNodeActor, RoadReduceHeight) == 0x000304, "Member 'ARoadNodeActor::RoadReduceHeight' has a wrong offset!");
static_assert(offsetof(ARoadNodeActor, IntersectionRoadConfigs) == 0x000308, "Member 'ARoadNodeActor::IntersectionRoadConfigs' has a wrong offset!");
static_assert(offsetof(ARoadNodeActor, LandscapeGuid) == 0x00031C, "Member 'ARoadNodeActor::LandscapeGuid' has a wrong offset!");
static_assert(offsetof(ARoadNodeActor, IntersectionInfo) == 0x000330, "Member 'ARoadNodeActor::IntersectionInfo' has a wrong offset!");
static_assert(offsetof(ARoadNodeActor, SideRoadExtraInfos) == 0x0003C0, "Member 'ARoadNodeActor::SideRoadExtraInfos' has a wrong offset!");
static_assert(offsetof(ARoadNodeActor, IntersectionSideInfos) == 0x0003D0, "Member 'ARoadNodeActor::IntersectionSideInfos' has a wrong offset!");
static_assert(offsetof(ARoadNodeActor, Networks) == 0x0003E0, "Member 'ARoadNodeActor::Networks' has a wrong offset!");

// Class DynamicRoadKit.RoadNodeComponent
// 0x0058 (0x05A0 - 0x0548)
class URoadNodeComponent final : public UPrimitiveComponent
{
public:
	uint8                                         Pad_548[0x8];                                      // 0x0548(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IntersectionRange;                                 // 0x0550(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSnapForwardAnglesToInteger;                       // 0x0554(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_555[0x3];                                      // 0x0555(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRoadNodeAttachment>            AttachedSegments;                                  // 0x0558(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FRoadSegmentAttachedSegmentInfo> AttachedSegmentInfos;                             // 0x0568(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FRoadNodeAttachedSegmentCalcInfo> AttachedSegmentCalcInfos;                        // 0x0578(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_588[0x18];                                     // 0x0588(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ApplyEntryTransformsToAttachedSegments();
	void AttachSegment(class URoadSegmentComponent* Curve, int32 ConnectorIndex, bool bUpdateNode);
	void DetachSegment(class URoadSegmentComponent* Curve, int32 ConnectorIndex, bool bUpdateNode);
	void SetAttachSegments(const TArray<struct FRoadNodeAttachment>& InAttachedSegments, bool bUpdate);
	void UpdateAttachedSegmentInfos();

	void GetAttachedSegmentCalcInfos(TArray<struct FRoadNodeAttachedSegmentCalcInfo>* OutInfos) const;
	void GetAttachedSegmentInfos(TArray<struct FRoadSegmentAttachedSegmentInfo>* OutInfos) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RoadNodeComponent">();
	}
	static class URoadNodeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoadNodeComponent>();
	}
};
static_assert(alignof(URoadNodeComponent) == 0x000008, "Wrong alignment on URoadNodeComponent");
static_assert(sizeof(URoadNodeComponent) == 0x0005A0, "Wrong size on URoadNodeComponent");
static_assert(offsetof(URoadNodeComponent, IntersectionRange) == 0x000550, "Member 'URoadNodeComponent::IntersectionRange' has a wrong offset!");
static_assert(offsetof(URoadNodeComponent, bSnapForwardAnglesToInteger) == 0x000554, "Member 'URoadNodeComponent::bSnapForwardAnglesToInteger' has a wrong offset!");
static_assert(offsetof(URoadNodeComponent, AttachedSegments) == 0x000558, "Member 'URoadNodeComponent::AttachedSegments' has a wrong offset!");
static_assert(offsetof(URoadNodeComponent, AttachedSegmentInfos) == 0x000568, "Member 'URoadNodeComponent::AttachedSegmentInfos' has a wrong offset!");
static_assert(offsetof(URoadNodeComponent, AttachedSegmentCalcInfos) == 0x000578, "Member 'URoadNodeComponent::AttachedSegmentCalcInfos' has a wrong offset!");

// Class DynamicRoadKit.RoadPrefabNodeActor
// 0x0090 (0x0368 - 0x02D8)
class ARoadPrefabNodeActor final : public ARoadBaseActor
{
public:
	uint8                                         Pad_2D8[0x8];                                      // 0x02D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class URoadPrefabNodeDataAsset*               RoadPrefabNodeDefinition;                          // 0x02E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URoadPrefabNodeComponent*               RoadPrefabNodeComponent;                           // 0x02E8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   IntersectionMeshComponent;                         // 0x02F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URoadEditComponent*                     RoadEditComponent;                                 // 0x02F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULandscapeSplinesComponent*             LandscapeSplinesComponent;                         // 0x0300(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class ALandscape>              LandscapeActor;                                    // 0x0308(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideAffectLandscapeConfig;                    // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRoadLandscapeConfig                   LandscapeConfig;                                   // 0x0334(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGuid                                  LandscapeGuid;                                     // 0x0354(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetNumSlots() const;
	const class URoadPrefabNodeDataAsset* GetRoadPrefabNodeDefinition() const;
	struct FTransform GetSlotWorldTransform(int32 SlotIndex) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RoadPrefabNodeActor">();
	}
	static class ARoadPrefabNodeActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARoadPrefabNodeActor>();
	}
};
static_assert(alignof(ARoadPrefabNodeActor) == 0x000008, "Wrong alignment on ARoadPrefabNodeActor");
static_assert(sizeof(ARoadPrefabNodeActor) == 0x000368, "Wrong size on ARoadPrefabNodeActor");
static_assert(offsetof(ARoadPrefabNodeActor, RoadPrefabNodeDefinition) == 0x0002E0, "Member 'ARoadPrefabNodeActor::RoadPrefabNodeDefinition' has a wrong offset!");
