#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FastGeoStreaming

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class FastGeoStreaming.FastGeoContainer
// 0x0118 (0x0140 - 0x0028)
class UFastGeoContainer final : public UAssetUserData
{
public:
	uint8                                         Pad_28[0xA8];                                      // 0x0028(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        Assets;                                            // 0x00D0(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E0[0x60];                                      // 0x00E0(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FastGeoContainer">();
	}
	static class UFastGeoContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFastGeoContainer>();
	}
};
static_assert(alignof(UFastGeoContainer) == 0x000008, "Wrong alignment on UFastGeoContainer");
static_assert(sizeof(UFastGeoContainer) == 0x000140, "Wrong size on UFastGeoContainer");
static_assert(offsetof(UFastGeoContainer, Assets) == 0x0000D0, "Member 'UFastGeoContainer::Assets' has a wrong offset!");

// Class FastGeoStreaming.FastGeoWorldPartitionRuntimeCellTransformer
// 0x0000 (0x0030 - 0x0030)
class UFastGeoWorldPartitionRuntimeCellTransformer : public UWorldPartitionRuntimeCellTransformer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FastGeoWorldPartitionRuntimeCellTransformer">();
	}
	static class UFastGeoWorldPartitionRuntimeCellTransformer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFastGeoWorldPartitionRuntimeCellTransformer>();
	}
};
static_assert(alignof(UFastGeoWorldPartitionRuntimeCellTransformer) == 0x000008, "Wrong alignment on UFastGeoWorldPartitionRuntimeCellTransformer");
static_assert(sizeof(UFastGeoWorldPartitionRuntimeCellTransformer) == 0x000030, "Wrong size on UFastGeoWorldPartitionRuntimeCellTransformer");

// Class FastGeoStreaming.FastGeoWorldSubsystem
// 0x0050 (0x0090 - 0x0040)
class UFastGeoWorldSubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_40[0x50];                                      // 0x0040(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FastGeoWorldSubsystem">();
	}
	static class UFastGeoWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFastGeoWorldSubsystem>();
	}
};
static_assert(alignof(UFastGeoWorldSubsystem) == 0x000008, "Wrong alignment on UFastGeoWorldSubsystem");
static_assert(sizeof(UFastGeoWorldSubsystem) == 0x000090, "Wrong size on UFastGeoWorldSubsystem");

}

