#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FieldInteraction

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum FieldInteraction.EFieldForceDirectionType
// NumValues: 0x0005
enum class EFieldForceDirectionType : uint8
{
	MovingDirection                          = 0,
	RadialOutward                            = 1,
	RadialInward                             = 2,
	ReverseMovingDirection                   = 3,
	EFieldForceDirectionType_MAX             = 4,
};

// Enum FieldInteraction.EFieldForcePlayerState
// NumValues: 0x0009
enum class EFieldForcePlayerState : uint8
{
	Default                                  = 0,
	DrivingVehicle                           = 1,
	Walking                                  = 2,
	Running                                  = 3,
	Flying                                   = 4,
	Swimming                                 = 5,
	Climbing                                 = 6,
	Idle                                     = 7,
	EFieldForcePlayerState_MAX               = 8,
};

// ScriptStruct FieldInteraction.FieldInfluenceCapsule
// 0x0090 (0x0090 - 0x0000)
struct FFieldInfluenceCapsule final
{
public:
	struct FVector4                               StartLocationAndRadius;                            // 0x0000(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               EndLocationAndRadius;                              // 0x0020(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               StartVelocityAndStrength;                          // 0x0040(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               EndVelocityAndStrength;                            // 0x0060(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LiftWeight;                                        // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableImpactForce;                                 // 0x0084(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableWindForce;                                   // 0x0085(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFieldForceDirectionType                      ForceDirection;                                    // 0x0086(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_87[0x1];                                       // 0x0087(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FoliageIntensityScale;                             // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFieldInfluenceCapsule) == 0x000004, "Wrong alignment on FFieldInfluenceCapsule");
static_assert(sizeof(FFieldInfluenceCapsule) == 0x000090, "Wrong size on FFieldInfluenceCapsule");
static_assert(offsetof(FFieldInfluenceCapsule, StartLocationAndRadius) == 0x000000, "Member 'FFieldInfluenceCapsule::StartLocationAndRadius' has a wrong offset!");
static_assert(offsetof(FFieldInfluenceCapsule, EndLocationAndRadius) == 0x000020, "Member 'FFieldInfluenceCapsule::EndLocationAndRadius' has a wrong offset!");
static_assert(offsetof(FFieldInfluenceCapsule, StartVelocityAndStrength) == 0x000040, "Member 'FFieldInfluenceCapsule::StartVelocityAndStrength' has a wrong offset!");
static_assert(offsetof(FFieldInfluenceCapsule, EndVelocityAndStrength) == 0x000060, "Member 'FFieldInfluenceCapsule::EndVelocityAndStrength' has a wrong offset!");
static_assert(offsetof(FFieldInfluenceCapsule, LiftWeight) == 0x000080, "Member 'FFieldInfluenceCapsule::LiftWeight' has a wrong offset!");
static_assert(offsetof(FFieldInfluenceCapsule, EnableImpactForce) == 0x000084, "Member 'FFieldInfluenceCapsule::EnableImpactForce' has a wrong offset!");
static_assert(offsetof(FFieldInfluenceCapsule, EnableWindForce) == 0x000085, "Member 'FFieldInfluenceCapsule::EnableWindForce' has a wrong offset!");
static_assert(offsetof(FFieldInfluenceCapsule, ForceDirection) == 0x000086, "Member 'FFieldInfluenceCapsule::ForceDirection' has a wrong offset!");
static_assert(offsetof(FFieldInfluenceCapsule, FoliageIntensityScale) == 0x000088, "Member 'FFieldInfluenceCapsule::FoliageIntensityScale' has a wrong offset!");

// ScriptStruct FieldInteraction.FieldInteractionImpulse
// 0x00B0 (0x00B0 - 0x0000)
struct FFieldInteractionImpulse final
{
public:
	float                                         StartTime;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            Curve;                                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFieldInfluenceCapsule                 Shape;                                             // 0x0010(0x0090)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         duration;                                          // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0xC];                                       // 0x00A4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFieldInteractionImpulse) == 0x000008, "Wrong alignment on FFieldInteractionImpulse");
static_assert(sizeof(FFieldInteractionImpulse) == 0x0000B0, "Wrong size on FFieldInteractionImpulse");
static_assert(offsetof(FFieldInteractionImpulse, StartTime) == 0x000000, "Member 'FFieldInteractionImpulse::StartTime' has a wrong offset!");
static_assert(offsetof(FFieldInteractionImpulse, Curve) == 0x000008, "Member 'FFieldInteractionImpulse::Curve' has a wrong offset!");
static_assert(offsetof(FFieldInteractionImpulse, Shape) == 0x000010, "Member 'FFieldInteractionImpulse::Shape' has a wrong offset!");
static_assert(offsetof(FFieldInteractionImpulse, duration) == 0x0000A0, "Member 'FFieldInteractionImpulse::duration' has a wrong offset!");

// ScriptStruct FieldInteraction.CharacterForceField
// 0x0040 (0x0040 - 0x0000)
struct FCharacterForceField final
{
public:
	class FName                                   SocketName;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForceStrength;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForceRadius;                                       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SocketOffset;                                      // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LiftWeight;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         duration;                                          // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinSpeed;                                          // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableImpactForce;                                 // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableWindForce;                                   // 0x0035(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFieldForceDirectionType                      ForceDirection;                                    // 0x0036(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FoliageIntensityScale;                             // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCharacterForceField) == 0x000004, "Wrong alignment on FCharacterForceField");
static_assert(sizeof(FCharacterForceField) == 0x000040, "Wrong size on FCharacterForceField");
static_assert(offsetof(FCharacterForceField, SocketName) == 0x000000, "Member 'FCharacterForceField::SocketName' has a wrong offset!");
static_assert(offsetof(FCharacterForceField, ForceStrength) == 0x000008, "Member 'FCharacterForceField::ForceStrength' has a wrong offset!");
static_assert(offsetof(FCharacterForceField, ForceRadius) == 0x00000C, "Member 'FCharacterForceField::ForceRadius' has a wrong offset!");
static_assert(offsetof(FCharacterForceField, SocketOffset) == 0x000010, "Member 'FCharacterForceField::SocketOffset' has a wrong offset!");
static_assert(offsetof(FCharacterForceField, LiftWeight) == 0x000028, "Member 'FCharacterForceField::LiftWeight' has a wrong offset!");
static_assert(offsetof(FCharacterForceField, duration) == 0x00002C, "Member 'FCharacterForceField::duration' has a wrong offset!");
static_assert(offsetof(FCharacterForceField, MinSpeed) == 0x000030, "Member 'FCharacterForceField::MinSpeed' has a wrong offset!");
static_assert(offsetof(FCharacterForceField, EnableImpactForce) == 0x000034, "Member 'FCharacterForceField::EnableImpactForce' has a wrong offset!");
static_assert(offsetof(FCharacterForceField, EnableWindForce) == 0x000035, "Member 'FCharacterForceField::EnableWindForce' has a wrong offset!");
static_assert(offsetof(FCharacterForceField, ForceDirection) == 0x000036, "Member 'FCharacterForceField::ForceDirection' has a wrong offset!");
static_assert(offsetof(FCharacterForceField, FoliageIntensityScale) == 0x000038, "Member 'FCharacterForceField::FoliageIntensityScale' has a wrong offset!");

// ScriptStruct FieldInteraction.VehicleForceFieldRange
// 0x0020 (0x0020 - 0x0000)
struct FVehicleForceFieldRange final
{
public:
	float                                         ForceRadius;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForceStrengthWeight;                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocalForceLocation;                                // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FVehicleForceFieldRange) == 0x000004, "Wrong alignment on FVehicleForceFieldRange");
static_assert(sizeof(FVehicleForceFieldRange) == 0x000020, "Wrong size on FVehicleForceFieldRange");
static_assert(offsetof(FVehicleForceFieldRange, ForceRadius) == 0x000000, "Member 'FVehicleForceFieldRange::ForceRadius' has a wrong offset!");
static_assert(offsetof(FVehicleForceFieldRange, ForceStrengthWeight) == 0x000004, "Member 'FVehicleForceFieldRange::ForceStrengthWeight' has a wrong offset!");
static_assert(offsetof(FVehicleForceFieldRange, LocalForceLocation) == 0x000008, "Member 'FVehicleForceFieldRange::LocalForceLocation' has a wrong offset!");

// ScriptStruct FieldInteraction.ForceFieldCollision
// 0x0040 (0x0040 - 0x0000)
struct FForceFieldCollision final
{
public:
	float                                         TopVehicleHeight;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BottomVehicleHeight;                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocalStartForceLocation;                           // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocalEndForceLocation;                             // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radian;                                            // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FForceFieldCollision) == 0x000004, "Wrong alignment on FForceFieldCollision");
static_assert(sizeof(FForceFieldCollision) == 0x000040, "Wrong size on FForceFieldCollision");
static_assert(offsetof(FForceFieldCollision, TopVehicleHeight) == 0x000000, "Member 'FForceFieldCollision::TopVehicleHeight' has a wrong offset!");
static_assert(offsetof(FForceFieldCollision, BottomVehicleHeight) == 0x000004, "Member 'FForceFieldCollision::BottomVehicleHeight' has a wrong offset!");
static_assert(offsetof(FForceFieldCollision, LocalStartForceLocation) == 0x000008, "Member 'FForceFieldCollision::LocalStartForceLocation' has a wrong offset!");
static_assert(offsetof(FForceFieldCollision, LocalEndForceLocation) == 0x000020, "Member 'FForceFieldCollision::LocalEndForceLocation' has a wrong offset!");
static_assert(offsetof(FForceFieldCollision, Radian) == 0x000038, "Member 'FForceFieldCollision::Radian' has a wrong offset!");

// ScriptStruct FieldInteraction.FieldInteractionPredictedFrameCollision
// 0x0060 (0x0060 - 0x0000)
struct FFieldInteractionPredictedFrameCollision final
{
public:
	struct FVector4                               StartXYBottomZAndRadius;                           // 0x0000(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               EndXYTopZAndRadius;                                // 0x0020(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               Velocity;                                          // 0x0040(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFieldInteractionPredictedFrameCollision) == 0x000001, "Wrong alignment on FFieldInteractionPredictedFrameCollision");
static_assert(sizeof(FFieldInteractionPredictedFrameCollision) == 0x000060, "Wrong size on FFieldInteractionPredictedFrameCollision");
static_assert(offsetof(FFieldInteractionPredictedFrameCollision, StartXYBottomZAndRadius) == 0x000000, "Member 'FFieldInteractionPredictedFrameCollision::StartXYBottomZAndRadius' has a wrong offset!");
static_assert(offsetof(FFieldInteractionPredictedFrameCollision, EndXYTopZAndRadius) == 0x000020, "Member 'FFieldInteractionPredictedFrameCollision::EndXYTopZAndRadius' has a wrong offset!");
static_assert(offsetof(FFieldInteractionPredictedFrameCollision, Velocity) == 0x000040, "Member 'FFieldInteractionPredictedFrameCollision::Velocity' has a wrong offset!");

// ScriptStruct FieldInteraction.SocketForceField
// 0x0048 (0x0048 - 0x0000)
struct FSocketForceField final
{
public:
	class FName                                   MeshTag;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshComponent*                         Mesh;                                              // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindStrength;                                      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindRadius;                                        // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LiftStrength;                                      // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableImpactForce;                                 // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableWindForce;                                   // 0x0025(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFieldForceDirectionType                      ForceDirection;                                    // 0x0026(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SocketOffset;                                      // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         duration;                                          // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSocketForceField) == 0x000008, "Wrong alignment on FSocketForceField");
static_assert(sizeof(FSocketForceField) == 0x000048, "Wrong size on FSocketForceField");
static_assert(offsetof(FSocketForceField, MeshTag) == 0x000000, "Member 'FSocketForceField::MeshTag' has a wrong offset!");
static_assert(offsetof(FSocketForceField, Mesh) == 0x000008, "Member 'FSocketForceField::Mesh' has a wrong offset!");
static_assert(offsetof(FSocketForceField, SocketName) == 0x000010, "Member 'FSocketForceField::SocketName' has a wrong offset!");
static_assert(offsetof(FSocketForceField, WindStrength) == 0x000018, "Member 'FSocketForceField::WindStrength' has a wrong offset!");
static_assert(offsetof(FSocketForceField, WindRadius) == 0x00001C, "Member 'FSocketForceField::WindRadius' has a wrong offset!");
static_assert(offsetof(FSocketForceField, LiftStrength) == 0x000020, "Member 'FSocketForceField::LiftStrength' has a wrong offset!");
static_assert(offsetof(FSocketForceField, EnableImpactForce) == 0x000024, "Member 'FSocketForceField::EnableImpactForce' has a wrong offset!");
static_assert(offsetof(FSocketForceField, EnableWindForce) == 0x000025, "Member 'FSocketForceField::EnableWindForce' has a wrong offset!");
static_assert(offsetof(FSocketForceField, ForceDirection) == 0x000026, "Member 'FSocketForceField::ForceDirection' has a wrong offset!");
static_assert(offsetof(FSocketForceField, SocketOffset) == 0x000028, "Member 'FSocketForceField::SocketOffset' has a wrong offset!");
static_assert(offsetof(FSocketForceField, duration) == 0x000040, "Member 'FSocketForceField::duration' has a wrong offset!");

}

