#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FieldInteraction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FieldInteraction_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FieldInteraction.FieldInteractionComponent.SetActiveField
// 0x0001 (0x0001 - 0x0000)
struct FieldInteractionComponent_SetActiveField final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FieldInteractionComponent_SetActiveField) == 0x000001, "Wrong alignment on FieldInteractionComponent_SetActiveField");
static_assert(sizeof(FieldInteractionComponent_SetActiveField) == 0x000001, "Wrong size on FieldInteractionComponent_SetActiveField");
static_assert(offsetof(FieldInteractionComponent_SetActiveField, bActive) == 0x000000, "Member 'FieldInteractionComponent_SetActiveField::bActive' has a wrong offset!");

// Function FieldInteraction.CharacterForceFieldComponent.SetTargetMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct CharacterForceFieldComponent_SetTargetMeshComponent final
{
public:
	const class USkeletalMeshComponent*           InMeshComponent;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterForceFieldComponent_SetTargetMeshComponent) == 0x000008, "Wrong alignment on CharacterForceFieldComponent_SetTargetMeshComponent");
static_assert(sizeof(CharacterForceFieldComponent_SetTargetMeshComponent) == 0x000008, "Wrong size on CharacterForceFieldComponent_SetTargetMeshComponent");
static_assert(offsetof(CharacterForceFieldComponent_SetTargetMeshComponent, InMeshComponent) == 0x000000, "Member 'CharacterForceFieldComponent_SetTargetMeshComponent::InMeshComponent' has a wrong offset!");

// Function FieldInteraction.CharacterForceFieldComponent.SetWindFieldParams
// 0x0010 (0x0010 - 0x0000)
struct CharacterForceFieldComponent_SetWindFieldParams final
{
public:
	TArray<struct FCharacterForceField>           InParams;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterForceFieldComponent_SetWindFieldParams) == 0x000008, "Wrong alignment on CharacterForceFieldComponent_SetWindFieldParams");
static_assert(sizeof(CharacterForceFieldComponent_SetWindFieldParams) == 0x000010, "Wrong size on CharacterForceFieldComponent_SetWindFieldParams");
static_assert(offsetof(CharacterForceFieldComponent_SetWindFieldParams, InParams) == 0x000000, "Member 'CharacterForceFieldComponent_SetWindFieldParams::InParams' has a wrong offset!");

// Function FieldInteraction.CharacterForceFieldComponent.GetForceFieldParams
// 0x0010 (0x0010 - 0x0000)
struct CharacterForceFieldComponent_GetForceFieldParams final
{
public:
	TArray<struct FCharacterForceField>           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CharacterForceFieldComponent_GetForceFieldParams) == 0x000008, "Wrong alignment on CharacterForceFieldComponent_GetForceFieldParams");
static_assert(sizeof(CharacterForceFieldComponent_GetForceFieldParams) == 0x000010, "Wrong size on CharacterForceFieldComponent_GetForceFieldParams");
static_assert(offsetof(CharacterForceFieldComponent_GetForceFieldParams, ReturnValue) == 0x000000, "Member 'CharacterForceFieldComponent_GetForceFieldParams::ReturnValue' has a wrong offset!");

// Function FieldInteraction.FieldInteractionBase.UnregisterField
// 0x0001 (0x0001 - 0x0000)
struct FieldInteractionBase_UnregisterField final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FieldInteractionBase_UnregisterField) == 0x000001, "Wrong alignment on FieldInteractionBase_UnregisterField");
static_assert(sizeof(FieldInteractionBase_UnregisterField) == 0x000001, "Wrong size on FieldInteractionBase_UnregisterField");
static_assert(offsetof(FieldInteractionBase_UnregisterField, EndPlayReason) == 0x000000, "Member 'FieldInteractionBase_UnregisterField::EndPlayReason' has a wrong offset!");

// Function FieldInteraction.FieldInteractionManager.AddForceFieldImpulse
// 0x00B0 (0x00B0 - 0x0000)
struct FieldInteractionManager_AddForceFieldImpulse final
{
public:
	struct FFieldInteractionImpulse               InInteractionBody;                                 // 0x0000(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FieldInteractionManager_AddForceFieldImpulse) == 0x000001, "Wrong alignment on FieldInteractionManager_AddForceFieldImpulse");
static_assert(sizeof(FieldInteractionManager_AddForceFieldImpulse) == 0x0000B0, "Wrong size on FieldInteractionManager_AddForceFieldImpulse");
static_assert(offsetof(FieldInteractionManager_AddForceFieldImpulse, InInteractionBody) == 0x000000, "Member 'FieldInteractionManager_AddForceFieldImpulse::InInteractionBody' has a wrong offset!");

// Function FieldInteraction.FieldInteractionManager.ProcessWindImpulses
// 0x0010 (0x0010 - 0x0000)
struct FieldInteractionManager_ProcessWindImpulses final
{
public:
	TArray<struct FFieldInteractionImpulse>       Impulses;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FieldInteractionManager_ProcessWindImpulses) == 0x000008, "Wrong alignment on FieldInteractionManager_ProcessWindImpulses");
static_assert(sizeof(FieldInteractionManager_ProcessWindImpulses) == 0x000010, "Wrong size on FieldInteractionManager_ProcessWindImpulses");
static_assert(offsetof(FieldInteractionManager_ProcessWindImpulses, Impulses) == 0x000000, "Member 'FieldInteractionManager_ProcessWindImpulses::Impulses' has a wrong offset!");

// Function FieldInteraction.FieldInteractionManager.UpdateVehicleCollisionData
// 0x0004 (0x0004 - 0x0000)
struct FieldInteractionManager_UpdateVehicleCollisionData final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FieldInteractionManager_UpdateVehicleCollisionData) == 0x000004, "Wrong alignment on FieldInteractionManager_UpdateVehicleCollisionData");
static_assert(sizeof(FieldInteractionManager_UpdateVehicleCollisionData) == 0x000004, "Wrong size on FieldInteractionManager_UpdateVehicleCollisionData");
static_assert(offsetof(FieldInteractionManager_UpdateVehicleCollisionData, DeltaTime) == 0x000000, "Member 'FieldInteractionManager_UpdateVehicleCollisionData::DeltaTime' has a wrong offset!");

// Function FieldInteraction.FieldManagerSubsystem.GetManager
// 0x0008 (0x0008 - 0x0000)
struct FieldManagerSubsystem_GetManager final
{
public:
	class AFieldInteractionManager*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FieldManagerSubsystem_GetManager) == 0x000008, "Wrong alignment on FieldManagerSubsystem_GetManager");
static_assert(sizeof(FieldManagerSubsystem_GetManager) == 0x000008, "Wrong size on FieldManagerSubsystem_GetManager");
static_assert(offsetof(FieldManagerSubsystem_GetManager, ReturnValue) == 0x000000, "Member 'FieldManagerSubsystem_GetManager::ReturnValue' has a wrong offset!");

// Function FieldInteraction.FoliageInteractionBubble.GetInteractionBubbles
// 0x0020 (0x0020 - 0x0000)
struct FoliageInteractionBubble_GetInteractionBubbles final
{
public:
	TArray<struct FVector4>                       LocationAndRadius;                                 // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector4>                       VelocityAndStrength;                               // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FoliageInteractionBubble_GetInteractionBubbles) == 0x000008, "Wrong alignment on FoliageInteractionBubble_GetInteractionBubbles");
static_assert(sizeof(FoliageInteractionBubble_GetInteractionBubbles) == 0x000020, "Wrong size on FoliageInteractionBubble_GetInteractionBubbles");
static_assert(offsetof(FoliageInteractionBubble_GetInteractionBubbles, LocationAndRadius) == 0x000000, "Member 'FoliageInteractionBubble_GetInteractionBubbles::LocationAndRadius' has a wrong offset!");
static_assert(offsetof(FoliageInteractionBubble_GetInteractionBubbles, VelocityAndStrength) == 0x000010, "Member 'FoliageInteractionBubble_GetInteractionBubbles::VelocityAndStrength' has a wrong offset!");

// Function FieldInteraction.FoliageInteractionBubble.SetActiveField
// 0x0001 (0x0001 - 0x0000)
struct FoliageInteractionBubble_SetActiveField final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FoliageInteractionBubble_SetActiveField) == 0x000001, "Wrong alignment on FoliageInteractionBubble_SetActiveField");
static_assert(sizeof(FoliageInteractionBubble_SetActiveField) == 0x000001, "Wrong size on FoliageInteractionBubble_SetActiveField");
static_assert(offsetof(FoliageInteractionBubble_SetActiveField, bActive) == 0x000000, "Member 'FoliageInteractionBubble_SetActiveField::bActive' has a wrong offset!");

// Function FieldInteraction.VehicleForceFieldComponent.GetPredictedFrameCollision
// 0x0070 (0x0070 - 0x0000)
struct VehicleForceFieldComponent_GetPredictedFrameCollision final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFieldInteractionPredictedFrameCollision ReturnValue;                                     // 0x0010(0x0060)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(VehicleForceFieldComponent_GetPredictedFrameCollision) == 0x000004, "Wrong alignment on VehicleForceFieldComponent_GetPredictedFrameCollision");
static_assert(sizeof(VehicleForceFieldComponent_GetPredictedFrameCollision) == 0x000070, "Wrong size on VehicleForceFieldComponent_GetPredictedFrameCollision");
static_assert(offsetof(VehicleForceFieldComponent_GetPredictedFrameCollision, DeltaTime) == 0x000000, "Member 'VehicleForceFieldComponent_GetPredictedFrameCollision::DeltaTime' has a wrong offset!");
static_assert(offsetof(VehicleForceFieldComponent_GetPredictedFrameCollision, ReturnValue) == 0x000010, "Member 'VehicleForceFieldComponent_GetPredictedFrameCollision::ReturnValue' has a wrong offset!");

// Function FieldInteraction.VehicleForceFieldComponent.SetPlayerDriving
// 0x0001 (0x0001 - 0x0000)
struct VehicleForceFieldComponent_SetPlayerDriving final
{
public:
	bool                                          IsPlayerDriving;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VehicleForceFieldComponent_SetPlayerDriving) == 0x000001, "Wrong alignment on VehicleForceFieldComponent_SetPlayerDriving");
static_assert(sizeof(VehicleForceFieldComponent_SetPlayerDriving) == 0x000001, "Wrong size on VehicleForceFieldComponent_SetPlayerDriving");
static_assert(offsetof(VehicleForceFieldComponent_SetPlayerDriving, IsPlayerDriving) == 0x000000, "Member 'VehicleForceFieldComponent_SetPlayerDriving::IsPlayerDriving' has a wrong offset!");

// Function FieldInteraction.VehicleForceFieldComponent.SetTargetMeshComponent
// 0x0008 (0x0008 - 0x0000)
struct VehicleForceFieldComponent_SetTargetMeshComponent final
{
public:
	const class USkeletalMeshComponent*           InMeshComponent;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VehicleForceFieldComponent_SetTargetMeshComponent) == 0x000008, "Wrong alignment on VehicleForceFieldComponent_SetTargetMeshComponent");
static_assert(sizeof(VehicleForceFieldComponent_SetTargetMeshComponent) == 0x000008, "Wrong size on VehicleForceFieldComponent_SetTargetMeshComponent");
static_assert(offsetof(VehicleForceFieldComponent_SetTargetMeshComponent, InMeshComponent) == 0x000000, "Member 'VehicleForceFieldComponent_SetTargetMeshComponent::InMeshComponent' has a wrong offset!");

}

