#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayStateTreeModule

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "StateTreeModule_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// Enum GameplayStateTreeModule.EStateTreeComponentSchemaScheduledTickPolicy
// NumValues: 0x0004
enum class EStateTreeComponentSchemaScheduledTickPolicy : uint8
{
	Default                                  = 0,
	Allowed                                  = 1,
	Denied                                   = 2,
	EStateTreeComponentSchemaScheduledTickPolicy_MAX = 3,
};

// ScriptStruct GameplayStateTreeModule.StateTreeGetActorLocationPropertyFunctionInstanceData
// 0x0020 (0x0020 - 0x0000)
struct FStateTreeGetActorLocationPropertyFunctionInstanceData final
{
public:
	class AActor*                                 Input;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Output;                                            // 0x0008(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStateTreeGetActorLocationPropertyFunctionInstanceData) == 0x000008, "Wrong alignment on FStateTreeGetActorLocationPropertyFunctionInstanceData");
static_assert(sizeof(FStateTreeGetActorLocationPropertyFunctionInstanceData) == 0x000020, "Wrong size on FStateTreeGetActorLocationPropertyFunctionInstanceData");
static_assert(offsetof(FStateTreeGetActorLocationPropertyFunctionInstanceData, Input) == 0x000000, "Member 'FStateTreeGetActorLocationPropertyFunctionInstanceData::Input' has a wrong offset!");
static_assert(offsetof(FStateTreeGetActorLocationPropertyFunctionInstanceData, Output) == 0x000008, "Member 'FStateTreeGetActorLocationPropertyFunctionInstanceData::Output' has a wrong offset!");

// ScriptStruct GameplayStateTreeModule.StateTreeGetActorLocationPropertyFunction
// 0x0000 (0x0020 - 0x0020)
struct FStateTreeGetActorLocationPropertyFunction final : public FStateTreePropertyFunctionCommonBase
{
};
static_assert(alignof(FStateTreeGetActorLocationPropertyFunction) == 0x000004, "Wrong alignment on FStateTreeGetActorLocationPropertyFunction");
static_assert(sizeof(FStateTreeGetActorLocationPropertyFunction) == 0x000020, "Wrong size on FStateTreeGetActorLocationPropertyFunction");

// ScriptStruct GameplayStateTreeModule.StateTreeAIConditionBase
// 0x0000 (0x0028 - 0x0028)
struct FStateTreeAIConditionBase final : public FStateTreeConditionBase
{
};
static_assert(alignof(FStateTreeAIConditionBase) == 0x000004, "Wrong alignment on FStateTreeAIConditionBase");
static_assert(sizeof(FStateTreeAIConditionBase) == 0x000028, "Wrong size on FStateTreeAIConditionBase");

// ScriptStruct GameplayStateTreeModule.StateTreeAITaskBase
// 0x0000 (0x0028 - 0x0028)
struct FStateTreeAITaskBase : public FStateTreeTaskBase
{
};
static_assert(alignof(FStateTreeAITaskBase) == 0x000004, "Wrong alignment on FStateTreeAITaskBase");
static_assert(sizeof(FStateTreeAITaskBase) == 0x000028, "Wrong size on FStateTreeAITaskBase");

// ScriptStruct GameplayStateTreeModule.StateTreeAIActionTaskBase
// 0x0000 (0x0028 - 0x0028)
struct FStateTreeAIActionTaskBase : public FStateTreeAITaskBase
{
};
static_assert(alignof(FStateTreeAIActionTaskBase) == 0x000004, "Wrong alignment on FStateTreeAIActionTaskBase");
static_assert(sizeof(FStateTreeAIActionTaskBase) == 0x000028, "Wrong size on FStateTreeAIActionTaskBase");

// ScriptStruct GameplayStateTreeModule.StateTreeComponentExecutionExtension
// 0x0008 (0x0010 - 0x0008)
struct FStateTreeComponentExecutionExtension final : public FStateTreeExecutionExtension
{
public:
	class UStateTreeComponent*                    Component;                                         // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStateTreeComponentExecutionExtension) == 0x000008, "Wrong alignment on FStateTreeComponentExecutionExtension");
static_assert(sizeof(FStateTreeComponentExecutionExtension) == 0x000010, "Wrong size on FStateTreeComponentExecutionExtension");
static_assert(offsetof(FStateTreeComponentExecutionExtension, Component) == 0x000008, "Member 'FStateTreeComponentExecutionExtension::Component' has a wrong offset!");

// ScriptStruct GameplayStateTreeModule.StateTreeRunEnvQueryInstanceData
// 0x0030 (0x0030 - 0x0000)
struct FStateTreeRunEnvQueryInstanceData final
{
public:
	struct FStateTreePropertyRef                  result;                                            // 0x0000(0x0002)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 QueryOwner;                                        // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEnvQuery*                              QueryTemplate;                                     // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAIDynamicParam>                QueryConfig;                                       // 0x0018(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	EEnvQueryRunMode                              RunMode;                                           // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FStateTreeRunEnvQueryInstanceData) == 0x000008, "Wrong alignment on FStateTreeRunEnvQueryInstanceData");
static_assert(sizeof(FStateTreeRunEnvQueryInstanceData) == 0x000030, "Wrong size on FStateTreeRunEnvQueryInstanceData");
static_assert(offsetof(FStateTreeRunEnvQueryInstanceData, result) == 0x000000, "Member 'FStateTreeRunEnvQueryInstanceData::result' has a wrong offset!");
static_assert(offsetof(FStateTreeRunEnvQueryInstanceData, QueryOwner) == 0x000008, "Member 'FStateTreeRunEnvQueryInstanceData::QueryOwner' has a wrong offset!");
static_assert(offsetof(FStateTreeRunEnvQueryInstanceData, QueryTemplate) == 0x000010, "Member 'FStateTreeRunEnvQueryInstanceData::QueryTemplate' has a wrong offset!");
static_assert(offsetof(FStateTreeRunEnvQueryInstanceData, QueryConfig) == 0x000018, "Member 'FStateTreeRunEnvQueryInstanceData::QueryConfig' has a wrong offset!");
static_assert(offsetof(FStateTreeRunEnvQueryInstanceData, RunMode) == 0x000028, "Member 'FStateTreeRunEnvQueryInstanceData::RunMode' has a wrong offset!");

// ScriptStruct GameplayStateTreeModule.StateTreeRunEnvQueryTask
// 0x0000 (0x0028 - 0x0028)
struct FStateTreeRunEnvQueryTask final : public FStateTreeTaskCommonBase
{
};
static_assert(alignof(FStateTreeRunEnvQueryTask) == 0x000004, "Wrong alignment on FStateTreeRunEnvQueryTask");
static_assert(sizeof(FStateTreeRunEnvQueryTask) == 0x000028, "Wrong size on FStateTreeRunEnvQueryTask");

// ScriptStruct GameplayStateTreeModule.StateTreeMoveToTaskInstanceData
// 0x0058 (0x0058 - 0x0000)
struct FStateTreeMoveToTaskInstanceData final
{
public:
	class AAIController*                          AIController;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Destination;                                       // 0x0008(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x0020(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AcceptableRadius;                                  // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DestinationMoveTolerance;                          // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavigationQueryFilter>     FilterClass;                                       // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowStrafe;                                      // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowPartialPath;                                 // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTrackMovingGoal;                                  // 0x003A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequireNavigableEndLocation;                      // 0x003B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProjectGoalLocation;                              // 0x003C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReachTestIncludesAgentRadius;                     // 0x003D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReachTestIncludesGoalRadius;                      // 0x003E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAITask_MoveTo*                         MoveToTask;                                        // 0x0040(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TScriptInterface<class IGameplayTaskOwnerInterface> TaskOwner;                                   // 0x0048(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FStateTreeMoveToTaskInstanceData) == 0x000008, "Wrong alignment on FStateTreeMoveToTaskInstanceData");
static_assert(sizeof(FStateTreeMoveToTaskInstanceData) == 0x000058, "Wrong size on FStateTreeMoveToTaskInstanceData");
static_assert(offsetof(FStateTreeMoveToTaskInstanceData, AIController) == 0x000000, "Member 'FStateTreeMoveToTaskInstanceData::AIController' has a wrong offset!");
static_assert(offsetof(FStateTreeMoveToTaskInstanceData, Destination) == 0x000008, "Member 'FStateTreeMoveToTaskInstanceData::Destination' has a wrong offset!");
static_assert(offsetof(FStateTreeMoveToTaskInstanceData, TargetActor) == 0x000020, "Member 'FStateTreeMoveToTaskInstanceData::TargetActor' has a wrong offset!");
static_assert(offsetof(FStateTreeMoveToTaskInstanceData, AcceptableRadius) == 0x000028, "Member 'FStateTreeMoveToTaskInstanceData::AcceptableRadius' has a wrong offset!");
static_assert(offsetof(FStateTreeMoveToTaskInstanceData, DestinationMoveTolerance) == 0x00002C, "Member 'FStateTreeMoveToTaskInstanceData::DestinationMoveTolerance' has a wrong offset!");
static_assert(offsetof(FStateTreeMoveToTaskInstanceData, FilterClass) == 0x000030, "Member 'FStateTreeMoveToTaskInstanceData::FilterClass' has a wrong offset!");
static_assert(offsetof(FStateTreeMoveToTaskInstanceData, bAllowStrafe) == 0x000038, "Member 'FStateTreeMoveToTaskInstanceData::bAllowStrafe' has a wrong offset!");
static_assert(offsetof(FStateTreeMoveToTaskInstanceData, bAllowPartialPath) == 0x000039, "Member 'FStateTreeMoveToTaskInstanceData::bAllowPartialPath' has a wrong offset!");
static_assert(offsetof(FStateTreeMoveToTaskInstanceData, bTrackMovingGoal) == 0x00003A, "Member 'FStateTreeMoveToTaskInstanceData::bTrackMovingGoal' has a wrong offset!");
static_assert(offsetof(FStateTreeMoveToTaskInstanceData, bRequireNavigableEndLocation) == 0x00003B, "Member 'FStateTreeMoveToTaskInstanceData::bRequireNavigableEndLocation' has a wrong offset!");
static_assert(offsetof(FStateTreeMoveToTaskInstanceData, bProjectGoalLocation) == 0x00003C, "Member 'FStateTreeMoveToTaskInstanceData::bProjectGoalLocation' has a wrong offset!");
static_assert(offsetof(FStateTreeMoveToTaskInstanceData, bReachTestIncludesAgentRadius) == 0x00003D, "Member 'FStateTreeMoveToTaskInstanceData::bReachTestIncludesAgentRadius' has a wrong offset!");
static_assert(offsetof(FStateTreeMoveToTaskInstanceData, bReachTestIncludesGoalRadius) == 0x00003E, "Member 'FStateTreeMoveToTaskInstanceData::bReachTestIncludesGoalRadius' has a wrong offset!");
static_assert(offsetof(FStateTreeMoveToTaskInstanceData, MoveToTask) == 0x000040, "Member 'FStateTreeMoveToTaskInstanceData::MoveToTask' has a wrong offset!");
static_assert(offsetof(FStateTreeMoveToTaskInstanceData, TaskOwner) == 0x000048, "Member 'FStateTreeMoveToTaskInstanceData::TaskOwner' has a wrong offset!");

// ScriptStruct GameplayStateTreeModule.StateTreeMoveToTask
// 0x0000 (0x0028 - 0x0028)
struct FStateTreeMoveToTask final : public FStateTreeAIActionTaskBase
{
};
static_assert(alignof(FStateTreeMoveToTask) == 0x000004, "Wrong alignment on FStateTreeMoveToTask");
static_assert(sizeof(FStateTreeMoveToTask) == 0x000028, "Wrong size on FStateTreeMoveToTask");

}

