#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayStateTreeModule

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GameplayStateTreeModule.StateTreeComponent.AddLinkedStateTreeOverrides
// 0x0030 (0x0030 - 0x0000)
struct StateTreeComponent_AddLinkedStateTreeOverrides final
{
public:
	struct FGameplayTag                           StateTag;                                          // 0x0000(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStateTreeReference                    StateTreeReference;                                // 0x0008(0x0028)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(StateTreeComponent_AddLinkedStateTreeOverrides) == 0x000001, "Wrong alignment on StateTreeComponent_AddLinkedStateTreeOverrides");
static_assert(sizeof(StateTreeComponent_AddLinkedStateTreeOverrides) == 0x000030, "Wrong size on StateTreeComponent_AddLinkedStateTreeOverrides");
static_assert(offsetof(StateTreeComponent_AddLinkedStateTreeOverrides, StateTag) == 0x000000, "Member 'StateTreeComponent_AddLinkedStateTreeOverrides::StateTag' has a wrong offset!");
static_assert(offsetof(StateTreeComponent_AddLinkedStateTreeOverrides, StateTreeReference) == 0x000008, "Member 'StateTreeComponent_AddLinkedStateTreeOverrides::StateTreeReference' has a wrong offset!");

// Function GameplayStateTreeModule.StateTreeComponent.RemoveLinkedStateTreeOverrides
// 0x0008 (0x0008 - 0x0000)
struct StateTreeComponent_RemoveLinkedStateTreeOverrides final
{
public:
	struct FGameplayTag                           StateTag;                                          // 0x0000(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StateTreeComponent_RemoveLinkedStateTreeOverrides) == 0x000001, "Wrong alignment on StateTreeComponent_RemoveLinkedStateTreeOverrides");
static_assert(sizeof(StateTreeComponent_RemoveLinkedStateTreeOverrides) == 0x000008, "Wrong size on StateTreeComponent_RemoveLinkedStateTreeOverrides");
static_assert(offsetof(StateTreeComponent_RemoveLinkedStateTreeOverrides, StateTag) == 0x000000, "Member 'StateTreeComponent_RemoveLinkedStateTreeOverrides::StateTag' has a wrong offset!");

// Function GameplayStateTreeModule.StateTreeComponent.SendStateTreeEvent
// 0x0020 (0x0020 - 0x0000)
struct StateTreeComponent_SendStateTreeEvent final
{
public:
	struct FStateTreeEvent                        Event;                                             // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StateTreeComponent_SendStateTreeEvent) == 0x000001, "Wrong alignment on StateTreeComponent_SendStateTreeEvent");
static_assert(sizeof(StateTreeComponent_SendStateTreeEvent) == 0x000020, "Wrong size on StateTreeComponent_SendStateTreeEvent");
static_assert(offsetof(StateTreeComponent_SendStateTreeEvent, Event) == 0x000000, "Member 'StateTreeComponent_SendStateTreeEvent::Event' has a wrong offset!");

// Function GameplayStateTreeModule.StateTreeComponent.SetStartLogicAutomatically
// 0x0001 (0x0001 - 0x0000)
struct StateTreeComponent_SetStartLogicAutomatically final
{
public:
	bool                                          bInStartLogicAutomatically;                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StateTreeComponent_SetStartLogicAutomatically) == 0x000001, "Wrong alignment on StateTreeComponent_SetStartLogicAutomatically");
static_assert(sizeof(StateTreeComponent_SetStartLogicAutomatically) == 0x000001, "Wrong size on StateTreeComponent_SetStartLogicAutomatically");
static_assert(offsetof(StateTreeComponent_SetStartLogicAutomatically, bInStartLogicAutomatically) == 0x000000, "Member 'StateTreeComponent_SetStartLogicAutomatically::bInStartLogicAutomatically' has a wrong offset!");

// Function GameplayStateTreeModule.StateTreeComponent.SetStateTree
// 0x0008 (0x0008 - 0x0000)
struct StateTreeComponent_SetStateTree final
{
public:
	class UStateTree*                             StateTree;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StateTreeComponent_SetStateTree) == 0x000008, "Wrong alignment on StateTreeComponent_SetStateTree");
static_assert(sizeof(StateTreeComponent_SetStateTree) == 0x000008, "Wrong size on StateTreeComponent_SetStateTree");
static_assert(offsetof(StateTreeComponent_SetStateTree, StateTree) == 0x000000, "Member 'StateTreeComponent_SetStateTree::StateTree' has a wrong offset!");

// Function GameplayStateTreeModule.StateTreeComponent.SetStateTreeReference
// 0x0028 (0x0028 - 0x0000)
struct StateTreeComponent_SetStateTreeReference final
{
public:
	struct FStateTreeReference                    StateTreeReference;                                // 0x0000(0x0028)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(StateTreeComponent_SetStateTreeReference) == 0x000001, "Wrong alignment on StateTreeComponent_SetStateTreeReference");
static_assert(sizeof(StateTreeComponent_SetStateTreeReference) == 0x000028, "Wrong size on StateTreeComponent_SetStateTreeReference");
static_assert(offsetof(StateTreeComponent_SetStateTreeReference, StateTreeReference) == 0x000000, "Member 'StateTreeComponent_SetStateTreeReference::StateTreeReference' has a wrong offset!");

// Function GameplayStateTreeModule.StateTreeComponent.GetStateTreeRunStatus
// 0x0001 (0x0001 - 0x0000)
struct StateTreeComponent_GetStateTreeRunStatus final
{
public:
	EStateTreeRunStatus                           ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StateTreeComponent_GetStateTreeRunStatus) == 0x000001, "Wrong alignment on StateTreeComponent_GetStateTreeRunStatus");
static_assert(sizeof(StateTreeComponent_GetStateTreeRunStatus) == 0x000001, "Wrong size on StateTreeComponent_GetStateTreeRunStatus");
static_assert(offsetof(StateTreeComponent_GetStateTreeRunStatus, ReturnValue) == 0x000000, "Member 'StateTreeComponent_GetStateTreeRunStatus::ReturnValue' has a wrong offset!");

}

