#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayCameras

#include "Basic.hpp"

#include "GameplayCameras_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GameplayCameras.BlueprintCameraEvaluationDataFunctionLibrary.BlendCameraEvaluationData
// 0x0038 (0x0038 - 0x0000)
struct BlueprintCameraEvaluationDataFunctionLibrary_BlendCameraEvaluationData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      FromCameraData;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FBlueprintCameraEvaluationDataRef      ToCameraData;                                      // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Factor;                                            // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BlueprintCameraEvaluationDataFunctionLibrary_BlendCameraEvaluationData) == 0x000004, "Wrong alignment on BlueprintCameraEvaluationDataFunctionLibrary_BlendCameraEvaluationData");
static_assert(sizeof(BlueprintCameraEvaluationDataFunctionLibrary_BlendCameraEvaluationData) == 0x000038, "Wrong size on BlueprintCameraEvaluationDataFunctionLibrary_BlendCameraEvaluationData");
static_assert(offsetof(BlueprintCameraEvaluationDataFunctionLibrary_BlendCameraEvaluationData, FromCameraData) == 0x000000, "Member 'BlueprintCameraEvaluationDataFunctionLibrary_BlendCameraEvaluationData::FromCameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraEvaluationDataFunctionLibrary_BlendCameraEvaluationData, ToCameraData) == 0x000018, "Member 'BlueprintCameraEvaluationDataFunctionLibrary_BlendCameraEvaluationData::ToCameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraEvaluationDataFunctionLibrary_BlendCameraEvaluationData, Factor) == 0x000030, "Member 'BlueprintCameraEvaluationDataFunctionLibrary_BlendCameraEvaluationData::Factor' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraEvaluationDataFunctionLibrary.GetCameraPose
// 0x00A0 (0x00A0 - 0x0000)
struct BlueprintCameraEvaluationDataFunctionLibrary_GetCameraPose final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FBlueprintCameraPose                   ReturnValue;                                       // 0x0018(0x0088)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueprintCameraEvaluationDataFunctionLibrary_GetCameraPose) == 0x000001, "Wrong alignment on BlueprintCameraEvaluationDataFunctionLibrary_GetCameraPose");
static_assert(sizeof(BlueprintCameraEvaluationDataFunctionLibrary_GetCameraPose) == 0x0000A0, "Wrong size on BlueprintCameraEvaluationDataFunctionLibrary_GetCameraPose");
static_assert(offsetof(BlueprintCameraEvaluationDataFunctionLibrary_GetCameraPose, CameraData) == 0x000000, "Member 'BlueprintCameraEvaluationDataFunctionLibrary_GetCameraPose::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraEvaluationDataFunctionLibrary_GetCameraPose, ReturnValue) == 0x000018, "Member 'BlueprintCameraEvaluationDataFunctionLibrary_GetCameraPose::ReturnValue' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraEvaluationDataFunctionLibrary.MakeCameraEvaluationData
// 0x0018 (0x0018 - 0x0000)
struct BlueprintCameraEvaluationDataFunctionLibrary_MakeCameraEvaluationData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueprintCameraEvaluationDataFunctionLibrary_MakeCameraEvaluationData) == 0x000001, "Wrong alignment on BlueprintCameraEvaluationDataFunctionLibrary_MakeCameraEvaluationData");
static_assert(sizeof(BlueprintCameraEvaluationDataFunctionLibrary_MakeCameraEvaluationData) == 0x000018, "Wrong size on BlueprintCameraEvaluationDataFunctionLibrary_MakeCameraEvaluationData");
static_assert(offsetof(BlueprintCameraEvaluationDataFunctionLibrary_MakeCameraEvaluationData, ReturnValue) == 0x000000, "Member 'BlueprintCameraEvaluationDataFunctionLibrary_MakeCameraEvaluationData::ReturnValue' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraEvaluationDataFunctionLibrary.SetCameraPose
// 0x00A0 (0x00A0 - 0x0000)
struct BlueprintCameraEvaluationDataFunctionLibrary_SetCameraPose final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FBlueprintCameraPose                   CameraPose;                                        // 0x0018(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueprintCameraEvaluationDataFunctionLibrary_SetCameraPose) == 0x000001, "Wrong alignment on BlueprintCameraEvaluationDataFunctionLibrary_SetCameraPose");
static_assert(sizeof(BlueprintCameraEvaluationDataFunctionLibrary_SetCameraPose) == 0x0000A0, "Wrong size on BlueprintCameraEvaluationDataFunctionLibrary_SetCameraPose");
static_assert(offsetof(BlueprintCameraEvaluationDataFunctionLibrary_SetCameraPose, CameraData) == 0x000000, "Member 'BlueprintCameraEvaluationDataFunctionLibrary_SetCameraPose::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraEvaluationDataFunctionLibrary_SetCameraPose, CameraPose) == 0x000018, "Member 'BlueprintCameraEvaluationDataFunctionLibrary_SetCameraPose::CameraPose' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraEvaluationDataFunctionLibrary.SetDefaultCameraRigParameters
// 0x0020 (0x0020 - 0x0000)
struct BlueprintCameraEvaluationDataFunctionLibrary_SetDefaultCameraRigParameters final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	const class UCameraRigAsset*                  CameraRig;                                         // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueprintCameraEvaluationDataFunctionLibrary_SetDefaultCameraRigParameters) == 0x000008, "Wrong alignment on BlueprintCameraEvaluationDataFunctionLibrary_SetDefaultCameraRigParameters");
static_assert(sizeof(BlueprintCameraEvaluationDataFunctionLibrary_SetDefaultCameraRigParameters) == 0x000020, "Wrong size on BlueprintCameraEvaluationDataFunctionLibrary_SetDefaultCameraRigParameters");
static_assert(offsetof(BlueprintCameraEvaluationDataFunctionLibrary_SetDefaultCameraRigParameters, CameraData) == 0x000000, "Member 'BlueprintCameraEvaluationDataFunctionLibrary_SetDefaultCameraRigParameters::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraEvaluationDataFunctionLibrary_SetDefaultCameraRigParameters, CameraRig) == 0x000018, "Member 'BlueprintCameraEvaluationDataFunctionLibrary_SetDefaultCameraRigParameters::CameraRig' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetBooleanCameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetBooleanCameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UBooleanCameraVariable*                 Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BlueprintCameraVariableTableFunctionLibrary_GetBooleanCameraVariable) == 0x000008, "Wrong alignment on BlueprintCameraVariableTableFunctionLibrary_GetBooleanCameraVariable");
static_assert(sizeof(BlueprintCameraVariableTableFunctionLibrary_GetBooleanCameraVariable) == 0x000028, "Wrong size on BlueprintCameraVariableTableFunctionLibrary_GetBooleanCameraVariable");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetBooleanCameraVariable, CameraData) == 0x000000, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetBooleanCameraVariable::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetBooleanCameraVariable, Variable) == 0x000018, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetBooleanCameraVariable::Variable' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetBooleanCameraVariable, ReturnValue) == 0x000020, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetBooleanCameraVariable::ReturnValue' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetDoubleCameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetDoubleCameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UDoubleCameraVariable*                  Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueprintCameraVariableTableFunctionLibrary_GetDoubleCameraVariable) == 0x000008, "Wrong alignment on BlueprintCameraVariableTableFunctionLibrary_GetDoubleCameraVariable");
static_assert(sizeof(BlueprintCameraVariableTableFunctionLibrary_GetDoubleCameraVariable) == 0x000028, "Wrong size on BlueprintCameraVariableTableFunctionLibrary_GetDoubleCameraVariable");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetDoubleCameraVariable, CameraData) == 0x000000, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetDoubleCameraVariable::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetDoubleCameraVariable, Variable) == 0x000018, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetDoubleCameraVariable::Variable' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetDoubleCameraVariable, ReturnValue) == 0x000020, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetDoubleCameraVariable::ReturnValue' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetFloatCameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetFloatCameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UFloatCameraVariable*                   Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BlueprintCameraVariableTableFunctionLibrary_GetFloatCameraVariable) == 0x000008, "Wrong alignment on BlueprintCameraVariableTableFunctionLibrary_GetFloatCameraVariable");
static_assert(sizeof(BlueprintCameraVariableTableFunctionLibrary_GetFloatCameraVariable) == 0x000028, "Wrong size on BlueprintCameraVariableTableFunctionLibrary_GetFloatCameraVariable");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetFloatCameraVariable, CameraData) == 0x000000, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetFloatCameraVariable::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetFloatCameraVariable, Variable) == 0x000018, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetFloatCameraVariable::Variable' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetFloatCameraVariable, ReturnValue) == 0x000020, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetFloatCameraVariable::ReturnValue' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetInteger32CameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetInteger32CameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UInteger32CameraVariable*               Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BlueprintCameraVariableTableFunctionLibrary_GetInteger32CameraVariable) == 0x000008, "Wrong alignment on BlueprintCameraVariableTableFunctionLibrary_GetInteger32CameraVariable");
static_assert(sizeof(BlueprintCameraVariableTableFunctionLibrary_GetInteger32CameraVariable) == 0x000028, "Wrong size on BlueprintCameraVariableTableFunctionLibrary_GetInteger32CameraVariable");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetInteger32CameraVariable, CameraData) == 0x000000, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetInteger32CameraVariable::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetInteger32CameraVariable, Variable) == 0x000018, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetInteger32CameraVariable::Variable' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetInteger32CameraVariable, ReturnValue) == 0x000020, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetInteger32CameraVariable::ReturnValue' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetRotatorCameraVariable
// 0x0038 (0x0038 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetRotatorCameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class URotator3dCameraVariable*               Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueprintCameraVariableTableFunctionLibrary_GetRotatorCameraVariable) == 0x000008, "Wrong alignment on BlueprintCameraVariableTableFunctionLibrary_GetRotatorCameraVariable");
static_assert(sizeof(BlueprintCameraVariableTableFunctionLibrary_GetRotatorCameraVariable) == 0x000038, "Wrong size on BlueprintCameraVariableTableFunctionLibrary_GetRotatorCameraVariable");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetRotatorCameraVariable, CameraData) == 0x000000, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetRotatorCameraVariable::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetRotatorCameraVariable, Variable) == 0x000018, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetRotatorCameraVariable::Variable' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetRotatorCameraVariable, ReturnValue) == 0x000020, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetRotatorCameraVariable::ReturnValue' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetTransformCameraVariable
// 0x0080 (0x0080 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetTransformCameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UTransform3dCameraVariable*             Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0020(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueprintCameraVariableTableFunctionLibrary_GetTransformCameraVariable) == 0x000008, "Wrong alignment on BlueprintCameraVariableTableFunctionLibrary_GetTransformCameraVariable");
static_assert(sizeof(BlueprintCameraVariableTableFunctionLibrary_GetTransformCameraVariable) == 0x000080, "Wrong size on BlueprintCameraVariableTableFunctionLibrary_GetTransformCameraVariable");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetTransformCameraVariable, CameraData) == 0x000000, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetTransformCameraVariable::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetTransformCameraVariable, Variable) == 0x000018, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetTransformCameraVariable::Variable' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetTransformCameraVariable, ReturnValue) == 0x000020, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetTransformCameraVariable::ReturnValue' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetVector2CameraVariable
// 0x0030 (0x0030 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetVector2CameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UVector2dCameraVariable*                Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueprintCameraVariableTableFunctionLibrary_GetVector2CameraVariable) == 0x000008, "Wrong alignment on BlueprintCameraVariableTableFunctionLibrary_GetVector2CameraVariable");
static_assert(sizeof(BlueprintCameraVariableTableFunctionLibrary_GetVector2CameraVariable) == 0x000030, "Wrong size on BlueprintCameraVariableTableFunctionLibrary_GetVector2CameraVariable");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetVector2CameraVariable, CameraData) == 0x000000, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetVector2CameraVariable::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetVector2CameraVariable, Variable) == 0x000018, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetVector2CameraVariable::Variable' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetVector2CameraVariable, ReturnValue) == 0x000020, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetVector2CameraVariable::ReturnValue' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetVector3CameraVariable
// 0x0038 (0x0038 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetVector3CameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UVector3dCameraVariable*                Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueprintCameraVariableTableFunctionLibrary_GetVector3CameraVariable) == 0x000008, "Wrong alignment on BlueprintCameraVariableTableFunctionLibrary_GetVector3CameraVariable");
static_assert(sizeof(BlueprintCameraVariableTableFunctionLibrary_GetVector3CameraVariable) == 0x000038, "Wrong size on BlueprintCameraVariableTableFunctionLibrary_GetVector3CameraVariable");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetVector3CameraVariable, CameraData) == 0x000000, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetVector3CameraVariable::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetVector3CameraVariable, Variable) == 0x000018, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetVector3CameraVariable::Variable' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetVector3CameraVariable, ReturnValue) == 0x000020, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetVector3CameraVariable::ReturnValue' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.GetVector4CameraVariable
// 0x0040 (0x0040 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_GetVector4CameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UVector4dCameraVariable*                Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               ReturnValue;                                       // 0x0020(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueprintCameraVariableTableFunctionLibrary_GetVector4CameraVariable) == 0x000008, "Wrong alignment on BlueprintCameraVariableTableFunctionLibrary_GetVector4CameraVariable");
static_assert(sizeof(BlueprintCameraVariableTableFunctionLibrary_GetVector4CameraVariable) == 0x000040, "Wrong size on BlueprintCameraVariableTableFunctionLibrary_GetVector4CameraVariable");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetVector4CameraVariable, CameraData) == 0x000000, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetVector4CameraVariable::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetVector4CameraVariable, Variable) == 0x000018, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetVector4CameraVariable::Variable' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_GetVector4CameraVariable, ReturnValue) == 0x000020, "Member 'BlueprintCameraVariableTableFunctionLibrary_GetVector4CameraVariable::ReturnValue' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetBooleanCameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetBooleanCameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UBooleanCameraVariable*                 Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BlueprintCameraVariableTableFunctionLibrary_SetBooleanCameraVariable) == 0x000008, "Wrong alignment on BlueprintCameraVariableTableFunctionLibrary_SetBooleanCameraVariable");
static_assert(sizeof(BlueprintCameraVariableTableFunctionLibrary_SetBooleanCameraVariable) == 0x000028, "Wrong size on BlueprintCameraVariableTableFunctionLibrary_SetBooleanCameraVariable");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetBooleanCameraVariable, CameraData) == 0x000000, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetBooleanCameraVariable::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetBooleanCameraVariable, Variable) == 0x000018, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetBooleanCameraVariable::Variable' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetBooleanCameraVariable, Value) == 0x000020, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetBooleanCameraVariable::Value' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetDoubleCameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetDoubleCameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UDoubleCameraVariable*                  Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Value;                                             // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueprintCameraVariableTableFunctionLibrary_SetDoubleCameraVariable) == 0x000008, "Wrong alignment on BlueprintCameraVariableTableFunctionLibrary_SetDoubleCameraVariable");
static_assert(sizeof(BlueprintCameraVariableTableFunctionLibrary_SetDoubleCameraVariable) == 0x000028, "Wrong size on BlueprintCameraVariableTableFunctionLibrary_SetDoubleCameraVariable");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetDoubleCameraVariable, CameraData) == 0x000000, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetDoubleCameraVariable::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetDoubleCameraVariable, Variable) == 0x000018, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetDoubleCameraVariable::Variable' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetDoubleCameraVariable, Value) == 0x000020, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetDoubleCameraVariable::Value' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetFloatCameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetFloatCameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UFloatCameraVariable*                   Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BlueprintCameraVariableTableFunctionLibrary_SetFloatCameraVariable) == 0x000008, "Wrong alignment on BlueprintCameraVariableTableFunctionLibrary_SetFloatCameraVariable");
static_assert(sizeof(BlueprintCameraVariableTableFunctionLibrary_SetFloatCameraVariable) == 0x000028, "Wrong size on BlueprintCameraVariableTableFunctionLibrary_SetFloatCameraVariable");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetFloatCameraVariable, CameraData) == 0x000000, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetFloatCameraVariable::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetFloatCameraVariable, Variable) == 0x000018, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetFloatCameraVariable::Variable' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetFloatCameraVariable, Value) == 0x000020, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetFloatCameraVariable::Value' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetInteger32CameraVariable
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetInteger32CameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UInteger32CameraVariable*               Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BlueprintCameraVariableTableFunctionLibrary_SetInteger32CameraVariable) == 0x000008, "Wrong alignment on BlueprintCameraVariableTableFunctionLibrary_SetInteger32CameraVariable");
static_assert(sizeof(BlueprintCameraVariableTableFunctionLibrary_SetInteger32CameraVariable) == 0x000028, "Wrong size on BlueprintCameraVariableTableFunctionLibrary_SetInteger32CameraVariable");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetInteger32CameraVariable, CameraData) == 0x000000, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetInteger32CameraVariable::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetInteger32CameraVariable, Variable) == 0x000018, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetInteger32CameraVariable::Variable' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetInteger32CameraVariable, Value) == 0x000020, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetInteger32CameraVariable::Value' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetRotatorCameraVariable
// 0x0038 (0x0038 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetRotatorCameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class URotator3dCameraVariable*               Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Value;                                             // 0x0020(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueprintCameraVariableTableFunctionLibrary_SetRotatorCameraVariable) == 0x000008, "Wrong alignment on BlueprintCameraVariableTableFunctionLibrary_SetRotatorCameraVariable");
static_assert(sizeof(BlueprintCameraVariableTableFunctionLibrary_SetRotatorCameraVariable) == 0x000038, "Wrong size on BlueprintCameraVariableTableFunctionLibrary_SetRotatorCameraVariable");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetRotatorCameraVariable, CameraData) == 0x000000, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetRotatorCameraVariable::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetRotatorCameraVariable, Variable) == 0x000018, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetRotatorCameraVariable::Variable' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetRotatorCameraVariable, Value) == 0x000020, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetRotatorCameraVariable::Value' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetTransformCameraVariable
// 0x0080 (0x0080 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetTransformCameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UTransform3dCameraVariable*             Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             Value;                                             // 0x0020(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueprintCameraVariableTableFunctionLibrary_SetTransformCameraVariable) == 0x000008, "Wrong alignment on BlueprintCameraVariableTableFunctionLibrary_SetTransformCameraVariable");
static_assert(sizeof(BlueprintCameraVariableTableFunctionLibrary_SetTransformCameraVariable) == 0x000080, "Wrong size on BlueprintCameraVariableTableFunctionLibrary_SetTransformCameraVariable");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetTransformCameraVariable, CameraData) == 0x000000, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetTransformCameraVariable::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetTransformCameraVariable, Variable) == 0x000018, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetTransformCameraVariable::Variable' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetTransformCameraVariable, Value) == 0x000020, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetTransformCameraVariable::Value' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetVector2CameraVariable
// 0x0030 (0x0030 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetVector2CameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UVector2dCameraVariable*                Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Value;                                             // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueprintCameraVariableTableFunctionLibrary_SetVector2CameraVariable) == 0x000008, "Wrong alignment on BlueprintCameraVariableTableFunctionLibrary_SetVector2CameraVariable");
static_assert(sizeof(BlueprintCameraVariableTableFunctionLibrary_SetVector2CameraVariable) == 0x000030, "Wrong size on BlueprintCameraVariableTableFunctionLibrary_SetVector2CameraVariable");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetVector2CameraVariable, CameraData) == 0x000000, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetVector2CameraVariable::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetVector2CameraVariable, Variable) == 0x000018, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetVector2CameraVariable::Variable' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetVector2CameraVariable, Value) == 0x000020, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetVector2CameraVariable::Value' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetVector3CameraVariable
// 0x0038 (0x0038 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetVector3CameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UVector3dCameraVariable*                Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Value;                                             // 0x0020(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueprintCameraVariableTableFunctionLibrary_SetVector3CameraVariable) == 0x000008, "Wrong alignment on BlueprintCameraVariableTableFunctionLibrary_SetVector3CameraVariable");
static_assert(sizeof(BlueprintCameraVariableTableFunctionLibrary_SetVector3CameraVariable) == 0x000038, "Wrong size on BlueprintCameraVariableTableFunctionLibrary_SetVector3CameraVariable");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetVector3CameraVariable, CameraData) == 0x000000, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetVector3CameraVariable::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetVector3CameraVariable, Variable) == 0x000018, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetVector3CameraVariable::Variable' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetVector3CameraVariable, Value) == 0x000020, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetVector3CameraVariable::Value' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraVariableTableFunctionLibrary.SetVector4CameraVariable
// 0x0040 (0x0040 - 0x0000)
struct BlueprintCameraVariableTableFunctionLibrary_SetVector4CameraVariable final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UVector4dCameraVariable*                Variable;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               Value;                                             // 0x0020(0x0020)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueprintCameraVariableTableFunctionLibrary_SetVector4CameraVariable) == 0x000008, "Wrong alignment on BlueprintCameraVariableTableFunctionLibrary_SetVector4CameraVariable");
static_assert(sizeof(BlueprintCameraVariableTableFunctionLibrary_SetVector4CameraVariable) == 0x000040, "Wrong size on BlueprintCameraVariableTableFunctionLibrary_SetVector4CameraVariable");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetVector4CameraVariable, CameraData) == 0x000000, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetVector4CameraVariable::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetVector4CameraVariable, Variable) == 0x000018, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetVector4CameraVariable::Variable' has a wrong offset!");
static_assert(offsetof(BlueprintCameraVariableTableFunctionLibrary_SetVector4CameraVariable, Value) == 0x000020, "Member 'BlueprintCameraVariableTableFunctionLibrary_SetVector4CameraVariable::Value' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraContextDataTableFunctionLibrary.GetClassData
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraContextDataTableFunctionLibrary_GetClassData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCameraContextDataID                   DataID;                                            // 0x0018(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueprintCameraContextDataTableFunctionLibrary_GetClassData) == 0x000008, "Wrong alignment on BlueprintCameraContextDataTableFunctionLibrary_GetClassData");
static_assert(sizeof(BlueprintCameraContextDataTableFunctionLibrary_GetClassData) == 0x000028, "Wrong size on BlueprintCameraContextDataTableFunctionLibrary_GetClassData");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_GetClassData, CameraData) == 0x000000, "Member 'BlueprintCameraContextDataTableFunctionLibrary_GetClassData::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_GetClassData, DataID) == 0x000018, "Member 'BlueprintCameraContextDataTableFunctionLibrary_GetClassData::DataID' has a wrong offset!");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_GetClassData, ReturnValue) == 0x000020, "Member 'BlueprintCameraContextDataTableFunctionLibrary_GetClassData::ReturnValue' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraContextDataTableFunctionLibrary.GetEnumData
// 0x0030 (0x0030 - 0x0000)
struct BlueprintCameraContextDataTableFunctionLibrary_GetEnumData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCameraContextDataID                   DataID;                                            // 0x0018(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UEnum*                            EnumType;                                          // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BlueprintCameraContextDataTableFunctionLibrary_GetEnumData) == 0x000008, "Wrong alignment on BlueprintCameraContextDataTableFunctionLibrary_GetEnumData");
static_assert(sizeof(BlueprintCameraContextDataTableFunctionLibrary_GetEnumData) == 0x000030, "Wrong size on BlueprintCameraContextDataTableFunctionLibrary_GetEnumData");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_GetEnumData, CameraData) == 0x000000, "Member 'BlueprintCameraContextDataTableFunctionLibrary_GetEnumData::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_GetEnumData, DataID) == 0x000018, "Member 'BlueprintCameraContextDataTableFunctionLibrary_GetEnumData::DataID' has a wrong offset!");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_GetEnumData, EnumType) == 0x000020, "Member 'BlueprintCameraContextDataTableFunctionLibrary_GetEnumData::EnumType' has a wrong offset!");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_GetEnumData, ReturnValue) == 0x000028, "Member 'BlueprintCameraContextDataTableFunctionLibrary_GetEnumData::ReturnValue' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraContextDataTableFunctionLibrary.GetNameData
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraContextDataTableFunctionLibrary_GetNameData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCameraContextDataID                   DataID;                                            // 0x0018(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x001C(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BlueprintCameraContextDataTableFunctionLibrary_GetNameData) == 0x000004, "Wrong alignment on BlueprintCameraContextDataTableFunctionLibrary_GetNameData");
static_assert(sizeof(BlueprintCameraContextDataTableFunctionLibrary_GetNameData) == 0x000028, "Wrong size on BlueprintCameraContextDataTableFunctionLibrary_GetNameData");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_GetNameData, CameraData) == 0x000000, "Member 'BlueprintCameraContextDataTableFunctionLibrary_GetNameData::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_GetNameData, DataID) == 0x000018, "Member 'BlueprintCameraContextDataTableFunctionLibrary_GetNameData::DataID' has a wrong offset!");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_GetNameData, ReturnValue) == 0x00001C, "Member 'BlueprintCameraContextDataTableFunctionLibrary_GetNameData::ReturnValue' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraContextDataTableFunctionLibrary.GetObjectData
// 0x0028 (0x0028 - 0x0000)
struct BlueprintCameraContextDataTableFunctionLibrary_GetObjectData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCameraContextDataID                   DataID;                                            // 0x0018(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueprintCameraContextDataTableFunctionLibrary_GetObjectData) == 0x000008, "Wrong alignment on BlueprintCameraContextDataTableFunctionLibrary_GetObjectData");
static_assert(sizeof(BlueprintCameraContextDataTableFunctionLibrary_GetObjectData) == 0x000028, "Wrong size on BlueprintCameraContextDataTableFunctionLibrary_GetObjectData");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_GetObjectData, CameraData) == 0x000000, "Member 'BlueprintCameraContextDataTableFunctionLibrary_GetObjectData::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_GetObjectData, DataID) == 0x000018, "Member 'BlueprintCameraContextDataTableFunctionLibrary_GetObjectData::DataID' has a wrong offset!");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_GetObjectData, ReturnValue) == 0x000020, "Member 'BlueprintCameraContextDataTableFunctionLibrary_GetObjectData::ReturnValue' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraContextDataTableFunctionLibrary.GetStringData
// 0x0030 (0x0030 - 0x0000)
struct BlueprintCameraContextDataTableFunctionLibrary_GetStringData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCameraContextDataID                   DataID;                                            // 0x0018(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueprintCameraContextDataTableFunctionLibrary_GetStringData) == 0x000008, "Wrong alignment on BlueprintCameraContextDataTableFunctionLibrary_GetStringData");
static_assert(sizeof(BlueprintCameraContextDataTableFunctionLibrary_GetStringData) == 0x000030, "Wrong size on BlueprintCameraContextDataTableFunctionLibrary_GetStringData");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_GetStringData, CameraData) == 0x000000, "Member 'BlueprintCameraContextDataTableFunctionLibrary_GetStringData::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_GetStringData, DataID) == 0x000018, "Member 'BlueprintCameraContextDataTableFunctionLibrary_GetStringData::DataID' has a wrong offset!");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_GetStringData, ReturnValue) == 0x000020, "Member 'BlueprintCameraContextDataTableFunctionLibrary_GetStringData::ReturnValue' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraContextDataTableFunctionLibrary.GetStructData
// 0x0038 (0x0038 - 0x0000)
struct BlueprintCameraContextDataTableFunctionLibrary_GetStructData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCameraContextDataID                   DataID;                                            // 0x0018(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UScriptStruct*                    DataStructType;                                    // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BlueprintCameraContextDataTableFunctionLibrary_GetStructData) == 0x000008, "Wrong alignment on BlueprintCameraContextDataTableFunctionLibrary_GetStructData");
static_assert(sizeof(BlueprintCameraContextDataTableFunctionLibrary_GetStructData) == 0x000038, "Wrong size on BlueprintCameraContextDataTableFunctionLibrary_GetStructData");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_GetStructData, CameraData) == 0x000000, "Member 'BlueprintCameraContextDataTableFunctionLibrary_GetStructData::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_GetStructData, DataID) == 0x000018, "Member 'BlueprintCameraContextDataTableFunctionLibrary_GetStructData::DataID' has a wrong offset!");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_GetStructData, DataStructType) == 0x000020, "Member 'BlueprintCameraContextDataTableFunctionLibrary_GetStructData::DataStructType' has a wrong offset!");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_GetStructData, ReturnValue) == 0x000028, "Member 'BlueprintCameraContextDataTableFunctionLibrary_GetStructData::ReturnValue' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraContextDataTableFunctionLibrary.SetClassData
// 0x0030 (0x0030 - 0x0000)
struct BlueprintCameraContextDataTableFunctionLibrary_SetClassData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCameraContextDataID                   DataID;                                            // 0x0018(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Data;                                              // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BlueprintCameraContextDataTableFunctionLibrary_SetClassData) == 0x000008, "Wrong alignment on BlueprintCameraContextDataTableFunctionLibrary_SetClassData");
static_assert(sizeof(BlueprintCameraContextDataTableFunctionLibrary_SetClassData) == 0x000030, "Wrong size on BlueprintCameraContextDataTableFunctionLibrary_SetClassData");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_SetClassData, CameraData) == 0x000000, "Member 'BlueprintCameraContextDataTableFunctionLibrary_SetClassData::CameraData' has a wrong offset!");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_SetClassData, DataID) == 0x000018, "Member 'BlueprintCameraContextDataTableFunctionLibrary_SetClassData::DataID' has a wrong offset!");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_SetClassData, Data) == 0x000020, "Member 'BlueprintCameraContextDataTableFunctionLibrary_SetClassData::Data' has a wrong offset!");
static_assert(offsetof(BlueprintCameraContextDataTableFunctionLibrary_SetClassData, ReturnValue) == 0x000028, "Member 'BlueprintCameraContextDataTableFunctionLibrary_SetClassData::ReturnValue' has a wrong offset!");

// Function GameplayCameras.BlueprintCameraContextDataTableFunctionLibrary.SetEnumData
// 0x0030 (0x0030 - 0x0000)
struct BlueprintCameraContextDataTableFunctionLibrary_SetEnumData final
{
public:
	struct FBlueprintCameraEvaluationDataRef      CameraData;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FCameraContextDataID                   DataID;                                            // 0x0018(0x0004)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UEnum*                            EnumType;                                          // 0x0020(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Data;                                              // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0029(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
