#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeometryDataflowNodes

#include "Basic.hpp"

#include "DataflowCore_structs.hpp"


namespace SDK
{

// Enum GeometryDataflowNodes.EMeshBooleanOperationEnum
// NumValues: 0x0004
enum class EMeshBooleanOperationEnum : uint8
{
	Dataflow_MeshBoolean_Union               = 0,
	Dataflow_MeshBoolean_Intersect           = 1,
	Dataflow_MeshBoolean_Difference          = 2,
	Dataflow_Max                             = 3,
};

// ScriptStruct GeometryDataflowNodes.MeshBooleanDataflowNode
// 0x0020 (0x02A0 - 0x0280)
struct FMeshBooleanDataflowNode final : public FDataflowNode
{
public:
	EMeshBooleanOperationEnum                     Operation;                                         // 0x0280(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicMesh*                           Mesh1;                                             // 0x0288(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicMesh*                           Mesh2;                                             // 0x0290(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicMesh*                           Mesh;                                              // 0x0298(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FMeshBooleanDataflowNode) == 0x000008, "Wrong alignment on FMeshBooleanDataflowNode");
static_assert(sizeof(FMeshBooleanDataflowNode) == 0x0002A0, "Wrong size on FMeshBooleanDataflowNode");
static_assert(offsetof(FMeshBooleanDataflowNode, Operation) == 0x000280, "Member 'FMeshBooleanDataflowNode::Operation' has a wrong offset!");
static_assert(offsetof(FMeshBooleanDataflowNode, Mesh1) == 0x000288, "Member 'FMeshBooleanDataflowNode::Mesh1' has a wrong offset!");
static_assert(offsetof(FMeshBooleanDataflowNode, Mesh2) == 0x000290, "Member 'FMeshBooleanDataflowNode::Mesh2' has a wrong offset!");
static_assert(offsetof(FMeshBooleanDataflowNode, Mesh) == 0x000298, "Member 'FMeshBooleanDataflowNode::Mesh' has a wrong offset!");

}

