#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HairStrandsSolver

#include "Basic.hpp"

#include "HairStrandsSolver_structs.hpp"
#include "DataflowSimulation_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class HairStrandsSolver.GroomSolverComponent
// 0x0270 (0x0800 - 0x0590)
class UGroomSolverComponent final : public UMeshComponent
{
public:
	uint8                                         Pad_590[0x8];                                      // 0x0590(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGroomSolverSettings                   SolverSettings;                                    // 0x0598(0x0068)(Edit, NativeAccessSpecifierPrivate)
	struct FDataflowSimulationAsset               SimulationAsset;                                   // 0x0600(0x0058)(Edit, AdvancedDisplay, NativeAccessSpecifierPrivate)
	TSet<class UGroomComponent*>                  GroomComponents;                                   // 0x0658(0x0050)(Edit, ExportObject, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UMeshDeformer*                          MeshDeformer;                                      // 0x06A8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMeshDeformerInstance*                  DeformerInstance;                                  // 0x06B0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMeshDeformerInstanceSettings*          DeformerSettings;                                  // 0x06B8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6C0[0x140];                                    // 0x06C0(0x0140)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddGroomComponent(class UGroomComponent* GroomComponent);
	void RemoveGroomComponent(class UGroomComponent* GroomComponent);
	void ResetGroomComponents();
	void SetDeformerSolver(class UMeshDeformer* DeformerSolver);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomSolverComponent">();
	}
	static class UGroomSolverComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomSolverComponent>();
	}
};
static_assert(alignof(UGroomSolverComponent) == 0x000008, "Wrong alignment on UGroomSolverComponent");
static_assert(sizeof(UGroomSolverComponent) == 0x000800, "Wrong size on UGroomSolverComponent");
static_assert(offsetof(UGroomSolverComponent, SolverSettings) == 0x000598, "Member 'UGroomSolverComponent::SolverSettings' has a wrong offset!");
static_assert(offsetof(UGroomSolverComponent, SimulationAsset) == 0x000600, "Member 'UGroomSolverComponent::SimulationAsset' has a wrong offset!");
static_assert(offsetof(UGroomSolverComponent, GroomComponents) == 0x000658, "Member 'UGroomSolverComponent::GroomComponents' has a wrong offset!");
static_assert(offsetof(UGroomSolverComponent, MeshDeformer) == 0x0006A8, "Member 'UGroomSolverComponent::MeshDeformer' has a wrong offset!");
static_assert(offsetof(UGroomSolverComponent, DeformerInstance) == 0x0006B0, "Member 'UGroomSolverComponent::DeformerInstance' has a wrong offset!");
static_assert(offsetof(UGroomSolverComponent, DeformerSettings) == 0x0006B8, "Member 'UGroomSolverComponent::DeformerSettings' has a wrong offset!");

}

