#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HairStrandsDeformer

#include "Basic.hpp"

#include "HairStrandsDeformer_structs.hpp"
#include "OptimusCore_classes.hpp"
#include "ComputeFramework_classes.hpp"


namespace SDK
{

// Class HairStrandsDeformer.OptimusGroomAttributeReadDataInterface
// 0x0020 (0x0048 - 0x0028)
class UOptimusGroomAttributeReadDataInterface final : public UOptimusComputeDataInterface
{
public:
	class FName                                   GroomAttributeName;                                // 0x0028(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EOptimusGroomExecDomain                       GroomAttributeGroup;                               // 0x0030(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EOptimusGroomAttributeTypes                   GroomAttributeType;                                // 0x0031(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_32[0x16];                                      // 0x0032(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomAttributeReadDataInterface">();
	}
	static class UOptimusGroomAttributeReadDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomAttributeReadDataInterface>();
	}
};
static_assert(alignof(UOptimusGroomAttributeReadDataInterface) == 0x000008, "Wrong alignment on UOptimusGroomAttributeReadDataInterface");
static_assert(sizeof(UOptimusGroomAttributeReadDataInterface) == 0x000048, "Wrong size on UOptimusGroomAttributeReadDataInterface");
static_assert(offsetof(UOptimusGroomAttributeReadDataInterface, GroomAttributeName) == 0x000028, "Member 'UOptimusGroomAttributeReadDataInterface::GroomAttributeName' has a wrong offset!");
static_assert(offsetof(UOptimusGroomAttributeReadDataInterface, GroomAttributeGroup) == 0x000030, "Member 'UOptimusGroomAttributeReadDataInterface::GroomAttributeGroup' has a wrong offset!");
static_assert(offsetof(UOptimusGroomAttributeReadDataInterface, GroomAttributeType) == 0x000031, "Member 'UOptimusGroomAttributeReadDataInterface::GroomAttributeType' has a wrong offset!");

// Class HairStrandsDeformer.OptimusGroomAttributeReadDataProvider
// 0x0018 (0x0040 - 0x0028)
class UOptimusGroomAttributeReadDataProvider final : public UComputeDataProvider
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GroomAttributeName;                                // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOptimusGroomExecDomain                       GroomAttributeGroup;                               // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOptimusGroomAttributeTypes                   GroomAttributeType;                                // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomAttributeReadDataProvider">();
	}
	static class UOptimusGroomAttributeReadDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomAttributeReadDataProvider>();
	}
};
static_assert(alignof(UOptimusGroomAttributeReadDataProvider) == 0x000008, "Wrong alignment on UOptimusGroomAttributeReadDataProvider");
static_assert(sizeof(UOptimusGroomAttributeReadDataProvider) == 0x000040, "Wrong size on UOptimusGroomAttributeReadDataProvider");
static_assert(offsetof(UOptimusGroomAttributeReadDataProvider, MeshComponent) == 0x000028, "Member 'UOptimusGroomAttributeReadDataProvider::MeshComponent' has a wrong offset!");
static_assert(offsetof(UOptimusGroomAttributeReadDataProvider, GroomAttributeName) == 0x000030, "Member 'UOptimusGroomAttributeReadDataProvider::GroomAttributeName' has a wrong offset!");
static_assert(offsetof(UOptimusGroomAttributeReadDataProvider, GroomAttributeGroup) == 0x000038, "Member 'UOptimusGroomAttributeReadDataProvider::GroomAttributeGroup' has a wrong offset!");
static_assert(offsetof(UOptimusGroomAttributeReadDataProvider, GroomAttributeType) == 0x000039, "Member 'UOptimusGroomAttributeReadDataProvider::GroomAttributeType' has a wrong offset!");

// Class HairStrandsDeformer.OptimusGroomExecDataInterface
// 0x0010 (0x0038 - 0x0028)
class UOptimusGroomExecDataInterface final : public UOptimusComputeDataInterface
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EOptimusGroomExecDomain                       Domain;                                            // 0x0030(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomExecDataInterface">();
	}
	static class UOptimusGroomExecDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomExecDataInterface>();
	}
};
static_assert(alignof(UOptimusGroomExecDataInterface) == 0x000008, "Wrong alignment on UOptimusGroomExecDataInterface");
static_assert(sizeof(UOptimusGroomExecDataInterface) == 0x000038, "Wrong size on UOptimusGroomExecDataInterface");
static_assert(offsetof(UOptimusGroomExecDataInterface, Domain) == 0x000030, "Member 'UOptimusGroomExecDataInterface::Domain' has a wrong offset!");

// Class HairStrandsDeformer.OptimusGroomExecDataProvider
// 0x0010 (0x0038 - 0x0028)
class UOptimusGroomExecDataProvider final : public UComputeDataProvider
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOptimusGroomExecDomain                       Domain;                                            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomExecDataProvider">();
	}
	static class UOptimusGroomExecDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomExecDataProvider>();
	}
};
static_assert(alignof(UOptimusGroomExecDataProvider) == 0x000008, "Wrong alignment on UOptimusGroomExecDataProvider");
static_assert(sizeof(UOptimusGroomExecDataProvider) == 0x000038, "Wrong size on UOptimusGroomExecDataProvider");
static_assert(offsetof(UOptimusGroomExecDataProvider, MeshComponent) == 0x000028, "Member 'UOptimusGroomExecDataProvider::MeshComponent' has a wrong offset!");
static_assert(offsetof(UOptimusGroomExecDataProvider, Domain) == 0x000030, "Member 'UOptimusGroomExecDataProvider::Domain' has a wrong offset!");

// Class HairStrandsDeformer.OptimusGroomAssetComponentSource
// 0x0000 (0x0028 - 0x0028)
class UOptimusGroomAssetComponentSource final : public UOptimusComponentSource
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomAssetComponentSource">();
	}
	static class UOptimusGroomAssetComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomAssetComponentSource>();
	}
};
static_assert(alignof(UOptimusGroomAssetComponentSource) == 0x000008, "Wrong alignment on UOptimusGroomAssetComponentSource");
static_assert(sizeof(UOptimusGroomAssetComponentSource) == 0x000028, "Wrong size on UOptimusGroomAssetComponentSource");

// Class HairStrandsDeformer.OptimusGroomSolverComponentSource
// 0x0000 (0x0028 - 0x0028)
class UOptimusGroomSolverComponentSource final : public UOptimusComponentSource
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomSolverComponentSource">();
	}
	static class UOptimusGroomSolverComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomSolverComponentSource>();
	}
};
static_assert(alignof(UOptimusGroomSolverComponentSource) == 0x000008, "Wrong alignment on UOptimusGroomSolverComponentSource");
static_assert(sizeof(UOptimusGroomSolverComponentSource) == 0x000028, "Wrong size on UOptimusGroomSolverComponentSource");

// Class HairStrandsDeformer.OptimusGroomGuidesReadDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusGroomGuidesReadDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomGuidesReadDataInterface">();
	}
	static class UOptimusGroomGuidesReadDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomGuidesReadDataInterface>();
	}
};
static_assert(alignof(UOptimusGroomGuidesReadDataInterface) == 0x000008, "Wrong alignment on UOptimusGroomGuidesReadDataInterface");
static_assert(sizeof(UOptimusGroomGuidesReadDataInterface) == 0x000028, "Wrong size on UOptimusGroomGuidesReadDataInterface");

// Class HairStrandsDeformer.OptimusGroomGuidesReadDataProvider
// 0x0008 (0x0030 - 0x0028)
class UOptimusGroomGuidesReadDataProvider final : public UComputeDataProvider
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomGuidesReadDataProvider">();
	}
	static class UOptimusGroomGuidesReadDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomGuidesReadDataProvider>();
	}
};
static_assert(alignof(UOptimusGroomGuidesReadDataProvider) == 0x000008, "Wrong alignment on UOptimusGroomGuidesReadDataProvider");
static_assert(sizeof(UOptimusGroomGuidesReadDataProvider) == 0x000030, "Wrong size on UOptimusGroomGuidesReadDataProvider");
static_assert(offsetof(UOptimusGroomGuidesReadDataProvider, MeshComponent) == 0x000028, "Member 'UOptimusGroomGuidesReadDataProvider::MeshComponent' has a wrong offset!");

// Class HairStrandsDeformer.OptimusGroomGuidesWriteDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusGroomGuidesWriteDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomGuidesWriteDataInterface">();
	}
	static class UOptimusGroomGuidesWriteDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomGuidesWriteDataInterface>();
	}
};
static_assert(alignof(UOptimusGroomGuidesWriteDataInterface) == 0x000008, "Wrong alignment on UOptimusGroomGuidesWriteDataInterface");
static_assert(sizeof(UOptimusGroomGuidesWriteDataInterface) == 0x000028, "Wrong size on UOptimusGroomGuidesWriteDataInterface");

// Class HairStrandsDeformer.OptimusGroomGuidesWriteDataProvider
// 0x0010 (0x0038 - 0x0028)
class UOptimusGroomGuidesWriteDataProvider final : public UComputeDataProvider
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomGuidesWriteDataProvider">();
	}
	static class UOptimusGroomGuidesWriteDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomGuidesWriteDataProvider>();
	}
};
static_assert(alignof(UOptimusGroomGuidesWriteDataProvider) == 0x000008, "Wrong alignment on UOptimusGroomGuidesWriteDataProvider");
static_assert(sizeof(UOptimusGroomGuidesWriteDataProvider) == 0x000038, "Wrong size on UOptimusGroomGuidesWriteDataProvider");
static_assert(offsetof(UOptimusGroomGuidesWriteDataProvider, MeshComponent) == 0x000028, "Member 'UOptimusGroomGuidesWriteDataProvider::MeshComponent' has a wrong offset!");

// Class HairStrandsDeformer.OptimusGroomMeshesReadDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusGroomMeshesReadDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomMeshesReadDataInterface">();
	}
	static class UOptimusGroomMeshesReadDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomMeshesReadDataInterface>();
	}
};
static_assert(alignof(UOptimusGroomMeshesReadDataInterface) == 0x000008, "Wrong alignment on UOptimusGroomMeshesReadDataInterface");
static_assert(sizeof(UOptimusGroomMeshesReadDataInterface) == 0x000028, "Wrong size on UOptimusGroomMeshesReadDataInterface");

// Class HairStrandsDeformer.OptimusGroomMeshesReadDataProvider
// 0x0008 (0x0030 - 0x0028)
class UOptimusGroomMeshesReadDataProvider final : public UComputeDataProvider
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomMeshesReadDataProvider">();
	}
	static class UOptimusGroomMeshesReadDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomMeshesReadDataProvider>();
	}
};
static_assert(alignof(UOptimusGroomMeshesReadDataProvider) == 0x000008, "Wrong alignment on UOptimusGroomMeshesReadDataProvider");
static_assert(sizeof(UOptimusGroomMeshesReadDataProvider) == 0x000030, "Wrong size on UOptimusGroomMeshesReadDataProvider");
static_assert(offsetof(UOptimusGroomMeshesReadDataProvider, MeshComponent) == 0x000028, "Member 'UOptimusGroomMeshesReadDataProvider::MeshComponent' has a wrong offset!");

// Class HairStrandsDeformer.OptimusGroomSolverReadDataInterface
// 0x0008 (0x0030 - 0x0028)
class UOptimusGroomSolverReadDataInterface final : public UOptimusComputeDataInterface
{
public:
	class FName                                   ResetSimulationTrigger;                            // 0x0028(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomSolverReadDataInterface">();
	}
	static class UOptimusGroomSolverReadDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomSolverReadDataInterface>();
	}
};
static_assert(alignof(UOptimusGroomSolverReadDataInterface) == 0x000008, "Wrong alignment on UOptimusGroomSolverReadDataInterface");
static_assert(sizeof(UOptimusGroomSolverReadDataInterface) == 0x000030, "Wrong size on UOptimusGroomSolverReadDataInterface");
static_assert(offsetof(UOptimusGroomSolverReadDataInterface, ResetSimulationTrigger) == 0x000028, "Member 'UOptimusGroomSolverReadDataInterface::ResetSimulationTrigger' has a wrong offset!");

// Class HairStrandsDeformer.OptimusGroomSolverReadDataProvider
// 0x0028 (0x0050 - 0x0028)
class UOptimusGroomSolverReadDataProvider final : public UComputeDataProvider
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroomSolverComponent*                  SolverComponent;                                   // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOptimusDeformerInstance*               DeformerInstance;                                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomSolverReadDataProvider">();
	}
	static class UOptimusGroomSolverReadDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomSolverReadDataProvider>();
	}
};
static_assert(alignof(UOptimusGroomSolverReadDataProvider) == 0x000008, "Wrong alignment on UOptimusGroomSolverReadDataProvider");
static_assert(sizeof(UOptimusGroomSolverReadDataProvider) == 0x000050, "Wrong size on UOptimusGroomSolverReadDataProvider");
static_assert(offsetof(UOptimusGroomSolverReadDataProvider, SolverComponent) == 0x000030, "Member 'UOptimusGroomSolverReadDataProvider::SolverComponent' has a wrong offset!");
static_assert(offsetof(UOptimusGroomSolverReadDataProvider, DeformerInstance) == 0x000038, "Member 'UOptimusGroomSolverReadDataProvider::DeformerInstance' has a wrong offset!");

// Class HairStrandsDeformer.OptimusGroomStrandsReadDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusGroomStrandsReadDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomStrandsReadDataInterface">();
	}
	static class UOptimusGroomStrandsReadDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomStrandsReadDataInterface>();
	}
};
static_assert(alignof(UOptimusGroomStrandsReadDataInterface) == 0x000008, "Wrong alignment on UOptimusGroomStrandsReadDataInterface");
static_assert(sizeof(UOptimusGroomStrandsReadDataInterface) == 0x000028, "Wrong size on UOptimusGroomStrandsReadDataInterface");

// Class HairStrandsDeformer.OptimusGroomStrandsReadDataProvider
// 0x0008 (0x0030 - 0x0028)
class UOptimusGroomStrandsReadDataProvider final : public UComputeDataProvider
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomStrandsReadDataProvider">();
	}
	static class UOptimusGroomStrandsReadDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomStrandsReadDataProvider>();
	}
};
static_assert(alignof(UOptimusGroomStrandsReadDataProvider) == 0x000008, "Wrong alignment on UOptimusGroomStrandsReadDataProvider");
static_assert(sizeof(UOptimusGroomStrandsReadDataProvider) == 0x000030, "Wrong size on UOptimusGroomStrandsReadDataProvider");
static_assert(offsetof(UOptimusGroomStrandsReadDataProvider, MeshComponent) == 0x000028, "Member 'UOptimusGroomStrandsReadDataProvider::MeshComponent' has a wrong offset!");

// Class HairStrandsDeformer.OptimusGroomStrandsWriteDataInterface
// 0x0000 (0x0028 - 0x0028)
class UOptimusGroomStrandsWriteDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomStrandsWriteDataInterface">();
	}
	static class UOptimusGroomStrandsWriteDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomStrandsWriteDataInterface>();
	}
};
static_assert(alignof(UOptimusGroomStrandsWriteDataInterface) == 0x000008, "Wrong alignment on UOptimusGroomStrandsWriteDataInterface");
static_assert(sizeof(UOptimusGroomStrandsWriteDataInterface) == 0x000028, "Wrong size on UOptimusGroomStrandsWriteDataInterface");

// Class HairStrandsDeformer.OptimusGroomStrandsWriteDataProvider
// 0x0010 (0x0038 - 0x0028)
class UOptimusGroomStrandsWriteDataProvider final : public UComputeDataProvider
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OptimusGroomStrandsWriteDataProvider">();
	}
	static class UOptimusGroomStrandsWriteDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptimusGroomStrandsWriteDataProvider>();
	}
};
static_assert(alignof(UOptimusGroomStrandsWriteDataProvider) == 0x000008, "Wrong alignment on UOptimusGroomStrandsWriteDataProvider");
static_assert(sizeof(UOptimusGroomStrandsWriteDataProvider) == 0x000038, "Wrong size on UOptimusGroomStrandsWriteDataProvider");
static_assert(offsetof(UOptimusGroomStrandsWriteDataProvider, MeshComponent) == 0x000028, "Member 'UOptimusGroomStrandsWriteDataProvider::MeshComponent' has a wrong offset!");

}

