#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HierarchicalInstanced

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "HierarchicalInstanced_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class HierarchicalInstanced.HierarchicalInstancedActor
// 0x0000 (0x02C8 - 0x02C8)
class AHierarchicalInstancedActor final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HierarchicalInstancedActor">();
	}
	static class AHierarchicalInstancedActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHierarchicalInstancedActor>();
	}
};
static_assert(alignof(AHierarchicalInstancedActor) == 0x000008, "Wrong alignment on AHierarchicalInstancedActor");
static_assert(sizeof(AHierarchicalInstancedActor) == 0x0002C8, "Wrong size on AHierarchicalInstancedActor");

// Class HierarchicalInstanced.HierarchicalInstancedSettings
// 0x0068 (0x0090 - 0x0028)
class UHierarchicalInstancedSettings final : public UObject
{
public:
	float                                         HISMRelevantDistance;                              // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinNumberOfActorsToInstanced;                      // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CullScreenSize;                                    // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipMeshesWithVertexColors;                       // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisallowNanite;                                   // 0x0035(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInstanceActorsUsingLocation;                      // 0x0036(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInstancedTargetAreaFlags                     InstancedTarget;                                   // 0x0037(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UseISMCSizeThreshold;                              // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           IncludeRuntimeGrids;                               // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           ExcludeRuntimeGrids;                               // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           IncludeDataLayers;                                 // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           ExcludeDataLayers;                                 // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         MaxMeshBound;                                      // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDetectionReference;                               // 0x0084(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipMeshesWithBreakableMesh;                      // 0x0085(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAssetUserData>             BreakeAssetUserData;                               // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HierarchicalInstancedSettings">();
	}
	static class UHierarchicalInstancedSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHierarchicalInstancedSettings>();
	}
};
static_assert(alignof(UHierarchicalInstancedSettings) == 0x000008, "Wrong alignment on UHierarchicalInstancedSettings");
static_assert(sizeof(UHierarchicalInstancedSettings) == 0x000090, "Wrong size on UHierarchicalInstancedSettings");
static_assert(offsetof(UHierarchicalInstancedSettings, HISMRelevantDistance) == 0x000028, "Member 'UHierarchicalInstancedSettings::HISMRelevantDistance' has a wrong offset!");
static_assert(offsetof(UHierarchicalInstancedSettings, MinNumberOfActorsToInstanced) == 0x00002C, "Member 'UHierarchicalInstancedSettings::MinNumberOfActorsToInstanced' has a wrong offset!");
static_assert(offsetof(UHierarchicalInstancedSettings, CullScreenSize) == 0x000030, "Member 'UHierarchicalInstancedSettings::CullScreenSize' has a wrong offset!");
static_assert(offsetof(UHierarchicalInstancedSettings, bSkipMeshesWithVertexColors) == 0x000034, "Member 'UHierarchicalInstancedSettings::bSkipMeshesWithVertexColors' has a wrong offset!");
static_assert(offsetof(UHierarchicalInstancedSettings, bDisallowNanite) == 0x000035, "Member 'UHierarchicalInstancedSettings::bDisallowNanite' has a wrong offset!");
static_assert(offsetof(UHierarchicalInstancedSettings, bInstanceActorsUsingLocation) == 0x000036, "Member 'UHierarchicalInstancedSettings::bInstanceActorsUsingLocation' has a wrong offset!");
static_assert(offsetof(UHierarchicalInstancedSettings, InstancedTarget) == 0x000037, "Member 'UHierarchicalInstancedSettings::InstancedTarget' has a wrong offset!");
static_assert(offsetof(UHierarchicalInstancedSettings, UseISMCSizeThreshold) == 0x000038, "Member 'UHierarchicalInstancedSettings::UseISMCSizeThreshold' has a wrong offset!");
static_assert(offsetof(UHierarchicalInstancedSettings, IncludeRuntimeGrids) == 0x000040, "Member 'UHierarchicalInstancedSettings::IncludeRuntimeGrids' has a wrong offset!");
static_assert(offsetof(UHierarchicalInstancedSettings, ExcludeRuntimeGrids) == 0x000050, "Member 'UHierarchicalInstancedSettings::ExcludeRuntimeGrids' has a wrong offset!");
static_assert(offsetof(UHierarchicalInstancedSettings, IncludeDataLayers) == 0x000060, "Member 'UHierarchicalInstancedSettings::IncludeDataLayers' has a wrong offset!");
static_assert(offsetof(UHierarchicalInstancedSettings, ExcludeDataLayers) == 0x000070, "Member 'UHierarchicalInstancedSettings::ExcludeDataLayers' has a wrong offset!");
static_assert(offsetof(UHierarchicalInstancedSettings, MaxMeshBound) == 0x000080, "Member 'UHierarchicalInstancedSettings::MaxMeshBound' has a wrong offset!");
static_assert(offsetof(UHierarchicalInstancedSettings, bDetectionReference) == 0x000084, "Member 'UHierarchicalInstancedSettings::bDetectionReference' has a wrong offset!");
static_assert(offsetof(UHierarchicalInstancedSettings, bSkipMeshesWithBreakableMesh) == 0x000085, "Member 'UHierarchicalInstancedSettings::bSkipMeshesWithBreakableMesh' has a wrong offset!");
static_assert(offsetof(UHierarchicalInstancedSettings, BreakeAssetUserData) == 0x000088, "Member 'UHierarchicalInstancedSettings::BreakeAssetUserData' has a wrong offset!");

// Class HierarchicalInstanced.HISMComponent
// 0x0008 (0x0B70 - 0x0B68)
class UHISMComponent final : public UHierarchicalInstancedStaticMeshComponent
{
public:
	uint8                                         Pad_B68[0x8];                                      // 0x0B68(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HISMComponent">();
	}
	static class UHISMComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHISMComponent>();
	}
};
static_assert(alignof(UHISMComponent) == 0x000008, "Wrong alignment on UHISMComponent");
static_assert(sizeof(UHISMComponent) == 0x000B70, "Wrong size on UHISMComponent");

}

