#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HottaUtility

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ZoneGraph_structs.hpp"


namespace SDK::Params
{

// Function HottaUtility.HottaUtilityBPLibrary.AddUniquePerPointLaneProfile
// 0x0028 (0x0028 - 0x0000)
struct HottaUtilityBPLibrary_AddUniquePerPointLaneProfile final
{
public:
	class UZoneShapeComponent*                    ZoneShapeComponent;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FZoneLaneProfileRef                    NewLaneProfileRef;                                 // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HottaUtilityBPLibrary_AddUniquePerPointLaneProfile) == 0x000008, "Wrong alignment on HottaUtilityBPLibrary_AddUniquePerPointLaneProfile");
static_assert(sizeof(HottaUtilityBPLibrary_AddUniquePerPointLaneProfile) == 0x000028, "Wrong size on HottaUtilityBPLibrary_AddUniquePerPointLaneProfile");
static_assert(offsetof(HottaUtilityBPLibrary_AddUniquePerPointLaneProfile, ZoneShapeComponent) == 0x000000, "Member 'HottaUtilityBPLibrary_AddUniquePerPointLaneProfile::ZoneShapeComponent' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_AddUniquePerPointLaneProfile, NewLaneProfileRef) == 0x000008, "Member 'HottaUtilityBPLibrary_AddUniquePerPointLaneProfile::NewLaneProfileRef' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_AddUniquePerPointLaneProfile, ReturnValue) == 0x000020, "Member 'HottaUtilityBPLibrary_AddUniquePerPointLaneProfile::ReturnValue' has a wrong offset!");

// Function HottaUtility.HottaUtilityBPLibrary.GetLaneLaneDescByName
// 0x0020 (0x0020 - 0x0000)
struct HottaUtilityBPLibrary_GetLaneLaneDescByName final
{
public:
	class FName                                   LaneName;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Succeful;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FZoneLaneDesc>                  ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HottaUtilityBPLibrary_GetLaneLaneDescByName) == 0x000008, "Wrong alignment on HottaUtilityBPLibrary_GetLaneLaneDescByName");
static_assert(sizeof(HottaUtilityBPLibrary_GetLaneLaneDescByName) == 0x000020, "Wrong size on HottaUtilityBPLibrary_GetLaneLaneDescByName");
static_assert(offsetof(HottaUtilityBPLibrary_GetLaneLaneDescByName, LaneName) == 0x000000, "Member 'HottaUtilityBPLibrary_GetLaneLaneDescByName::LaneName' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_GetLaneLaneDescByName, Succeful) == 0x000008, "Member 'HottaUtilityBPLibrary_GetLaneLaneDescByName::Succeful' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_GetLaneLaneDescByName, ReturnValue) == 0x000010, "Member 'HottaUtilityBPLibrary_GetLaneLaneDescByName::ReturnValue' has a wrong offset!");

// Function HottaUtility.HottaUtilityBPLibrary.GetLaneProfileRefByName
// 0x0024 (0x0024 - 0x0000)
struct HottaUtilityBPLibrary_GetLaneProfileRefByName final
{
public:
	class FName                                   LaneName;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Succeful;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneLaneProfileRef                    ReturnValue;                                       // 0x000C(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(HottaUtilityBPLibrary_GetLaneProfileRefByName) == 0x000004, "Wrong alignment on HottaUtilityBPLibrary_GetLaneProfileRefByName");
static_assert(sizeof(HottaUtilityBPLibrary_GetLaneProfileRefByName) == 0x000024, "Wrong size on HottaUtilityBPLibrary_GetLaneProfileRefByName");
static_assert(offsetof(HottaUtilityBPLibrary_GetLaneProfileRefByName, LaneName) == 0x000000, "Member 'HottaUtilityBPLibrary_GetLaneProfileRefByName::LaneName' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_GetLaneProfileRefByName, Succeful) == 0x000008, "Member 'HottaUtilityBPLibrary_GetLaneProfileRefByName::Succeful' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_GetLaneProfileRefByName, ReturnValue) == 0x00000C, "Member 'HottaUtilityBPLibrary_GetLaneProfileRefByName::ReturnValue' has a wrong offset!");

// Function HottaUtility.HottaUtilityBPLibrary.GetLanesTotalWidthByName
// 0x0010 (0x0010 - 0x0000)
struct HottaUtilityBPLibrary_GetLanesTotalWidthByName final
{
public:
	class FName                                   LaneName;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Succeful;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HottaUtilityBPLibrary_GetLanesTotalWidthByName) == 0x000004, "Wrong alignment on HottaUtilityBPLibrary_GetLanesTotalWidthByName");
static_assert(sizeof(HottaUtilityBPLibrary_GetLanesTotalWidthByName) == 0x000010, "Wrong size on HottaUtilityBPLibrary_GetLanesTotalWidthByName");
static_assert(offsetof(HottaUtilityBPLibrary_GetLanesTotalWidthByName, LaneName) == 0x000000, "Member 'HottaUtilityBPLibrary_GetLanesTotalWidthByName::LaneName' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_GetLanesTotalWidthByName, Succeful) == 0x000008, "Member 'HottaUtilityBPLibrary_GetLanesTotalWidthByName::Succeful' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_GetLanesTotalWidthByName, ReturnValue) == 0x00000C, "Member 'HottaUtilityBPLibrary_GetLanesTotalWidthByName::ReturnValue' has a wrong offset!");

// Function HottaUtility.HottaUtilityBPLibrary.GetLanesTotalWidthByProfileRef
// 0x001C (0x001C - 0x0000)
struct HottaUtilityBPLibrary_GetLanesTotalWidthByProfileRef final
{
public:
	struct FZoneLaneProfileRef                    ProfileRef;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HottaUtilityBPLibrary_GetLanesTotalWidthByProfileRef) == 0x000004, "Wrong alignment on HottaUtilityBPLibrary_GetLanesTotalWidthByProfileRef");
static_assert(sizeof(HottaUtilityBPLibrary_GetLanesTotalWidthByProfileRef) == 0x00001C, "Wrong size on HottaUtilityBPLibrary_GetLanesTotalWidthByProfileRef");
static_assert(offsetof(HottaUtilityBPLibrary_GetLanesTotalWidthByProfileRef, ProfileRef) == 0x000000, "Member 'HottaUtilityBPLibrary_GetLanesTotalWidthByProfileRef::ProfileRef' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_GetLanesTotalWidthByProfileRef, ReturnValue) == 0x000018, "Member 'HottaUtilityBPLibrary_GetLanesTotalWidthByProfileRef::ReturnValue' has a wrong offset!");

// Function HottaUtility.HottaUtilityBPLibrary.GetSocketNameByIndex
// 0x0018 (0x0018 - 0x0000)
struct HottaUtilityBPLibrary_GetSocketNameByIndex final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Succeful;                                          // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HottaUtilityBPLibrary_GetSocketNameByIndex) == 0x000008, "Wrong alignment on HottaUtilityBPLibrary_GetSocketNameByIndex");
static_assert(sizeof(HottaUtilityBPLibrary_GetSocketNameByIndex) == 0x000018, "Wrong size on HottaUtilityBPLibrary_GetSocketNameByIndex");
static_assert(offsetof(HottaUtilityBPLibrary_GetSocketNameByIndex, StaticMesh) == 0x000000, "Member 'HottaUtilityBPLibrary_GetSocketNameByIndex::StaticMesh' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_GetSocketNameByIndex, Index_0) == 0x000008, "Member 'HottaUtilityBPLibrary_GetSocketNameByIndex::Index_0' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_GetSocketNameByIndex, Succeful) == 0x00000C, "Member 'HottaUtilityBPLibrary_GetSocketNameByIndex::Succeful' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_GetSocketNameByIndex, ReturnValue) == 0x000010, "Member 'HottaUtilityBPLibrary_GetSocketNameByIndex::ReturnValue' has a wrong offset!");

// Function HottaUtility.HottaUtilityBPLibrary.GetSocketsName
// 0x0018 (0x0018 - 0x0000)
struct HottaUtilityBPLibrary_GetSocketsName final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HottaUtilityBPLibrary_GetSocketsName) == 0x000008, "Wrong alignment on HottaUtilityBPLibrary_GetSocketsName");
static_assert(sizeof(HottaUtilityBPLibrary_GetSocketsName) == 0x000018, "Wrong size on HottaUtilityBPLibrary_GetSocketsName");
static_assert(offsetof(HottaUtilityBPLibrary_GetSocketsName, StaticMesh) == 0x000000, "Member 'HottaUtilityBPLibrary_GetSocketsName::StaticMesh' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_GetSocketsName, ReturnValue) == 0x000008, "Member 'HottaUtilityBPLibrary_GetSocketsName::ReturnValue' has a wrong offset!");

// Function HottaUtility.HottaUtilityBPLibrary.GetValueObject
// 0x0018 (0x0018 - 0x0000)
struct HottaUtilityBPLibrary_GetValueObject final
{
public:
	const class UPCGComponent*                    PCGComponent;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HottaUtilityBPLibrary_GetValueObject) == 0x000008, "Wrong alignment on HottaUtilityBPLibrary_GetValueObject");
static_assert(sizeof(HottaUtilityBPLibrary_GetValueObject) == 0x000018, "Wrong size on HottaUtilityBPLibrary_GetValueObject");
static_assert(offsetof(HottaUtilityBPLibrary_GetValueObject, PCGComponent) == 0x000000, "Member 'HottaUtilityBPLibrary_GetValueObject::PCGComponent' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_GetValueObject, PropertyName) == 0x000008, "Member 'HottaUtilityBPLibrary_GetValueObject::PropertyName' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_GetValueObject, ReturnValue) == 0x000010, "Member 'HottaUtilityBPLibrary_GetValueObject::ReturnValue' has a wrong offset!");

// Function HottaUtility.HottaUtilityBPLibrary.GetValueObjectArray
// 0x0020 (0x0020 - 0x0000)
struct HottaUtilityBPLibrary_GetValueObjectArray final
{
public:
	const class UPCGComponent*                    PCGComponent;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HottaUtilityBPLibrary_GetValueObjectArray) == 0x000008, "Wrong alignment on HottaUtilityBPLibrary_GetValueObjectArray");
static_assert(sizeof(HottaUtilityBPLibrary_GetValueObjectArray) == 0x000020, "Wrong size on HottaUtilityBPLibrary_GetValueObjectArray");
static_assert(offsetof(HottaUtilityBPLibrary_GetValueObjectArray, PCGComponent) == 0x000000, "Member 'HottaUtilityBPLibrary_GetValueObjectArray::PCGComponent' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_GetValueObjectArray, PropertyName) == 0x000008, "Member 'HottaUtilityBPLibrary_GetValueObjectArray::PropertyName' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_GetValueObjectArray, ReturnValue) == 0x000010, "Member 'HottaUtilityBPLibrary_GetValueObjectArray::ReturnValue' has a wrong offset!");

// Function HottaUtility.HottaUtilityBPLibrary.IsSM5
// 0x0001 (0x0001 - 0x0000)
struct HottaUtilityBPLibrary_IsSM5 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HottaUtilityBPLibrary_IsSM5) == 0x000001, "Wrong alignment on HottaUtilityBPLibrary_IsSM5");
static_assert(sizeof(HottaUtilityBPLibrary_IsSM5) == 0x000001, "Wrong size on HottaUtilityBPLibrary_IsSM5");
static_assert(offsetof(HottaUtilityBPLibrary_IsSM5, ReturnValue) == 0x000000, "Member 'HottaUtilityBPLibrary_IsSM5::ReturnValue' has a wrong offset!");

// Function HottaUtility.HottaUtilityBPLibrary.IsSM6
// 0x0001 (0x0001 - 0x0000)
struct HottaUtilityBPLibrary_IsSM6 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HottaUtilityBPLibrary_IsSM6) == 0x000001, "Wrong alignment on HottaUtilityBPLibrary_IsSM6");
static_assert(sizeof(HottaUtilityBPLibrary_IsSM6) == 0x000001, "Wrong size on HottaUtilityBPLibrary_IsSM6");
static_assert(offsetof(HottaUtilityBPLibrary_IsSM6, ReturnValue) == 0x000000, "Member 'HottaUtilityBPLibrary_IsSM6::ReturnValue' has a wrong offset!");

// Function HottaUtility.HottaUtilityBPLibrary.ReadCurve
// 0x0098 (0x0098 - 0x0000)
struct HottaUtilityBPLibrary_ReadCurve final
{
public:
	struct FRuntimeFloatCurve                     RuntimeFloatCurve;                                 // 0x0000(0x0088)(Parm, NativeAccessSpecifierPublic)
	float                                         InTime;                                            // 0x0088(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultValue;                                      // 0x008C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0090(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HottaUtilityBPLibrary_ReadCurve) == 0x000004, "Wrong alignment on HottaUtilityBPLibrary_ReadCurve");
static_assert(sizeof(HottaUtilityBPLibrary_ReadCurve) == 0x000098, "Wrong size on HottaUtilityBPLibrary_ReadCurve");
static_assert(offsetof(HottaUtilityBPLibrary_ReadCurve, RuntimeFloatCurve) == 0x000000, "Member 'HottaUtilityBPLibrary_ReadCurve::RuntimeFloatCurve' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_ReadCurve, InTime) == 0x000088, "Member 'HottaUtilityBPLibrary_ReadCurve::InTime' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_ReadCurve, DefaultValue) == 0x00008C, "Member 'HottaUtilityBPLibrary_ReadCurve::DefaultValue' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_ReadCurve, ReturnValue) == 0x000090, "Member 'HottaUtilityBPLibrary_ReadCurve::ReturnValue' has a wrong offset!");

// Function HottaUtility.HottaUtilityBPLibrary.ReadCurveVector
// 0x01C0 (0x01C0 - 0x0000)
struct HottaUtilityBPLibrary_ReadCurveVector final
{
public:
	struct FRuntimeVectorCurve                    RuntimeVectorCurve;                                // 0x0000(0x0188)(Parm, NativeAccessSpecifierPublic)
	float                                         InTime;                                            // 0x0188(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DefaultValue;                                      // 0x0190(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x01A8(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HottaUtilityBPLibrary_ReadCurveVector) == 0x000004, "Wrong alignment on HottaUtilityBPLibrary_ReadCurveVector");
static_assert(sizeof(HottaUtilityBPLibrary_ReadCurveVector) == 0x0001C0, "Wrong size on HottaUtilityBPLibrary_ReadCurveVector");
static_assert(offsetof(HottaUtilityBPLibrary_ReadCurveVector, RuntimeVectorCurve) == 0x000000, "Member 'HottaUtilityBPLibrary_ReadCurveVector::RuntimeVectorCurve' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_ReadCurveVector, InTime) == 0x000188, "Member 'HottaUtilityBPLibrary_ReadCurveVector::InTime' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_ReadCurveVector, DefaultValue) == 0x000190, "Member 'HottaUtilityBPLibrary_ReadCurveVector::DefaultValue' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_ReadCurveVector, ReturnValue) == 0x0001A8, "Member 'HottaUtilityBPLibrary_ReadCurveVector::ReturnValue' has a wrong offset!");

// Function HottaUtility.HottaUtilityBPLibrary.SetPrimitiveComponentNeverDistanceCulled
// 0x0010 (0x0010 - 0x0000)
struct HottaUtilityBPLibrary_SetPrimitiveComponentNeverDistanceCulled final
{
public:
	class UPrimitiveComponent*                    Primitive;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NewValue;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HottaUtilityBPLibrary_SetPrimitiveComponentNeverDistanceCulled) == 0x000008, "Wrong alignment on HottaUtilityBPLibrary_SetPrimitiveComponentNeverDistanceCulled");
static_assert(sizeof(HottaUtilityBPLibrary_SetPrimitiveComponentNeverDistanceCulled) == 0x000010, "Wrong size on HottaUtilityBPLibrary_SetPrimitiveComponentNeverDistanceCulled");
static_assert(offsetof(HottaUtilityBPLibrary_SetPrimitiveComponentNeverDistanceCulled, Primitive) == 0x000000, "Member 'HottaUtilityBPLibrary_SetPrimitiveComponentNeverDistanceCulled::Primitive' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_SetPrimitiveComponentNeverDistanceCulled, NewValue) == 0x000008, "Member 'HottaUtilityBPLibrary_SetPrimitiveComponentNeverDistanceCulled::NewValue' has a wrong offset!");

// Function HottaUtility.HottaUtilityBPLibrary.SetPrimitiveComponentSelectable
// 0x0010 (0x0010 - 0x0000)
struct HottaUtilityBPLibrary_SetPrimitiveComponentSelectable final
{
public:
	class UPrimitiveComponent*                    Primitive;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectable;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HottaUtilityBPLibrary_SetPrimitiveComponentSelectable) == 0x000008, "Wrong alignment on HottaUtilityBPLibrary_SetPrimitiveComponentSelectable");
static_assert(sizeof(HottaUtilityBPLibrary_SetPrimitiveComponentSelectable) == 0x000010, "Wrong size on HottaUtilityBPLibrary_SetPrimitiveComponentSelectable");
static_assert(offsetof(HottaUtilityBPLibrary_SetPrimitiveComponentSelectable, Primitive) == 0x000000, "Member 'HottaUtilityBPLibrary_SetPrimitiveComponentSelectable::Primitive' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_SetPrimitiveComponentSelectable, bSelectable) == 0x000008, "Member 'HottaUtilityBPLibrary_SetPrimitiveComponentSelectable::bSelectable' has a wrong offset!");

// Function HottaUtility.HottaUtilityBPLibrary.SetRayTracingFarField
// 0x0010 (0x0010 - 0x0000)
struct HottaUtilityBPLibrary_SetRayTracingFarField final
{
public:
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRayTracingFarField;                               // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HottaUtilityBPLibrary_SetRayTracingFarField) == 0x000008, "Wrong alignment on HottaUtilityBPLibrary_SetRayTracingFarField");
static_assert(sizeof(HottaUtilityBPLibrary_SetRayTracingFarField) == 0x000010, "Wrong size on HottaUtilityBPLibrary_SetRayTracingFarField");
static_assert(offsetof(HottaUtilityBPLibrary_SetRayTracingFarField, StaticMesh) == 0x000000, "Member 'HottaUtilityBPLibrary_SetRayTracingFarField::StaticMesh' has a wrong offset!");
static_assert(offsetof(HottaUtilityBPLibrary_SetRayTracingFarField, bRayTracingFarField) == 0x000008, "Member 'HottaUtilityBPLibrary_SetRayTracingFarField::bRayTracingFarField' has a wrong offset!");

// Function HottaUtility.HottaUtilityBPLibrary.UpdateZoneShape
// 0x0008 (0x0008 - 0x0000)
struct HottaUtilityBPLibrary_UpdateZoneShape final
{
public:
	class UZoneShapeComponent*                    ZoneShapeComponent;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HottaUtilityBPLibrary_UpdateZoneShape) == 0x000008, "Wrong alignment on HottaUtilityBPLibrary_UpdateZoneShape");
static_assert(sizeof(HottaUtilityBPLibrary_UpdateZoneShape) == 0x000008, "Wrong size on HottaUtilityBPLibrary_UpdateZoneShape");
static_assert(offsetof(HottaUtilityBPLibrary_UpdateZoneShape, ZoneShapeComponent) == 0x000000, "Member 'HottaUtilityBPLibrary_UpdateZoneShape::ZoneShapeComponent' has a wrong offset!");

// Function HottaUtility.HTMeshMaterialConfigData.ApplyMaterialSchemeFromStaticMesh
// 0x0018 (0x0018 - 0x0000)
struct HTMeshMaterialConfigData_ApplyMaterialSchemeFromStaticMesh final
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            StaticMesh;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SchemeIndex;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HTMeshMaterialConfigData_ApplyMaterialSchemeFromStaticMesh) == 0x000008, "Wrong alignment on HTMeshMaterialConfigData_ApplyMaterialSchemeFromStaticMesh");
static_assert(sizeof(HTMeshMaterialConfigData_ApplyMaterialSchemeFromStaticMesh) == 0x000018, "Wrong size on HTMeshMaterialConfigData_ApplyMaterialSchemeFromStaticMesh");
static_assert(offsetof(HTMeshMaterialConfigData_ApplyMaterialSchemeFromStaticMesh, MeshComponent) == 0x000000, "Member 'HTMeshMaterialConfigData_ApplyMaterialSchemeFromStaticMesh::MeshComponent' has a wrong offset!");
static_assert(offsetof(HTMeshMaterialConfigData_ApplyMaterialSchemeFromStaticMesh, StaticMesh) == 0x000008, "Member 'HTMeshMaterialConfigData_ApplyMaterialSchemeFromStaticMesh::StaticMesh' has a wrong offset!");
static_assert(offsetof(HTMeshMaterialConfigData_ApplyMaterialSchemeFromStaticMesh, SchemeIndex) == 0x000010, "Member 'HTMeshMaterialConfigData_ApplyMaterialSchemeFromStaticMesh::SchemeIndex' has a wrong offset!");

// Function HottaUtility.HTMeshMaterialConfigData.ApplyMaterialSchemeToMesh
// 0x0010 (0x0010 - 0x0000)
struct HTMeshMaterialConfigData_ApplyMaterialSchemeToMesh final
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SchemeIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HTMeshMaterialConfigData_ApplyMaterialSchemeToMesh) == 0x000008, "Wrong alignment on HTMeshMaterialConfigData_ApplyMaterialSchemeToMesh");
static_assert(sizeof(HTMeshMaterialConfigData_ApplyMaterialSchemeToMesh) == 0x000010, "Wrong size on HTMeshMaterialConfigData_ApplyMaterialSchemeToMesh");
static_assert(offsetof(HTMeshMaterialConfigData_ApplyMaterialSchemeToMesh, MeshComponent) == 0x000000, "Member 'HTMeshMaterialConfigData_ApplyMaterialSchemeToMesh::MeshComponent' has a wrong offset!");
static_assert(offsetof(HTMeshMaterialConfigData_ApplyMaterialSchemeToMesh, SchemeIndex) == 0x000008, "Member 'HTMeshMaterialConfigData_ApplyMaterialSchemeToMesh::SchemeIndex' has a wrong offset!");

// Function HottaUtility.HTMeshMaterialConfigData.ApplyMaterialScheme
// 0x0010 (0x0010 - 0x0000)
struct HTMeshMaterialConfigData_ApplyMaterialScheme final
{
public:
	class UMeshComponent*                         MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SchemeIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HTMeshMaterialConfigData_ApplyMaterialScheme) == 0x000008, "Wrong alignment on HTMeshMaterialConfigData_ApplyMaterialScheme");
static_assert(sizeof(HTMeshMaterialConfigData_ApplyMaterialScheme) == 0x000010, "Wrong size on HTMeshMaterialConfigData_ApplyMaterialScheme");
static_assert(offsetof(HTMeshMaterialConfigData_ApplyMaterialScheme, MeshComponent) == 0x000000, "Member 'HTMeshMaterialConfigData_ApplyMaterialScheme::MeshComponent' has a wrong offset!");
static_assert(offsetof(HTMeshMaterialConfigData_ApplyMaterialScheme, SchemeIndex) == 0x000008, "Member 'HTMeshMaterialConfigData_ApplyMaterialScheme::SchemeIndex' has a wrong offset!");

// Function HottaUtility.HTMeshMaterialConfigData.GetMaterialForSlot
// 0x0010 (0x0010 - 0x0000)
struct HTMeshMaterialConfigData_GetMaterialForSlot final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SchemeIndex;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HTMeshMaterialConfigData_GetMaterialForSlot) == 0x000008, "Wrong alignment on HTMeshMaterialConfigData_GetMaterialForSlot");
static_assert(sizeof(HTMeshMaterialConfigData_GetMaterialForSlot) == 0x000010, "Wrong size on HTMeshMaterialConfigData_GetMaterialForSlot");
static_assert(offsetof(HTMeshMaterialConfigData_GetMaterialForSlot, SlotIndex) == 0x000000, "Member 'HTMeshMaterialConfigData_GetMaterialForSlot::SlotIndex' has a wrong offset!");
static_assert(offsetof(HTMeshMaterialConfigData_GetMaterialForSlot, SchemeIndex) == 0x000004, "Member 'HTMeshMaterialConfigData_GetMaterialForSlot::SchemeIndex' has a wrong offset!");
static_assert(offsetof(HTMeshMaterialConfigData_GetMaterialForSlot, ReturnValue) == 0x000008, "Member 'HTMeshMaterialConfigData_GetMaterialForSlot::ReturnValue' has a wrong offset!");

// Function HottaUtility.HTMeshMaterialConfigData.GetSchemeIndices
// 0x0018 (0x0018 - 0x0000)
struct HTMeshMaterialConfigData_GetSchemeIndices final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HTMeshMaterialConfigData_GetSchemeIndices) == 0x000008, "Wrong alignment on HTMeshMaterialConfigData_GetSchemeIndices");
static_assert(sizeof(HTMeshMaterialConfigData_GetSchemeIndices) == 0x000018, "Wrong size on HTMeshMaterialConfigData_GetSchemeIndices");
static_assert(offsetof(HTMeshMaterialConfigData_GetSchemeIndices, SlotIndex) == 0x000000, "Member 'HTMeshMaterialConfigData_GetSchemeIndices::SlotIndex' has a wrong offset!");
static_assert(offsetof(HTMeshMaterialConfigData_GetSchemeIndices, ReturnValue) == 0x000008, "Member 'HTMeshMaterialConfigData_GetSchemeIndices::ReturnValue' has a wrong offset!");

// Function HottaUtility.HTMeshMaterialConfigData.GetSlotIndices
// 0x0010 (0x0010 - 0x0000)
struct HTMeshMaterialConfigData_GetSlotIndices final
{
public:
	TArray<int32>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HTMeshMaterialConfigData_GetSlotIndices) == 0x000008, "Wrong alignment on HTMeshMaterialConfigData_GetSlotIndices");
static_assert(sizeof(HTMeshMaterialConfigData_GetSlotIndices) == 0x000010, "Wrong size on HTMeshMaterialConfigData_GetSlotIndices");
static_assert(offsetof(HTMeshMaterialConfigData_GetSlotIndices, ReturnValue) == 0x000000, "Member 'HTMeshMaterialConfigData_GetSlotIndices::ReturnValue' has a wrong offset!");

}

