#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HottaUtility

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct HottaUtility.MaterialSlotConfig
// 0x0010 (0x0010 - 0x0000)
struct FMaterialSlotConfig final
{
public:
	TArray<TSoftObjectPtr<class UMaterialInterface>> MaterialSlots;                                  // 0x0000(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMaterialSlotConfig) == 0x000008, "Wrong alignment on FMaterialSlotConfig");
static_assert(sizeof(FMaterialSlotConfig) == 0x000010, "Wrong size on FMaterialSlotConfig");
static_assert(offsetof(FMaterialSlotConfig, MaterialSlots) == 0x000000, "Member 'FMaterialSlotConfig::MaterialSlots' has a wrong offset!");

// ScriptStruct HottaUtility.OCSerializableTriIndices
// 0x000C (0x000C - 0x0000)
struct FOCSerializableTriIndices final
{
public:
	int32                                         v0;                                                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         v1;                                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         v2;                                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOCSerializableTriIndices) == 0x000004, "Wrong alignment on FOCSerializableTriIndices");
static_assert(sizeof(FOCSerializableTriIndices) == 0x00000C, "Wrong size on FOCSerializableTriIndices");
static_assert(offsetof(FOCSerializableTriIndices, v0) == 0x000000, "Member 'FOCSerializableTriIndices::v0' has a wrong offset!");
static_assert(offsetof(FOCSerializableTriIndices, v1) == 0x000004, "Member 'FOCSerializableTriIndices::v1' has a wrong offset!");
static_assert(offsetof(FOCSerializableTriIndices, v2) == 0x000008, "Member 'FOCSerializableTriIndices::v2' has a wrong offset!");

// ScriptStruct HottaUtility.OCUVChannelData
// 0x0010 (0x0010 - 0x0000)
struct FOCUVChannelData final
{
public:
	TArray<struct FVector2D>                      UVs;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOCUVChannelData) == 0x000008, "Wrong alignment on FOCUVChannelData");
static_assert(sizeof(FOCUVChannelData) == 0x000010, "Wrong size on FOCUVChannelData");
static_assert(offsetof(FOCUVChannelData, UVs) == 0x000000, "Member 'FOCUVChannelData::UVs' has a wrong offset!");

// ScriptStruct HottaUtility.OCSerializableTriMeshCollisionData
// 0x0048 (0x0048 - 0x0000)
struct FOCSerializableTriMeshCollisionData final
{
public:
	TArray<struct FVector3f>                      Vertices;                                          // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FOCSerializableTriIndices>      Indices;                                           // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint16>                                MaterialIndices;                                   // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FOCUVChannelData>               UVChannels;                                        // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bFlipNormals;                                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeformableMesh;                                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFastCook;                                         // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableActiveEdgePrecompute;                      // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FOCSerializableTriMeshCollisionData) == 0x000008, "Wrong alignment on FOCSerializableTriMeshCollisionData");
static_assert(sizeof(FOCSerializableTriMeshCollisionData) == 0x000048, "Wrong size on FOCSerializableTriMeshCollisionData");
static_assert(offsetof(FOCSerializableTriMeshCollisionData, Vertices) == 0x000000, "Member 'FOCSerializableTriMeshCollisionData::Vertices' has a wrong offset!");
static_assert(offsetof(FOCSerializableTriMeshCollisionData, Indices) == 0x000010, "Member 'FOCSerializableTriMeshCollisionData::Indices' has a wrong offset!");
static_assert(offsetof(FOCSerializableTriMeshCollisionData, MaterialIndices) == 0x000020, "Member 'FOCSerializableTriMeshCollisionData::MaterialIndices' has a wrong offset!");
static_assert(offsetof(FOCSerializableTriMeshCollisionData, UVChannels) == 0x000030, "Member 'FOCSerializableTriMeshCollisionData::UVChannels' has a wrong offset!");
static_assert(offsetof(FOCSerializableTriMeshCollisionData, bFlipNormals) == 0x000040, "Member 'FOCSerializableTriMeshCollisionData::bFlipNormals' has a wrong offset!");
static_assert(offsetof(FOCSerializableTriMeshCollisionData, bDeformableMesh) == 0x000041, "Member 'FOCSerializableTriMeshCollisionData::bDeformableMesh' has a wrong offset!");
static_assert(offsetof(FOCSerializableTriMeshCollisionData, bFastCook) == 0x000042, "Member 'FOCSerializableTriMeshCollisionData::bFastCook' has a wrong offset!");
static_assert(offsetof(FOCSerializableTriMeshCollisionData, bDisableActiveEdgePrecompute) == 0x000043, "Member 'FOCSerializableTriMeshCollisionData::bDisableActiveEdgePrecompute' has a wrong offset!");

}

