#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HottaUtility

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "HottaUtility_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class HottaUtility.EditorEventActor
// 0x0000 (0x02C8 - 0x02C8)
class AEditorEventActor final : public AActor
{
public:
	void WhenFeatureLevelChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorEventActor">();
	}
	static class AEditorEventActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEditorEventActor>();
	}
};
static_assert(alignof(AEditorEventActor) == 0x000008, "Wrong alignment on AEditorEventActor");
static_assert(sizeof(AEditorEventActor) == 0x0002C8, "Wrong size on AEditorEventActor");

// Class HottaUtility.HottaUtilityBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UHottaUtilityBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static int32 AddUniquePerPointLaneProfile(class UZoneShapeComponent* ZoneShapeComponent, const struct FZoneLaneProfileRef& NewLaneProfileRef);
	static TArray<struct FZoneLaneDesc> GetLaneLaneDescByName(class FName LaneName, bool* Succeful);
	static struct FZoneLaneProfileRef GetLaneProfileRefByName(class FName LaneName, bool* Succeful);
	static float GetLanesTotalWidthByName(class FName LaneName, bool* Succeful);
	static float GetLanesTotalWidthByProfileRef(const struct FZoneLaneProfileRef& ProfileRef);
	static class FName GetSocketNameByIndex(class UStaticMesh* StaticMesh, int32 Index_0, bool* Succeful);
	static TArray<class FName> GetSocketsName(class UStaticMesh* StaticMesh);
	static class UObject* GetValueObject(const class UPCGComponent* PCGComponent, const class FName PropertyName);
	static TArray<class UObject*> GetValueObjectArray(const class UPCGComponent* PCGComponent, const class FName PropertyName);
	static bool IsSM5();
	static bool IsSM6();
	static float ReadCurve(const struct FRuntimeFloatCurve& RuntimeFloatCurve, float InTime, float DefaultValue);
	static struct FVector ReadCurveVector(const struct FRuntimeVectorCurve& RuntimeVectorCurve, float InTime, const struct FVector& DefaultValue);
	static void RebuildGraph();
	static void SetPrimitiveComponentNeverDistanceCulled(class UPrimitiveComponent* Primitive, bool NewValue);
	static void SetPrimitiveComponentSelectable(class UPrimitiveComponent* Primitive, bool bSelectable);
	static void SetRayTracingFarField(class UStaticMeshComponent* StaticMesh, bool bRayTracingFarField);
	static void UpdateZoneShape(class UZoneShapeComponent* ZoneShapeComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HottaUtilityBPLibrary">();
	}
	static class UHottaUtilityBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHottaUtilityBPLibrary>();
	}
};
static_assert(alignof(UHottaUtilityBPLibrary) == 0x000008, "Wrong alignment on UHottaUtilityBPLibrary");
static_assert(sizeof(UHottaUtilityBPLibrary) == 0x000028, "Wrong size on UHottaUtilityBPLibrary");

// Class HottaUtility.HTAssetUserData_DetailMode
// 0x0008 (0x0030 - 0x0028)
class UHTAssetUserData_DetailMode final : public UAssetUserData
{
public:
	EDetailMode                                   DetailMode;                                        // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTAssetUserData_DetailMode">();
	}
	static class UHTAssetUserData_DetailMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTAssetUserData_DetailMode>();
	}
};
static_assert(alignof(UHTAssetUserData_DetailMode) == 0x000008, "Wrong alignment on UHTAssetUserData_DetailMode");
static_assert(sizeof(UHTAssetUserData_DetailMode) == 0x000030, "Wrong size on UHTAssetUserData_DetailMode");
static_assert(offsetof(UHTAssetUserData_DetailMode, DetailMode) == 0x000028, "Member 'UHTAssetUserData_DetailMode::DetailMode' has a wrong offset!");

// Class HottaUtility.HTEditorConfigAssetUserData
// 0x0000 (0x0028 - 0x0028)
class UHTEditorConfigAssetUserData final : public UAssetUserData
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTEditorConfigAssetUserData">();
	}
	static class UHTEditorConfigAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTEditorConfigAssetUserData>();
	}
};
static_assert(alignof(UHTEditorConfigAssetUserData) == 0x000008, "Wrong alignment on UHTEditorConfigAssetUserData");
static_assert(sizeof(UHTEditorConfigAssetUserData) == 0x000028, "Wrong size on UHTEditorConfigAssetUserData");

// Class HottaUtility.HTMeshMaterialConfigData
// 0x0010 (0x0038 - 0x0028)
class UHTMeshMaterialConfigData final : public UAssetUserData
{
public:
	TArray<struct FMaterialSlotConfig>            MaterialSlots;                                     // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static void ApplyMaterialSchemeFromStaticMesh(class UMeshComponent* MeshComponent, class UStaticMesh* StaticMesh, int32 SchemeIndex);
	static void ApplyMaterialSchemeToMesh(class UMeshComponent* MeshComponent, int32 SchemeIndex);

	void ApplyMaterialScheme(class UMeshComponent* MeshComponent, int32 SchemeIndex);
	class UMaterialInterface* GetMaterialForSlot(int32 SlotIndex, int32 SchemeIndex);
	TArray<int32> GetSchemeIndices(int32 SlotIndex);
	TArray<int32> GetSlotIndices();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTMeshMaterialConfigData">();
	}
	static class UHTMeshMaterialConfigData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTMeshMaterialConfigData>();
	}
};
static_assert(alignof(UHTMeshMaterialConfigData) == 0x000008, "Wrong alignment on UHTMeshMaterialConfigData");
static_assert(sizeof(UHTMeshMaterialConfigData) == 0x000038, "Wrong size on UHTMeshMaterialConfigData");
static_assert(offsetof(UHTMeshMaterialConfigData, MaterialSlots) == 0x000028, "Member 'UHTMeshMaterialConfigData::MaterialSlots' has a wrong offset!");

// Class HottaUtility.ZoneGraphLaneSplineActor
// 0x0000 (0x02C8 - 0x02C8)
class AZoneGraphLaneSplineActor final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphLaneSplineActor">();
	}
	static class AZoneGraphLaneSplineActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZoneGraphLaneSplineActor>();
	}
};
static_assert(alignof(AZoneGraphLaneSplineActor) == 0x000008, "Wrong alignment on AZoneGraphLaneSplineActor");
static_assert(sizeof(AZoneGraphLaneSplineActor) == 0x0002C8, "Wrong size on AZoneGraphLaneSplineActor");

// Class HottaUtility.ZoneGraphLaneSplineShapeActor
// 0x0000 (0x02C8 - 0x02C8)
class AZoneGraphLaneSplineShapeActor final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphLaneSplineShapeActor">();
	}
	static class AZoneGraphLaneSplineShapeActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZoneGraphLaneSplineShapeActor>();
	}
};
static_assert(alignof(AZoneGraphLaneSplineShapeActor) == 0x000008, "Wrong alignment on AZoneGraphLaneSplineShapeActor");
static_assert(sizeof(AZoneGraphLaneSplineShapeActor) == 0x0002C8, "Wrong size on AZoneGraphLaneSplineShapeActor");

// Class HottaUtility.ZoneGraphLaneSplineComponent
// 0x0008 (0x0600 - 0x05F8)
class UZoneGraphLaneSplineComponent final : public USplineComponent
{
public:
	class UZoneGraphLaneSplineShapeComponent*     SplineShapeComp;                                   // 0x05F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphLaneSplineComponent">();
	}
	static class UZoneGraphLaneSplineComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphLaneSplineComponent>();
	}
};
static_assert(alignof(UZoneGraphLaneSplineComponent) == 0x000008, "Wrong alignment on UZoneGraphLaneSplineComponent");
static_assert(sizeof(UZoneGraphLaneSplineComponent) == 0x000600, "Wrong size on UZoneGraphLaneSplineComponent");
static_assert(offsetof(UZoneGraphLaneSplineComponent, SplineShapeComp) == 0x0005F8, "Member 'UZoneGraphLaneSplineComponent::SplineShapeComp' has a wrong offset!");

// Class HottaUtility.ZoneGraphLaneSplineShapeComponent
// 0x0020 (0x0270 - 0x0250)
class UZoneGraphLaneSplineShapeComponent final : public USceneComponent
{
public:
	TArray<class UZoneShapeComponent*>            ZoneShapeComps;                                    // 0x0250(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	class UZoneGraphLaneSplineComponent*          OwnerSplineComp;                                   // 0x0260(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphLaneSplineShapeComponent">();
	}
	static class UZoneGraphLaneSplineShapeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphLaneSplineShapeComponent>();
	}
};
static_assert(alignof(UZoneGraphLaneSplineShapeComponent) == 0x000008, "Wrong alignment on UZoneGraphLaneSplineShapeComponent");
static_assert(sizeof(UZoneGraphLaneSplineShapeComponent) == 0x000270, "Wrong size on UZoneGraphLaneSplineShapeComponent");
static_assert(offsetof(UZoneGraphLaneSplineShapeComponent, ZoneShapeComps) == 0x000250, "Member 'UZoneGraphLaneSplineShapeComponent::ZoneShapeComps' has a wrong offset!");
static_assert(offsetof(UZoneGraphLaneSplineShapeComponent, OwnerSplineComp) == 0x000260, "Member 'UZoneGraphLaneSplineShapeComponent::OwnerSplineComp' has a wrong offset!");

// Class HottaUtility.OnlyCollisionComponent
// 0x00A8 (0x05F0 - 0x0548)
class UOnlyCollisionComponent final : public UPrimitiveComponent
{
public:
	uint8                                         Pad_548[0x8];                                      // 0x0548(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOCSerializableTriMeshCollisionData    CachedCollisionData;                               // 0x0550(0x0048)(Protected, NativeAccessSpecifierProtected)
	class FString                                 MeshId;                                            // 0x0598(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int64                                         VerticeCount;                                      // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBodySetup*                             BodySetup;                                         // 0x05B0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FBoxSphereBounds                       Bounds;                                            // 0x05B8(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlyCollisionComponent">();
	}
	static class UOnlyCollisionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlyCollisionComponent>();
	}
};
static_assert(alignof(UOnlyCollisionComponent) == 0x000008, "Wrong alignment on UOnlyCollisionComponent");
static_assert(sizeof(UOnlyCollisionComponent) == 0x0005F0, "Wrong size on UOnlyCollisionComponent");
static_assert(offsetof(UOnlyCollisionComponent, CachedCollisionData) == 0x000550, "Member 'UOnlyCollisionComponent::CachedCollisionData' has a wrong offset!");
static_assert(offsetof(UOnlyCollisionComponent, MeshId) == 0x000598, "Member 'UOnlyCollisionComponent::MeshId' has a wrong offset!");
static_assert(offsetof(UOnlyCollisionComponent, VerticeCount) == 0x0005A8, "Member 'UOnlyCollisionComponent::VerticeCount' has a wrong offset!");
static_assert(offsetof(UOnlyCollisionComponent, BodySetup) == 0x0005B0, "Member 'UOnlyCollisionComponent::BodySetup' has a wrong offset!");
static_assert(offsetof(UOnlyCollisionComponent, Bounds) == 0x0005B8, "Member 'UOnlyCollisionComponent::Bounds' has a wrong offset!");

}

