#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HottaFramework

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function HottaFramework.AsyncAction_ListenForGameplayMessage.ListenForGameplayMessages
// 0x0020 (0x0020 - 0x0000)
struct AsyncAction_ListenForGameplayMessage_ListenForGameplayMessages final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Channel;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScriptStruct*                          PayloadType;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncAction_ListenForGameplayMessage*  ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsyncAction_ListenForGameplayMessage_ListenForGameplayMessages) == 0x000008, "Wrong alignment on AsyncAction_ListenForGameplayMessage_ListenForGameplayMessages");
static_assert(sizeof(AsyncAction_ListenForGameplayMessage_ListenForGameplayMessages) == 0x000020, "Wrong size on AsyncAction_ListenForGameplayMessage_ListenForGameplayMessages");
static_assert(offsetof(AsyncAction_ListenForGameplayMessage_ListenForGameplayMessages, WorldContextObject) == 0x000000, "Member 'AsyncAction_ListenForGameplayMessage_ListenForGameplayMessages::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AsyncAction_ListenForGameplayMessage_ListenForGameplayMessages, Channel) == 0x000008, "Member 'AsyncAction_ListenForGameplayMessage_ListenForGameplayMessages::Channel' has a wrong offset!");
static_assert(offsetof(AsyncAction_ListenForGameplayMessage_ListenForGameplayMessages, PayloadType) == 0x000010, "Member 'AsyncAction_ListenForGameplayMessage_ListenForGameplayMessages::PayloadType' has a wrong offset!");
static_assert(offsetof(AsyncAction_ListenForGameplayMessage_ListenForGameplayMessages, ReturnValue) == 0x000018, "Member 'AsyncAction_ListenForGameplayMessage_ListenForGameplayMessages::ReturnValue' has a wrong offset!");

// Function HottaFramework.AsyncAction_ListenForGameplayMessage.GetPayload
// 0x0008 (0x0008 - 0x0000)
struct AsyncAction_ListenForGameplayMessage_GetPayload final
{
public:
	int32                                         OutPayload;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AsyncAction_ListenForGameplayMessage_GetPayload) == 0x000004, "Wrong alignment on AsyncAction_ListenForGameplayMessage_GetPayload");
static_assert(sizeof(AsyncAction_ListenForGameplayMessage_GetPayload) == 0x000008, "Wrong size on AsyncAction_ListenForGameplayMessage_GetPayload");
static_assert(offsetof(AsyncAction_ListenForGameplayMessage_GetPayload, OutPayload) == 0x000000, "Member 'AsyncAction_ListenForGameplayMessage_GetPayload::OutPayload' has a wrong offset!");
static_assert(offsetof(AsyncAction_ListenForGameplayMessage_GetPayload, ReturnValue) == 0x000004, "Member 'AsyncAction_ListenForGameplayMessage_GetPayload::ReturnValue' has a wrong offset!");

// Function HottaFramework.AsyncAction_ListenForGameplayMessageWithSimpleMessage.ListenForGameplayMessagesWithSimpleMessage
// 0x0018 (0x0018 - 0x0000)
struct AsyncAction_ListenForGameplayMessageWithSimpleMessage_ListenForGameplayMessagesWithSimpleMessage final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Channel;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncAction_ListenForGameplayMessageWithSimpleMessage* ReturnValue;                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AsyncAction_ListenForGameplayMessageWithSimpleMessage_ListenForGameplayMessagesWithSimpleMessage) == 0x000008, "Wrong alignment on AsyncAction_ListenForGameplayMessageWithSimpleMessage_ListenForGameplayMessagesWithSimpleMessage");
static_assert(sizeof(AsyncAction_ListenForGameplayMessageWithSimpleMessage_ListenForGameplayMessagesWithSimpleMessage) == 0x000018, "Wrong size on AsyncAction_ListenForGameplayMessageWithSimpleMessage_ListenForGameplayMessagesWithSimpleMessage");
static_assert(offsetof(AsyncAction_ListenForGameplayMessageWithSimpleMessage_ListenForGameplayMessagesWithSimpleMessage, WorldContextObject) == 0x000000, "Member 'AsyncAction_ListenForGameplayMessageWithSimpleMessage_ListenForGameplayMessagesWithSimpleMessage::WorldContextObject' has a wrong offset!");
static_assert(offsetof(AsyncAction_ListenForGameplayMessageWithSimpleMessage_ListenForGameplayMessagesWithSimpleMessage, Channel) == 0x000008, "Member 'AsyncAction_ListenForGameplayMessageWithSimpleMessage_ListenForGameplayMessagesWithSimpleMessage::Channel' has a wrong offset!");
static_assert(offsetof(AsyncAction_ListenForGameplayMessageWithSimpleMessage_ListenForGameplayMessagesWithSimpleMessage, ReturnValue) == 0x000010, "Member 'AsyncAction_ListenForGameplayMessageWithSimpleMessage_ListenForGameplayMessagesWithSimpleMessage::ReturnValue' has a wrong offset!");

// Function HottaFramework.GameplayMessageSubsystem.K2_BroadcastMessage
// 0x000C (0x000C - 0x0000)
struct GameplayMessageSubsystem_K2_BroadcastMessage final
{
public:
	class FName                                   Channel;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Message;                                           // 0x0008(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayMessageSubsystem_K2_BroadcastMessage) == 0x000004, "Wrong alignment on GameplayMessageSubsystem_K2_BroadcastMessage");
static_assert(sizeof(GameplayMessageSubsystem_K2_BroadcastMessage) == 0x00000C, "Wrong size on GameplayMessageSubsystem_K2_BroadcastMessage");
static_assert(offsetof(GameplayMessageSubsystem_K2_BroadcastMessage, Channel) == 0x000000, "Member 'GameplayMessageSubsystem_K2_BroadcastMessage::Channel' has a wrong offset!");
static_assert(offsetof(GameplayMessageSubsystem_K2_BroadcastMessage, Message) == 0x000008, "Member 'GameplayMessageSubsystem_K2_BroadcastMessage::Message' has a wrong offset!");

// Function HottaFramework.GameplayMessageSubsystemStatic.GetSimpleMessageBoolValue
// 0x0028 (0x0028 - 0x0000)
struct GameplayMessageSubsystemStatic_GetSimpleMessageBoolValue final
{
public:
	struct FGameplayMessageSimpleMessage          InStruct;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameplayMessageSubsystemStatic_GetSimpleMessageBoolValue) == 0x000004, "Wrong alignment on GameplayMessageSubsystemStatic_GetSimpleMessageBoolValue");
static_assert(sizeof(GameplayMessageSubsystemStatic_GetSimpleMessageBoolValue) == 0x000028, "Wrong size on GameplayMessageSubsystemStatic_GetSimpleMessageBoolValue");
static_assert(offsetof(GameplayMessageSubsystemStatic_GetSimpleMessageBoolValue, InStruct) == 0x000000, "Member 'GameplayMessageSubsystemStatic_GetSimpleMessageBoolValue::InStruct' has a wrong offset!");
static_assert(offsetof(GameplayMessageSubsystemStatic_GetSimpleMessageBoolValue, ReturnValue) == 0x000020, "Member 'GameplayMessageSubsystemStatic_GetSimpleMessageBoolValue::ReturnValue' has a wrong offset!");

// Function HottaFramework.GameplayMessageSubsystemStatic.GetSimpleMessageFloatValue
// 0x0028 (0x0028 - 0x0000)
struct GameplayMessageSubsystemStatic_GetSimpleMessageFloatValue final
{
public:
	struct FGameplayMessageSimpleMessage          InStruct;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameplayMessageSubsystemStatic_GetSimpleMessageFloatValue) == 0x000004, "Wrong alignment on GameplayMessageSubsystemStatic_GetSimpleMessageFloatValue");
static_assert(sizeof(GameplayMessageSubsystemStatic_GetSimpleMessageFloatValue) == 0x000028, "Wrong size on GameplayMessageSubsystemStatic_GetSimpleMessageFloatValue");
static_assert(offsetof(GameplayMessageSubsystemStatic_GetSimpleMessageFloatValue, InStruct) == 0x000000, "Member 'GameplayMessageSubsystemStatic_GetSimpleMessageFloatValue::InStruct' has a wrong offset!");
static_assert(offsetof(GameplayMessageSubsystemStatic_GetSimpleMessageFloatValue, ReturnValue) == 0x000020, "Member 'GameplayMessageSubsystemStatic_GetSimpleMessageFloatValue::ReturnValue' has a wrong offset!");

// Function HottaFramework.GameplayMessageSubsystemStatic.GetSimpleMessageIntValue
// 0x0028 (0x0028 - 0x0000)
struct GameplayMessageSubsystemStatic_GetSimpleMessageIntValue final
{
public:
	struct FGameplayMessageSimpleMessage          InStruct;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameplayMessageSubsystemStatic_GetSimpleMessageIntValue) == 0x000004, "Wrong alignment on GameplayMessageSubsystemStatic_GetSimpleMessageIntValue");
static_assert(sizeof(GameplayMessageSubsystemStatic_GetSimpleMessageIntValue) == 0x000028, "Wrong size on GameplayMessageSubsystemStatic_GetSimpleMessageIntValue");
static_assert(offsetof(GameplayMessageSubsystemStatic_GetSimpleMessageIntValue, InStruct) == 0x000000, "Member 'GameplayMessageSubsystemStatic_GetSimpleMessageIntValue::InStruct' has a wrong offset!");
static_assert(offsetof(GameplayMessageSubsystemStatic_GetSimpleMessageIntValue, ReturnValue) == 0x000020, "Member 'GameplayMessageSubsystemStatic_GetSimpleMessageIntValue::ReturnValue' has a wrong offset!");

// Function HottaFramework.GameplayMessageSubsystemStatic.GetSimpleMessageStringValue
// 0x0030 (0x0030 - 0x0000)
struct GameplayMessageSubsystemStatic_GetSimpleMessageStringValue final
{
public:
	struct FGameplayMessageSimpleMessage          InStruct;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayMessageSubsystemStatic_GetSimpleMessageStringValue) == 0x000008, "Wrong alignment on GameplayMessageSubsystemStatic_GetSimpleMessageStringValue");
static_assert(sizeof(GameplayMessageSubsystemStatic_GetSimpleMessageStringValue) == 0x000030, "Wrong size on GameplayMessageSubsystemStatic_GetSimpleMessageStringValue");
static_assert(offsetof(GameplayMessageSubsystemStatic_GetSimpleMessageStringValue, InStruct) == 0x000000, "Member 'GameplayMessageSubsystemStatic_GetSimpleMessageStringValue::InStruct' has a wrong offset!");
static_assert(offsetof(GameplayMessageSubsystemStatic_GetSimpleMessageStringValue, ReturnValue) == 0x000020, "Member 'GameplayMessageSubsystemStatic_GetSimpleMessageStringValue::ReturnValue' has a wrong offset!");

// Function HottaFramework.GameplayMessageSubsystemStatic.MakeLiteralSimpleMessageWithBool
// 0x0028 (0x0028 - 0x0000)
struct GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithBool final
{
public:
	bool                                          InValue;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayMessageSimpleMessage          ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithBool) == 0x000001, "Wrong alignment on GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithBool");
static_assert(sizeof(GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithBool) == 0x000028, "Wrong size on GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithBool");
static_assert(offsetof(GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithBool, InValue) == 0x000000, "Member 'GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithBool::InValue' has a wrong offset!");
static_assert(offsetof(GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithBool, ReturnValue) == 0x000008, "Member 'GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithBool::ReturnValue' has a wrong offset!");

// Function HottaFramework.GameplayMessageSubsystemStatic.MakeLiteralSimpleMessageWithFloat
// 0x0028 (0x0028 - 0x0000)
struct GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithFloat final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayMessageSimpleMessage          ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithFloat) == 0x000004, "Wrong alignment on GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithFloat");
static_assert(sizeof(GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithFloat) == 0x000028, "Wrong size on GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithFloat");
static_assert(offsetof(GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithFloat, InValue) == 0x000000, "Member 'GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithFloat::InValue' has a wrong offset!");
static_assert(offsetof(GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithFloat, ReturnValue) == 0x000008, "Member 'GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithFloat::ReturnValue' has a wrong offset!");

// Function HottaFramework.GameplayMessageSubsystemStatic.MakeLiteralSimpleMessageWithInt
// 0x0028 (0x0028 - 0x0000)
struct GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithInt final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayMessageSimpleMessage          ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithInt) == 0x000004, "Wrong alignment on GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithInt");
static_assert(sizeof(GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithInt) == 0x000028, "Wrong size on GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithInt");
static_assert(offsetof(GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithInt, InValue) == 0x000000, "Member 'GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithInt::InValue' has a wrong offset!");
static_assert(offsetof(GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithInt, ReturnValue) == 0x000008, "Member 'GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithInt::ReturnValue' has a wrong offset!");

// Function HottaFramework.GameplayMessageSubsystemStatic.MakeLiteralSimpleMessageWithString
// 0x0030 (0x0030 - 0x0000)
struct GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithString final
{
public:
	class FString                                 InValue;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayMessageSimpleMessage          ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithString) == 0x000008, "Wrong alignment on GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithString");
static_assert(sizeof(GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithString) == 0x000030, "Wrong size on GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithString");
static_assert(offsetof(GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithString, InValue) == 0x000000, "Member 'GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithString::InValue' has a wrong offset!");
static_assert(offsetof(GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithString, ReturnValue) == 0x000010, "Member 'GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithString::ReturnValue' has a wrong offset!");

// Function HottaFramework.HottaPlayerState.GetPSAccountId
// 0x0010 (0x0010 - 0x0000)
struct HottaPlayerState_GetPSAccountId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HottaPlayerState_GetPSAccountId) == 0x000008, "Wrong alignment on HottaPlayerState_GetPSAccountId");
static_assert(sizeof(HottaPlayerState_GetPSAccountId) == 0x000010, "Wrong size on HottaPlayerState_GetPSAccountId");
static_assert(offsetof(HottaPlayerState_GetPSAccountId, ReturnValue) == 0x000000, "Member 'HottaPlayerState_GetPSAccountId::ReturnValue' has a wrong offset!");

// Function HottaFramework.HottaPlayerState.GetPSPSOnlineId
// 0x0010 (0x0010 - 0x0000)
struct HottaPlayerState_GetPSPSOnlineId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HottaPlayerState_GetPSPSOnlineId) == 0x000008, "Wrong alignment on HottaPlayerState_GetPSPSOnlineId");
static_assert(sizeof(HottaPlayerState_GetPSPSOnlineId) == 0x000010, "Wrong size on HottaPlayerState_GetPSPSOnlineId");
static_assert(offsetof(HottaPlayerState_GetPSPSOnlineId, ReturnValue) == 0x000000, "Member 'HottaPlayerState_GetPSPSOnlineId::ReturnValue' has a wrong offset!");

// Function HottaFramework.HottaPlayerState.GetPSPlayerInterface
// 0x0001 (0x0001 - 0x0000)
struct HottaPlayerState_GetPSPlayerInterface final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HottaPlayerState_GetPSPlayerInterface) == 0x000001, "Wrong alignment on HottaPlayerState_GetPSPlayerInterface");
static_assert(sizeof(HottaPlayerState_GetPSPlayerInterface) == 0x000001, "Wrong size on HottaPlayerState_GetPSPlayerInterface");
static_assert(offsetof(HottaPlayerState_GetPSPlayerInterface, ReturnValue) == 0x000000, "Member 'HottaPlayerState_GetPSPlayerInterface::ReturnValue' has a wrong offset!");

// Function HottaFramework.HottaPlayerState.GetRoleId
// 0x0008 (0x0008 - 0x0000)
struct HottaPlayerState_GetRoleId final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HottaPlayerState_GetRoleId) == 0x000008, "Wrong alignment on HottaPlayerState_GetRoleId");
static_assert(sizeof(HottaPlayerState_GetRoleId) == 0x000008, "Wrong size on HottaPlayerState_GetRoleId");
static_assert(offsetof(HottaPlayerState_GetRoleId, ReturnValue) == 0x000000, "Member 'HottaPlayerState_GetRoleId::ReturnValue' has a wrong offset!");

// Function HottaFramework.HottaSyncUtil.UObjectPropertyToJsonString
// 0x0028 (0x0028 - 0x0000)
struct HottaSyncUtil_UObjectPropertyToJsonString final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InPropertyName;                                    // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InSkipFlags;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInPrettyPrint;                                    // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HottaSyncUtil_UObjectPropertyToJsonString) == 0x000008, "Wrong alignment on HottaSyncUtil_UObjectPropertyToJsonString");
static_assert(sizeof(HottaSyncUtil_UObjectPropertyToJsonString) == 0x000028, "Wrong size on HottaSyncUtil_UObjectPropertyToJsonString");
static_assert(offsetof(HottaSyncUtil_UObjectPropertyToJsonString, InObject) == 0x000000, "Member 'HottaSyncUtil_UObjectPropertyToJsonString::InObject' has a wrong offset!");
static_assert(offsetof(HottaSyncUtil_UObjectPropertyToJsonString, InPropertyName) == 0x000008, "Member 'HottaSyncUtil_UObjectPropertyToJsonString::InPropertyName' has a wrong offset!");
static_assert(offsetof(HottaSyncUtil_UObjectPropertyToJsonString, InSkipFlags) == 0x000010, "Member 'HottaSyncUtil_UObjectPropertyToJsonString::InSkipFlags' has a wrong offset!");
static_assert(offsetof(HottaSyncUtil_UObjectPropertyToJsonString, bInPrettyPrint) == 0x000014, "Member 'HottaSyncUtil_UObjectPropertyToJsonString::bInPrettyPrint' has a wrong offset!");
static_assert(offsetof(HottaSyncUtil_UObjectPropertyToJsonString, ReturnValue) == 0x000018, "Member 'HottaSyncUtil_UObjectPropertyToJsonString::ReturnValue' has a wrong offset!");

// Function HottaFramework.MDWrapperLibrary.MakeParameterTypeInfo
// 0x000C (0x000C - 0x0000)
struct MDWrapperLibrary_MakeParameterTypeInfo final
{
public:
	struct FParameterTypeInfo                     ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MDWrapperLibrary_MakeParameterTypeInfo) == 0x000001, "Wrong alignment on MDWrapperLibrary_MakeParameterTypeInfo");
static_assert(sizeof(MDWrapperLibrary_MakeParameterTypeInfo) == 0x00000C, "Wrong size on MDWrapperLibrary_MakeParameterTypeInfo");
static_assert(offsetof(MDWrapperLibrary_MakeParameterTypeInfo, ReturnValue) == 0x000000, "Member 'MDWrapperLibrary_MakeParameterTypeInfo::ReturnValue' has a wrong offset!");

// Function HottaFramework.MDWrapperLibrary.MakeParameterWrapper
// 0x0020 (0x0020 - 0x0000)
struct MDWrapperLibrary_MakeParameterWrapper final
{
public:
	struct FParameterWrapper                      ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MDWrapperLibrary_MakeParameterWrapper) == 0x000001, "Wrong alignment on MDWrapperLibrary_MakeParameterWrapper");
static_assert(sizeof(MDWrapperLibrary_MakeParameterWrapper) == 0x000020, "Wrong size on MDWrapperLibrary_MakeParameterWrapper");
static_assert(offsetof(MDWrapperLibrary_MakeParameterWrapper, ReturnValue) == 0x000000, "Member 'MDWrapperLibrary_MakeParameterWrapper::ReturnValue' has a wrong offset!");

// Function HottaFramework.MDWrapperLibrary.MakeParameterWrapperArray
// 0x0018 (0x0018 - 0x0000)
struct MDWrapperLibrary_MakeParameterWrapperArray final
{
public:
	struct FParameterWrapperArray                 ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MDWrapperLibrary_MakeParameterWrapperArray) == 0x000001, "Wrong alignment on MDWrapperLibrary_MakeParameterWrapperArray");
static_assert(sizeof(MDWrapperLibrary_MakeParameterWrapperArray) == 0x000018, "Wrong size on MDWrapperLibrary_MakeParameterWrapperArray");
static_assert(offsetof(MDWrapperLibrary_MakeParameterWrapperArray, ReturnValue) == 0x000000, "Member 'MDWrapperLibrary_MakeParameterWrapperArray::ReturnValue' has a wrong offset!");

}

