#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HottaFramework

#include "Basic.hpp"


namespace SDK
{

// Enum HottaFramework.EParameterType
// NumValues: 0x0028
enum class EParameterType : uint8
{
	None                                     = 0,
	Bool                                     = 1,
	AnsiChar                                 = 2,
	WideChar                                 = 3,
	Int8                                     = 4,
	Int16                                    = 5,
	Int32                                    = 6,
	Int64                                    = 7,
	UInt8                                    = 8,
	UInt16                                   = 9,
	UInt32                                   = 10,
	UInt64                                   = 11,
	Float                                    = 12,
	Double                                   = 13,
	String                                   = 14,
	Name                                     = 15,
	Text                                     = 16,
	Vector                                   = 17,
	Vector2D                                 = 18,
	Vector4                                  = 19,
	IntVector                                = 20,
	TwoVectors                               = 21,
	Rotator                                  = 22,
	Transform                                = 23,
	Matrix                                   = 24,
	DateTime                                 = 25,
	Timespan                                 = 26,
	IntPoint                                 = 27,
	IntRect                                  = 28,
	Guid                                     = 29,
	NetworkGUID                              = 30,
	Enum                                     = 31,
	Nullptr                                  = 32,
	AnsiString                               = 33,
	WideString                               = 34,
	Object                                   = 35,
	Array                                    = 36,
	ObjectArray                              = 37,
	Custom                                   = 38,
	EParameterType_MAX                       = 39,
};

// Enum HottaFramework.EGameModeType
// NumValues: 0x0008
enum class EGameModeType : uint8
{
	GAMEMODE_TYPE_NONE                       = 0,
	GAMEMODE_TYPE_LOGIN                      = 1,
	GAMEMODE_TYPE_CREATE                     = 2,
	GAMEMODE_TYPE_GAME                       = 3,
	GAMEMODE_TYPE_ROOM                       = 4,
	GAMEMODE_TYPE_CLONE                      = 5,
	GAMEMODE_TYPE_GUILD                      = 6,
	GAMEMODE_TYPE_MAX                        = 7,
};

// ScriptStruct HottaFramework.ParameterTypeInfo
// 0x000C (0x000C - 0x0000)
struct FParameterTypeInfo final
{
public:
	EParameterType                                Type;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CustomTypeName;                                    // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FParameterTypeInfo) == 0x000004, "Wrong alignment on FParameterTypeInfo");
static_assert(sizeof(FParameterTypeInfo) == 0x00000C, "Wrong size on FParameterTypeInfo");
static_assert(offsetof(FParameterTypeInfo, Type) == 0x000000, "Member 'FParameterTypeInfo::Type' has a wrong offset!");
static_assert(offsetof(FParameterTypeInfo, CustomTypeName) == 0x000004, "Member 'FParameterTypeInfo::CustomTypeName' has a wrong offset!");

// ScriptStruct HottaFramework.ParameterWrapper
// 0x0020 (0x0020 - 0x0000)
struct FParameterWrapper final
{
public:
	struct FParameterTypeInfo                     TypeInfo;                                          // 0x0000(0x000C)(Edit, BlueprintVisible, SaveGame, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 BinaryData;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
};
static_assert(alignof(FParameterWrapper) == 0x000008, "Wrong alignment on FParameterWrapper");
static_assert(sizeof(FParameterWrapper) == 0x000020, "Wrong size on FParameterWrapper");
static_assert(offsetof(FParameterWrapper, TypeInfo) == 0x000000, "Member 'FParameterWrapper::TypeInfo' has a wrong offset!");
static_assert(offsetof(FParameterWrapper, BinaryData) == 0x000010, "Member 'FParameterWrapper::BinaryData' has a wrong offset!");

// ScriptStruct HottaFramework.HottaReplicatedObjectPropertyIdentifier
// 0x0010 (0x0010 - 0x0000)
struct FHottaReplicatedObjectPropertyIdentifier final
{
public:
	class UObject*                                Owner;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHottaReplicatedObjectPropertyIdentifier) == 0x000008, "Wrong alignment on FHottaReplicatedObjectPropertyIdentifier");
static_assert(sizeof(FHottaReplicatedObjectPropertyIdentifier) == 0x000010, "Wrong size on FHottaReplicatedObjectPropertyIdentifier");
static_assert(offsetof(FHottaReplicatedObjectPropertyIdentifier, Owner) == 0x000000, "Member 'FHottaReplicatedObjectPropertyIdentifier::Owner' has a wrong offset!");
static_assert(offsetof(FHottaReplicatedObjectPropertyIdentifier, Name) == 0x000008, "Member 'FHottaReplicatedObjectPropertyIdentifier::Name' has a wrong offset!");

// ScriptStruct HottaFramework.HottaPropertyReplicator
// 0x0020 (0x0020 - 0x0000)
struct FHottaPropertyReplicator
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHottaReplicatedObjectPropertyIdentifier> Properties;                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
};
static_assert(alignof(FHottaPropertyReplicator) == 0x000008, "Wrong alignment on FHottaPropertyReplicator");
static_assert(sizeof(FHottaPropertyReplicator) == 0x000020, "Wrong size on FHottaPropertyReplicator");
static_assert(offsetof(FHottaPropertyReplicator, Properties) == 0x000010, "Member 'FHottaPropertyReplicator::Properties' has a wrong offset!");

// ScriptStruct HottaFramework.HottaReplicatedObjectProperty
// 0x0020 (0x0020 - 0x0000)
struct FHottaReplicatedObjectProperty final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 Datas;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bCompressed;                                       // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHottaReplicatedObjectProperty) == 0x000008, "Wrong alignment on FHottaReplicatedObjectProperty");
static_assert(sizeof(FHottaReplicatedObjectProperty) == 0x000020, "Wrong size on FHottaReplicatedObjectProperty");
static_assert(offsetof(FHottaReplicatedObjectProperty, Name) == 0x000000, "Member 'FHottaReplicatedObjectProperty::Name' has a wrong offset!");
static_assert(offsetof(FHottaReplicatedObjectProperty, Datas) == 0x000008, "Member 'FHottaReplicatedObjectProperty::Datas' has a wrong offset!");
static_assert(offsetof(FHottaReplicatedObjectProperty, bCompressed) == 0x000018, "Member 'FHottaReplicatedObjectProperty::bCompressed' has a wrong offset!");

// ScriptStruct HottaFramework.HottaReplicatedObjectPropertyContainer
// 0x0020 (0x0020 - 0x0000)
struct FHottaReplicatedObjectPropertyContainer
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHottaReplicatedObjectProperty> Properties;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UObject*                                Owner;                                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
static_assert(alignof(FHottaReplicatedObjectPropertyContainer) == 0x000008, "Wrong alignment on FHottaReplicatedObjectPropertyContainer");
static_assert(sizeof(FHottaReplicatedObjectPropertyContainer) == 0x000020, "Wrong size on FHottaReplicatedObjectPropertyContainer");
static_assert(offsetof(FHottaReplicatedObjectPropertyContainer, Properties) == 0x000008, "Member 'FHottaReplicatedObjectPropertyContainer::Properties' has a wrong offset!");
static_assert(offsetof(FHottaReplicatedObjectPropertyContainer, Owner) == 0x000018, "Member 'FHottaReplicatedObjectPropertyContainer::Owner' has a wrong offset!");

// ScriptStruct HottaFramework.ParameterWrapperArray
// 0x0018 (0x0018 - 0x0000)
struct FParameterWrapperArray
{
public:
	TArray<struct FParameterWrapper>              ParameterWrappers;                                 // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	int32                                         ReadParameterIndex;                                // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FParameterWrapperArray) == 0x000008, "Wrong alignment on FParameterWrapperArray");
static_assert(sizeof(FParameterWrapperArray) == 0x000018, "Wrong size on FParameterWrapperArray");
static_assert(offsetof(FParameterWrapperArray, ParameterWrappers) == 0x000000, "Member 'FParameterWrapperArray::ParameterWrappers' has a wrong offset!");
static_assert(offsetof(FParameterWrapperArray, ReadParameterIndex) == 0x000010, "Member 'FParameterWrapperArray::ReadParameterIndex' has a wrong offset!");

// ScriptStruct HottaFramework.HottaRpcMessage
// 0x0008 (0x0020 - 0x0018)
struct FHottaRpcMessage final : public FParameterWrapperArray
{
public:
	int32                                         Type;                                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHottaRpcMessage) == 0x000008, "Wrong alignment on FHottaRpcMessage");
static_assert(sizeof(FHottaRpcMessage) == 0x000020, "Wrong size on FHottaRpcMessage");
static_assert(offsetof(FHottaRpcMessage, Type) == 0x000018, "Member 'FHottaRpcMessage::Type' has a wrong offset!");

// ScriptStruct HottaFramework.GameplayMessageSimpleMessage
// 0x0020 (0x0020 - 0x0000)
struct FGameplayMessageSimpleMessage final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGameplayMessageSimpleMessage) == 0x000001, "Wrong alignment on FGameplayMessageSimpleMessage");
static_assert(sizeof(FGameplayMessageSimpleMessage) == 0x000020, "Wrong size on FGameplayMessageSimpleMessage");

// ScriptStruct HottaFramework.GameplayMessageListenerData
// 0x0040 (0x0040 - 0x0000)
struct FGameplayMessageListenerData final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGameplayMessageListenerData) == 0x000001, "Wrong alignment on FGameplayMessageListenerData");
static_assert(sizeof(FGameplayMessageListenerData) == 0x000040, "Wrong size on FGameplayMessageListenerData");

// ScriptStruct HottaFramework.GameplayMessageListenerHandle
// 0x0020 (0x0020 - 0x0000)
struct FGameplayMessageListenerHandle final
{
public:
	TWeakObjectPtr<class USubsystem>              Subsystem;                                         // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Channel;                                           // 0x0008(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ID;                                                // 0x0010(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGameplayMessageListenerHandle) == 0x000004, "Wrong alignment on FGameplayMessageListenerHandle");
static_assert(sizeof(FGameplayMessageListenerHandle) == 0x000020, "Wrong size on FGameplayMessageListenerHandle");
static_assert(offsetof(FGameplayMessageListenerHandle, Subsystem) == 0x000000, "Member 'FGameplayMessageListenerHandle::Subsystem' has a wrong offset!");
static_assert(offsetof(FGameplayMessageListenerHandle, Channel) == 0x000008, "Member 'FGameplayMessageListenerHandle::Channel' has a wrong offset!");
static_assert(offsetof(FGameplayMessageListenerHandle, ID) == 0x000010, "Member 'FGameplayMessageListenerHandle::ID' has a wrong offset!");

}

