#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HTAnimSharing

#include "Basic.hpp"

#include "HTAnimSharing_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class HTAnimSharing.HTAnimationSharingData
// 0x0010 (0x0040 - 0x0030)
class UHTAnimationSharingData final : public UDataAsset
{
public:
	TArray<struct FHTAnimationSharingSkeletonSetup> AnimationSharingSkeletonSetups;                  // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTAnimationSharingData">();
	}
	static class UHTAnimationSharingData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTAnimationSharingData>();
	}
};
static_assert(alignof(UHTAnimationSharingData) == 0x000008, "Wrong alignment on UHTAnimationSharingData");
static_assert(sizeof(UHTAnimationSharingData) == 0x000040, "Wrong size on UHTAnimationSharingData");
static_assert(offsetof(UHTAnimationSharingData, AnimationSharingSkeletonSetups) == 0x000030, "Member 'UHTAnimationSharingData::AnimationSharingSkeletonSetups' has a wrong offset!");

// Class HTAnimSharing.HTAnimationSharingManager
// 0x00A0 (0x00C8 - 0x0028)
class UHTAnimationSharingManager : public UObject
{
public:
	class UHTAnimationSharingSettings*            HTAnimationSharingSettings;                        // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHTAnimationSharingData*                HTAnimationSharingData;                            // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class USkeleton*, class UHTAnimSharingInstance*> AnimSharingInstanceMap;                    // 0x0038(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	class AHTSharingActor*                        SharingActor;                                      // 0x0088(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x38];                                      // 0x0090(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class USkeletalMeshComponent* GetAdditiveAnimMeshComponent(class AActor* PlayActor);
	static float HTAdditivePlayAnimMontage(class AActor* PlayActor, class UAnimMontage* AnimMontage, float InPlayRate, class FName StartSectionName);
	static class UHTAnimSharingAdditiveInstance* HTGetActorAdditiveAnimInstance(class AActor* PlayActor);
	static class UHTAnimationSharingManager* HTGetAnimationSharingManager(class AActor* InActor);
	static class UAnimMontage* HTHasAdditivePlayAnimMontageByGroup(class AActor* PlayActor, class FName InGroupName);
	static float HTSharingPlayAnimMontage(class AActor* PlayActor, class UAnimMontage* AnimMontage, float InPlayRate, class FName StartSectionName);

	float AdditivePlayAnimMontage(class AActor* PlayActor, class UAnimMontage* AnimMontage, float InPlayRate, class FName StartSectionName);
	void RegisterActor(class AActor* InActor);
	float SharingPlayAnimMontage(class AActor* PlayActor, class UAnimMontage* AnimMontage, float InPlayRate, class FName StartSectionName);
	void UnRegisterActor(class AActor* InActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTAnimationSharingManager">();
	}
	static class UHTAnimationSharingManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTAnimationSharingManager>();
	}
};
static_assert(alignof(UHTAnimationSharingManager) == 0x000008, "Wrong alignment on UHTAnimationSharingManager");
static_assert(sizeof(UHTAnimationSharingManager) == 0x0000C8, "Wrong size on UHTAnimationSharingManager");
static_assert(offsetof(UHTAnimationSharingManager, HTAnimationSharingSettings) == 0x000028, "Member 'UHTAnimationSharingManager::HTAnimationSharingSettings' has a wrong offset!");
static_assert(offsetof(UHTAnimationSharingManager, HTAnimationSharingData) == 0x000030, "Member 'UHTAnimationSharingManager::HTAnimationSharingData' has a wrong offset!");
static_assert(offsetof(UHTAnimationSharingManager, AnimSharingInstanceMap) == 0x000038, "Member 'UHTAnimationSharingManager::AnimSharingInstanceMap' has a wrong offset!");
static_assert(offsetof(UHTAnimationSharingManager, SharingActor) == 0x000088, "Member 'UHTAnimationSharingManager::SharingActor' has a wrong offset!");

// Class HTAnimSharing.HTAnimationSharingSettings
// 0x0040 (0x0078 - 0x0038)
class UHTAnimationSharingSettings final : public UDeveloperSettings
{
public:
	TSubclassOf<class UHTAnimationSharingManager> HTAnimationSharingManagerClass;                    // 0x0038(0x0008)(Edit, ZeroConstructor, Config, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UHTAnimationSharingData> HTAnimationSharingDataSP;                          // 0x0040(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UHTAnimSharingInstance>     HTAnimSharingInstanceClass;                        // 0x0068(0x0008)(Edit, ZeroConstructor, Config, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AHTSharingActor>            HTSharingActorClass;                               // 0x0070(0x0008)(Edit, ZeroConstructor, Config, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTAnimationSharingSettings">();
	}
	static class UHTAnimationSharingSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTAnimationSharingSettings>();
	}
};
static_assert(alignof(UHTAnimationSharingSettings) == 0x000008, "Wrong alignment on UHTAnimationSharingSettings");
static_assert(sizeof(UHTAnimationSharingSettings) == 0x000078, "Wrong size on UHTAnimationSharingSettings");
static_assert(offsetof(UHTAnimationSharingSettings, HTAnimationSharingManagerClass) == 0x000038, "Member 'UHTAnimationSharingSettings::HTAnimationSharingManagerClass' has a wrong offset!");
static_assert(offsetof(UHTAnimationSharingSettings, HTAnimationSharingDataSP) == 0x000040, "Member 'UHTAnimationSharingSettings::HTAnimationSharingDataSP' has a wrong offset!");
static_assert(offsetof(UHTAnimationSharingSettings, HTAnimSharingInstanceClass) == 0x000068, "Member 'UHTAnimationSharingSettings::HTAnimSharingInstanceClass' has a wrong offset!");
static_assert(offsetof(UHTAnimationSharingSettings, HTSharingActorClass) == 0x000070, "Member 'UHTAnimationSharingSettings::HTSharingActorClass' has a wrong offset!");

// Class HTAnimSharing.HTAnimationSharingStateProcessor
// 0x0000 (0x0028 - 0x0028)
class UHTAnimationSharingStateProcessor : public UObject
{
public:
	void ProcessActorState(int32* OutState, class AActor* InActor, int32 CurrentState, int32 OnDemandState, bool* bShouldProcess);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTAnimationSharingStateProcessor">();
	}
	static class UHTAnimationSharingStateProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTAnimationSharingStateProcessor>();
	}
};
static_assert(alignof(UHTAnimationSharingStateProcessor) == 0x000008, "Wrong alignment on UHTAnimationSharingStateProcessor");
static_assert(sizeof(UHTAnimationSharingStateProcessor) == 0x000028, "Wrong size on UHTAnimationSharingStateProcessor");

// Class HTAnimSharing.HTAnimationSharingSubsystem
// 0x0018 (0x0048 - 0x0030)
class UHTAnimationSharingSubsystem : public UWorldSubsystem
{
public:
	class UHTAnimationSharingManager*             HTAnimationSharingManager;                         // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHTAnimationSharingSettings*            HTAnimationSharingSettings;                        // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHTAnimationSharingData*                HTAnimationSharingData;                            // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static float PlayAnimMontage(class UAnimInstance* AnimInstance, class UAnimMontage* AnimMontage, float InPlayRate, class FName StartSectionName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTAnimationSharingSubsystem">();
	}
	static class UHTAnimationSharingSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTAnimationSharingSubsystem>();
	}
};
static_assert(alignof(UHTAnimationSharingSubsystem) == 0x000008, "Wrong alignment on UHTAnimationSharingSubsystem");
static_assert(sizeof(UHTAnimationSharingSubsystem) == 0x000048, "Wrong size on UHTAnimationSharingSubsystem");
static_assert(offsetof(UHTAnimationSharingSubsystem, HTAnimationSharingManager) == 0x000030, "Member 'UHTAnimationSharingSubsystem::HTAnimationSharingManager' has a wrong offset!");
static_assert(offsetof(UHTAnimationSharingSubsystem, HTAnimationSharingSettings) == 0x000038, "Member 'UHTAnimationSharingSubsystem::HTAnimationSharingSettings' has a wrong offset!");
static_assert(offsetof(UHTAnimationSharingSubsystem, HTAnimationSharingData) == 0x000040, "Member 'UHTAnimationSharingSubsystem::HTAnimationSharingData' has a wrong offset!");

// Class HTAnimSharing.HTAnimSharingAdditiveInstance
// 0x0030 (0x0418 - 0x03E8)
#pragma pack(push, 0x1)
class alignas(0x08) UHTAnimSharingAdditiveInstance : public UAnimInstance
{
public:
	TWeakObjectPtr<class USkeletalMeshComponent>  BaseComponent;                                     // 0x03E8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHTAnimSharingInstance*                 AnimSharingInstance;                               // 0x03F0(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InActor;                                           // 0x03F8(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 OwnerComponent;                                    // 0x0400(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInit;                                           // 0x0408(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCanLeader;                                      // 0x0409(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40A[0x2];                                      // 0x040A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RemainingTime;                                     // 0x040C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurRemainingTime;                                  // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDestroy;                                        // 0x0414(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_415[0x3];                                      // 0x0415(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTAnimSharingAdditiveInstance">();
	}
	static class UHTAnimSharingAdditiveInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTAnimSharingAdditiveInstance>();
	}
};
#pragma pack(pop)
static_assert(alignof(UHTAnimSharingAdditiveInstance) == 0x000008, "Wrong alignment on UHTAnimSharingAdditiveInstance");
static_assert(sizeof(UHTAnimSharingAdditiveInstance) == 0x000418, "Wrong size on UHTAnimSharingAdditiveInstance");
static_assert(offsetof(UHTAnimSharingAdditiveInstance, BaseComponent) == 0x0003E8, "Member 'UHTAnimSharingAdditiveInstance::BaseComponent' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingAdditiveInstance, AnimSharingInstance) == 0x0003F0, "Member 'UHTAnimSharingAdditiveInstance::AnimSharingInstance' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingAdditiveInstance, InActor) == 0x0003F8, "Member 'UHTAnimSharingAdditiveInstance::InActor' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingAdditiveInstance, OwnerComponent) == 0x000400, "Member 'UHTAnimSharingAdditiveInstance::OwnerComponent' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingAdditiveInstance, bIsInit) == 0x000408, "Member 'UHTAnimSharingAdditiveInstance::bIsInit' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingAdditiveInstance, bIsCanLeader) == 0x000409, "Member 'UHTAnimSharingAdditiveInstance::bIsCanLeader' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingAdditiveInstance, RemainingTime) == 0x00040C, "Member 'UHTAnimSharingAdditiveInstance::RemainingTime' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingAdditiveInstance, CurRemainingTime) == 0x000410, "Member 'UHTAnimSharingAdditiveInstance::CurRemainingTime' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingAdditiveInstance, bIsDestroy) == 0x000414, "Member 'UHTAnimSharingAdditiveInstance::bIsDestroy' has a wrong offset!");

// Class HTAnimSharing.HTAnimSharingInstance
// 0x0138 (0x0160 - 0x0028)
class UHTAnimSharingInstance final : public UObject
{
public:
	struct FHTAnimationSharingSkeletonSetup       AnimationSharingSkeletonSetup;                     // 0x0028(0x0038)(BlueprintVisible, NativeAccessSpecifierPublic)
	class UHTAnimationSharingManager*             AnimationSharingManager;                           // 0x0060(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<uint32, struct FHTAnimationSharingSetup> AnimationSharingSetupMap;                          // 0x0068(0x0050)(NativeAccessSpecifierPublic)
	TMap<uint32, struct FHTAnimationSharingInstanceData> AnimationSharingInstanceDataMap;            // 0x00B8(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPublic)
	TMap<class AActor*, struct FHTAnimationSharingStateInfor> RegisterActorMap;                      // 0x0108(0x0050)(BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UHTAnimationSharingStateProcessor*      AnimationSharingStateProcessor;                    // 0x0158(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTAnimSharingInstance">();
	}
	static class UHTAnimSharingInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTAnimSharingInstance>();
	}
};
static_assert(alignof(UHTAnimSharingInstance) == 0x000008, "Wrong alignment on UHTAnimSharingInstance");
static_assert(sizeof(UHTAnimSharingInstance) == 0x000160, "Wrong size on UHTAnimSharingInstance");
static_assert(offsetof(UHTAnimSharingInstance, AnimationSharingSkeletonSetup) == 0x000028, "Member 'UHTAnimSharingInstance::AnimationSharingSkeletonSetup' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingInstance, AnimationSharingManager) == 0x000060, "Member 'UHTAnimSharingInstance::AnimationSharingManager' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingInstance, AnimationSharingSetupMap) == 0x000068, "Member 'UHTAnimSharingInstance::AnimationSharingSetupMap' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingInstance, AnimationSharingInstanceDataMap) == 0x0000B8, "Member 'UHTAnimSharingInstance::AnimationSharingInstanceDataMap' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingInstance, RegisterActorMap) == 0x000108, "Member 'UHTAnimSharingInstance::RegisterActorMap' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingInstance, AnimationSharingStateProcessor) == 0x000158, "Member 'UHTAnimSharingInstance::AnimationSharingStateProcessor' has a wrong offset!");

// Class HTAnimSharing.HTAnimSharingInterface
// 0x0000 (0x0000 - 0x0000)
class IHTAnimSharingInterface final
{
public:
	void OnSetActorLeaderComp(class USkeletalMeshComponent* TargetComp);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTAnimSharingInterface">();
	}
	static class IHTAnimSharingInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IHTAnimSharingInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IHTAnimSharingInterface) == 0x000001, "Wrong alignment on IHTAnimSharingInterface");
static_assert(sizeof(IHTAnimSharingInterface) == 0x000001, "Wrong size on IHTAnimSharingInterface");

// Class HTAnimSharing.HTAnimSharingStateInstance
// 0x0028 (0x0410 - 0x03E8)
class UHTAnimSharingStateInstance : public UAnimInstance
{
public:
	class UAnimSequence*                          AnimationToPlay;                                   // 0x03E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PermutationTimeOffset;                             // 0x03F0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayRate;                                          // 0x03F4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStateBool;                                        // 0x03F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTAnimSharingInstance*                 Instance;                                          // 0x0400(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_408[0x8];                                      // 0x0408(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetInstancedActors(TArray<class AActor*>* Actors);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTAnimSharingStateInstance">();
	}
	static class UHTAnimSharingStateInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTAnimSharingStateInstance>();
	}
};
static_assert(alignof(UHTAnimSharingStateInstance) == 0x000008, "Wrong alignment on UHTAnimSharingStateInstance");
static_assert(sizeof(UHTAnimSharingStateInstance) == 0x000410, "Wrong size on UHTAnimSharingStateInstance");
static_assert(offsetof(UHTAnimSharingStateInstance, AnimationToPlay) == 0x0003E8, "Member 'UHTAnimSharingStateInstance::AnimationToPlay' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingStateInstance, PermutationTimeOffset) == 0x0003F0, "Member 'UHTAnimSharingStateInstance::PermutationTimeOffset' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingStateInstance, PlayRate) == 0x0003F4, "Member 'UHTAnimSharingStateInstance::PlayRate' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingStateInstance, bStateBool) == 0x0003F8, "Member 'UHTAnimSharingStateInstance::bStateBool' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingStateInstance, Instance) == 0x000400, "Member 'UHTAnimSharingStateInstance::Instance' has a wrong offset!");

// Class HTAnimSharing.HTAnimSharingTransitionInstance
// 0x0048 (0x0430 - 0x03E8)
class UHTAnimSharingTransitionInstance : public UAnimInstance
{
public:
	TWeakObjectPtr<class USkeletalMeshComponent>  FromComponent;                                     // 0x03E8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class USkeletalMeshComponent>  ToComponent;                                       // 0x03F0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendTime;                                         // 0x03F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RemainingTime;                                     // 0x03FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransitionTime;                                    // 0x0400(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlendBool;                                        // 0x0404(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_405[0x3];                                      // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTAnimSharingInstance*                 AnimSharingInstance;                               // 0x0408(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 InActor;                                           // 0x0410(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInit;                                           // 0x0418(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTransition;                                     // 0x0419(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41A[0x6];                                      // 0x041A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 OwnerComponent;                                    // 0x0420(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_428[0x8];                                      // 0x0428(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTAnimSharingTransitionInstance">();
	}
	static class UHTAnimSharingTransitionInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTAnimSharingTransitionInstance>();
	}
};
static_assert(alignof(UHTAnimSharingTransitionInstance) == 0x000008, "Wrong alignment on UHTAnimSharingTransitionInstance");
static_assert(sizeof(UHTAnimSharingTransitionInstance) == 0x000430, "Wrong size on UHTAnimSharingTransitionInstance");
static_assert(offsetof(UHTAnimSharingTransitionInstance, FromComponent) == 0x0003E8, "Member 'UHTAnimSharingTransitionInstance::FromComponent' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingTransitionInstance, ToComponent) == 0x0003F0, "Member 'UHTAnimSharingTransitionInstance::ToComponent' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingTransitionInstance, BlendTime) == 0x0003F8, "Member 'UHTAnimSharingTransitionInstance::BlendTime' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingTransitionInstance, RemainingTime) == 0x0003FC, "Member 'UHTAnimSharingTransitionInstance::RemainingTime' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingTransitionInstance, TransitionTime) == 0x000400, "Member 'UHTAnimSharingTransitionInstance::TransitionTime' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingTransitionInstance, bBlendBool) == 0x000404, "Member 'UHTAnimSharingTransitionInstance::bBlendBool' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingTransitionInstance, AnimSharingInstance) == 0x000408, "Member 'UHTAnimSharingTransitionInstance::AnimSharingInstance' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingTransitionInstance, InActor) == 0x000410, "Member 'UHTAnimSharingTransitionInstance::InActor' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingTransitionInstance, bIsInit) == 0x000418, "Member 'UHTAnimSharingTransitionInstance::bIsInit' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingTransitionInstance, bIsTransition) == 0x000419, "Member 'UHTAnimSharingTransitionInstance::bIsTransition' has a wrong offset!");
static_assert(offsetof(UHTAnimSharingTransitionInstance, OwnerComponent) == 0x000420, "Member 'UHTAnimSharingTransitionInstance::OwnerComponent' has a wrong offset!");

// Class HTAnimSharing.HTSharingActor
// 0x0008 (0x02D0 - 0x02C8)
class AHTSharingActor : public AActor
{
public:
	class UCapsuleComponent*                      CapsuleComponent;                                  // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTSharingActor">();
	}
	static class AHTSharingActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHTSharingActor>();
	}
};
static_assert(alignof(AHTSharingActor) == 0x000008, "Wrong alignment on AHTSharingActor");
static_assert(sizeof(AHTSharingActor) == 0x0002D0, "Wrong size on AHTSharingActor");
static_assert(offsetof(AHTSharingActor, CapsuleComponent) == 0x0002C8, "Member 'AHTSharingActor::CapsuleComponent' has a wrong offset!");

}

