#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HTAnimSharing

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct HTAnimSharing.HTAnimationSharingInstanceData
// 0x0050 (0x0050 - 0x0000)
struct FHTAnimationSharingInstanceData final
{
public:
	TMap<class USkeletalMeshComponent*, uint32>   CompMap;                                           // 0x0000(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHTAnimationSharingInstanceData) == 0x000008, "Wrong alignment on FHTAnimationSharingInstanceData");
static_assert(sizeof(FHTAnimationSharingInstanceData) == 0x000050, "Wrong size on FHTAnimationSharingInstanceData");
static_assert(offsetof(FHTAnimationSharingInstanceData, CompMap) == 0x000000, "Member 'FHTAnimationSharingInstanceData::CompMap' has a wrong offset!");

// ScriptStruct HTAnimSharing.HTAnimationSharingStateInfor
// 0x0030 (0x0030 - 0x0000)
struct FHTAnimationSharingStateInfor final
{
public:
	uint32                                        PreState;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        CurState;                                          // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInit;                                           // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 PreSkeletalMeshComponent;                          // 0x0010(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 CurSkeletalMeshComponent;                          // 0x0018(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 TransitionSkeletalMeshComponent;                   // 0x0020(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 AdditiveSkeletalMeshComponent;                     // 0x0028(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHTAnimationSharingStateInfor) == 0x000008, "Wrong alignment on FHTAnimationSharingStateInfor");
static_assert(sizeof(FHTAnimationSharingStateInfor) == 0x000030, "Wrong size on FHTAnimationSharingStateInfor");
static_assert(offsetof(FHTAnimationSharingStateInfor, PreState) == 0x000000, "Member 'FHTAnimationSharingStateInfor::PreState' has a wrong offset!");
static_assert(offsetof(FHTAnimationSharingStateInfor, CurState) == 0x000004, "Member 'FHTAnimationSharingStateInfor::CurState' has a wrong offset!");
static_assert(offsetof(FHTAnimationSharingStateInfor, bIsInit) == 0x000008, "Member 'FHTAnimationSharingStateInfor::bIsInit' has a wrong offset!");
static_assert(offsetof(FHTAnimationSharingStateInfor, PreSkeletalMeshComponent) == 0x000010, "Member 'FHTAnimationSharingStateInfor::PreSkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(FHTAnimationSharingStateInfor, CurSkeletalMeshComponent) == 0x000018, "Member 'FHTAnimationSharingStateInfor::CurSkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(FHTAnimationSharingStateInfor, TransitionSkeletalMeshComponent) == 0x000020, "Member 'FHTAnimationSharingStateInfor::TransitionSkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(FHTAnimationSharingStateInfor, AdditiveSkeletalMeshComponent) == 0x000028, "Member 'FHTAnimationSharingStateInfor::AdditiveSkeletalMeshComponent' has a wrong offset!");

// ScriptStruct HTAnimSharing.HTAnimationSharingStateEnum
// 0x0018 (0x0018 - 0x0000)
struct FHTAnimationSharingStateEnum final
{
public:
	uint32                                        State;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Describe;                                          // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHTAnimationSharingStateEnum) == 0x000008, "Wrong alignment on FHTAnimationSharingStateEnum");
static_assert(sizeof(FHTAnimationSharingStateEnum) == 0x000018, "Wrong size on FHTAnimationSharingStateEnum");
static_assert(offsetof(FHTAnimationSharingStateEnum, State) == 0x000000, "Member 'FHTAnimationSharingStateEnum::State' has a wrong offset!");
static_assert(offsetof(FHTAnimationSharingStateEnum, Describe) == 0x000008, "Member 'FHTAnimationSharingStateEnum::Describe' has a wrong offset!");

// ScriptStruct HTAnimSharing.HTAnimationSharingSetup
// 0x0020 (0x0020 - 0x0000)
struct FHTAnimationSharingSetup final
{
public:
	class UAnimSequence*                          AnimSequence;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UHTAnimSharingStateInstance> AnimInstanceClass;                                // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendTime;                                         // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPerPlatformInt                        NumRandomizedInstances;                            // 0x0014(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerPlatformBool                       Enabled;                                           // 0x0018(0x0001)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHTAnimationSharingSetup) == 0x000008, "Wrong alignment on FHTAnimationSharingSetup");
static_assert(sizeof(FHTAnimationSharingSetup) == 0x000020, "Wrong size on FHTAnimationSharingSetup");
static_assert(offsetof(FHTAnimationSharingSetup, AnimSequence) == 0x000000, "Member 'FHTAnimationSharingSetup::AnimSequence' has a wrong offset!");
static_assert(offsetof(FHTAnimationSharingSetup, AnimInstanceClass) == 0x000008, "Member 'FHTAnimationSharingSetup::AnimInstanceClass' has a wrong offset!");
static_assert(offsetof(FHTAnimationSharingSetup, BlendTime) == 0x000010, "Member 'FHTAnimationSharingSetup::BlendTime' has a wrong offset!");
static_assert(offsetof(FHTAnimationSharingSetup, NumRandomizedInstances) == 0x000014, "Member 'FHTAnimationSharingSetup::NumRandomizedInstances' has a wrong offset!");
static_assert(offsetof(FHTAnimationSharingSetup, Enabled) == 0x000018, "Member 'FHTAnimationSharingSetup::Enabled' has a wrong offset!");

// ScriptStruct HTAnimSharing.HTAnimationSharingState
// 0x0038 (0x0038 - 0x0000)
struct FHTAnimationSharingState final
{
public:
	struct FHTAnimationSharingStateEnum           StateEnum;                                         // 0x0000(0x0018)(Edit, NativeAccessSpecifierPublic)
	struct FHTAnimationSharingSetup               AnimationSharingSkeletonSetup;                     // 0x0018(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHTAnimationSharingState) == 0x000001, "Wrong alignment on FHTAnimationSharingState");
static_assert(sizeof(FHTAnimationSharingState) == 0x000038, "Wrong size on FHTAnimationSharingState");
static_assert(offsetof(FHTAnimationSharingState, StateEnum) == 0x000000, "Member 'FHTAnimationSharingState::StateEnum' has a wrong offset!");
static_assert(offsetof(FHTAnimationSharingState, AnimationSharingSkeletonSetup) == 0x000018, "Member 'FHTAnimationSharingState::AnimationSharingSkeletonSetup' has a wrong offset!");

// ScriptStruct HTAnimSharing.HTAnimationSharingSkeletonSetup
// 0x0038 (0x0038 - 0x0000)
struct FHTAnimationSharingSkeletonSetup final
{
public:
	class USkeleton*                              Skeleton;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UHTAnimSharingTransitionInstance> AnimSharingTransitionInstance;               // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UHTAnimSharingAdditiveInstance> AnimSharingAdditiveInstance;                   // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UHTAnimationSharingStateProcessor> AnimationSharingStateProcessor;             // 0x0020(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FHTAnimationSharingState>       HTAnimationSharingStates;                          // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHTAnimationSharingSkeletonSetup) == 0x000008, "Wrong alignment on FHTAnimationSharingSkeletonSetup");
static_assert(sizeof(FHTAnimationSharingSkeletonSetup) == 0x000038, "Wrong size on FHTAnimationSharingSkeletonSetup");
static_assert(offsetof(FHTAnimationSharingSkeletonSetup, Skeleton) == 0x000000, "Member 'FHTAnimationSharingSkeletonSetup::Skeleton' has a wrong offset!");
static_assert(offsetof(FHTAnimationSharingSkeletonSetup, SkeletalMesh) == 0x000008, "Member 'FHTAnimationSharingSkeletonSetup::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(FHTAnimationSharingSkeletonSetup, AnimSharingTransitionInstance) == 0x000010, "Member 'FHTAnimationSharingSkeletonSetup::AnimSharingTransitionInstance' has a wrong offset!");
static_assert(offsetof(FHTAnimationSharingSkeletonSetup, AnimSharingAdditiveInstance) == 0x000018, "Member 'FHTAnimationSharingSkeletonSetup::AnimSharingAdditiveInstance' has a wrong offset!");
static_assert(offsetof(FHTAnimationSharingSkeletonSetup, AnimationSharingStateProcessor) == 0x000020, "Member 'FHTAnimationSharingSkeletonSetup::AnimationSharingStateProcessor' has a wrong offset!");
static_assert(offsetof(FHTAnimationSharingSkeletonSetup, HTAnimationSharingStates) == 0x000028, "Member 'FHTAnimationSharingSkeletonSetup::HTAnimationSharingStates' has a wrong offset!");

// ScriptStruct HTAnimSharing.TickHTAnimationSharingFunction
// 0x0008 (0x0038 - 0x0030)
struct FTickHTAnimationSharingFunction final : public FTickFunction
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTickHTAnimationSharingFunction) == 0x000004, "Wrong alignment on FTickHTAnimationSharingFunction");
static_assert(sizeof(FTickHTAnimationSharingFunction) == 0x000038, "Wrong size on FTickHTAnimationSharingFunction");

}

