#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HTWorldPartition

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class HTWorldPartition.HTEditorActor
// 0x0000 (0x02C8 - 0x02C8)
class AHTEditorActor : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTEditorActor">();
	}
	static class AHTEditorActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHTEditorActor>();
	}
};
static_assert(alignof(AHTEditorActor) == 0x000008, "Wrong alignment on AHTEditorActor");
static_assert(sizeof(AHTEditorActor) == 0x0002C8, "Wrong size on AHTEditorActor");

// Class HTWorldPartition.HTEditorGroupActor
// 0x0000 (0x02C8 - 0x02C8)
class AHTEditorGroupActor final : public AHTEditorActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTEditorGroupActor">();
	}
	static class AHTEditorGroupActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHTEditorGroupActor>();
	}
};
static_assert(alignof(AHTEditorGroupActor) == 0x000008, "Wrong alignment on AHTEditorGroupActor");
static_assert(sizeof(AHTEditorGroupActor) == 0x0002C8, "Wrong size on AHTEditorGroupActor");

// Class HTWorldPartition.HTPartitionActor
// 0x0008 (0x02D0 - 0x02C8)
class AHTPartitionActor : public APartitionActor
{
public:
	float                                         GenerateGridSize;                                  // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTPartitionActor">();
	}
	static class AHTPartitionActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHTPartitionActor>();
	}
};
static_assert(alignof(AHTPartitionActor) == 0x000008, "Wrong alignment on AHTPartitionActor");
static_assert(sizeof(AHTPartitionActor) == 0x0002D0, "Wrong size on AHTPartitionActor");
static_assert(offsetof(AHTPartitionActor, GenerateGridSize) == 0x0002C8, "Member 'AHTPartitionActor::GenerateGridSize' has a wrong offset!");

// Class HTWorldPartition.HTTransformerISMEditorUtilityObject
// 0x0090 (0x00B8 - 0x0028)
class UHTTransformerISMEditorUtilityObject final : public UObject
{
public:
	TArray<TSoftClassPtr<class UClass>>           SMComponentClassesToIgnore;                        // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   HTBreakableISMComponentClass;                      // 0x0038(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   HTBreakableSMComponentClass;                       // 0x0060(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           NotCovertTags;                                     // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           NotInstanceActorTags;                              // 0x0098(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           NotInstanceComponentTags;                          // 0x00A8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	TArray<class UStaticMesh*> GetBreakableMeshs() const;
	void PostBuildAllHISM() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTTransformerISMEditorUtilityObject">();
	}
	static class UHTTransformerISMEditorUtilityObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTTransformerISMEditorUtilityObject>();
	}
};
static_assert(alignof(UHTTransformerISMEditorUtilityObject) == 0x000008, "Wrong alignment on UHTTransformerISMEditorUtilityObject");
static_assert(sizeof(UHTTransformerISMEditorUtilityObject) == 0x0000B8, "Wrong size on UHTTransformerISMEditorUtilityObject");
static_assert(offsetof(UHTTransformerISMEditorUtilityObject, SMComponentClassesToIgnore) == 0x000028, "Member 'UHTTransformerISMEditorUtilityObject::SMComponentClassesToIgnore' has a wrong offset!");
static_assert(offsetof(UHTTransformerISMEditorUtilityObject, HTBreakableISMComponentClass) == 0x000038, "Member 'UHTTransformerISMEditorUtilityObject::HTBreakableISMComponentClass' has a wrong offset!");
static_assert(offsetof(UHTTransformerISMEditorUtilityObject, HTBreakableSMComponentClass) == 0x000060, "Member 'UHTTransformerISMEditorUtilityObject::HTBreakableSMComponentClass' has a wrong offset!");
static_assert(offsetof(UHTTransformerISMEditorUtilityObject, NotCovertTags) == 0x000088, "Member 'UHTTransformerISMEditorUtilityObject::NotCovertTags' has a wrong offset!");
static_assert(offsetof(UHTTransformerISMEditorUtilityObject, NotInstanceActorTags) == 0x000098, "Member 'UHTTransformerISMEditorUtilityObject::NotInstanceActorTags' has a wrong offset!");
static_assert(offsetof(UHTTransformerISMEditorUtilityObject, NotInstanceComponentTags) == 0x0000A8, "Member 'UHTTransformerISMEditorUtilityObject::NotInstanceComponentTags' has a wrong offset!");

// Class HTWorldPartition.HTTransformerISMEditorUtilitySetting
// 0x0028 (0x0050 - 0x0028)
class UHTTransformerISMEditorUtilitySetting final : public UObject
{
public:
	TSoftClassPtr<class UClass>                   HTTransformerISMEditorUtility;                     // 0x0028(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTTransformerISMEditorUtilitySetting">();
	}
	static class UHTTransformerISMEditorUtilitySetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTTransformerISMEditorUtilitySetting>();
	}
};
static_assert(alignof(UHTTransformerISMEditorUtilitySetting) == 0x000008, "Wrong alignment on UHTTransformerISMEditorUtilitySetting");
static_assert(sizeof(UHTTransformerISMEditorUtilitySetting) == 0x000050, "Wrong size on UHTTransformerISMEditorUtilitySetting");
static_assert(offsetof(UHTTransformerISMEditorUtilitySetting, HTTransformerISMEditorUtility) == 0x000028, "Member 'UHTTransformerISMEditorUtilitySetting::HTTransformerISMEditorUtility' has a wrong offset!");

// Class HTWorldPartition.HTWorldPartitionAutoMeshInstancedActor
// 0x0000 (0x02C8 - 0x02C8)
class AHTWorldPartitionAutoMeshInstancedActor final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTWorldPartitionAutoMeshInstancedActor">();
	}
	static class AHTWorldPartitionAutoMeshInstancedActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHTWorldPartitionAutoMeshInstancedActor>();
	}
};
static_assert(alignof(AHTWorldPartitionAutoMeshInstancedActor) == 0x000008, "Wrong alignment on AHTWorldPartitionAutoMeshInstancedActor");
static_assert(sizeof(AHTWorldPartitionAutoMeshInstancedActor) == 0x0002C8, "Wrong size on AHTWorldPartitionAutoMeshInstancedActor");

// Class HTWorldPartition.HTWorldPartitionRuntimeCellTransformerISM
// 0x0000 (0x0030 - 0x0030)
class UHTWorldPartitionRuntimeCellTransformerISM final : public UWorldPartitionRuntimeCellTransformer
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTWorldPartitionRuntimeCellTransformerISM">();
	}
	static class UHTWorldPartitionRuntimeCellTransformerISM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTWorldPartitionRuntimeCellTransformerISM>();
	}
};
static_assert(alignof(UHTWorldPartitionRuntimeCellTransformerISM) == 0x000008, "Wrong alignment on UHTWorldPartitionRuntimeCellTransformerISM");
static_assert(sizeof(UHTWorldPartitionRuntimeCellTransformerISM) == 0x000030, "Wrong size on UHTWorldPartitionRuntimeCellTransformerISM");

}

