#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InstanceSplineMesh

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct InstanceSplineMesh.InstanceSplineMeshParams
// 0x00D0 (0x00D0 - 0x0000)
struct FInstanceSplineMeshParams final
{
public:
	struct FVector                                StartPos;                                          // 0x0000(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StartTangent;                                      // 0x0018(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              StartScale;                                        // 0x0030(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartRoll;                                         // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              StartOffset;                                       // 0x0048(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EndPos;                                            // 0x0058(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              EndScale;                                          // 0x0070(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EndTangent;                                        // 0x0080(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndRoll;                                           // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              EndOffset;                                         // 0x00A0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                UpDir;                                             // 0x00B0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NaniteClusterBoundsScale;                          // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FInstanceSplineMeshParams) == 0x000004, "Wrong alignment on FInstanceSplineMeshParams");
static_assert(sizeof(FInstanceSplineMeshParams) == 0x0000D0, "Wrong size on FInstanceSplineMeshParams");
static_assert(offsetof(FInstanceSplineMeshParams, StartPos) == 0x000000, "Member 'FInstanceSplineMeshParams::StartPos' has a wrong offset!");
static_assert(offsetof(FInstanceSplineMeshParams, StartTangent) == 0x000018, "Member 'FInstanceSplineMeshParams::StartTangent' has a wrong offset!");
static_assert(offsetof(FInstanceSplineMeshParams, StartScale) == 0x000030, "Member 'FInstanceSplineMeshParams::StartScale' has a wrong offset!");
static_assert(offsetof(FInstanceSplineMeshParams, StartRoll) == 0x000040, "Member 'FInstanceSplineMeshParams::StartRoll' has a wrong offset!");
static_assert(offsetof(FInstanceSplineMeshParams, StartOffset) == 0x000048, "Member 'FInstanceSplineMeshParams::StartOffset' has a wrong offset!");
static_assert(offsetof(FInstanceSplineMeshParams, EndPos) == 0x000058, "Member 'FInstanceSplineMeshParams::EndPos' has a wrong offset!");
static_assert(offsetof(FInstanceSplineMeshParams, EndScale) == 0x000070, "Member 'FInstanceSplineMeshParams::EndScale' has a wrong offset!");
static_assert(offsetof(FInstanceSplineMeshParams, EndTangent) == 0x000080, "Member 'FInstanceSplineMeshParams::EndTangent' has a wrong offset!");
static_assert(offsetof(FInstanceSplineMeshParams, EndRoll) == 0x000098, "Member 'FInstanceSplineMeshParams::EndRoll' has a wrong offset!");
static_assert(offsetof(FInstanceSplineMeshParams, EndOffset) == 0x0000A0, "Member 'FInstanceSplineMeshParams::EndOffset' has a wrong offset!");
static_assert(offsetof(FInstanceSplineMeshParams, UpDir) == 0x0000B0, "Member 'FInstanceSplineMeshParams::UpDir' has a wrong offset!");
static_assert(offsetof(FInstanceSplineMeshParams, NaniteClusterBoundsScale) == 0x0000C8, "Member 'FInstanceSplineMeshParams::NaniteClusterBoundsScale' has a wrong offset!");

// ScriptStruct InstanceSplineMesh.SerializableTriIndices
// 0x000C (0x000C - 0x0000)
struct FSerializableTriIndices final
{
public:
	int32                                         v0;                                                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         v1;                                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         v2;                                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSerializableTriIndices) == 0x000004, "Wrong alignment on FSerializableTriIndices");
static_assert(sizeof(FSerializableTriIndices) == 0x00000C, "Wrong size on FSerializableTriIndices");
static_assert(offsetof(FSerializableTriIndices, v0) == 0x000000, "Member 'FSerializableTriIndices::v0' has a wrong offset!");
static_assert(offsetof(FSerializableTriIndices, v1) == 0x000004, "Member 'FSerializableTriIndices::v1' has a wrong offset!");
static_assert(offsetof(FSerializableTriIndices, v2) == 0x000008, "Member 'FSerializableTriIndices::v2' has a wrong offset!");

// ScriptStruct InstanceSplineMesh.UVChannelData
// 0x0010 (0x0010 - 0x0000)
struct FUVChannelData final
{
public:
	TArray<struct FVector2D>                      UVs;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUVChannelData) == 0x000008, "Wrong alignment on FUVChannelData");
static_assert(sizeof(FUVChannelData) == 0x000010, "Wrong size on FUVChannelData");
static_assert(offsetof(FUVChannelData, UVs) == 0x000000, "Member 'FUVChannelData::UVs' has a wrong offset!");

// ScriptStruct InstanceSplineMesh.SerializableTriMeshCollisionData
// 0x0048 (0x0048 - 0x0000)
struct FSerializableTriMeshCollisionData final
{
public:
	TArray<struct FVector3f>                      Vertices;                                          // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSerializableTriIndices>        Indices;                                           // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint16>                                MaterialIndices;                                   // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FUVChannelData>                 UVChannels;                                        // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bFlipNormals;                                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeformableMesh;                                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFastCook;                                         // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableActiveEdgePrecompute;                      // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSerializableTriMeshCollisionData) == 0x000008, "Wrong alignment on FSerializableTriMeshCollisionData");
static_assert(sizeof(FSerializableTriMeshCollisionData) == 0x000048, "Wrong size on FSerializableTriMeshCollisionData");
static_assert(offsetof(FSerializableTriMeshCollisionData, Vertices) == 0x000000, "Member 'FSerializableTriMeshCollisionData::Vertices' has a wrong offset!");
static_assert(offsetof(FSerializableTriMeshCollisionData, Indices) == 0x000010, "Member 'FSerializableTriMeshCollisionData::Indices' has a wrong offset!");
static_assert(offsetof(FSerializableTriMeshCollisionData, MaterialIndices) == 0x000020, "Member 'FSerializableTriMeshCollisionData::MaterialIndices' has a wrong offset!");
static_assert(offsetof(FSerializableTriMeshCollisionData, UVChannels) == 0x000030, "Member 'FSerializableTriMeshCollisionData::UVChannels' has a wrong offset!");
static_assert(offsetof(FSerializableTriMeshCollisionData, bFlipNormals) == 0x000040, "Member 'FSerializableTriMeshCollisionData::bFlipNormals' has a wrong offset!");
static_assert(offsetof(FSerializableTriMeshCollisionData, bDeformableMesh) == 0x000041, "Member 'FSerializableTriMeshCollisionData::bDeformableMesh' has a wrong offset!");
static_assert(offsetof(FSerializableTriMeshCollisionData, bFastCook) == 0x000042, "Member 'FSerializableTriMeshCollisionData::bFastCook' has a wrong offset!");
static_assert(offsetof(FSerializableTriMeshCollisionData, bDisableActiveEdgePrecompute) == 0x000043, "Member 'FSerializableTriMeshCollisionData::bDisableActiveEdgePrecompute' has a wrong offset!");

}

