#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InstanceSplineMesh

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function InstanceSplineMesh.InstanceSplineMeshComponent.AddSplineInstance
// 0x00B0 (0x00B0 - 0x0000)
struct InstanceSplineMeshComponent_AddSplineInstance final
{
public:
	struct FVector                                StartPos;                                          // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StartTangent;                                      // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              StartScale;                                        // 0x0030(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartRoll;                                         // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                EndPos;                                            // 0x0048(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                EndTangent;                                        // 0x0060(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              EndScale;                                          // 0x0078(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndRoll;                                           // 0x0088(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                UpDir;                                             // 0x0090(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWorldSpace;                                       // 0x00A8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x00AC(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InstanceSplineMeshComponent_AddSplineInstance) == 0x000004, "Wrong alignment on InstanceSplineMeshComponent_AddSplineInstance");
static_assert(sizeof(InstanceSplineMeshComponent_AddSplineInstance) == 0x0000B0, "Wrong size on InstanceSplineMeshComponent_AddSplineInstance");
static_assert(offsetof(InstanceSplineMeshComponent_AddSplineInstance, StartPos) == 0x000000, "Member 'InstanceSplineMeshComponent_AddSplineInstance::StartPos' has a wrong offset!");
static_assert(offsetof(InstanceSplineMeshComponent_AddSplineInstance, StartTangent) == 0x000018, "Member 'InstanceSplineMeshComponent_AddSplineInstance::StartTangent' has a wrong offset!");
static_assert(offsetof(InstanceSplineMeshComponent_AddSplineInstance, StartScale) == 0x000030, "Member 'InstanceSplineMeshComponent_AddSplineInstance::StartScale' has a wrong offset!");
static_assert(offsetof(InstanceSplineMeshComponent_AddSplineInstance, StartRoll) == 0x000040, "Member 'InstanceSplineMeshComponent_AddSplineInstance::StartRoll' has a wrong offset!");
static_assert(offsetof(InstanceSplineMeshComponent_AddSplineInstance, EndPos) == 0x000048, "Member 'InstanceSplineMeshComponent_AddSplineInstance::EndPos' has a wrong offset!");
static_assert(offsetof(InstanceSplineMeshComponent_AddSplineInstance, EndTangent) == 0x000060, "Member 'InstanceSplineMeshComponent_AddSplineInstance::EndTangent' has a wrong offset!");
static_assert(offsetof(InstanceSplineMeshComponent_AddSplineInstance, EndScale) == 0x000078, "Member 'InstanceSplineMeshComponent_AddSplineInstance::EndScale' has a wrong offset!");
static_assert(offsetof(InstanceSplineMeshComponent_AddSplineInstance, EndRoll) == 0x000088, "Member 'InstanceSplineMeshComponent_AddSplineInstance::EndRoll' has a wrong offset!");
static_assert(offsetof(InstanceSplineMeshComponent_AddSplineInstance, UpDir) == 0x000090, "Member 'InstanceSplineMeshComponent_AddSplineInstance::UpDir' has a wrong offset!");
static_assert(offsetof(InstanceSplineMeshComponent_AddSplineInstance, bWorldSpace) == 0x0000A8, "Member 'InstanceSplineMeshComponent_AddSplineInstance::bWorldSpace' has a wrong offset!");
static_assert(offsetof(InstanceSplineMeshComponent_AddSplineInstance, ReturnValue) == 0x0000AC, "Member 'InstanceSplineMeshComponent_AddSplineInstance::ReturnValue' has a wrong offset!");

// Function InstanceSplineMesh.InstanceSplineMeshUtility.ConvertSplineMeshToInstance
// 0x0008 (0x0008 - 0x0000)
struct InstanceSplineMeshUtility_ConvertSplineMeshToInstance final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InstanceSplineMeshUtility_ConvertSplineMeshToInstance) == 0x000008, "Wrong alignment on InstanceSplineMeshUtility_ConvertSplineMeshToInstance");
static_assert(sizeof(InstanceSplineMeshUtility_ConvertSplineMeshToInstance) == 0x000008, "Wrong size on InstanceSplineMeshUtility_ConvertSplineMeshToInstance");
static_assert(offsetof(InstanceSplineMeshUtility_ConvertSplineMeshToInstance, TargetActor) == 0x000000, "Member 'InstanceSplineMeshUtility_ConvertSplineMeshToInstance::TargetActor' has a wrong offset!");

// Function InstanceSplineMesh.InstanceSplineMeshUtility.InstancingSplineMeshs
// 0x0028 (0x0028 - 0x0000)
struct InstanceSplineMeshUtility_InstancingSplineMeshs final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            StaticMesh;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USplineMeshComponent*>           SplineMeshs;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UInstanceSplineMeshComponent*           ReturnValue;                                       // 0x0020(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(InstanceSplineMeshUtility_InstancingSplineMeshs) == 0x000008, "Wrong alignment on InstanceSplineMeshUtility_InstancingSplineMeshs");
static_assert(sizeof(InstanceSplineMeshUtility_InstancingSplineMeshs) == 0x000028, "Wrong size on InstanceSplineMeshUtility_InstancingSplineMeshs");
static_assert(offsetof(InstanceSplineMeshUtility_InstancingSplineMeshs, TargetActor) == 0x000000, "Member 'InstanceSplineMeshUtility_InstancingSplineMeshs::TargetActor' has a wrong offset!");
static_assert(offsetof(InstanceSplineMeshUtility_InstancingSplineMeshs, StaticMesh) == 0x000008, "Member 'InstanceSplineMeshUtility_InstancingSplineMeshs::StaticMesh' has a wrong offset!");
static_assert(offsetof(InstanceSplineMeshUtility_InstancingSplineMeshs, SplineMeshs) == 0x000010, "Member 'InstanceSplineMeshUtility_InstancingSplineMeshs::SplineMeshs' has a wrong offset!");
static_assert(offsetof(InstanceSplineMeshUtility_InstancingSplineMeshs, ReturnValue) == 0x000020, "Member 'InstanceSplineMeshUtility_InstancingSplineMeshs::ReturnValue' has a wrong offset!");

}

