#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ISMPool

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ISMPool.ISMPoolSubSystem
// 0x0050 (0x0080 - 0x0030)
class UISMPoolSubSystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnActorEndPlay(class AActor* InSource, EEndPlayReason Reason);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ISMPoolSubSystem">();
	}
	static class UISMPoolSubSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UISMPoolSubSystem>();
	}
};
static_assert(alignof(UISMPoolSubSystem) == 0x000008, "Wrong alignment on UISMPoolSubSystem");
static_assert(sizeof(UISMPoolSubSystem) == 0x000080, "Wrong size on UISMPoolSubSystem");

// Class ISMPool.ISMPoolActor
// 0x0010 (0x02D8 - 0x02C8)
class AISMPoolActor final : public AActor
{
public:
	class UISMPoolComponent*                      ISMPoolComp;                                       // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UISMPoolDebugDrawComponent*             ISMPoolDebugDrawComp;                              // 0x02D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ISMPoolActor">();
	}
	static class AISMPoolActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AISMPoolActor>();
	}
};
static_assert(alignof(AISMPoolActor) == 0x000008, "Wrong alignment on AISMPoolActor");
static_assert(sizeof(AISMPoolActor) == 0x0002D8, "Wrong size on AISMPoolActor");
static_assert(offsetof(AISMPoolActor, ISMPoolComp) == 0x0002C8, "Member 'AISMPoolActor::ISMPoolComp' has a wrong offset!");
static_assert(offsetof(AISMPoolActor, ISMPoolDebugDrawComp) == 0x0002D0, "Member 'AISMPoolActor::ISMPoolDebugDrawComp' has a wrong offset!");

// Class ISMPool.ISMPoolComponent
// 0x0130 (0x0380 - 0x0250)
class UISMPoolComponent final : public USceneComponent
{
public:
	uint8                                         Pad_250[0x130];                                    // 0x0250(0x0130)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ISMPoolComponent">();
	}
	static class UISMPoolComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UISMPoolComponent>();
	}
};
static_assert(alignof(UISMPoolComponent) == 0x000008, "Wrong alignment on UISMPoolComponent");
static_assert(sizeof(UISMPoolComponent) == 0x000380, "Wrong size on UISMPoolComponent");

// Class ISMPool.ISMPoolDebugDrawComponent
// 0x0018 (0x05C0 - 0x05A8)
class UISMPoolDebugDrawComponent final : public UDebugDrawComponent
{
public:
	bool                                          bShowGlobalStats;                                  // 0x05A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowStats;                                        // 0x05A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowBounds;                                       // 0x05AA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5AB[0x5];                                      // 0x05AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UInstancedStaticMeshComponent*          SelectedComponent;                                 // 0x05B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B8[0x8];                                      // 0x05B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ISMPoolDebugDrawComponent">();
	}
	static class UISMPoolDebugDrawComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UISMPoolDebugDrawComponent>();
	}
};
static_assert(alignof(UISMPoolDebugDrawComponent) == 0x000008, "Wrong alignment on UISMPoolDebugDrawComponent");
static_assert(sizeof(UISMPoolDebugDrawComponent) == 0x0005C0, "Wrong size on UISMPoolDebugDrawComponent");
static_assert(offsetof(UISMPoolDebugDrawComponent, bShowGlobalStats) == 0x0005A8, "Member 'UISMPoolDebugDrawComponent::bShowGlobalStats' has a wrong offset!");
static_assert(offsetof(UISMPoolDebugDrawComponent, bShowStats) == 0x0005A9, "Member 'UISMPoolDebugDrawComponent::bShowStats' has a wrong offset!");
static_assert(offsetof(UISMPoolDebugDrawComponent, bShowBounds) == 0x0005AA, "Member 'UISMPoolDebugDrawComponent::bShowBounds' has a wrong offset!");
static_assert(offsetof(UISMPoolDebugDrawComponent, SelectedComponent) == 0x0005B0, "Member 'UISMPoolDebugDrawComponent::SelectedComponent' has a wrong offset!");

}

