#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KawaiiPhysics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function KawaiiPhysics.KawaiiPhysics_CustomExternalForce.Apply
// 0x08C0 (0x08C0 - 0x0000)
struct KawaiiPhysics_CustomExternalForce_Apply final
{
public:
	struct FAnimNode_KawaiiPhysics                Node;                                              // 0x0000(0x0850)(Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         ModifyBoneIndex;                                   // 0x0850(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_854[0x4];                                      // 0x0854(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class USkeletalMeshComponent*           SkelComp;                                          // 0x0858(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             BoneTransform;                                     // 0x0860(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KawaiiPhysics_CustomExternalForce_Apply) == 0x000008, "Wrong alignment on KawaiiPhysics_CustomExternalForce_Apply");
static_assert(sizeof(KawaiiPhysics_CustomExternalForce_Apply) == 0x0008C0, "Wrong size on KawaiiPhysics_CustomExternalForce_Apply");
static_assert(offsetof(KawaiiPhysics_CustomExternalForce_Apply, Node) == 0x000000, "Member 'KawaiiPhysics_CustomExternalForce_Apply::Node' has a wrong offset!");
static_assert(offsetof(KawaiiPhysics_CustomExternalForce_Apply, ModifyBoneIndex) == 0x000850, "Member 'KawaiiPhysics_CustomExternalForce_Apply::ModifyBoneIndex' has a wrong offset!");
static_assert(offsetof(KawaiiPhysics_CustomExternalForce_Apply, SkelComp) == 0x000858, "Member 'KawaiiPhysics_CustomExternalForce_Apply::SkelComp' has a wrong offset!");
static_assert(offsetof(KawaiiPhysics_CustomExternalForce_Apply, BoneTransform) == 0x000860, "Member 'KawaiiPhysics_CustomExternalForce_Apply::BoneTransform' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysics_CustomExternalForce.IsDebugEnabled
// 0x0001 (0x0001 - 0x0000)
struct KawaiiPhysics_CustomExternalForce_IsDebugEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KawaiiPhysics_CustomExternalForce_IsDebugEnabled) == 0x000001, "Wrong alignment on KawaiiPhysics_CustomExternalForce_IsDebugEnabled");
static_assert(sizeof(KawaiiPhysics_CustomExternalForce_IsDebugEnabled) == 0x000001, "Wrong size on KawaiiPhysics_CustomExternalForce_IsDebugEnabled");
static_assert(offsetof(KawaiiPhysics_CustomExternalForce_IsDebugEnabled, ReturnValue) == 0x000000, "Member 'KawaiiPhysics_CustomExternalForce_IsDebugEnabled::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysics_CustomExternalForce.PreApply
// 0x0860 (0x0860 - 0x0000)
struct KawaiiPhysics_CustomExternalForce_PreApply final
{
public:
	struct FAnimNode_KawaiiPhysics                Node;                                              // 0x0000(0x0850)(Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	const class USkeletalMeshComponent*           SkelComp;                                          // 0x0850(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_858[0x8];                                      // 0x0858(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KawaiiPhysics_CustomExternalForce_PreApply) == 0x000008, "Wrong alignment on KawaiiPhysics_CustomExternalForce_PreApply");
static_assert(sizeof(KawaiiPhysics_CustomExternalForce_PreApply) == 0x000860, "Wrong size on KawaiiPhysics_CustomExternalForce_PreApply");
static_assert(offsetof(KawaiiPhysics_CustomExternalForce_PreApply, Node) == 0x000000, "Member 'KawaiiPhysics_CustomExternalForce_PreApply::Node' has a wrong offset!");
static_assert(offsetof(KawaiiPhysics_CustomExternalForce_PreApply, SkelComp) == 0x000850, "Member 'KawaiiPhysics_CustomExternalForce_PreApply::SkelComp' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.AddExternalForce
// 0x0030 (0x0030 - 0x0000)
struct KawaiiPhysicsLibrary_AddExternalForce final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       ExternalForce;                                     // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	class UObject*                                Owner;                                             // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOneShot;                                        // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0029(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KawaiiPhysicsLibrary_AddExternalForce) == 0x000008, "Wrong alignment on KawaiiPhysicsLibrary_AddExternalForce");
static_assert(sizeof(KawaiiPhysicsLibrary_AddExternalForce) == 0x000030, "Wrong size on KawaiiPhysicsLibrary_AddExternalForce");
static_assert(offsetof(KawaiiPhysicsLibrary_AddExternalForce, KawaiiPhysics) == 0x000000, "Member 'KawaiiPhysicsLibrary_AddExternalForce::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_AddExternalForce, ExternalForce) == 0x000010, "Member 'KawaiiPhysicsLibrary_AddExternalForce::ExternalForce' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_AddExternalForce, Owner) == 0x000020, "Member 'KawaiiPhysicsLibrary_AddExternalForce::Owner' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_AddExternalForce, bIsOneShot) == 0x000028, "Member 'KawaiiPhysicsLibrary_AddExternalForce::bIsOneShot' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_AddExternalForce, ReturnValue) == 0x000029, "Member 'KawaiiPhysicsLibrary_AddExternalForce::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.AddExternalForcesToComponent
// 0x0048 (0x0048 - 0x0000)
struct KawaiiPhysicsLibrary_AddExternalForcesToComponent final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               ExternalForces;                                    // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class UObject*                                Owner;                                             // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  FilterTags;                                        // 0x0020(0x0020)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bFilterExactMatch;                                 // 0x0040(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOneShot;                                        // 0x0041(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0042(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KawaiiPhysicsLibrary_AddExternalForcesToComponent) == 0x000008, "Wrong alignment on KawaiiPhysicsLibrary_AddExternalForcesToComponent");
static_assert(sizeof(KawaiiPhysicsLibrary_AddExternalForcesToComponent) == 0x000048, "Wrong size on KawaiiPhysicsLibrary_AddExternalForcesToComponent");
static_assert(offsetof(KawaiiPhysicsLibrary_AddExternalForcesToComponent, MeshComp) == 0x000000, "Member 'KawaiiPhysicsLibrary_AddExternalForcesToComponent::MeshComp' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_AddExternalForcesToComponent, ExternalForces) == 0x000008, "Member 'KawaiiPhysicsLibrary_AddExternalForcesToComponent::ExternalForces' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_AddExternalForcesToComponent, Owner) == 0x000018, "Member 'KawaiiPhysicsLibrary_AddExternalForcesToComponent::Owner' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_AddExternalForcesToComponent, FilterTags) == 0x000020, "Member 'KawaiiPhysicsLibrary_AddExternalForcesToComponent::FilterTags' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_AddExternalForcesToComponent, bFilterExactMatch) == 0x000040, "Member 'KawaiiPhysicsLibrary_AddExternalForcesToComponent::bFilterExactMatch' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_AddExternalForcesToComponent, bIsOneShot) == 0x000041, "Member 'KawaiiPhysicsLibrary_AddExternalForcesToComponent::bIsOneShot' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_AddExternalForcesToComponent, ReturnValue) == 0x000042, "Member 'KawaiiPhysicsLibrary_AddExternalForcesToComponent::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.AddExternalForceWithExecResult
// 0x0040 (0x0040 - 0x0000)
struct KawaiiPhysicsLibrary_AddExternalForceWithExecResult final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       ExternalForce;                                     // 0x0018(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	class UObject*                                Owner;                                             // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(KawaiiPhysicsLibrary_AddExternalForceWithExecResult) == 0x000008, "Wrong alignment on KawaiiPhysicsLibrary_AddExternalForceWithExecResult");
static_assert(sizeof(KawaiiPhysicsLibrary_AddExternalForceWithExecResult) == 0x000040, "Wrong size on KawaiiPhysicsLibrary_AddExternalForceWithExecResult");
static_assert(offsetof(KawaiiPhysicsLibrary_AddExternalForceWithExecResult, ExecResult) == 0x000000, "Member 'KawaiiPhysicsLibrary_AddExternalForceWithExecResult::ExecResult' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_AddExternalForceWithExecResult, KawaiiPhysics) == 0x000008, "Member 'KawaiiPhysicsLibrary_AddExternalForceWithExecResult::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_AddExternalForceWithExecResult, ExternalForce) == 0x000018, "Member 'KawaiiPhysicsLibrary_AddExternalForceWithExecResult::ExternalForce' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_AddExternalForceWithExecResult, Owner) == 0x000028, "Member 'KawaiiPhysicsLibrary_AddExternalForceWithExecResult::Owner' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_AddExternalForceWithExecResult, ReturnValue) == 0x000030, "Member 'KawaiiPhysicsLibrary_AddExternalForceWithExecResult::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.ConvertToKawaiiPhysics
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_ConvertToKawaiiPhysics final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EAnimNodeReferenceConversionResult            result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(KawaiiPhysicsLibrary_ConvertToKawaiiPhysics) == 0x000001, "Wrong alignment on KawaiiPhysicsLibrary_ConvertToKawaiiPhysics");
static_assert(sizeof(KawaiiPhysicsLibrary_ConvertToKawaiiPhysics) == 0x000028, "Wrong size on KawaiiPhysicsLibrary_ConvertToKawaiiPhysics");
static_assert(offsetof(KawaiiPhysicsLibrary_ConvertToKawaiiPhysics, Node) == 0x000000, "Member 'KawaiiPhysicsLibrary_ConvertToKawaiiPhysics::Node' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_ConvertToKawaiiPhysics, result) == 0x000010, "Member 'KawaiiPhysicsLibrary_ConvertToKawaiiPhysics::result' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_ConvertToKawaiiPhysics, ReturnValue) == 0x000018, "Member 'KawaiiPhysicsLibrary_ConvertToKawaiiPhysics::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.ConvertToKawaiiPhysicsPure
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_ConvertToKawaiiPhysicsPure final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0010(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KawaiiPhysicsLibrary_ConvertToKawaiiPhysicsPure) == 0x000001, "Wrong alignment on KawaiiPhysicsLibrary_ConvertToKawaiiPhysicsPure");
static_assert(sizeof(KawaiiPhysicsLibrary_ConvertToKawaiiPhysicsPure) == 0x000028, "Wrong size on KawaiiPhysicsLibrary_ConvertToKawaiiPhysicsPure");
static_assert(offsetof(KawaiiPhysicsLibrary_ConvertToKawaiiPhysicsPure, Node) == 0x000000, "Member 'KawaiiPhysicsLibrary_ConvertToKawaiiPhysicsPure::Node' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_ConvertToKawaiiPhysicsPure, KawaiiPhysics) == 0x000010, "Member 'KawaiiPhysicsLibrary_ConvertToKawaiiPhysicsPure::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_ConvertToKawaiiPhysicsPure, result) == 0x000020, "Member 'KawaiiPhysicsLibrary_ConvertToKawaiiPhysicsPure::result' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetAllowWorldCollision
// 0x0018 (0x0018 - 0x0000)
struct KawaiiPhysicsLibrary_GetAllowWorldCollision final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KawaiiPhysicsLibrary_GetAllowWorldCollision) == 0x000001, "Wrong alignment on KawaiiPhysicsLibrary_GetAllowWorldCollision");
static_assert(sizeof(KawaiiPhysicsLibrary_GetAllowWorldCollision) == 0x000018, "Wrong size on KawaiiPhysicsLibrary_GetAllowWorldCollision");
static_assert(offsetof(KawaiiPhysicsLibrary_GetAllowWorldCollision, KawaiiPhysics) == 0x000000, "Member 'KawaiiPhysicsLibrary_GetAllowWorldCollision::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetAllowWorldCollision, ReturnValue) == 0x000010, "Member 'KawaiiPhysicsLibrary_GetAllowWorldCollision::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetDummyBoneLength
// 0x0018 (0x0018 - 0x0000)
struct KawaiiPhysicsLibrary_GetDummyBoneLength final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KawaiiPhysicsLibrary_GetDummyBoneLength) == 0x000004, "Wrong alignment on KawaiiPhysicsLibrary_GetDummyBoneLength");
static_assert(sizeof(KawaiiPhysicsLibrary_GetDummyBoneLength) == 0x000018, "Wrong size on KawaiiPhysicsLibrary_GetDummyBoneLength");
static_assert(offsetof(KawaiiPhysicsLibrary_GetDummyBoneLength, KawaiiPhysics) == 0x000000, "Member 'KawaiiPhysicsLibrary_GetDummyBoneLength::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetDummyBoneLength, ReturnValue) == 0x000010, "Member 'KawaiiPhysicsLibrary_GetDummyBoneLength::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetEnableWind
// 0x0018 (0x0018 - 0x0000)
struct KawaiiPhysicsLibrary_GetEnableWind final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KawaiiPhysicsLibrary_GetEnableWind) == 0x000001, "Wrong alignment on KawaiiPhysicsLibrary_GetEnableWind");
static_assert(sizeof(KawaiiPhysicsLibrary_GetEnableWind) == 0x000018, "Wrong size on KawaiiPhysicsLibrary_GetEnableWind");
static_assert(offsetof(KawaiiPhysicsLibrary_GetEnableWind, KawaiiPhysics) == 0x000000, "Member 'KawaiiPhysicsLibrary_GetEnableWind::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetEnableWind, ReturnValue) == 0x000010, "Member 'KawaiiPhysicsLibrary_GetEnableWind::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetExcludeBoneNames
// 0x0020 (0x0020 - 0x0000)
struct KawaiiPhysicsLibrary_GetExcludeBoneNames final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(KawaiiPhysicsLibrary_GetExcludeBoneNames) == 0x000008, "Wrong alignment on KawaiiPhysicsLibrary_GetExcludeBoneNames");
static_assert(sizeof(KawaiiPhysicsLibrary_GetExcludeBoneNames) == 0x000020, "Wrong size on KawaiiPhysicsLibrary_GetExcludeBoneNames");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExcludeBoneNames, KawaiiPhysics) == 0x000000, "Member 'KawaiiPhysicsLibrary_GetExcludeBoneNames::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExcludeBoneNames, ReturnValue) == 0x000010, "Member 'KawaiiPhysicsLibrary_GetExcludeBoneNames::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetExternalForceBoolProperty
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_GetExternalForceBoolProperty final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ExternalForceIndex;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KawaiiPhysicsLibrary_GetExternalForceBoolProperty) == 0x000004, "Wrong alignment on KawaiiPhysicsLibrary_GetExternalForceBoolProperty");
static_assert(sizeof(KawaiiPhysicsLibrary_GetExternalForceBoolProperty) == 0x000028, "Wrong size on KawaiiPhysicsLibrary_GetExternalForceBoolProperty");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceBoolProperty, ExecResult) == 0x000000, "Member 'KawaiiPhysicsLibrary_GetExternalForceBoolProperty::ExecResult' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceBoolProperty, KawaiiPhysics) == 0x000008, "Member 'KawaiiPhysicsLibrary_GetExternalForceBoolProperty::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceBoolProperty, ExternalForceIndex) == 0x000018, "Member 'KawaiiPhysicsLibrary_GetExternalForceBoolProperty::ExternalForceIndex' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceBoolProperty, PropertyName) == 0x00001C, "Member 'KawaiiPhysicsLibrary_GetExternalForceBoolProperty::PropertyName' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceBoolProperty, ReturnValue) == 0x000024, "Member 'KawaiiPhysicsLibrary_GetExternalForceBoolProperty::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetExternalForceFloatProperty
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_GetExternalForceFloatProperty final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ExternalForceIndex;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KawaiiPhysicsLibrary_GetExternalForceFloatProperty) == 0x000004, "Wrong alignment on KawaiiPhysicsLibrary_GetExternalForceFloatProperty");
static_assert(sizeof(KawaiiPhysicsLibrary_GetExternalForceFloatProperty) == 0x000028, "Wrong size on KawaiiPhysicsLibrary_GetExternalForceFloatProperty");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceFloatProperty, ExecResult) == 0x000000, "Member 'KawaiiPhysicsLibrary_GetExternalForceFloatProperty::ExecResult' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceFloatProperty, KawaiiPhysics) == 0x000008, "Member 'KawaiiPhysicsLibrary_GetExternalForceFloatProperty::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceFloatProperty, ExternalForceIndex) == 0x000018, "Member 'KawaiiPhysicsLibrary_GetExternalForceFloatProperty::ExternalForceIndex' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceFloatProperty, PropertyName) == 0x00001C, "Member 'KawaiiPhysicsLibrary_GetExternalForceFloatProperty::PropertyName' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceFloatProperty, ReturnValue) == 0x000024, "Member 'KawaiiPhysicsLibrary_GetExternalForceFloatProperty::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetExternalForceIntProperty
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_GetExternalForceIntProperty final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ExternalForceIndex;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KawaiiPhysicsLibrary_GetExternalForceIntProperty) == 0x000004, "Wrong alignment on KawaiiPhysicsLibrary_GetExternalForceIntProperty");
static_assert(sizeof(KawaiiPhysicsLibrary_GetExternalForceIntProperty) == 0x000028, "Wrong size on KawaiiPhysicsLibrary_GetExternalForceIntProperty");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceIntProperty, ExecResult) == 0x000000, "Member 'KawaiiPhysicsLibrary_GetExternalForceIntProperty::ExecResult' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceIntProperty, KawaiiPhysics) == 0x000008, "Member 'KawaiiPhysicsLibrary_GetExternalForceIntProperty::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceIntProperty, ExternalForceIndex) == 0x000018, "Member 'KawaiiPhysicsLibrary_GetExternalForceIntProperty::ExternalForceIndex' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceIntProperty, PropertyName) == 0x00001C, "Member 'KawaiiPhysicsLibrary_GetExternalForceIntProperty::PropertyName' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceIntProperty, ReturnValue) == 0x000024, "Member 'KawaiiPhysicsLibrary_GetExternalForceIntProperty::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetExternalForceRotatorProperty
// 0x0040 (0x0040 - 0x0000)
struct KawaiiPhysicsLibrary_GetExternalForceRotatorProperty final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ExternalForceIndex;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ReturnValue;                                       // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(KawaiiPhysicsLibrary_GetExternalForceRotatorProperty) == 0x000004, "Wrong alignment on KawaiiPhysicsLibrary_GetExternalForceRotatorProperty");
static_assert(sizeof(KawaiiPhysicsLibrary_GetExternalForceRotatorProperty) == 0x000040, "Wrong size on KawaiiPhysicsLibrary_GetExternalForceRotatorProperty");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceRotatorProperty, ExecResult) == 0x000000, "Member 'KawaiiPhysicsLibrary_GetExternalForceRotatorProperty::ExecResult' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceRotatorProperty, KawaiiPhysics) == 0x000008, "Member 'KawaiiPhysicsLibrary_GetExternalForceRotatorProperty::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceRotatorProperty, ExternalForceIndex) == 0x000018, "Member 'KawaiiPhysicsLibrary_GetExternalForceRotatorProperty::ExternalForceIndex' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceRotatorProperty, PropertyName) == 0x00001C, "Member 'KawaiiPhysicsLibrary_GetExternalForceRotatorProperty::PropertyName' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceRotatorProperty, ReturnValue) == 0x000028, "Member 'KawaiiPhysicsLibrary_GetExternalForceRotatorProperty::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetExternalForceTransformProperty
// 0x0090 (0x0090 - 0x0000)
struct KawaiiPhysicsLibrary_GetExternalForceTransformProperty final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ExternalForceIndex;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0xC];                                       // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0030(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KawaiiPhysicsLibrary_GetExternalForceTransformProperty) == 0x000004, "Wrong alignment on KawaiiPhysicsLibrary_GetExternalForceTransformProperty");
static_assert(sizeof(KawaiiPhysicsLibrary_GetExternalForceTransformProperty) == 0x000090, "Wrong size on KawaiiPhysicsLibrary_GetExternalForceTransformProperty");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceTransformProperty, ExecResult) == 0x000000, "Member 'KawaiiPhysicsLibrary_GetExternalForceTransformProperty::ExecResult' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceTransformProperty, KawaiiPhysics) == 0x000008, "Member 'KawaiiPhysicsLibrary_GetExternalForceTransformProperty::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceTransformProperty, ExternalForceIndex) == 0x000018, "Member 'KawaiiPhysicsLibrary_GetExternalForceTransformProperty::ExternalForceIndex' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceTransformProperty, PropertyName) == 0x00001C, "Member 'KawaiiPhysicsLibrary_GetExternalForceTransformProperty::PropertyName' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceTransformProperty, ReturnValue) == 0x000030, "Member 'KawaiiPhysicsLibrary_GetExternalForceTransformProperty::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetExternalForceVectorProperty
// 0x0040 (0x0040 - 0x0000)
struct KawaiiPhysicsLibrary_GetExternalForceVectorProperty final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ExternalForceIndex;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KawaiiPhysicsLibrary_GetExternalForceVectorProperty) == 0x000004, "Wrong alignment on KawaiiPhysicsLibrary_GetExternalForceVectorProperty");
static_assert(sizeof(KawaiiPhysicsLibrary_GetExternalForceVectorProperty) == 0x000040, "Wrong size on KawaiiPhysicsLibrary_GetExternalForceVectorProperty");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceVectorProperty, ExecResult) == 0x000000, "Member 'KawaiiPhysicsLibrary_GetExternalForceVectorProperty::ExecResult' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceVectorProperty, KawaiiPhysics) == 0x000008, "Member 'KawaiiPhysicsLibrary_GetExternalForceVectorProperty::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceVectorProperty, ExternalForceIndex) == 0x000018, "Member 'KawaiiPhysicsLibrary_GetExternalForceVectorProperty::ExternalForceIndex' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceVectorProperty, PropertyName) == 0x00001C, "Member 'KawaiiPhysicsLibrary_GetExternalForceVectorProperty::PropertyName' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceVectorProperty, ReturnValue) == 0x000028, "Member 'KawaiiPhysicsLibrary_GetExternalForceVectorProperty::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetExternalForceWildcardProperty
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_GetExternalForceWildcardProperty final
{
public:
	EKawaiiPhysicsAccessExternalForceResult       ExecResult;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ExternalForceIndex;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PropertyName;                                      // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KawaiiPhysicsLibrary_GetExternalForceWildcardProperty) == 0x000004, "Wrong alignment on KawaiiPhysicsLibrary_GetExternalForceWildcardProperty");
static_assert(sizeof(KawaiiPhysicsLibrary_GetExternalForceWildcardProperty) == 0x000028, "Wrong size on KawaiiPhysicsLibrary_GetExternalForceWildcardProperty");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceWildcardProperty, ExecResult) == 0x000000, "Member 'KawaiiPhysicsLibrary_GetExternalForceWildcardProperty::ExecResult' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceWildcardProperty, KawaiiPhysics) == 0x000008, "Member 'KawaiiPhysicsLibrary_GetExternalForceWildcardProperty::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceWildcardProperty, ExternalForceIndex) == 0x000018, "Member 'KawaiiPhysicsLibrary_GetExternalForceWildcardProperty::ExternalForceIndex' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceWildcardProperty, PropertyName) == 0x00001C, "Member 'KawaiiPhysicsLibrary_GetExternalForceWildcardProperty::PropertyName' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetExternalForceWildcardProperty, Value) == 0x000024, "Member 'KawaiiPhysicsLibrary_GetExternalForceWildcardProperty::Value' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetGravity
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_GetGravity final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KawaiiPhysicsLibrary_GetGravity) == 0x000001, "Wrong alignment on KawaiiPhysicsLibrary_GetGravity");
static_assert(sizeof(KawaiiPhysicsLibrary_GetGravity) == 0x000028, "Wrong size on KawaiiPhysicsLibrary_GetGravity");
static_assert(offsetof(KawaiiPhysicsLibrary_GetGravity, KawaiiPhysics) == 0x000000, "Member 'KawaiiPhysicsLibrary_GetGravity::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetGravity, ReturnValue) == 0x000010, "Member 'KawaiiPhysicsLibrary_GetGravity::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetLimitsDataAsset
// 0x0018 (0x0018 - 0x0000)
struct KawaiiPhysicsLibrary_GetLimitsDataAsset final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UKawaiiPhysicsLimitsDataAsset*          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KawaiiPhysicsLibrary_GetLimitsDataAsset) == 0x000008, "Wrong alignment on KawaiiPhysicsLibrary_GetLimitsDataAsset");
static_assert(sizeof(KawaiiPhysicsLibrary_GetLimitsDataAsset) == 0x000018, "Wrong size on KawaiiPhysicsLibrary_GetLimitsDataAsset");
static_assert(offsetof(KawaiiPhysicsLibrary_GetLimitsDataAsset, KawaiiPhysics) == 0x000000, "Member 'KawaiiPhysicsLibrary_GetLimitsDataAsset::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetLimitsDataAsset, ReturnValue) == 0x000010, "Member 'KawaiiPhysicsLibrary_GetLimitsDataAsset::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetNeedWarmUp
// 0x0018 (0x0018 - 0x0000)
struct KawaiiPhysicsLibrary_GetNeedWarmUp final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KawaiiPhysicsLibrary_GetNeedWarmUp) == 0x000001, "Wrong alignment on KawaiiPhysicsLibrary_GetNeedWarmUp");
static_assert(sizeof(KawaiiPhysicsLibrary_GetNeedWarmUp) == 0x000018, "Wrong size on KawaiiPhysicsLibrary_GetNeedWarmUp");
static_assert(offsetof(KawaiiPhysicsLibrary_GetNeedWarmUp, KawaiiPhysics) == 0x000000, "Member 'KawaiiPhysicsLibrary_GetNeedWarmUp::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetNeedWarmUp, ReturnValue) == 0x000010, "Member 'KawaiiPhysicsLibrary_GetNeedWarmUp::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetPhysicsSettings
// 0x0030 (0x0030 - 0x0000)
struct KawaiiPhysicsLibrary_GetPhysicsSettings final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FKawaiiPhysicsSettings                 ReturnValue;                                       // 0x0010(0x001C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KawaiiPhysicsLibrary_GetPhysicsSettings) == 0x000001, "Wrong alignment on KawaiiPhysicsLibrary_GetPhysicsSettings");
static_assert(sizeof(KawaiiPhysicsLibrary_GetPhysicsSettings) == 0x000030, "Wrong size on KawaiiPhysicsLibrary_GetPhysicsSettings");
static_assert(offsetof(KawaiiPhysicsLibrary_GetPhysicsSettings, KawaiiPhysics) == 0x000000, "Member 'KawaiiPhysicsLibrary_GetPhysicsSettings::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetPhysicsSettings, ReturnValue) == 0x000010, "Member 'KawaiiPhysicsLibrary_GetPhysicsSettings::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetRootBoneName
// 0x0018 (0x0018 - 0x0000)
struct KawaiiPhysicsLibrary_GetRootBoneName final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KawaiiPhysicsLibrary_GetRootBoneName) == 0x000004, "Wrong alignment on KawaiiPhysicsLibrary_GetRootBoneName");
static_assert(sizeof(KawaiiPhysicsLibrary_GetRootBoneName) == 0x000018, "Wrong size on KawaiiPhysicsLibrary_GetRootBoneName");
static_assert(offsetof(KawaiiPhysicsLibrary_GetRootBoneName, KawaiiPhysics) == 0x000000, "Member 'KawaiiPhysicsLibrary_GetRootBoneName::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetRootBoneName, ReturnValue) == 0x000010, "Member 'KawaiiPhysicsLibrary_GetRootBoneName::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetTeleportDistanceThreshold
// 0x0018 (0x0018 - 0x0000)
struct KawaiiPhysicsLibrary_GetTeleportDistanceThreshold final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KawaiiPhysicsLibrary_GetTeleportDistanceThreshold) == 0x000004, "Wrong alignment on KawaiiPhysicsLibrary_GetTeleportDistanceThreshold");
static_assert(sizeof(KawaiiPhysicsLibrary_GetTeleportDistanceThreshold) == 0x000018, "Wrong size on KawaiiPhysicsLibrary_GetTeleportDistanceThreshold");
static_assert(offsetof(KawaiiPhysicsLibrary_GetTeleportDistanceThreshold, KawaiiPhysics) == 0x000000, "Member 'KawaiiPhysicsLibrary_GetTeleportDistanceThreshold::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetTeleportDistanceThreshold, ReturnValue) == 0x000010, "Member 'KawaiiPhysicsLibrary_GetTeleportDistanceThreshold::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetTeleportRotationThreshold
// 0x0018 (0x0018 - 0x0000)
struct KawaiiPhysicsLibrary_GetTeleportRotationThreshold final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KawaiiPhysicsLibrary_GetTeleportRotationThreshold) == 0x000004, "Wrong alignment on KawaiiPhysicsLibrary_GetTeleportRotationThreshold");
static_assert(sizeof(KawaiiPhysicsLibrary_GetTeleportRotationThreshold) == 0x000018, "Wrong size on KawaiiPhysicsLibrary_GetTeleportRotationThreshold");
static_assert(offsetof(KawaiiPhysicsLibrary_GetTeleportRotationThreshold, KawaiiPhysics) == 0x000000, "Member 'KawaiiPhysicsLibrary_GetTeleportRotationThreshold::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetTeleportRotationThreshold, ReturnValue) == 0x000010, "Member 'KawaiiPhysicsLibrary_GetTeleportRotationThreshold::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.GetWindScale
// 0x0018 (0x0018 - 0x0000)
struct KawaiiPhysicsLibrary_GetWindScale final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KawaiiPhysicsLibrary_GetWindScale) == 0x000004, "Wrong alignment on KawaiiPhysicsLibrary_GetWindScale");
static_assert(sizeof(KawaiiPhysicsLibrary_GetWindScale) == 0x000018, "Wrong size on KawaiiPhysicsLibrary_GetWindScale");
static_assert(offsetof(KawaiiPhysicsLibrary_GetWindScale, KawaiiPhysics) == 0x000000, "Member 'KawaiiPhysicsLibrary_GetWindScale::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_GetWindScale, ReturnValue) == 0x000010, "Member 'KawaiiPhysicsLibrary_GetWindScale::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.RemoveExternalForcesFromComponent
// 0x0038 (0x0038 - 0x0000)
struct KawaiiPhysicsLibrary_RemoveExternalForcesFromComponent final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Owner;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  FilterTags;                                        // 0x0010(0x0020)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bFilterExactMatch;                                 // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0031(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KawaiiPhysicsLibrary_RemoveExternalForcesFromComponent) == 0x000008, "Wrong alignment on KawaiiPhysicsLibrary_RemoveExternalForcesFromComponent");
static_assert(sizeof(KawaiiPhysicsLibrary_RemoveExternalForcesFromComponent) == 0x000038, "Wrong size on KawaiiPhysicsLibrary_RemoveExternalForcesFromComponent");
static_assert(offsetof(KawaiiPhysicsLibrary_RemoveExternalForcesFromComponent, MeshComp) == 0x000000, "Member 'KawaiiPhysicsLibrary_RemoveExternalForcesFromComponent::MeshComp' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_RemoveExternalForcesFromComponent, Owner) == 0x000008, "Member 'KawaiiPhysicsLibrary_RemoveExternalForcesFromComponent::Owner' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_RemoveExternalForcesFromComponent, FilterTags) == 0x000010, "Member 'KawaiiPhysicsLibrary_RemoveExternalForcesFromComponent::FilterTags' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_RemoveExternalForcesFromComponent, bFilterExactMatch) == 0x000030, "Member 'KawaiiPhysicsLibrary_RemoveExternalForcesFromComponent::bFilterExactMatch' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_RemoveExternalForcesFromComponent, ReturnValue) == 0x000031, "Member 'KawaiiPhysicsLibrary_RemoveExternalForcesFromComponent::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.ResetDynamics
// 0x0020 (0x0020 - 0x0000)
struct KawaiiPhysicsLibrary_ResetDynamics final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(KawaiiPhysicsLibrary_ResetDynamics) == 0x000001, "Wrong alignment on KawaiiPhysicsLibrary_ResetDynamics");
static_assert(sizeof(KawaiiPhysicsLibrary_ResetDynamics) == 0x000020, "Wrong size on KawaiiPhysicsLibrary_ResetDynamics");
static_assert(offsetof(KawaiiPhysicsLibrary_ResetDynamics, KawaiiPhysics) == 0x000000, "Member 'KawaiiPhysicsLibrary_ResetDynamics::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_ResetDynamics, ReturnValue) == 0x000010, "Member 'KawaiiPhysicsLibrary_ResetDynamics::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.SetAllowWorldCollision
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_SetAllowWorldCollision final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bAllowWorldCollision;                              // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(KawaiiPhysicsLibrary_SetAllowWorldCollision) == 0x000001, "Wrong alignment on KawaiiPhysicsLibrary_SetAllowWorldCollision");
static_assert(sizeof(KawaiiPhysicsLibrary_SetAllowWorldCollision) == 0x000028, "Wrong size on KawaiiPhysicsLibrary_SetAllowWorldCollision");
static_assert(offsetof(KawaiiPhysicsLibrary_SetAllowWorldCollision, KawaiiPhysics) == 0x000000, "Member 'KawaiiPhysicsLibrary_SetAllowWorldCollision::KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_SetAllowWorldCollision, bAllowWorldCollision) == 0x000010, "Member 'KawaiiPhysicsLibrary_SetAllowWorldCollision::bAllowWorldCollision' has a wrong offset!");
static_assert(offsetof(KawaiiPhysicsLibrary_SetAllowWorldCollision, ReturnValue) == 0x000018, "Member 'KawaiiPhysicsLibrary_SetAllowWorldCollision::ReturnValue' has a wrong offset!");

// Function KawaiiPhysics.KawaiiPhysicsLibrary.SetDummyBoneLength
// 0x0028 (0x0028 - 0x0000)
struct KawaiiPhysicsLibrary_SetDummyBoneLength final
{
public:
	struct FKawaiiPhysicsReference                KawaiiPhysics;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         DummyBoneLength;                                   // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKawaiiPhysicsReference                ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(KawaiiPhysicsLibrary_SetDummyBoneLength) == 0x000004, "Wrong alignment on KawaiiPhysicsLibrary_SetDummyBoneLength");
static_assert(sizeof(KawaiiPhysicsLibrary_SetDummyBoneLength) == 0x000028, "Wrong size on KawaiiPhysicsLibrary_SetDummyBoneLength");
