#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LauncherSDK

#include "Basic.hpp"

#include "LauncherSDK_structs.hpp"


namespace SDK::Params
{

// Function LauncherSDK.LauncherSDKSubsystem.BlinkTaskbar
// 0x0004 (0x0004 - 0x0000)
struct LauncherSDKSubsystem_BlinkTaskbar final
{
public:
	int32                                         Sec;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LauncherSDKSubsystem_BlinkTaskbar) == 0x000004, "Wrong alignment on LauncherSDKSubsystem_BlinkTaskbar");
static_assert(sizeof(LauncherSDKSubsystem_BlinkTaskbar) == 0x000004, "Wrong size on LauncherSDKSubsystem_BlinkTaskbar");
static_assert(offsetof(LauncherSDKSubsystem_BlinkTaskbar, Sec) == 0x000000, "Member 'LauncherSDKSubsystem_BlinkTaskbar::Sec' has a wrong offset!");

// Function LauncherSDK.LauncherSDKSubsystem.ChangeSize
// 0x000C (0x000C - 0x0000)
struct LauncherSDKSubsystem_ChangeSize final
{
public:
	int32                                         Width;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFullScreen;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExclusive;                                        // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LauncherSDKSubsystem_ChangeSize) == 0x000004, "Wrong alignment on LauncherSDKSubsystem_ChangeSize");
static_assert(sizeof(LauncherSDKSubsystem_ChangeSize) == 0x00000C, "Wrong size on LauncherSDKSubsystem_ChangeSize");
static_assert(offsetof(LauncherSDKSubsystem_ChangeSize, Width) == 0x000000, "Member 'LauncherSDKSubsystem_ChangeSize::Width' has a wrong offset!");
static_assert(offsetof(LauncherSDKSubsystem_ChangeSize, Height) == 0x000004, "Member 'LauncherSDKSubsystem_ChangeSize::Height' has a wrong offset!");
static_assert(offsetof(LauncherSDKSubsystem_ChangeSize, bFullScreen) == 0x000008, "Member 'LauncherSDKSubsystem_ChangeSize::bFullScreen' has a wrong offset!");
static_assert(offsetof(LauncherSDKSubsystem_ChangeSize, bExclusive) == 0x000009, "Member 'LauncherSDKSubsystem_ChangeSize::bExclusive' has a wrong offset!");

// Function LauncherSDK.LauncherSDKSubsystem.GetCurrentOrientation
// 0x0001 (0x0001 - 0x0000)
struct LauncherSDKSubsystem_GetCurrentOrientation final
{
public:
	EGameOrientation                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LauncherSDKSubsystem_GetCurrentOrientation) == 0x000001, "Wrong alignment on LauncherSDKSubsystem_GetCurrentOrientation");
static_assert(sizeof(LauncherSDKSubsystem_GetCurrentOrientation) == 0x000001, "Wrong size on LauncherSDKSubsystem_GetCurrentOrientation");
static_assert(offsetof(LauncherSDKSubsystem_GetCurrentOrientation, ReturnValue) == 0x000000, "Member 'LauncherSDKSubsystem_GetCurrentOrientation::ReturnValue' has a wrong offset!");

// Function LauncherSDK.LauncherSDKSubsystem.GetMediaId
// 0x0010 (0x0010 - 0x0000)
struct LauncherSDKSubsystem_GetMediaId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LauncherSDKSubsystem_GetMediaId) == 0x000008, "Wrong alignment on LauncherSDKSubsystem_GetMediaId");
static_assert(sizeof(LauncherSDKSubsystem_GetMediaId) == 0x000010, "Wrong size on LauncherSDKSubsystem_GetMediaId");
static_assert(offsetof(LauncherSDKSubsystem_GetMediaId, ReturnValue) == 0x000000, "Member 'LauncherSDKSubsystem_GetMediaId::ReturnValue' has a wrong offset!");

// Function LauncherSDK.LauncherSDKSubsystem.GetSafeZoneInfo
// 0x0010 (0x0010 - 0x0000)
struct LauncherSDKSubsystem_GetSafeZoneInfo final
{
public:
	TDelegate<void(int32 Code, const class FString& Data)> Handler;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LauncherSDKSubsystem_GetSafeZoneInfo) == 0x000004, "Wrong alignment on LauncherSDKSubsystem_GetSafeZoneInfo");
static_assert(sizeof(LauncherSDKSubsystem_GetSafeZoneInfo) == 0x000010, "Wrong size on LauncherSDKSubsystem_GetSafeZoneInfo");
static_assert(offsetof(LauncherSDKSubsystem_GetSafeZoneInfo, Handler) == 0x000000, "Member 'LauncherSDKSubsystem_GetSafeZoneInfo::Handler' has a wrong offset!");

// Function LauncherSDK.LauncherSDKSubsystem.GetUserDataPath
// 0x0018 (0x0018 - 0x0000)
struct LauncherSDKSubsystem_GetUserDataPath final
{
public:
	EUserPathType                                 PathType;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LauncherSDKSubsystem_GetUserDataPath) == 0x000008, "Wrong alignment on LauncherSDKSubsystem_GetUserDataPath");
static_assert(sizeof(LauncherSDKSubsystem_GetUserDataPath) == 0x000018, "Wrong size on LauncherSDKSubsystem_GetUserDataPath");
static_assert(offsetof(LauncherSDKSubsystem_GetUserDataPath, PathType) == 0x000000, "Member 'LauncherSDKSubsystem_GetUserDataPath::PathType' has a wrong offset!");
static_assert(offsetof(LauncherSDKSubsystem_GetUserDataPath, ReturnValue) == 0x000008, "Member 'LauncherSDKSubsystem_GetUserDataPath::ReturnValue' has a wrong offset!");

// Function LauncherSDK.LauncherSDKSubsystem.HasPartner
// 0x0001 (0x0001 - 0x0000)
struct LauncherSDKSubsystem_HasPartner final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LauncherSDKSubsystem_HasPartner) == 0x000001, "Wrong alignment on LauncherSDKSubsystem_HasPartner");
static_assert(sizeof(LauncherSDKSubsystem_HasPartner) == 0x000001, "Wrong size on LauncherSDKSubsystem_HasPartner");
static_assert(offsetof(LauncherSDKSubsystem_HasPartner, ReturnValue) == 0x000000, "Member 'LauncherSDKSubsystem_HasPartner::ReturnValue' has a wrong offset!");

// Function LauncherSDK.LauncherSDKSubsystem.HasPopupUI
// 0x0001 (0x0001 - 0x0000)
struct LauncherSDKSubsystem_HasPopupUI final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LauncherSDKSubsystem_HasPopupUI) == 0x000001, "Wrong alignment on LauncherSDKSubsystem_HasPopupUI");
static_assert(sizeof(LauncherSDKSubsystem_HasPopupUI) == 0x000001, "Wrong size on LauncherSDKSubsystem_HasPopupUI");
static_assert(offsetof(LauncherSDKSubsystem_HasPopupUI, ReturnValue) == 0x000000, "Member 'LauncherSDKSubsystem_HasPopupUI::ReturnValue' has a wrong offset!");

// Function LauncherSDK.LauncherSDKSubsystem.IMECustomMsgToCloudTerminal
// 0x0030 (0x0030 - 0x0000)
struct LauncherSDKSubsystem_IMECustomMsgToCloudTerminal final
{
public:
	int32                                         X;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Y;                                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Width;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Data;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 Code, const class FString& Data)> Handler;                                  // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LauncherSDKSubsystem_IMECustomMsgToCloudTerminal) == 0x000008, "Wrong alignment on LauncherSDKSubsystem_IMECustomMsgToCloudTerminal");
static_assert(sizeof(LauncherSDKSubsystem_IMECustomMsgToCloudTerminal) == 0x000030, "Wrong size on LauncherSDKSubsystem_IMECustomMsgToCloudTerminal");
static_assert(offsetof(LauncherSDKSubsystem_IMECustomMsgToCloudTerminal, X) == 0x000000, "Member 'LauncherSDKSubsystem_IMECustomMsgToCloudTerminal::X' has a wrong offset!");
static_assert(offsetof(LauncherSDKSubsystem_IMECustomMsgToCloudTerminal, Y) == 0x000004, "Member 'LauncherSDKSubsystem_IMECustomMsgToCloudTerminal::Y' has a wrong offset!");
static_assert(offsetof(LauncherSDKSubsystem_IMECustomMsgToCloudTerminal, Width) == 0x000008, "Member 'LauncherSDKSubsystem_IMECustomMsgToCloudTerminal::Width' has a wrong offset!");
static_assert(offsetof(LauncherSDKSubsystem_IMECustomMsgToCloudTerminal, Height) == 0x00000C, "Member 'LauncherSDKSubsystem_IMECustomMsgToCloudTerminal::Height' has a wrong offset!");
static_assert(offsetof(LauncherSDKSubsystem_IMECustomMsgToCloudTerminal, Data) == 0x000010, "Member 'LauncherSDKSubsystem_IMECustomMsgToCloudTerminal::Data' has a wrong offset!");
static_assert(offsetof(LauncherSDKSubsystem_IMECustomMsgToCloudTerminal, Handler) == 0x000020, "Member 'LauncherSDKSubsystem_IMECustomMsgToCloudTerminal::Handler' has a wrong offset!");

// Function LauncherSDK.LauncherSDKSubsystem.IMEWinMsgToCloudTerminal
// 0x0010 (0x0010 - 0x0000)
struct LauncherSDKSubsystem_IMEWinMsgToCloudTerminal final
{
public:
	int32                                         X;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Y;                                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Width;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LauncherSDKSubsystem_IMEWinMsgToCloudTerminal) == 0x000004, "Wrong alignment on LauncherSDKSubsystem_IMEWinMsgToCloudTerminal");
static_assert(sizeof(LauncherSDKSubsystem_IMEWinMsgToCloudTerminal) == 0x000010, "Wrong size on LauncherSDKSubsystem_IMEWinMsgToCloudTerminal");
static_assert(offsetof(LauncherSDKSubsystem_IMEWinMsgToCloudTerminal, X) == 0x000000, "Member 'LauncherSDKSubsystem_IMEWinMsgToCloudTerminal::X' has a wrong offset!");
static_assert(offsetof(LauncherSDKSubsystem_IMEWinMsgToCloudTerminal, Y) == 0x000004, "Member 'LauncherSDKSubsystem_IMEWinMsgToCloudTerminal::Y' has a wrong offset!");
static_assert(offsetof(LauncherSDKSubsystem_IMEWinMsgToCloudTerminal, Width) == 0x000008, "Member 'LauncherSDKSubsystem_IMEWinMsgToCloudTerminal::Width' has a wrong offset!");
static_assert(offsetof(LauncherSDKSubsystem_IMEWinMsgToCloudTerminal, Height) == 0x00000C, "Member 'LauncherSDKSubsystem_IMEWinMsgToCloudTerminal::Height' has a wrong offset!");

// Function LauncherSDK.LauncherSDKSubsystem.Init
// 0x0028 (0x0028 - 0x0000)
struct LauncherSDKSubsystem_Init final
{
public:
	class FString                                 AppID;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AppKey;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LauncherSDKSubsystem_Init) == 0x000008, "Wrong alignment on LauncherSDKSubsystem_Init");
static_assert(sizeof(LauncherSDKSubsystem_Init) == 0x000028, "Wrong size on LauncherSDKSubsystem_Init");
static_assert(offsetof(LauncherSDKSubsystem_Init, AppID) == 0x000000, "Member 'LauncherSDKSubsystem_Init::AppID' has a wrong offset!");
static_assert(offsetof(LauncherSDKSubsystem_Init, AppKey) == 0x000010, "Member 'LauncherSDKSubsystem_Init::AppKey' has a wrong offset!");
static_assert(offsetof(LauncherSDKSubsystem_Init, ReturnValue) == 0x000020, "Member 'LauncherSDKSubsystem_Init::ReturnValue' has a wrong offset!");

// Function LauncherSDK.LauncherSDKSubsystem.IsCloudGame
// 0x0001 (0x0001 - 0x0000)
struct LauncherSDKSubsystem_IsCloudGame final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LauncherSDKSubsystem_IsCloudGame) == 0x000001, "Wrong alignment on LauncherSDKSubsystem_IsCloudGame");
static_assert(sizeof(LauncherSDKSubsystem_IsCloudGame) == 0x000001, "Wrong size on LauncherSDKSubsystem_IsCloudGame");
static_assert(offsetof(LauncherSDKSubsystem_IsCloudGame, ReturnValue) == 0x000000, "Member 'LauncherSDKSubsystem_IsCloudGame::ReturnValue' has a wrong offset!");

// Function LauncherSDK.LauncherSDKSubsystem.IsFullscreen
// 0x0001 (0x0001 - 0x0000)
struct LauncherSDKSubsystem_IsFullscreen final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LauncherSDKSubsystem_IsFullscreen) == 0x000001, "Wrong alignment on LauncherSDKSubsystem_IsFullscreen");
static_assert(sizeof(LauncherSDKSubsystem_IsFullscreen) == 0x000001, "Wrong size on LauncherSDKSubsystem_IsFullscreen");
static_assert(offsetof(LauncherSDKSubsystem_IsFullscreen, ReturnValue) == 0x000000, "Member 'LauncherSDKSubsystem_IsFullscreen::ReturnValue' has a wrong offset!");

// Function LauncherSDK.LauncherSDKSubsystem.IsStartFromLauncher
// 0x0001 (0x0001 - 0x0000)
struct LauncherSDKSubsystem_IsStartFromLauncher final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LauncherSDKSubsystem_IsStartFromLauncher) == 0x000001, "Wrong alignment on LauncherSDKSubsystem_IsStartFromLauncher");
static_assert(sizeof(LauncherSDKSubsystem_IsStartFromLauncher) == 0x000001, "Wrong size on LauncherSDKSubsystem_IsStartFromLauncher");
static_assert(offsetof(LauncherSDKSubsystem_IsStartFromLauncher, ReturnValue) == 0x000000, "Member 'LauncherSDKSubsystem_IsStartFromLauncher::ReturnValue' has a wrong offset!");

// Function LauncherSDK.LauncherSDKSubsystem.Quit
// 0x0008 (0x0008 - 0x0000)
struct LauncherSDKSubsystem_Quit final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LauncherSDKSubsystem_Quit) == 0x000008, "Wrong alignment on LauncherSDKSubsystem_Quit");
static_assert(sizeof(LauncherSDKSubsystem_Quit) == 0x000008, "Wrong size on LauncherSDKSubsystem_Quit");
static_assert(offsetof(LauncherSDKSubsystem_Quit, ReturnValue) == 0x000000, "Member 'LauncherSDKSubsystem_Quit::ReturnValue' has a wrong offset!");

// Function LauncherSDK.LauncherSDKSubsystem.ReInstallGame
// 0x0001 (0x0001 - 0x0000)
struct LauncherSDKSubsystem_ReInstallGame final
{
public:
	bool                                          bShowWarning;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LauncherSDKSubsystem_ReInstallGame) == 0x000001, "Wrong alignment on LauncherSDKSubsystem_ReInstallGame");
static_assert(sizeof(LauncherSDKSubsystem_ReInstallGame) == 0x000001, "Wrong size on LauncherSDKSubsystem_ReInstallGame");
static_assert(offsetof(LauncherSDKSubsystem_ReInstallGame, bShowWarning) == 0x000000, "Member 'LauncherSDKSubsystem_ReInstallGame::bShowWarning' has a wrong offset!");

// Function LauncherSDK.LauncherSDKSubsystem.Restart
// 0x0010 (0x0010 - 0x0000)
struct LauncherSDKSubsystem_Restart final
{
public:
	bool                                          bForUpdateGame;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LauncherSDKSubsystem_Restart) == 0x000008, "Wrong alignment on LauncherSDKSubsystem_Restart");
static_assert(sizeof(LauncherSDKSubsystem_Restart) == 0x000010, "Wrong size on LauncherSDKSubsystem_Restart");
static_assert(offsetof(LauncherSDKSubsystem_Restart, bForUpdateGame) == 0x000000, "Member 'LauncherSDKSubsystem_Restart::bForUpdateGame' has a wrong offset!");
static_assert(offsetof(LauncherSDKSubsystem_Restart, ReturnValue) == 0x000008, "Member 'LauncherSDKSubsystem_Restart::ReturnValue' has a wrong offset!");

// Function LauncherSDK.LauncherSDKSubsystem.SetOrientation
// 0x0001 (0x0001 - 0x0000)
struct LauncherSDKSubsystem_SetOrientation final
{
public:
	EGameOrientation                              orientation;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LauncherSDKSubsystem_SetOrientation) == 0x000001, "Wrong alignment on LauncherSDKSubsystem_SetOrientation");
static_assert(sizeof(LauncherSDKSubsystem_SetOrientation) == 0x000001, "Wrong size on LauncherSDKSubsystem_SetOrientation");
static_assert(offsetof(LauncherSDKSubsystem_SetOrientation, orientation) == 0x000000, "Member 'LauncherSDKSubsystem_SetOrientation::orientation' has a wrong offset!");

// Function LauncherSDK.LauncherSDKSubsystem.ShowFullScreen
// 0x0001 (0x0001 - 0x0000)
struct LauncherSDKSubsystem_ShowFullScreen final
{
public:
	bool                                          bExclusive;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LauncherSDKSubsystem_ShowFullScreen) == 0x000001, "Wrong alignment on LauncherSDKSubsystem_ShowFullScreen");
static_assert(sizeof(LauncherSDKSubsystem_ShowFullScreen) == 0x000001, "Wrong size on LauncherSDKSubsystem_ShowFullScreen");
static_assert(offsetof(LauncherSDKSubsystem_ShowFullScreen, bExclusive) == 0x000000, "Member 'LauncherSDKSubsystem_ShowFullScreen::bExclusive' has a wrong offset!");

// Function LauncherSDK.LauncherSDKSubsystem.StartPlatform
// 0x0018 (0x0018 - 0x0000)
struct LauncherSDKSubsystem_StartPlatform final
{
public:
	class FString                                 Cmd;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LauncherSDKSubsystem_StartPlatform) == 0x000008, "Wrong alignment on LauncherSDKSubsystem_StartPlatform");
static_assert(sizeof(LauncherSDKSubsystem_StartPlatform) == 0x000018, "Wrong size on LauncherSDKSubsystem_StartPlatform");
static_assert(offsetof(LauncherSDKSubsystem_StartPlatform, Cmd) == 0x000000, "Member 'LauncherSDKSubsystem_StartPlatform::Cmd' has a wrong offset!");
static_assert(offsetof(LauncherSDKSubsystem_StartPlatform, ReturnValue) == 0x000010, "Member 'LauncherSDKSubsystem_StartPlatform::ReturnValue' has a wrong offset!");

// Function LauncherSDK.LauncherSDKSubsystem.TaskbarIsBlinking
// 0x0001 (0x0001 - 0x0000)
struct LauncherSDKSubsystem_TaskbarIsBlinking final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LauncherSDKSubsystem_TaskbarIsBlinking) == 0x000001, "Wrong alignment on LauncherSDKSubsystem_TaskbarIsBlinking");
static_assert(sizeof(LauncherSDKSubsystem_TaskbarIsBlinking) == 0x000001, "Wrong size on LauncherSDKSubsystem_TaskbarIsBlinking");
static_assert(offsetof(LauncherSDKSubsystem_TaskbarIsBlinking, ReturnValue) == 0x000000, "Member 'LauncherSDKSubsystem_TaskbarIsBlinking::ReturnValue' has a wrong offset!");

// Function LauncherSDK.LauncherSDKSubsystem.TrackEvent
// 0x0060 (0x0060 - 0x0000)
struct LauncherSDKSubsystem_TrackEvent final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Info;                                              // 0x0010(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(LauncherSDKSubsystem_TrackEvent) == 0x000008, "Wrong alignment on LauncherSDKSubsystem_TrackEvent");
static_assert(sizeof(LauncherSDKSubsystem_TrackEvent) == 0x000060, "Wrong size on LauncherSDKSubsystem_TrackEvent");
static_assert(offsetof(LauncherSDKSubsystem_TrackEvent, EventName) == 0x000000, "Member 'LauncherSDKSubsystem_TrackEvent::EventName' has a wrong offset!");
static_assert(offsetof(LauncherSDKSubsystem_TrackEvent, Info) == 0x000010, "Member 'LauncherSDKSubsystem_TrackEvent::Info' has a wrong offset!");

}

