#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LevelSequence

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.ClearFavoriteRating
// 0x0008 (0x0008 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_ClearFavoriteRating final
{
public:
	class ULevelSequence*                         InLevelSequence;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_ClearFavoriteRating) == 0x000008, "Wrong alignment on LevelSequenceShotMetaDataLibrary_ClearFavoriteRating");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_ClearFavoriteRating) == 0x000008, "Wrong size on LevelSequenceShotMetaDataLibrary_ClearFavoriteRating");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_ClearFavoriteRating, InLevelSequence) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_ClearFavoriteRating::InLevelSequence' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.ClearIsFlagged
// 0x0008 (0x0008 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_ClearIsFlagged final
{
public:
	class ULevelSequence*                         InLevelSequence;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_ClearIsFlagged) == 0x000008, "Wrong alignment on LevelSequenceShotMetaDataLibrary_ClearIsFlagged");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_ClearIsFlagged) == 0x000008, "Wrong size on LevelSequenceShotMetaDataLibrary_ClearIsFlagged");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_ClearIsFlagged, InLevelSequence) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_ClearIsFlagged::InLevelSequence' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.ClearIsNoGood
// 0x0008 (0x0008 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_ClearIsNoGood final
{
public:
	class ULevelSequence*                         InLevelSequence;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_ClearIsNoGood) == 0x000008, "Wrong alignment on LevelSequenceShotMetaDataLibrary_ClearIsNoGood");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_ClearIsNoGood) == 0x000008, "Wrong size on LevelSequenceShotMetaDataLibrary_ClearIsNoGood");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_ClearIsNoGood, InLevelSequence) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_ClearIsNoGood::InLevelSequence' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.ClearIsRecorded
// 0x0008 (0x0008 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_ClearIsRecorded final
{
public:
	class ULevelSequence*                         InLevelSequence;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_ClearIsRecorded) == 0x000008, "Wrong alignment on LevelSequenceShotMetaDataLibrary_ClearIsRecorded");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_ClearIsRecorded) == 0x000008, "Wrong size on LevelSequenceShotMetaDataLibrary_ClearIsRecorded");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_ClearIsRecorded, InLevelSequence) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_ClearIsRecorded::InLevelSequence' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.ClearIsSubSequence
// 0x0008 (0x0008 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_ClearIsSubSequence final
{
public:
	class ULevelSequence*                         InLevelSequence;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_ClearIsSubSequence) == 0x000008, "Wrong alignment on LevelSequenceShotMetaDataLibrary_ClearIsSubSequence");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_ClearIsSubSequence) == 0x000008, "Wrong size on LevelSequenceShotMetaDataLibrary_ClearIsSubSequence");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_ClearIsSubSequence, InLevelSequence) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_ClearIsSubSequence::InLevelSequence' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.GetFavoriteRating
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_GetFavoriteRating final
{
public:
	const class ULevelSequence*                   InLevelSequence;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutFavoriteRating;                                 // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_GetFavoriteRating) == 0x000008, "Wrong alignment on LevelSequenceShotMetaDataLibrary_GetFavoriteRating");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_GetFavoriteRating) == 0x000010, "Wrong size on LevelSequenceShotMetaDataLibrary_GetFavoriteRating");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetFavoriteRating, InLevelSequence) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_GetFavoriteRating::InLevelSequence' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetFavoriteRating, OutFavoriteRating) == 0x000008, "Member 'LevelSequenceShotMetaDataLibrary_GetFavoriteRating::OutFavoriteRating' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetFavoriteRating, ReturnValue) == 0x00000C, "Member 'LevelSequenceShotMetaDataLibrary_GetFavoriteRating::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.GetFavoriteRatingAssetTag
// 0x0008 (0x0008 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_GetFavoriteRatingAssetTag final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_GetFavoriteRatingAssetTag) == 0x000004, "Wrong alignment on LevelSequenceShotMetaDataLibrary_GetFavoriteRatingAssetTag");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_GetFavoriteRatingAssetTag) == 0x000008, "Wrong size on LevelSequenceShotMetaDataLibrary_GetFavoriteRatingAssetTag");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetFavoriteRatingAssetTag, ReturnValue) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_GetFavoriteRatingAssetTag::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.GetFavoriteRatingByAssetData
// 0x0070 (0x0070 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_GetFavoriteRatingByAssetData final
{
public:
	struct FAssetData                             InAssetData;                                       // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutFavoriteRating;                                 // 0x0068(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x006C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_GetFavoriteRatingByAssetData) == 0x000004, "Wrong alignment on LevelSequenceShotMetaDataLibrary_GetFavoriteRatingByAssetData");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_GetFavoriteRatingByAssetData) == 0x000070, "Wrong size on LevelSequenceShotMetaDataLibrary_GetFavoriteRatingByAssetData");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetFavoriteRatingByAssetData, InAssetData) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_GetFavoriteRatingByAssetData::InAssetData' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetFavoriteRatingByAssetData, OutFavoriteRating) == 0x000068, "Member 'LevelSequenceShotMetaDataLibrary_GetFavoriteRatingByAssetData::OutFavoriteRating' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetFavoriteRatingByAssetData, ReturnValue) == 0x00006C, "Member 'LevelSequenceShotMetaDataLibrary_GetFavoriteRatingByAssetData::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.GetIsFlagged
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_GetIsFlagged final
{
public:
	const class ULevelSequence*                   InLevelSequence;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutIsFlagged;                                     // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_GetIsFlagged) == 0x000008, "Wrong alignment on LevelSequenceShotMetaDataLibrary_GetIsFlagged");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_GetIsFlagged) == 0x000010, "Wrong size on LevelSequenceShotMetaDataLibrary_GetIsFlagged");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsFlagged, InLevelSequence) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_GetIsFlagged::InLevelSequence' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsFlagged, bOutIsFlagged) == 0x000008, "Member 'LevelSequenceShotMetaDataLibrary_GetIsFlagged::bOutIsFlagged' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsFlagged, ReturnValue) == 0x000009, "Member 'LevelSequenceShotMetaDataLibrary_GetIsFlagged::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.GetIsFlaggedAssetTag
// 0x0008 (0x0008 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_GetIsFlaggedAssetTag final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_GetIsFlaggedAssetTag) == 0x000004, "Wrong alignment on LevelSequenceShotMetaDataLibrary_GetIsFlaggedAssetTag");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_GetIsFlaggedAssetTag) == 0x000008, "Wrong size on LevelSequenceShotMetaDataLibrary_GetIsFlaggedAssetTag");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsFlaggedAssetTag, ReturnValue) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_GetIsFlaggedAssetTag::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.GetIsFlaggedByAssetData
// 0x0070 (0x0070 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_GetIsFlaggedByAssetData final
{
public:
	struct FAssetData                             InAssetData;                                       // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutIsFlagged;                                     // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0069(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_GetIsFlaggedByAssetData) == 0x000001, "Wrong alignment on LevelSequenceShotMetaDataLibrary_GetIsFlaggedByAssetData");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_GetIsFlaggedByAssetData) == 0x000070, "Wrong size on LevelSequenceShotMetaDataLibrary_GetIsFlaggedByAssetData");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsFlaggedByAssetData, InAssetData) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_GetIsFlaggedByAssetData::InAssetData' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsFlaggedByAssetData, bOutIsFlagged) == 0x000068, "Member 'LevelSequenceShotMetaDataLibrary_GetIsFlaggedByAssetData::bOutIsFlagged' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsFlaggedByAssetData, ReturnValue) == 0x000069, "Member 'LevelSequenceShotMetaDataLibrary_GetIsFlaggedByAssetData::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.GetIsNoGood
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_GetIsNoGood final
{
public:
	const class ULevelSequence*                   InLevelSequence;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutNoGood;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_GetIsNoGood) == 0x000008, "Wrong alignment on LevelSequenceShotMetaDataLibrary_GetIsNoGood");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_GetIsNoGood) == 0x000010, "Wrong size on LevelSequenceShotMetaDataLibrary_GetIsNoGood");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsNoGood, InLevelSequence) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_GetIsNoGood::InLevelSequence' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsNoGood, bOutNoGood) == 0x000008, "Member 'LevelSequenceShotMetaDataLibrary_GetIsNoGood::bOutNoGood' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsNoGood, ReturnValue) == 0x000009, "Member 'LevelSequenceShotMetaDataLibrary_GetIsNoGood::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.GetIsNoGoodAssetTag
// 0x0008 (0x0008 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_GetIsNoGoodAssetTag final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_GetIsNoGoodAssetTag) == 0x000004, "Wrong alignment on LevelSequenceShotMetaDataLibrary_GetIsNoGoodAssetTag");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_GetIsNoGoodAssetTag) == 0x000008, "Wrong size on LevelSequenceShotMetaDataLibrary_GetIsNoGoodAssetTag");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsNoGoodAssetTag, ReturnValue) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_GetIsNoGoodAssetTag::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.GetIsNoGoodByAssetData
// 0x0070 (0x0070 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_GetIsNoGoodByAssetData final
{
public:
	struct FAssetData                             InAssetData;                                       // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutNoGood;                                        // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0069(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_GetIsNoGoodByAssetData) == 0x000001, "Wrong alignment on LevelSequenceShotMetaDataLibrary_GetIsNoGoodByAssetData");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_GetIsNoGoodByAssetData) == 0x000070, "Wrong size on LevelSequenceShotMetaDataLibrary_GetIsNoGoodByAssetData");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsNoGoodByAssetData, InAssetData) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_GetIsNoGoodByAssetData::InAssetData' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsNoGoodByAssetData, bOutNoGood) == 0x000068, "Member 'LevelSequenceShotMetaDataLibrary_GetIsNoGoodByAssetData::bOutNoGood' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsNoGoodByAssetData, ReturnValue) == 0x000069, "Member 'LevelSequenceShotMetaDataLibrary_GetIsNoGoodByAssetData::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.GetIsRecorded
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_GetIsRecorded final
{
public:
	const class ULevelSequence*                   InLevelSequence;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutIsRecorded;                                    // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_GetIsRecorded) == 0x000008, "Wrong alignment on LevelSequenceShotMetaDataLibrary_GetIsRecorded");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_GetIsRecorded) == 0x000010, "Wrong size on LevelSequenceShotMetaDataLibrary_GetIsRecorded");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsRecorded, InLevelSequence) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_GetIsRecorded::InLevelSequence' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsRecorded, bOutIsRecorded) == 0x000008, "Member 'LevelSequenceShotMetaDataLibrary_GetIsRecorded::bOutIsRecorded' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsRecorded, ReturnValue) == 0x000009, "Member 'LevelSequenceShotMetaDataLibrary_GetIsRecorded::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.GetIsRecordedAssetTag
// 0x0008 (0x0008 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_GetIsRecordedAssetTag final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_GetIsRecordedAssetTag) == 0x000004, "Wrong alignment on LevelSequenceShotMetaDataLibrary_GetIsRecordedAssetTag");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_GetIsRecordedAssetTag) == 0x000008, "Wrong size on LevelSequenceShotMetaDataLibrary_GetIsRecordedAssetTag");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsRecordedAssetTag, ReturnValue) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_GetIsRecordedAssetTag::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.GetIsRecordedByAssetData
// 0x0070 (0x0070 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_GetIsRecordedByAssetData final
{
public:
	struct FAssetData                             InAssetData;                                       // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutIsRecorded;                                    // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0069(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_GetIsRecordedByAssetData) == 0x000001, "Wrong alignment on LevelSequenceShotMetaDataLibrary_GetIsRecordedByAssetData");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_GetIsRecordedByAssetData) == 0x000070, "Wrong size on LevelSequenceShotMetaDataLibrary_GetIsRecordedByAssetData");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsRecordedByAssetData, InAssetData) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_GetIsRecordedByAssetData::InAssetData' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsRecordedByAssetData, bOutIsRecorded) == 0x000068, "Member 'LevelSequenceShotMetaDataLibrary_GetIsRecordedByAssetData::bOutIsRecorded' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsRecordedByAssetData, ReturnValue) == 0x000069, "Member 'LevelSequenceShotMetaDataLibrary_GetIsRecordedByAssetData::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.GetIsSubSequence
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_GetIsSubSequence final
{
public:
	const class ULevelSequence*                   InLevelSequence;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutIsSubSequence;                                 // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_GetIsSubSequence) == 0x000008, "Wrong alignment on LevelSequenceShotMetaDataLibrary_GetIsSubSequence");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_GetIsSubSequence) == 0x000010, "Wrong size on LevelSequenceShotMetaDataLibrary_GetIsSubSequence");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsSubSequence, InLevelSequence) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_GetIsSubSequence::InLevelSequence' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsSubSequence, bOutIsSubSequence) == 0x000008, "Member 'LevelSequenceShotMetaDataLibrary_GetIsSubSequence::bOutIsSubSequence' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsSubSequence, ReturnValue) == 0x000009, "Member 'LevelSequenceShotMetaDataLibrary_GetIsSubSequence::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.GetIsSubSequenceAssetTag
// 0x0008 (0x0008 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_GetIsSubSequenceAssetTag final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_GetIsSubSequenceAssetTag) == 0x000004, "Wrong alignment on LevelSequenceShotMetaDataLibrary_GetIsSubSequenceAssetTag");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_GetIsSubSequenceAssetTag) == 0x000008, "Wrong size on LevelSequenceShotMetaDataLibrary_GetIsSubSequenceAssetTag");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsSubSequenceAssetTag, ReturnValue) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_GetIsSubSequenceAssetTag::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.GetIsSubSequenceByAssetData
// 0x0070 (0x0070 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_GetIsSubSequenceByAssetData final
{
public:
	struct FAssetData                             InAssetData;                                       // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutIsSubSequence;                                 // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0069(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_GetIsSubSequenceByAssetData) == 0x000001, "Wrong alignment on LevelSequenceShotMetaDataLibrary_GetIsSubSequenceByAssetData");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_GetIsSubSequenceByAssetData) == 0x000070, "Wrong size on LevelSequenceShotMetaDataLibrary_GetIsSubSequenceByAssetData");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsSubSequenceByAssetData, InAssetData) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_GetIsSubSequenceByAssetData::InAssetData' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsSubSequenceByAssetData, bOutIsSubSequence) == 0x000068, "Member 'LevelSequenceShotMetaDataLibrary_GetIsSubSequenceByAssetData::bOutIsSubSequence' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_GetIsSubSequenceByAssetData, ReturnValue) == 0x000069, "Member 'LevelSequenceShotMetaDataLibrary_GetIsSubSequenceByAssetData::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.HasFavoriteRating
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_HasFavoriteRating final
{
public:
	const class ULevelSequence*                   InLevelSequence;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_HasFavoriteRating) == 0x000008, "Wrong alignment on LevelSequenceShotMetaDataLibrary_HasFavoriteRating");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_HasFavoriteRating) == 0x000010, "Wrong size on LevelSequenceShotMetaDataLibrary_HasFavoriteRating");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_HasFavoriteRating, InLevelSequence) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_HasFavoriteRating::InLevelSequence' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_HasFavoriteRating, ReturnValue) == 0x000008, "Member 'LevelSequenceShotMetaDataLibrary_HasFavoriteRating::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.HasFavoriteRatingByAssetData
// 0x0070 (0x0070 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_HasFavoriteRatingByAssetData final
{
public:
	struct FAssetData                             InAssetData;                                       // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_HasFavoriteRatingByAssetData) == 0x000001, "Wrong alignment on LevelSequenceShotMetaDataLibrary_HasFavoriteRatingByAssetData");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_HasFavoriteRatingByAssetData) == 0x000070, "Wrong size on LevelSequenceShotMetaDataLibrary_HasFavoriteRatingByAssetData");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_HasFavoriteRatingByAssetData, InAssetData) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_HasFavoriteRatingByAssetData::InAssetData' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_HasFavoriteRatingByAssetData, ReturnValue) == 0x000068, "Member 'LevelSequenceShotMetaDataLibrary_HasFavoriteRatingByAssetData::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.HasIsFlagged
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_HasIsFlagged final
{
public:
	const class ULevelSequence*                   InLevelSequence;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_HasIsFlagged) == 0x000008, "Wrong alignment on LevelSequenceShotMetaDataLibrary_HasIsFlagged");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_HasIsFlagged) == 0x000010, "Wrong size on LevelSequenceShotMetaDataLibrary_HasIsFlagged");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_HasIsFlagged, InLevelSequence) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_HasIsFlagged::InLevelSequence' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_HasIsFlagged, ReturnValue) == 0x000008, "Member 'LevelSequenceShotMetaDataLibrary_HasIsFlagged::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.HasIsFlaggedByAssetData
// 0x0070 (0x0070 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_HasIsFlaggedByAssetData final
{
public:
	struct FAssetData                             InAssetData;                                       // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_HasIsFlaggedByAssetData) == 0x000001, "Wrong alignment on LevelSequenceShotMetaDataLibrary_HasIsFlaggedByAssetData");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_HasIsFlaggedByAssetData) == 0x000070, "Wrong size on LevelSequenceShotMetaDataLibrary_HasIsFlaggedByAssetData");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_HasIsFlaggedByAssetData, InAssetData) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_HasIsFlaggedByAssetData::InAssetData' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_HasIsFlaggedByAssetData, ReturnValue) == 0x000068, "Member 'LevelSequenceShotMetaDataLibrary_HasIsFlaggedByAssetData::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.HasIsNoGood
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_HasIsNoGood final
{
public:
	const class ULevelSequence*                   InLevelSequence;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_HasIsNoGood) == 0x000008, "Wrong alignment on LevelSequenceShotMetaDataLibrary_HasIsNoGood");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_HasIsNoGood) == 0x000010, "Wrong size on LevelSequenceShotMetaDataLibrary_HasIsNoGood");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_HasIsNoGood, InLevelSequence) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_HasIsNoGood::InLevelSequence' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_HasIsNoGood, ReturnValue) == 0x000008, "Member 'LevelSequenceShotMetaDataLibrary_HasIsNoGood::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.HasIsNoGoodByAssetData
// 0x0070 (0x0070 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_HasIsNoGoodByAssetData final
{
public:
	struct FAssetData                             InAssetData;                                       // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_HasIsNoGoodByAssetData) == 0x000001, "Wrong alignment on LevelSequenceShotMetaDataLibrary_HasIsNoGoodByAssetData");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_HasIsNoGoodByAssetData) == 0x000070, "Wrong size on LevelSequenceShotMetaDataLibrary_HasIsNoGoodByAssetData");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_HasIsNoGoodByAssetData, InAssetData) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_HasIsNoGoodByAssetData::InAssetData' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_HasIsNoGoodByAssetData, ReturnValue) == 0x000068, "Member 'LevelSequenceShotMetaDataLibrary_HasIsNoGoodByAssetData::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.HasIsRecorded
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_HasIsRecorded final
{
public:
	const class ULevelSequence*                   InLevelSequence;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_HasIsRecorded) == 0x000008, "Wrong alignment on LevelSequenceShotMetaDataLibrary_HasIsRecorded");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_HasIsRecorded) == 0x000010, "Wrong size on LevelSequenceShotMetaDataLibrary_HasIsRecorded");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_HasIsRecorded, InLevelSequence) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_HasIsRecorded::InLevelSequence' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_HasIsRecorded, ReturnValue) == 0x000008, "Member 'LevelSequenceShotMetaDataLibrary_HasIsRecorded::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.HasIsRecordedByAssetData
// 0x0070 (0x0070 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_HasIsRecordedByAssetData final
{
public:
	struct FAssetData                             InAssetData;                                       // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_HasIsRecordedByAssetData) == 0x000001, "Wrong alignment on LevelSequenceShotMetaDataLibrary_HasIsRecordedByAssetData");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_HasIsRecordedByAssetData) == 0x000070, "Wrong size on LevelSequenceShotMetaDataLibrary_HasIsRecordedByAssetData");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_HasIsRecordedByAssetData, InAssetData) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_HasIsRecordedByAssetData::InAssetData' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_HasIsRecordedByAssetData, ReturnValue) == 0x000068, "Member 'LevelSequenceShotMetaDataLibrary_HasIsRecordedByAssetData::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.HasIsSubSequence
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_HasIsSubSequence final
{
public:
	const class ULevelSequence*                   InLevelSequence;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_HasIsSubSequence) == 0x000008, "Wrong alignment on LevelSequenceShotMetaDataLibrary_HasIsSubSequence");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_HasIsSubSequence) == 0x000010, "Wrong size on LevelSequenceShotMetaDataLibrary_HasIsSubSequence");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_HasIsSubSequence, InLevelSequence) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_HasIsSubSequence::InLevelSequence' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_HasIsSubSequence, ReturnValue) == 0x000008, "Member 'LevelSequenceShotMetaDataLibrary_HasIsSubSequence::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.HasIsSubSequenceByAssetData
// 0x0070 (0x0070 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_HasIsSubSequenceByAssetData final
{
public:
	struct FAssetData                             InAssetData;                                       // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_HasIsSubSequenceByAssetData) == 0x000001, "Wrong alignment on LevelSequenceShotMetaDataLibrary_HasIsSubSequenceByAssetData");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_HasIsSubSequenceByAssetData) == 0x000070, "Wrong size on LevelSequenceShotMetaDataLibrary_HasIsSubSequenceByAssetData");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_HasIsSubSequenceByAssetData, InAssetData) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_HasIsSubSequenceByAssetData::InAssetData' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_HasIsSubSequenceByAssetData, ReturnValue) == 0x000068, "Member 'LevelSequenceShotMetaDataLibrary_HasIsSubSequenceByAssetData::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.SetFavoriteRating
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_SetFavoriteRating final
{
public:
	class ULevelSequence*                         InLevelSequence;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InFavoriteRating;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_SetFavoriteRating) == 0x000008, "Wrong alignment on LevelSequenceShotMetaDataLibrary_SetFavoriteRating");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_SetFavoriteRating) == 0x000010, "Wrong size on LevelSequenceShotMetaDataLibrary_SetFavoriteRating");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_SetFavoriteRating, InLevelSequence) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_SetFavoriteRating::InLevelSequence' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_SetFavoriteRating, InFavoriteRating) == 0x000008, "Member 'LevelSequenceShotMetaDataLibrary_SetFavoriteRating::InFavoriteRating' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.SetIsFlagged
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_SetIsFlagged final
{
public:
	class ULevelSequence*                         InLevelSequence;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInIsFlagged;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_SetIsFlagged) == 0x000008, "Wrong alignment on LevelSequenceShotMetaDataLibrary_SetIsFlagged");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_SetIsFlagged) == 0x000010, "Wrong size on LevelSequenceShotMetaDataLibrary_SetIsFlagged");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_SetIsFlagged, InLevelSequence) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_SetIsFlagged::InLevelSequence' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_SetIsFlagged, bInIsFlagged) == 0x000008, "Member 'LevelSequenceShotMetaDataLibrary_SetIsFlagged::bInIsFlagged' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.SetIsNoGood
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_SetIsNoGood final
{
public:
	class ULevelSequence*                         InLevelSequence;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInIsNoGood;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_SetIsNoGood) == 0x000008, "Wrong alignment on LevelSequenceShotMetaDataLibrary_SetIsNoGood");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_SetIsNoGood) == 0x000010, "Wrong size on LevelSequenceShotMetaDataLibrary_SetIsNoGood");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_SetIsNoGood, InLevelSequence) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_SetIsNoGood::InLevelSequence' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_SetIsNoGood, bInIsNoGood) == 0x000008, "Member 'LevelSequenceShotMetaDataLibrary_SetIsNoGood::bInIsNoGood' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.SetIsRecorded
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_SetIsRecorded final
{
public:
	class ULevelSequence*                         InLevelSequence;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInIsRecorded;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_SetIsRecorded) == 0x000008, "Wrong alignment on LevelSequenceShotMetaDataLibrary_SetIsRecorded");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_SetIsRecorded) == 0x000010, "Wrong size on LevelSequenceShotMetaDataLibrary_SetIsRecorded");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_SetIsRecorded, InLevelSequence) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_SetIsRecorded::InLevelSequence' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_SetIsRecorded, bInIsRecorded) == 0x000008, "Member 'LevelSequenceShotMetaDataLibrary_SetIsRecorded::bInIsRecorded' has a wrong offset!");

// Function LevelSequence.LevelSequenceShotMetaDataLibrary.SetIsSubSequence
// 0x0010 (0x0010 - 0x0000)
struct LevelSequenceShotMetaDataLibrary_SetIsSubSequence final
{
public:
	class ULevelSequence*                         InLevelSequence;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInIsSubSequence;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceShotMetaDataLibrary_SetIsSubSequence) == 0x000008, "Wrong alignment on LevelSequenceShotMetaDataLibrary_SetIsSubSequence");
static_assert(sizeof(LevelSequenceShotMetaDataLibrary_SetIsSubSequence) == 0x000010, "Wrong size on LevelSequenceShotMetaDataLibrary_SetIsSubSequence");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_SetIsSubSequence, InLevelSequence) == 0x000000, "Member 'LevelSequenceShotMetaDataLibrary_SetIsSubSequence::InLevelSequence' has a wrong offset!");
static_assert(offsetof(LevelSequenceShotMetaDataLibrary_SetIsSubSequence, bInIsSubSequence) == 0x000008, "Member 'LevelSequenceShotMetaDataLibrary_SetIsSubSequence::bInIsSubSequence' has a wrong offset!");

// Function LevelSequence.LevelSequence.CopyMetaData
// 0x0010 (0x0010 - 0x0000)
struct LevelSequence_CopyMetaData final
{
public:
	class UObject*                                InMetaData;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequence_CopyMetaData) == 0x000008, "Wrong alignment on LevelSequence_CopyMetaData");
static_assert(sizeof(LevelSequence_CopyMetaData) == 0x000010, "Wrong size on LevelSequence_CopyMetaData");
static_assert(offsetof(LevelSequence_CopyMetaData, InMetaData) == 0x000000, "Member 'LevelSequence_CopyMetaData::InMetaData' has a wrong offset!");
static_assert(offsetof(LevelSequence_CopyMetaData, ReturnValue) == 0x000008, "Member 'LevelSequence_CopyMetaData::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequence.FindOrAddMetaDataByClass
// 0x0010 (0x0010 - 0x0000)
struct LevelSequence_FindOrAddMetaDataByClass final
{
public:
	TSubclassOf<class UObject>                    InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequence_FindOrAddMetaDataByClass) == 0x000008, "Wrong alignment on LevelSequence_FindOrAddMetaDataByClass");
static_assert(sizeof(LevelSequence_FindOrAddMetaDataByClass) == 0x000010, "Wrong size on LevelSequence_FindOrAddMetaDataByClass");
static_assert(offsetof(LevelSequence_FindOrAddMetaDataByClass, InClass) == 0x000000, "Member 'LevelSequence_FindOrAddMetaDataByClass::InClass' has a wrong offset!");
static_assert(offsetof(LevelSequence_FindOrAddMetaDataByClass, ReturnValue) == 0x000008, "Member 'LevelSequence_FindOrAddMetaDataByClass::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequence.RemoveMetaDataByClass
// 0x0008 (0x0008 - 0x0000)
struct LevelSequence_RemoveMetaDataByClass final
{
public:
	TSubclassOf<class UObject>                    InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequence_RemoveMetaDataByClass) == 0x000008, "Wrong alignment on LevelSequence_RemoveMetaDataByClass");
static_assert(sizeof(LevelSequence_RemoveMetaDataByClass) == 0x000008, "Wrong size on LevelSequence_RemoveMetaDataByClass");
static_assert(offsetof(LevelSequence_RemoveMetaDataByClass, InClass) == 0x000000, "Member 'LevelSequence_RemoveMetaDataByClass::InClass' has a wrong offset!");

// Function LevelSequence.LevelSequence.FindMetaDataByClass
// 0x0010 (0x0010 - 0x0000)
struct LevelSequence_FindMetaDataByClass final
{
public:
	TSubclassOf<class UObject>                    InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequence_FindMetaDataByClass) == 0x000008, "Wrong alignment on LevelSequence_FindMetaDataByClass");
static_assert(sizeof(LevelSequence_FindMetaDataByClass) == 0x000010, "Wrong size on LevelSequence_FindMetaDataByClass");
static_assert(offsetof(LevelSequence_FindMetaDataByClass, InClass) == 0x000000, "Member 'LevelSequence_FindMetaDataByClass::InClass' has a wrong offset!");
static_assert(offsetof(LevelSequence_FindMetaDataByClass, ReturnValue) == 0x000008, "Member 'LevelSequence_FindMetaDataByClass::ReturnValue' has a wrong offset!");

// Function LevelSequence.LevelSequenceBurnInOptions.SetBurnIn
// 0x0020 (0x0020 - 0x0000)
struct LevelSequenceBurnInOptions_SetBurnIn final
{
public:
	struct FSoftClassPath                         InBurnInClass;                                     // 0x0000(0x0020)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LevelSequenceBurnInOptions_SetBurnIn) == 0x000001, "Wrong alignment on LevelSequenceBurnInOptions_SetBurnIn");
static_assert(sizeof(LevelSequenceBurnInOptions_SetBurnIn) == 0x000020, "Wrong size on LevelSequenceBurnInOptions_SetBurnIn");
static_assert(offsetof(LevelSequenceBurnInOptions_SetBurnIn, InBurnInClass) == 0x000000, "Member 'LevelSequenceBurnInOptions_SetBurnIn::InBurnInClass' has a wrong offset!");

// Function LevelSequence.LevelSequenceActor.AddBinding
// 0x0028 (0x0028 - 0x0000)
struct LevelSequenceActor_AddBinding final
{
public:
	struct FMovieSceneObjectBindingID             Binding;                                           // 0x0000(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Actor;                                             // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowBindingsFromAsset;                           // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceActor_AddBinding) == 0x000008, "Wrong alignment on LevelSequenceActor_AddBinding");
static_assert(sizeof(LevelSequenceActor_AddBinding) == 0x000028, "Wrong size on LevelSequenceActor_AddBinding");
static_assert(offsetof(LevelSequenceActor_AddBinding, Binding) == 0x000000, "Member 'LevelSequenceActor_AddBinding::Binding' has a wrong offset!");
static_assert(offsetof(LevelSequenceActor_AddBinding, Actor) == 0x000018, "Member 'LevelSequenceActor_AddBinding::Actor' has a wrong offset!");
static_assert(offsetof(LevelSequenceActor_AddBinding, bAllowBindingsFromAsset) == 0x000020, "Member 'LevelSequenceActor_AddBinding::bAllowBindingsFromAsset' has a wrong offset!");

// Function LevelSequence.LevelSequenceActor.AddBindingByTag
// 0x0018 (0x0018 - 0x0000)
struct LevelSequenceActor_AddBindingByTag final
{
public:
	class FName                                   BindingTag;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowBindingsFromAsset;                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LevelSequenceActor_AddBindingByTag) == 0x000008, "Wrong alignment on LevelSequenceActor_AddBindingByTag");
static_assert(sizeof(LevelSequenceActor_AddBindingByTag) == 0x000018, "Wrong size on LevelSequenceActor_AddBindingByTag");
