#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoginPlayerAnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct LoginPlayerAnimBlueprint.LoginPlayerAnimBlueprint_C.AnimBlueprintGeneratedConstantData
// 0x029F (0x02A0 - 0x0001)
struct LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_43;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_44;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_45;                                  // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_46;                                 // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_47;                                // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_48;                               // 0x0020(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_49;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_50;                                 // 0x0050(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_51;                                 // 0x0051(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_52;                                 // 0x0052(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_53;                                 // 0x0054(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_54;                                 // 0x005C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_55;                                 // 0x0064(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_56;                                  // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_57;                               // 0x0070(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0090(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0110(0x0040)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0150(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;               // 0x0180(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x01B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                  // 0x01E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x0210(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x0240(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x0270(0x0030)()
};
static_assert(alignof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000004, "Wrong alignment on LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x0002A0, "Wrong size on LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_43) == 0x000004, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_43' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_44) == 0x00000C, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_44' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_45) == 0x000014, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_45' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, __BoolProperty_46) == 0x000018, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::__BoolProperty_46' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_47) == 0x00001C, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_47' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_48) == 0x000020, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_48' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, __FloatProperty_49) == 0x00004C, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::__FloatProperty_49' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_50) == 0x000050, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_50' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, __BoolProperty_51) == 0x000051, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::__BoolProperty_51' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, __ByteProperty_52) == 0x000052, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::__ByteProperty_52' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_53) == 0x000054, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_53' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_54) == 0x00005C, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_54' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_55) == 0x000064, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_55' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, __IntProperty_56) == 0x00006C, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::__IntProperty_56' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_57) == 0x000070, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_57' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000090, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000110, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000150, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x000180, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x0001B0, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x0001E0, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000210, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000240, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000270, "Member 'LoginPlayerAnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");

}

