#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoginPlayerAnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass LoginPlayerAnimBlueprint.LoginPlayerAnimBlueprint_C
// 0x0200 (0x05E8 - 0x03E8)
class ULoginPlayerAnimBlueprint_C : public UAnimInstance
{
public:
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03F0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03F8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0400(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0420(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0448(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0490(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x04B0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x04F8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0518(0x00C8)()
	bool                                          Open;                                              // 0x05E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoginPlayerAnimBlueprint_C">();
	}
	static class ULoginPlayerAnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoginPlayerAnimBlueprint_C>();
	}
};
static_assert(alignof(ULoginPlayerAnimBlueprint_C) == 0x000008, "Wrong alignment on ULoginPlayerAnimBlueprint_C");
static_assert(sizeof(ULoginPlayerAnimBlueprint_C) == 0x0005E8, "Wrong size on ULoginPlayerAnimBlueprint_C");
static_assert(offsetof(ULoginPlayerAnimBlueprint_C, AnimBlueprintExtension_PropertyAccess) == 0x0003F0, "Member 'ULoginPlayerAnimBlueprint_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ULoginPlayerAnimBlueprint_C, AnimBlueprintExtension_Base) == 0x0003F8, "Member 'ULoginPlayerAnimBlueprint_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ULoginPlayerAnimBlueprint_C, AnimGraphNode_Root) == 0x000400, "Member 'ULoginPlayerAnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ULoginPlayerAnimBlueprint_C, AnimGraphNode_TransitionResult) == 0x000420, "Member 'ULoginPlayerAnimBlueprint_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ULoginPlayerAnimBlueprint_C, AnimGraphNode_SequencePlayer_1) == 0x000448, "Member 'ULoginPlayerAnimBlueprint_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ULoginPlayerAnimBlueprint_C, AnimGraphNode_StateResult_1) == 0x000490, "Member 'ULoginPlayerAnimBlueprint_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ULoginPlayerAnimBlueprint_C, AnimGraphNode_SequencePlayer) == 0x0004B0, "Member 'ULoginPlayerAnimBlueprint_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ULoginPlayerAnimBlueprint_C, AnimGraphNode_StateResult) == 0x0004F8, "Member 'ULoginPlayerAnimBlueprint_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ULoginPlayerAnimBlueprint_C, AnimGraphNode_StateMachine) == 0x000518, "Member 'ULoginPlayerAnimBlueprint_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ULoginPlayerAnimBlueprint_C, Open) == 0x0005E0, "Member 'ULoginPlayerAnimBlueprint_C::Open' has a wrong offset!");

}

