#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassTraffic

#include "Basic.hpp"

#include "MassReplication_structs.hpp"
#include "MassRepresentation_structs.hpp"
#include "Engine_structs.hpp"
#include "MassEntity_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MassCommon_structs.hpp"
#include "ZoneGraph_structs.hpp"


namespace SDK
{

// Enum MassTraffic.EMassTrafficVehicleDamageState
// NumValues: 0x0006
enum class EMassTrafficVehicleDamageState : uint8
{
	None                                     = 0,
	Damaged                                  = 1,
	Totaled                                  = 2,
	Repairing                                = 3,
	Irreparable                              = 4,
	EMassTrafficVehicleDamageState_MAX       = 5,
};

// Enum MassTraffic.EDriverAnimStateVariation
// NumValues: 0x0005
enum class EDriverAnimStateVariation : uint8
{
	TwoHands                                 = 0,
	OneHand                                  = 1,
	Bus                                      = 2,
	None                                     = 3,
	EDriverAnimStateVariation_MAX            = 4,
};

// Enum MassTraffic.EMassTrafficFieldInclusionMode
// NumValues: 0x0003
enum class EMassTrafficFieldInclusionMode : uint8
{
	Lanes                                    = 0,
	VehiclesOnLanes                          = 1,
	EMassTrafficFieldInclusionMode_MAX       = 2,
};

// Enum MassTraffic.EMassTrafficLightStateFlags
// NumValues: 0x0008
enum class EMassTrafficLightStateFlags : uint8
{
	None                                     = 0,
	VehicleGo                                = 1,
	VehiclePrepareToStop                     = 2,
	PedestrianGo_FrontSide                   = 4,
	PedestrianGo_LeftSide                    = 8,
	PedestrianGo_RightSide                   = 16,
	PedestrianGo                             = 28,
	EMassTrafficLightStateFlags_MAX          = 29,
};

// Enum MassTraffic.EMassTrafficPeriodLanesAction
// NumValues: 0x0007
enum class EMassTrafficPeriodLanesAction : uint8
{
	None                                     = 0,
	Open                                     = 1,
	HardClose                                = 2,
	SoftClose                                = 3,
	HardPrepareToClose                       = 4,
	SoftPrepareToClose                       = 5,
	EMassTrafficPeriodLanesAction_MAX        = 6,
};

// Enum MassTraffic.ETrafficDriverAnimState
// NumValues: 0x0004
enum class ETrafficDriverAnimState : uint64
{
	Invalid                                  = 18446744073709551615,
	Steering                                 = 0,
	Count                                    = 11,
	ETrafficDriverAnimState_MAX              = 12,
};

// Enum MassTraffic.EMassTrafficCombineDistanceToNextType
// NumValues: 0x0005
enum class EMassTrafficCombineDistanceToNextType : uint8
{
	Next                                     = 0,
	LaneChangeNext                           = 1,
	SpittingLaneGhostNext                    = 2,
	MergingLaneGhostNext                     = 3,
	EMassTrafficCombineDistanceToNextType_MAX = 4,
};

// Enum MassTraffic.EChangeLaneDirection
// NumValues: 0x0004
enum class EChangeLaneDirection : uint8
{
	Invalid                                  = 0,
	Left                                     = 1,
	Right                                    = 2,
	EChangeLaneDirection_MAX                 = 3,
};

// Enum MassTraffic.EBusStateType
// NumValues: 0x0007
enum class EBusStateType : uint8
{
	Running                                  = 0,
	ApproachingStation                       = 1,
	WaitingToStop                            = 2,
	OpeningDoor                              = 3,
	WaitingAtStation                         = 4,
	ClosingDoor                              = 5,
	EBusStateType_MAX                        = 6,
};

// Enum MassTraffic.ETrainState
// NumValues: 0x0009
enum class ETrainState : uint8
{
	InValid                                  = 0,
	Running                                  = 1,
	BreakApproachStation                     = 2,
	OpenDoor                                 = 3,
	Stopping                                 = 4,
	CloseDoor                                = 5,
	ExternalControlStopped                   = 6,
	WaitForTargetStationFree                 = 7,
	ETrainState_MAX                          = 8,
};

// Enum MassTraffic.ETrafficVehicleMovementInterpolationMethod
// NumValues: 0x0003
enum class ETrafficVehicleMovementInterpolationMethod : uint8
{
	Linear                                   = 0,
	CubicBezier                              = 1,
	ETrafficVehicleMovementInterpolationMethod_MAX = 2,
};

// Enum MassTraffic.EMassTrafficLaneChangeMode
// NumValues: 0x0004
enum class EMassTrafficLaneChangeMode : uint8
{
	Off                                      = 0,
	On                                       = 1,
	On_OnlyForOffLOD                         = 2,
	EMassTrafficLaneChangeMode_MAX           = 3,
};

// Enum MassTraffic.EPriorityPassLanePriority
// NumValues: 0x0005
enum class EPriorityPassLanePriority : uint8
{
	InValid                                  = 0,
	Default                                  = 1,
	Autopilot                                = 2,
	Train                                    = 3,
	EPriorityPassLanePriority_MAX            = 4,
};

// ScriptStruct MassTraffic.ReplicatedTrafficAgent
// 0x0020 (0x0048 - 0x0028)
struct FReplicatedTrafficAgent final : public FReplicatedAgentBase
{
public:
	struct FReplicatedAgentPositionYawData        PositionYaw;                                       // 0x0028(0x0020)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FReplicatedTrafficAgent) == 0x000001, "Wrong alignment on FReplicatedTrafficAgent");
static_assert(sizeof(FReplicatedTrafficAgent) == 0x000048, "Wrong size on FReplicatedTrafficAgent");
static_assert(offsetof(FReplicatedTrafficAgent, PositionYaw) == 0x000028, "Member 'FReplicatedTrafficAgent::PositionYaw' has a wrong offset!");

// ScriptStruct MassTraffic.TrafficFastArrayItem
// 0x0048 (0x0058 - 0x0010)
struct FTrafficFastArrayItem final : public FMassFastArrayItemBase
{
public:
	struct FReplicatedTrafficAgent                Agent;                                             // 0x0010(0x0048)(Transient, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FTrafficFastArrayItem) == 0x000004, "Wrong alignment on FTrafficFastArrayItem");
static_assert(sizeof(FTrafficFastArrayItem) == 0x000058, "Wrong size on FTrafficFastArrayItem");
static_assert(offsetof(FTrafficFastArrayItem, Agent) == 0x000010, "Member 'FTrafficFastArrayItem::Agent' has a wrong offset!");

// ScriptStruct MassTraffic.TrafficClientBubbleSerializer
// 0x0118 (0x0250 - 0x0138)
struct FTrafficClientBubbleSerializer final : public FMassClientBubbleSerializerBase
{
public:
	uint8                                         Pad_138[0x108];                                    // 0x0138(0x0108)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTrafficFastArrayItem>          Traffic;                                           // 0x0240(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
};
static_assert(alignof(FTrafficClientBubbleSerializer) == 0x000008, "Wrong alignment on FTrafficClientBubbleSerializer");
static_assert(sizeof(FTrafficClientBubbleSerializer) == 0x000250, "Wrong size on FTrafficClientBubbleSerializer");
static_assert(offsetof(FTrafficClientBubbleSerializer, Traffic) == 0x000240, "Member 'FTrafficClientBubbleSerializer::Traffic' has a wrong offset!");

// ScriptStruct MassTraffic.MassTrafficVehicleInstanceCustomData
// 0x0014 (0x0014 - 0x0000)
struct FMassTrafficVehicleInstanceCustomData final
{
public:
	float                                         RandomFraction;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFrontLeftRunningLights;                           // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFrontRightRunningLights;                          // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRearLeftRunningLights;                            // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRearRightRunningLights;                           // 0x0007(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLeftBrakeLights;                                  // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRightBrakeLights;                                 // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLeftTurnSignalLights;                             // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRightTurnSignalLights;                            // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLeftHeadlight;                                    // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRightHeadlight;                                   // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReversingLights;                                  // 0x000E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAccessoryLights;                                  // 0x000F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPoliceLightBlue;                                  // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPoliceLightRed;                                   // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLensFlare;                                        // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficVehicleInstanceCustomData) == 0x000004, "Wrong alignment on FMassTrafficVehicleInstanceCustomData");
static_assert(sizeof(FMassTrafficVehicleInstanceCustomData) == 0x000014, "Wrong size on FMassTrafficVehicleInstanceCustomData");
static_assert(offsetof(FMassTrafficVehicleInstanceCustomData, RandomFraction) == 0x000000, "Member 'FMassTrafficVehicleInstanceCustomData::RandomFraction' has a wrong offset!");
static_assert(offsetof(FMassTrafficVehicleInstanceCustomData, bFrontLeftRunningLights) == 0x000004, "Member 'FMassTrafficVehicleInstanceCustomData::bFrontLeftRunningLights' has a wrong offset!");
static_assert(offsetof(FMassTrafficVehicleInstanceCustomData, bFrontRightRunningLights) == 0x000005, "Member 'FMassTrafficVehicleInstanceCustomData::bFrontRightRunningLights' has a wrong offset!");
static_assert(offsetof(FMassTrafficVehicleInstanceCustomData, bRearLeftRunningLights) == 0x000006, "Member 'FMassTrafficVehicleInstanceCustomData::bRearLeftRunningLights' has a wrong offset!");
static_assert(offsetof(FMassTrafficVehicleInstanceCustomData, bRearRightRunningLights) == 0x000007, "Member 'FMassTrafficVehicleInstanceCustomData::bRearRightRunningLights' has a wrong offset!");
static_assert(offsetof(FMassTrafficVehicleInstanceCustomData, bLeftBrakeLights) == 0x000008, "Member 'FMassTrafficVehicleInstanceCustomData::bLeftBrakeLights' has a wrong offset!");
static_assert(offsetof(FMassTrafficVehicleInstanceCustomData, bRightBrakeLights) == 0x000009, "Member 'FMassTrafficVehicleInstanceCustomData::bRightBrakeLights' has a wrong offset!");
static_assert(offsetof(FMassTrafficVehicleInstanceCustomData, bLeftTurnSignalLights) == 0x00000A, "Member 'FMassTrafficVehicleInstanceCustomData::bLeftTurnSignalLights' has a wrong offset!");
static_assert(offsetof(FMassTrafficVehicleInstanceCustomData, bRightTurnSignalLights) == 0x00000B, "Member 'FMassTrafficVehicleInstanceCustomData::bRightTurnSignalLights' has a wrong offset!");
static_assert(offsetof(FMassTrafficVehicleInstanceCustomData, bLeftHeadlight) == 0x00000C, "Member 'FMassTrafficVehicleInstanceCustomData::bLeftHeadlight' has a wrong offset!");
static_assert(offsetof(FMassTrafficVehicleInstanceCustomData, bRightHeadlight) == 0x00000D, "Member 'FMassTrafficVehicleInstanceCustomData::bRightHeadlight' has a wrong offset!");
static_assert(offsetof(FMassTrafficVehicleInstanceCustomData, bReversingLights) == 0x00000E, "Member 'FMassTrafficVehicleInstanceCustomData::bReversingLights' has a wrong offset!");
static_assert(offsetof(FMassTrafficVehicleInstanceCustomData, bAccessoryLights) == 0x00000F, "Member 'FMassTrafficVehicleInstanceCustomData::bAccessoryLights' has a wrong offset!");
static_assert(offsetof(FMassTrafficVehicleInstanceCustomData, bPoliceLightBlue) == 0x000010, "Member 'FMassTrafficVehicleInstanceCustomData::bPoliceLightBlue' has a wrong offset!");
static_assert(offsetof(FMassTrafficVehicleInstanceCustomData, bPoliceLightRed) == 0x000011, "Member 'FMassTrafficVehicleInstanceCustomData::bPoliceLightRed' has a wrong offset!");
static_assert(offsetof(FMassTrafficVehicleInstanceCustomData, bLensFlare) == 0x000012, "Member 'FMassTrafficVehicleInstanceCustomData::bLensFlare' has a wrong offset!");

// ScriptStruct MassTraffic.MassTrafficDriverMesh
// 0x0020 (0x0020 - 0x0000)
struct FMassTrafficDriverMesh final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             MaterialOverrides;                                 // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	float                                         MinLODSignificance;                                // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxLODSignificance;                                // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassTrafficDriverMesh) == 0x000008, "Wrong alignment on FMassTrafficDriverMesh");
static_assert(sizeof(FMassTrafficDriverMesh) == 0x000020, "Wrong size on FMassTrafficDriverMesh");
static_assert(offsetof(FMassTrafficDriverMesh, StaticMesh) == 0x000000, "Member 'FMassTrafficDriverMesh::StaticMesh' has a wrong offset!");
static_assert(offsetof(FMassTrafficDriverMesh, MaterialOverrides) == 0x000008, "Member 'FMassTrafficDriverMesh::MaterialOverrides' has a wrong offset!");
static_assert(offsetof(FMassTrafficDriverMesh, MinLODSignificance) == 0x000018, "Member 'FMassTrafficDriverMesh::MinLODSignificance' has a wrong offset!");
static_assert(offsetof(FMassTrafficDriverMesh, MaxLODSignificance) == 0x00001C, "Member 'FMassTrafficDriverMesh::MaxLODSignificance' has a wrong offset!");

// ScriptStruct MassTraffic.MassTrafficDriverTypeData
// 0x00A0 (0x00A0 - 0x0000)
struct FMassTrafficDriverTypeData final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMassTrafficDriverMesh>         Meshes;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UAnimToTextureDataAsset*                AnimationData;                                     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x70];                                      // 0x0020(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ACharacter>                 TemplateActor;                                     // 0x0090(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficDriverTypeData) == 0x000008, "Wrong alignment on FMassTrafficDriverTypeData");
static_assert(sizeof(FMassTrafficDriverTypeData) == 0x0000A0, "Wrong size on FMassTrafficDriverTypeData");
static_assert(offsetof(FMassTrafficDriverTypeData, Name) == 0x000000, "Member 'FMassTrafficDriverTypeData::Name' has a wrong offset!");
static_assert(offsetof(FMassTrafficDriverTypeData, Meshes) == 0x000008, "Member 'FMassTrafficDriverTypeData::Meshes' has a wrong offset!");
static_assert(offsetof(FMassTrafficDriverTypeData, AnimationData) == 0x000018, "Member 'FMassTrafficDriverTypeData::AnimationData' has a wrong offset!");
static_assert(offsetof(FMassTrafficDriverTypeData, TemplateActor) == 0x000090, "Member 'FMassTrafficDriverTypeData::TemplateActor' has a wrong offset!");

// ScriptStruct MassTraffic.IntersectionPeriodCache
// 0x0010 (0x0010 - 0x0000)
struct FIntersectionPeriodCache final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FIntersectionPeriodCache) == 0x000001, "Wrong alignment on FIntersectionPeriodCache");
static_assert(sizeof(FIntersectionPeriodCache) == 0x000010, "Wrong size on FIntersectionPeriodCache");

// ScriptStruct MassTraffic.MassTrafficDriversParameters
// 0x0020 (0x0020 - 0x0000)
struct FMassTrafficDriversParameters final : public FMassConstSharedFragment
{
public:
	class UMassTrafficDriverTypesDataAsset*       DriverTypesData;                                   // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDriverAnimStateVariation                     AnimStateVariationOverride;                        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStaticMeshInstanceVisualizationDescHandle> DriverTypesStaticMeshDescHandle;       // 0x0010(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassTrafficDriversParameters) == 0x000008, "Wrong alignment on FMassTrafficDriversParameters");
static_assert(sizeof(FMassTrafficDriversParameters) == 0x000020, "Wrong size on FMassTrafficDriversParameters");
static_assert(offsetof(FMassTrafficDriversParameters, DriverTypesData) == 0x000000, "Member 'FMassTrafficDriversParameters::DriverTypesData' has a wrong offset!");
static_assert(offsetof(FMassTrafficDriversParameters, AnimStateVariationOverride) == 0x000008, "Member 'FMassTrafficDriversParameters::AnimStateVariationOverride' has a wrong offset!");
static_assert(offsetof(FMassTrafficDriversParameters, DriverTypesStaticMeshDescHandle) == 0x000010, "Member 'FMassTrafficDriversParameters::DriverTypesStaticMeshDescHandle' has a wrong offset!");

// ScriptStruct MassTraffic.MassTrafficVehicleTag
// 0x0000 (0x0001 - 0x0001)
struct FMassTrafficVehicleTag final : public FMassTag
{
};
static_assert(alignof(FMassTrafficVehicleTag) == 0x000001, "Wrong alignment on FMassTrafficVehicleTag");
static_assert(sizeof(FMassTrafficVehicleTag) == 0x000001, "Wrong size on FMassTrafficVehicleTag");

// ScriptStruct MassTraffic.MassTrafficParkedVehicleTag
// 0x0000 (0x0001 - 0x0001)
struct FMassTrafficParkedVehicleTag final : public FMassTag
{
};
static_assert(alignof(FMassTrafficParkedVehicleTag) == 0x000001, "Wrong alignment on FMassTrafficParkedVehicleTag");
static_assert(sizeof(FMassTrafficParkedVehicleTag) == 0x000001, "Wrong size on FMassTrafficParkedVehicleTag");

// ScriptStruct MassTraffic.MassTrafficParkedVehicleMarkDisturbedTag
// 0x0000 (0x0001 - 0x0001)
struct FMassTrafficParkedVehicleMarkDisturbedTag final : public FMassTag
{
};
static_assert(alignof(FMassTrafficParkedVehicleMarkDisturbedTag) == 0x000001, "Wrong alignment on FMassTrafficParkedVehicleMarkDisturbedTag");
static_assert(sizeof(FMassTrafficParkedVehicleMarkDisturbedTag) == 0x000001, "Wrong size on FMassTrafficParkedVehicleMarkDisturbedTag");

// ScriptStruct MassTraffic.MassTrafficDisturbedVehicleTag
// 0x0000 (0x0001 - 0x0001)
struct FMassTrafficDisturbedVehicleTag final : public FMassTag
{
};
static_assert(alignof(FMassTrafficDisturbedVehicleTag) == 0x000001, "Wrong alignment on FMassTrafficDisturbedVehicleTag");
static_assert(sizeof(FMassTrafficDisturbedVehicleTag) == 0x000001, "Wrong size on FMassTrafficDisturbedVehicleTag");

// ScriptStruct MassTraffic.MassTrafficPlayerDrivingVehicleTag
// 0x0000 (0x0001 - 0x0001)
struct FMassTrafficPlayerDrivingVehicleTag final : public FMassTag
{
};
static_assert(alignof(FMassTrafficPlayerDrivingVehicleTag) == 0x000001, "Wrong alignment on FMassTrafficPlayerDrivingVehicleTag");
static_assert(sizeof(FMassTrafficPlayerDrivingVehicleTag) == 0x000001, "Wrong size on FMassTrafficPlayerDrivingVehicleTag");

// ScriptStruct MassTraffic.MassTrafficPlayerOwnedVehicleTag
// 0x0000 (0x0001 - 0x0001)
struct FMassTrafficPlayerOwnedVehicleTag final : public FMassTag
{
};
static_assert(alignof(FMassTrafficPlayerOwnedVehicleTag) == 0x000001, "Wrong alignment on FMassTrafficPlayerOwnedVehicleTag");
static_assert(sizeof(FMassTrafficPlayerOwnedVehicleTag) == 0x000001, "Wrong size on FMassTrafficPlayerOwnedVehicleTag");

// ScriptStruct MassTraffic.MassTrafficRecyclableVehicleTag
// 0x0000 (0x0001 - 0x0001)
struct FMassTrafficRecyclableVehicleTag final : public FMassTag
{
};
static_assert(alignof(FMassTrafficRecyclableVehicleTag) == 0x000001, "Wrong alignment on FMassTrafficRecyclableVehicleTag");
static_assert(sizeof(FMassTrafficRecyclableVehicleTag) == 0x000001, "Wrong size on FMassTrafficRecyclableVehicleTag");

// ScriptStruct MassTraffic.MassTrafficIntersectionTag
// 0x0000 (0x0001 - 0x0001)
struct FMassTrafficIntersectionTag final : public FMassTag
{
};
static_assert(alignof(FMassTrafficIntersectionTag) == 0x000001, "Wrong alignment on FMassTrafficIntersectionTag");
static_assert(sizeof(FMassTrafficIntersectionTag) == 0x000001, "Wrong size on FMassTrafficIntersectionTag");

// ScriptStruct MassTraffic.MassTrafficObstacleTag
// 0x0000 (0x0001 - 0x0001)
struct FMassTrafficObstacleTag final : public FMassTag
{
};
static_assert(alignof(FMassTrafficObstacleTag) == 0x000001, "Wrong alignment on FMassTrafficObstacleTag");
static_assert(sizeof(FMassTrafficObstacleTag) == 0x000001, "Wrong size on FMassTrafficObstacleTag");

// ScriptStruct MassTraffic.MassTrafficConstrainedVehicleFragment
// 0x0010 (0x0010 - 0x0000)
struct FMassTrafficConstrainedVehicleFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficConstrainedVehicleFragment) == 0x000001, "Wrong alignment on FMassTrafficConstrainedVehicleFragment");
static_assert(sizeof(FMassTrafficConstrainedVehicleFragment) == 0x000010, "Wrong size on FMassTrafficConstrainedVehicleFragment");

// ScriptStruct MassTraffic.MassTrafficLaneOffsetFragment
// 0x0004 (0x0004 - 0x0000)
struct FMassTrafficLaneOffsetFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficLaneOffsetFragment) == 0x000001, "Wrong alignment on FMassTrafficLaneOffsetFragment");
static_assert(sizeof(FMassTrafficLaneOffsetFragment) == 0x000004, "Wrong size on FMassTrafficLaneOffsetFragment");

// ScriptStruct MassTraffic.MassTrafficLight
// 0x0028 (0x0028 - 0x0000)
struct FMassTrafficLight final
{
public:
	struct FVector                                position;                                          // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ZRotation;                                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int16                                         TrafficLightTypeIndex;                             // 0x001C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMassTrafficLightStateFlags                   TrafficLightStateFlags;                            // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassEntityHandle                      TrafficLightEntityHandle;                          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassTrafficLight) == 0x000004, "Wrong alignment on FMassTrafficLight");
static_assert(sizeof(FMassTrafficLight) == 0x000028, "Wrong size on FMassTrafficLight");
static_assert(offsetof(FMassTrafficLight, position) == 0x000000, "Member 'FMassTrafficLight::position' has a wrong offset!");
static_assert(offsetof(FMassTrafficLight, ZRotation) == 0x000018, "Member 'FMassTrafficLight::ZRotation' has a wrong offset!");
static_assert(offsetof(FMassTrafficLight, TrafficLightTypeIndex) == 0x00001C, "Member 'FMassTrafficLight::TrafficLightTypeIndex' has a wrong offset!");
static_assert(offsetof(FMassTrafficLight, TrafficLightStateFlags) == 0x00001E, "Member 'FMassTrafficLight::TrafficLightStateFlags' has a wrong offset!");
static_assert(offsetof(FMassTrafficLight, TrafficLightEntityHandle) == 0x000020, "Member 'FMassTrafficLight::TrafficLightEntityHandle' has a wrong offset!");

// ScriptStruct MassTraffic.MassTrafficLightControl
// 0x0001 (0x0001 - 0x0000)
struct FMassTrafficLightControl final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficLightControl) == 0x000001, "Wrong alignment on FMassTrafficLightControl");
static_assert(sizeof(FMassTrafficLightControl) == 0x000001, "Wrong size on FMassTrafficLightControl");

// ScriptStruct MassTraffic.MassTrafficLaneToTrafficLightMap
// 0x0050 (0x0050 - 0x0000)
struct FMassTrafficLaneToTrafficLightMap final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficLaneToTrafficLightMap) == 0x000001, "Wrong alignment on FMassTrafficLaneToTrafficLightMap");
static_assert(sizeof(FMassTrafficLaneToTrafficLightMap) == 0x000050, "Wrong size on FMassTrafficLaneToTrafficLightMap");

// ScriptStruct MassTraffic.MassTrafficPeriod
// 0x00B8 (0x00B8 - 0x0000)
struct FMassTrafficPeriod final
{
public:
	uint8                                         Pad_0[0xB8];                                       // 0x0000(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficPeriod) == 0x000001, "Wrong alignment on FMassTrafficPeriod");
static_assert(sizeof(FMassTrafficPeriod) == 0x0000B8, "Wrong size on FMassTrafficPeriod");

// ScriptStruct MassTraffic.MassTrafficIntersectionFragment
// 0x0AE8 (0x0AE8 - 0x0000)
struct FMassTrafficIntersectionFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0xAE8];                                      // 0x0000(0x0AE8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficIntersectionFragment) == 0x000001, "Wrong alignment on FMassTrafficIntersectionFragment");
static_assert(sizeof(FMassTrafficIntersectionFragment) == 0x000AE8, "Wrong size on FMassTrafficIntersectionFragment");

// ScriptStruct MassTraffic.MassTrafficSimulationLODFragment
// 0x0005 (0x0005 - 0x0000)
struct FMassTrafficSimulationLODFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x5];                                        // 0x0000(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficSimulationLODFragment) == 0x000001, "Wrong alignment on FMassTrafficSimulationLODFragment");
static_assert(sizeof(FMassTrafficSimulationLODFragment) == 0x000005, "Wrong size on FMassTrafficSimulationLODFragment");

// ScriptStruct MassTraffic.MassTrafficDriverVisualizationFragment
// 0x0090 (0x0090 - 0x0000)
struct FMassTrafficDriverVisualizationFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x90];                                       // 0x0000(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficDriverVisualizationFragment) == 0x000001, "Wrong alignment on FMassTrafficDriverVisualizationFragment");
static_assert(sizeof(FMassTrafficDriverVisualizationFragment) == 0x000090, "Wrong size on FMassTrafficDriverVisualizationFragment");

// ScriptStruct MassTraffic.MassTrafficNextVehicleFragment
// 0x0038 (0x0038 - 0x0000)
struct FMassTrafficNextVehicleFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x38];                                       // 0x0000(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficNextVehicleFragment) == 0x000001, "Wrong alignment on FMassTrafficNextVehicleFragment");
static_assert(sizeof(FMassTrafficNextVehicleFragment) == 0x000038, "Wrong size on FMassTrafficNextVehicleFragment");

// ScriptStruct MassTraffic.MassTrafficObstacleListFragment
// 0x0030 (0x0030 - 0x0000)
struct FMassTrafficObstacleListFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficObstacleListFragment) == 0x000001, "Wrong alignment on FMassTrafficObstacleListFragment");
static_assert(sizeof(FMassTrafficObstacleListFragment) == 0x000030, "Wrong size on FMassTrafficObstacleListFragment");

// ScriptStruct MassTraffic.MassTrafficObstacleAvoidanceFragment
// 0x0018 (0x0018 - 0x0000)
struct FMassTrafficObstacleAvoidanceFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficObstacleAvoidanceFragment) == 0x000001, "Wrong alignment on FMassTrafficObstacleAvoidanceFragment");
static_assert(sizeof(FMassTrafficObstacleAvoidanceFragment) == 0x000018, "Wrong size on FMassTrafficObstacleAvoidanceFragment");

// ScriptStruct MassTraffic.MassTrafficRandomFractionFragment
// 0x0002 (0x0002 - 0x0000)
struct FMassTrafficRandomFractionFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x2];                                        // 0x0000(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficRandomFractionFragment) == 0x000001, "Wrong alignment on FMassTrafficRandomFractionFragment");
static_assert(sizeof(FMassTrafficRandomFractionFragment) == 0x000002, "Wrong size on FMassTrafficRandomFractionFragment");

// ScriptStruct MassTraffic.MassTrafficVehicleDamageFragment
// 0x0001 (0x0001 - 0x0000)
struct FMassTrafficVehicleDamageFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficVehicleDamageFragment) == 0x000001, "Wrong alignment on FMassTrafficVehicleDamageFragment");
static_assert(sizeof(FMassTrafficVehicleDamageFragment) == 0x000001, "Wrong size on FMassTrafficVehicleDamageFragment");

// ScriptStruct MassTraffic.MassTrafficVehicleLightsFragment
// 0x0001 (0x0001 - 0x0000)
struct FMassTrafficVehicleLightsFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficVehicleLightsFragment) == 0x000001, "Wrong alignment on FMassTrafficVehicleLightsFragment");
static_assert(sizeof(FMassTrafficVehicleLightsFragment) == 0x000001, "Wrong size on FMassTrafficVehicleLightsFragment");

// ScriptStruct MassTraffic.MassTrafficVehicleTimeFragment
// 0x0008 (0x0008 - 0x0000)
struct FMassTrafficVehicleTimeFragment final : public FMassFragment
{
public:
	float                                         LightStartTime;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LightEndTime;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassTrafficVehicleTimeFragment) == 0x000004, "Wrong alignment on FMassTrafficVehicleTimeFragment");
static_assert(sizeof(FMassTrafficVehicleTimeFragment) == 0x000008, "Wrong size on FMassTrafficVehicleTimeFragment");
static_assert(offsetof(FMassTrafficVehicleTimeFragment, LightStartTime) == 0x000000, "Member 'FMassTrafficVehicleTimeFragment::LightStartTime' has a wrong offset!");
static_assert(offsetof(FMassTrafficVehicleTimeFragment, LightEndTime) == 0x000004, "Member 'FMassTrafficVehicleTimeFragment::LightEndTime' has a wrong offset!");

// ScriptStruct MassTraffic.MassTrafficVehicleControlFragment
// 0x0080 (0x0080 - 0x0000)
struct FMassTrafficVehicleControlFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x80];                                       // 0x0000(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficVehicleControlFragment) == 0x000001, "Wrong alignment on FMassTrafficVehicleControlFragment");
static_assert(sizeof(FMassTrafficVehicleControlFragment) == 0x000080, "Wrong size on FMassTrafficVehicleControlFragment");

// ScriptStruct MassTraffic.MassTrafficVehicleLaneChangeFragment
// 0x0060 (0x0060 - 0x0000)
struct FMassTrafficVehicleLaneChangeFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x60];                                       // 0x0000(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficVehicleLaneChangeFragment) == 0x000001, "Wrong alignment on FMassTrafficVehicleLaneChangeFragment");
static_assert(sizeof(FMassTrafficVehicleLaneChangeFragment) == 0x000060, "Wrong size on FMassTrafficVehicleLaneChangeFragment");

// ScriptStruct MassTraffic.MassTrafficDebugFragment
// 0x0001 (0x0001 - 0x0000)
struct FMassTrafficDebugFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficDebugFragment) == 0x000001, "Wrong alignment on FMassTrafficDebugFragment");
static_assert(sizeof(FMassTrafficDebugFragment) == 0x000001, "Wrong size on FMassTrafficDebugFragment");

// ScriptStruct MassTraffic.MassTrafficInterpolationFragment
// 0x00A8 (0x00A8 - 0x0000)
struct FMassTrafficInterpolationFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0xA8];                                       // 0x0000(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficInterpolationFragment) == 0x000001, "Wrong alignment on FMassTrafficInterpolationFragment");
static_assert(sizeof(FMassTrafficInterpolationFragment) == 0x0000A8, "Wrong size on FMassTrafficInterpolationFragment");

// ScriptStruct MassTraffic.MassTrafficPIDControlInterpolationFragment
// 0x0150 (0x0150 - 0x0000)
struct FMassTrafficPIDControlInterpolationFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x150];                                      // 0x0000(0x0150)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficPIDControlInterpolationFragment) == 0x000001, "Wrong alignment on FMassTrafficPIDControlInterpolationFragment");
static_assert(sizeof(FMassTrafficPIDControlInterpolationFragment) == 0x000150, "Wrong size on FMassTrafficPIDControlInterpolationFragment");

// ScriptStruct MassTraffic.MassTrafficVehiclePIDCustomParams
// 0x0018 (0x0018 - 0x0000)
struct FMassTrafficVehiclePIDCustomParams final
{
public:
	bool                                          bMoreLaneLookAhead;                                // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpeedControlLaneLookAheadTime;                     // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedControlMinLookAheadDistance;                  // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurnSpeedScale;                                    // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SteeringControlLaneLookAheadTime;                  // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SteeringControlMinLookAheadDistance;               // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassTrafficVehiclePIDCustomParams) == 0x000004, "Wrong alignment on FMassTrafficVehiclePIDCustomParams");
static_assert(sizeof(FMassTrafficVehiclePIDCustomParams) == 0x000018, "Wrong size on FMassTrafficVehiclePIDCustomParams");
static_assert(offsetof(FMassTrafficVehiclePIDCustomParams, bMoreLaneLookAhead) == 0x000000, "Member 'FMassTrafficVehiclePIDCustomParams::bMoreLaneLookAhead' has a wrong offset!");
static_assert(offsetof(FMassTrafficVehiclePIDCustomParams, SpeedControlLaneLookAheadTime) == 0x000004, "Member 'FMassTrafficVehiclePIDCustomParams::SpeedControlLaneLookAheadTime' has a wrong offset!");
static_assert(offsetof(FMassTrafficVehiclePIDCustomParams, SpeedControlMinLookAheadDistance) == 0x000008, "Member 'FMassTrafficVehiclePIDCustomParams::SpeedControlMinLookAheadDistance' has a wrong offset!");
static_assert(offsetof(FMassTrafficVehiclePIDCustomParams, TurnSpeedScale) == 0x00000C, "Member 'FMassTrafficVehiclePIDCustomParams::TurnSpeedScale' has a wrong offset!");
static_assert(offsetof(FMassTrafficVehiclePIDCustomParams, SteeringControlLaneLookAheadTime) == 0x000010, "Member 'FMassTrafficVehiclePIDCustomParams::SteeringControlLaneLookAheadTime' has a wrong offset!");
static_assert(offsetof(FMassTrafficVehiclePIDCustomParams, SteeringControlMinLookAheadDistance) == 0x000014, "Member 'FMassTrafficVehiclePIDCustomParams::SteeringControlMinLookAheadDistance' has a wrong offset!");

// ScriptStruct MassTraffic.MassTrafficPIDControllerParams
// 0x0010 (0x0010 - 0x0000)
struct FMassTrafficPIDControllerParams final
{
public:
	float                                         ProportionalFactor;                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IntegralFactor;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IntegralWindow;                                    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DerivativeFactor;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassTrafficPIDControllerParams) == 0x000004, "Wrong alignment on FMassTrafficPIDControllerParams");
static_assert(sizeof(FMassTrafficPIDControllerParams) == 0x000010, "Wrong size on FMassTrafficPIDControllerParams");
static_assert(offsetof(FMassTrafficPIDControllerParams, ProportionalFactor) == 0x000000, "Member 'FMassTrafficPIDControllerParams::ProportionalFactor' has a wrong offset!");
static_assert(offsetof(FMassTrafficPIDControllerParams, IntegralFactor) == 0x000004, "Member 'FMassTrafficPIDControllerParams::IntegralFactor' has a wrong offset!");
static_assert(offsetof(FMassTrafficPIDControllerParams, IntegralWindow) == 0x000008, "Member 'FMassTrafficPIDControllerParams::IntegralWindow' has a wrong offset!");
static_assert(offsetof(FMassTrafficPIDControllerParams, DerivativeFactor) == 0x00000C, "Member 'FMassTrafficPIDControllerParams::DerivativeFactor' has a wrong offset!");

// ScriptStruct MassTraffic.MassTrafficPIDVehicleControlFragment
// 0x0054 (0x0054 - 0x0000)
struct FMassTrafficPIDVehicleControlFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TOptional<struct FMassTrafficPIDControllerParams> SteeringPIDControllerParams;                   // 0x0010(0x0014)(Edit, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TOptional<struct FMassTrafficVehiclePIDCustomParams> PIDCustomParams;                            // 0x0024(0x001C)(Edit, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x14];                                      // 0x0040(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficPIDVehicleControlFragment) == 0x000004, "Wrong alignment on FMassTrafficPIDVehicleControlFragment");
static_assert(sizeof(FMassTrafficPIDVehicleControlFragment) == 0x000054, "Wrong size on FMassTrafficPIDVehicleControlFragment");
static_assert(offsetof(FMassTrafficPIDVehicleControlFragment, SteeringPIDControllerParams) == 0x000010, "Member 'FMassTrafficPIDVehicleControlFragment::SteeringPIDControllerParams' has a wrong offset!");
static_assert(offsetof(FMassTrafficPIDVehicleControlFragment, PIDCustomParams) == 0x000024, "Member 'FMassTrafficPIDVehicleControlFragment::PIDCustomParams' has a wrong offset!");

// ScriptStruct MassTraffic.MassTrafficAngularVelocityFragment
// 0x00A0 (0x00A0 - 0x0000)
struct FMassTrafficAngularVelocityFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0xA0];                                       // 0x0000(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficAngularVelocityFragment) == 0x000001, "Wrong alignment on FMassTrafficAngularVelocityFragment");
static_assert(sizeof(FMassTrafficAngularVelocityFragment) == 0x0000A0, "Wrong size on FMassTrafficAngularVelocityFragment");

// ScriptStruct MassTraffic.MassTrafficVehiclePhysicsSharedParameters
// 0x0008 (0x0008 - 0x0000)
struct FMassTrafficVehiclePhysicsSharedParameters final : public FMassConstSharedFragment
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficVehiclePhysicsSharedParameters) == 0x000001, "Wrong alignment on FMassTrafficVehiclePhysicsSharedParameters");
static_assert(sizeof(FMassTrafficVehiclePhysicsSharedParameters) == 0x000008, "Wrong size on FMassTrafficVehiclePhysicsSharedParameters");

// ScriptStruct MassTraffic.MassTrafficSyncActorTransformToMassFragment
// 0x0001 (0x0001 - 0x0000)
struct FMassTrafficSyncActorTransformToMassFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficSyncActorTransformToMassFragment) == 0x000001, "Wrong alignment on FMassTrafficSyncActorTransformToMassFragment");
static_assert(sizeof(FMassTrafficSyncActorTransformToMassFragment) == 0x000001, "Wrong size on FMassTrafficSyncActorTransformToMassFragment");

// ScriptStruct MassTraffic.MassTrafficCustomControlProcessorTag
// 0x0000 (0x0001 - 0x0001)
struct FMassTrafficCustomControlProcessorTag final : public FMassTag
{
};
static_assert(alignof(FMassTrafficCustomControlProcessorTag) == 0x000001, "Wrong alignment on FMassTrafficCustomControlProcessorTag");
static_assert(sizeof(FMassTrafficCustomControlProcessorTag) == 0x000001, "Wrong size on FMassTrafficCustomControlProcessorTag");

// ScriptStruct MassTraffic.MassTrafficForceChangeLaneDataFragment
// 0x0080 (0x0080 - 0x0000)
struct FMassTrafficForceChangeLaneDataFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x80];                                       // 0x0000(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficForceChangeLaneDataFragment) == 0x000001, "Wrong alignment on FMassTrafficForceChangeLaneDataFragment");
static_assert(sizeof(FMassTrafficForceChangeLaneDataFragment) == 0x000080, "Wrong size on FMassTrafficForceChangeLaneDataFragment");

// ScriptStruct MassTraffic.MassTrafficVehicleBusTag
// 0x0000 (0x0001 - 0x0001)
struct FMassTrafficVehicleBusTag final : public FMassTag
{
};
static_assert(alignof(FMassTrafficVehicleBusTag) == 0x000001, "Wrong alignment on FMassTrafficVehicleBusTag");
static_assert(sizeof(FMassTrafficVehicleBusTag) == 0x000001, "Wrong size on FMassTrafficVehicleBusTag");

// ScriptStruct MassTraffic.MassTrafficBusInfoFragment
// 0x00F0 (0x00F0 - 0x0000)
struct FMassTrafficBusInfoFragment final : public FMassFragment
{
public:
	class FName                                   BusName;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FZoneGraphLaneLocation                 StationLocation;                                   // 0x0008(0x0070)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         DistanceToStation;                                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BeginSlowDownDistance;                             // 0x007C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EBusStateType, float>                    StatePeriodTime;                                   // 0x0080(0x0050)(Edit, NativeAccessSpecifierPublic)
	EBusStateType                                 CurrentState;                                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        EnterStateTimeSeconds;                             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPlayerGettingOn;                                 // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastBusLaneIndex;                                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LastChangeBusLaneIndex;                            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficBusInfoFragment) == 0x000008, "Wrong alignment on FMassTrafficBusInfoFragment");
static_assert(sizeof(FMassTrafficBusInfoFragment) == 0x0000F0, "Wrong size on FMassTrafficBusInfoFragment");
static_assert(offsetof(FMassTrafficBusInfoFragment, BusName) == 0x000000, "Member 'FMassTrafficBusInfoFragment::BusName' has a wrong offset!");
static_assert(offsetof(FMassTrafficBusInfoFragment, StationLocation) == 0x000008, "Member 'FMassTrafficBusInfoFragment::StationLocation' has a wrong offset!");
static_assert(offsetof(FMassTrafficBusInfoFragment, DistanceToStation) == 0x000078, "Member 'FMassTrafficBusInfoFragment::DistanceToStation' has a wrong offset!");
static_assert(offsetof(FMassTrafficBusInfoFragment, BeginSlowDownDistance) == 0x00007C, "Member 'FMassTrafficBusInfoFragment::BeginSlowDownDistance' has a wrong offset!");
static_assert(offsetof(FMassTrafficBusInfoFragment, StatePeriodTime) == 0x000080, "Member 'FMassTrafficBusInfoFragment::StatePeriodTime' has a wrong offset!");
static_assert(offsetof(FMassTrafficBusInfoFragment, CurrentState) == 0x0000D0, "Member 'FMassTrafficBusInfoFragment::CurrentState' has a wrong offset!");
static_assert(offsetof(FMassTrafficBusInfoFragment, EnterStateTimeSeconds) == 0x0000D8, "Member 'FMassTrafficBusInfoFragment::EnterStateTimeSeconds' has a wrong offset!");
static_assert(offsetof(FMassTrafficBusInfoFragment, IsPlayerGettingOn) == 0x0000E0, "Member 'FMassTrafficBusInfoFragment::IsPlayerGettingOn' has a wrong offset!");
static_assert(offsetof(FMassTrafficBusInfoFragment, LastBusLaneIndex) == 0x0000E4, "Member 'FMassTrafficBusInfoFragment::LastBusLaneIndex' has a wrong offset!");
static_assert(offsetof(FMassTrafficBusInfoFragment, LastChangeBusLaneIndex) == 0x0000E8, "Member 'FMassTrafficBusInfoFragment::LastChangeBusLaneIndex' has a wrong offset!");

// ScriptStruct MassTraffic.MassTrafficBusQuestInfoFragment
// 0x0001 (0x0001 - 0x0000)
struct FMassTrafficBusQuestInfoFragment final : public FMassFragment
{
public:
	bool                                          bIsQuestVehicleStarted;                            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassTrafficBusQuestInfoFragment) == 0x000001, "Wrong alignment on FMassTrafficBusQuestInfoFragment");
static_assert(sizeof(FMassTrafficBusQuestInfoFragment) == 0x000001, "Wrong size on FMassTrafficBusQuestInfoFragment");
static_assert(offsetof(FMassTrafficBusQuestInfoFragment, bIsQuestVehicleStarted) == 0x000000, "Member 'FMassTrafficBusQuestInfoFragment::bIsQuestVehicleStarted' has a wrong offset!");

// ScriptStruct MassTraffic.MassTrafficLightsParameters
// 0x0018 (0x0018 - 0x0000)
struct FMassTrafficLightsParameters final : public FMassConstSharedFragment
{
public:
	class UMassTrafficLightTypesDataAsset*        TrafficLightTypesData;                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FStaticMeshInstanceVisualizationDescHandle> TrafficLightTypesStaticMeshDescHandle; // 0x0008(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassTrafficLightsParameters) == 0x000008, "Wrong alignment on FMassTrafficLightsParameters");
static_assert(sizeof(FMassTrafficLightsParameters) == 0x000018, "Wrong size on FMassTrafficLightsParameters");
static_assert(offsetof(FMassTrafficLightsParameters, TrafficLightTypesData) == 0x000000, "Member 'FMassTrafficLightsParameters::TrafficLightTypesData' has a wrong offset!");
static_assert(offsetof(FMassTrafficLightsParameters, TrafficLightTypesStaticMeshDescHandle) == 0x000008, "Member 'FMassTrafficLightsParameters::TrafficLightTypesStaticMeshDescHandle' has a wrong offset!");

// ScriptStruct MassTraffic.MassTrafficDriverHonkDataFragment
// 0x0038 (0x0038 - 0x0000)
struct FMassTrafficDriverHonkDataFragment final : public FMassConstSharedFragment
{
public:
	struct FVector2f                              HonkIntervalRange;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxHonkTimeForEmptyPlayerVehicle;                  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DriverHonkSpeedThreshold;                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DriverHonkDistanceThreshold;                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LaneExitDistanceThreshold;                         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        HonkAudioEvent;                                    // 0x0018(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassTrafficDriverHonkDataFragment) == 0x000004, "Wrong alignment on FMassTrafficDriverHonkDataFragment");
static_assert(sizeof(FMassTrafficDriverHonkDataFragment) == 0x000038, "Wrong size on FMassTrafficDriverHonkDataFragment");
static_assert(offsetof(FMassTrafficDriverHonkDataFragment, HonkIntervalRange) == 0x000000, "Member 'FMassTrafficDriverHonkDataFragment::HonkIntervalRange' has a wrong offset!");
static_assert(offsetof(FMassTrafficDriverHonkDataFragment, MaxHonkTimeForEmptyPlayerVehicle) == 0x000008, "Member 'FMassTrafficDriverHonkDataFragment::MaxHonkTimeForEmptyPlayerVehicle' has a wrong offset!");
static_assert(offsetof(FMassTrafficDriverHonkDataFragment, DriverHonkSpeedThreshold) == 0x00000C, "Member 'FMassTrafficDriverHonkDataFragment::DriverHonkSpeedThreshold' has a wrong offset!");
static_assert(offsetof(FMassTrafficDriverHonkDataFragment, DriverHonkDistanceThreshold) == 0x000010, "Member 'FMassTrafficDriverHonkDataFragment::DriverHonkDistanceThreshold' has a wrong offset!");
static_assert(offsetof(FMassTrafficDriverHonkDataFragment, LaneExitDistanceThreshold) == 0x000014, "Member 'FMassTrafficDriverHonkDataFragment::LaneExitDistanceThreshold' has a wrong offset!");
static_assert(offsetof(FMassTrafficDriverHonkDataFragment, HonkAudioEvent) == 0x000018, "Member 'FMassTrafficDriverHonkDataFragment::HonkAudioEvent' has a wrong offset!");

// ScriptStruct MassTraffic.MassTrafficDriverHonkInstanceFragment
// 0x0010 (0x0010 - 0x0000)
struct FMassTrafficDriverHonkInstanceFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassTrafficDriverHonkInstanceFragment) == 0x000001, "Wrong alignment on FMassTrafficDriverHonkInstanceFragment");
static_assert(sizeof(FMassTrafficDriverHonkInstanceFragment) == 0x000010, "Wrong size on FMassTrafficDriverHonkInstanceFragment");

// ScriptStruct MassTraffic.MassTrafficDriverDataFragment
// 0x0018 (0x0018 - 0x0000)
struct FMassTrafficDriverDataFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0xC];                                        // 0x0000(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HairColorNum;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
