#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassEQS

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_classes.hpp"
#include "MassEntity_classes.hpp"
#include "MassEQS_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class MassEQS.EnvQueryItemType_MassEntityHandle
// 0x0000 (0x0030 - 0x0030)
class UEnvQueryItemType_MassEntityHandle final : public UEnvQueryItemType_VectorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryItemType_MassEntityHandle">();
	}
	static class UEnvQueryItemType_MassEntityHandle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryItemType_MassEntityHandle>();
	}
};
static_assert(alignof(UEnvQueryItemType_MassEntityHandle) == 0x000008, "Wrong alignment on UEnvQueryItemType_MassEntityHandle");
static_assert(sizeof(UEnvQueryItemType_MassEntityHandle) == 0x000030, "Wrong size on UEnvQueryItemType_MassEntityHandle");

// Class MassEQS.MassEnvQueryGenerator
// 0x0028 (0x0078 - 0x0050)
class UMassEnvQueryGenerator : public UEnvQueryGenerator
{
public:
	uint8                                         Pad_50[0x28];                                      // 0x0050(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassEnvQueryGenerator">();
	}
	static class UMassEnvQueryGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEnvQueryGenerator>();
	}
};
static_assert(alignof(UMassEnvQueryGenerator) == 0x000008, "Wrong alignment on UMassEnvQueryGenerator");
static_assert(sizeof(UMassEnvQueryGenerator) == 0x000078, "Wrong size on UMassEnvQueryGenerator");

// Class MassEQS.MassEnvQueryProcessorBase
// 0x0010 (0x00D0 - 0x00C0)
class UMassEnvQueryProcessorBase : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0x10];                                      // 0x00C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassEnvQueryProcessorBase">();
	}
	static class UMassEnvQueryProcessorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEnvQueryProcessorBase>();
	}
};
static_assert(alignof(UMassEnvQueryProcessorBase) == 0x000008, "Wrong alignment on UMassEnvQueryProcessorBase");
static_assert(sizeof(UMassEnvQueryProcessorBase) == 0x0000D0, "Wrong size on UMassEnvQueryProcessorBase");

// Class MassEQS.MassEnvQueryGeneratorProcessor_MassEntityHandles
// 0x0350 (0x0420 - 0x00D0)
class UMassEnvQueryGeneratorProcessor_MassEntityHandles final : public UMassEnvQueryProcessorBase
{
public:
	uint8                                         Pad_D0[0x350];                                     // 0x00D0(0x0350)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassEnvQueryGeneratorProcessor_MassEntityHandles">();
	}
	static class UMassEnvQueryGeneratorProcessor_MassEntityHandles* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEnvQueryGeneratorProcessor_MassEntityHandles>();
	}
};
static_assert(alignof(UMassEnvQueryGeneratorProcessor_MassEntityHandles) == 0x000008, "Wrong alignment on UMassEnvQueryGeneratorProcessor_MassEntityHandles");
static_assert(sizeof(UMassEnvQueryGeneratorProcessor_MassEntityHandles) == 0x000420, "Wrong size on UMassEnvQueryGeneratorProcessor_MassEntityHandles");

// Class MassEQS.MassEnvQueryGenerator_MassEntityHandles
// 0x0040 (0x00B8 - 0x0078)
class UMassEnvQueryGenerator_MassEntityHandles final : public UMassEnvQueryGenerator
{
public:
	struct FAIDataProviderFloatValue              SearchRadius;                                      // 0x0078(0x0038)(Edit, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UEnvQueryContext>           SearchCenter;                                      // 0x00B0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassEnvQueryGenerator_MassEntityHandles">();
	}
	static class UMassEnvQueryGenerator_MassEntityHandles* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEnvQueryGenerator_MassEntityHandles>();
	}
};
static_assert(alignof(UMassEnvQueryGenerator_MassEntityHandles) == 0x000008, "Wrong alignment on UMassEnvQueryGenerator_MassEntityHandles");
static_assert(sizeof(UMassEnvQueryGenerator_MassEntityHandles) == 0x0000B8, "Wrong size on UMassEnvQueryGenerator_MassEntityHandles");
static_assert(offsetof(UMassEnvQueryGenerator_MassEntityHandles, SearchRadius) == 0x000078, "Member 'UMassEnvQueryGenerator_MassEntityHandles::SearchRadius' has a wrong offset!");
static_assert(offsetof(UMassEnvQueryGenerator_MassEntityHandles, SearchCenter) == 0x0000B0, "Member 'UMassEnvQueryGenerator_MassEntityHandles::SearchCenter' has a wrong offset!");

// Class MassEQS.MassEnvQueryTest
// 0x0028 (0x0220 - 0x01F8)
class UMassEnvQueryTest : public UEnvQueryTest
{
public:
	uint8                                         Pad_1F8[0x28];                                     // 0x01F8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassEnvQueryTest">();
	}
	static class UMassEnvQueryTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEnvQueryTest>();
	}
};
static_assert(alignof(UMassEnvQueryTest) == 0x000008, "Wrong alignment on UMassEnvQueryTest");
static_assert(sizeof(UMassEnvQueryTest) == 0x000220, "Wrong size on UMassEnvQueryTest");

// Class MassEQS.MassEnvQueryTestProcessor_MassEntityTags
// 0x0350 (0x0420 - 0x00D0)
class UMassEnvQueryTestProcessor_MassEntityTags final : public UMassEnvQueryProcessorBase
{
public:
	uint8                                         Pad_D0[0x350];                                     // 0x00D0(0x0350)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassEnvQueryTestProcessor_MassEntityTags">();
	}
	static class UMassEnvQueryTestProcessor_MassEntityTags* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEnvQueryTestProcessor_MassEntityTags>();
	}
};
static_assert(alignof(UMassEnvQueryTestProcessor_MassEntityTags) == 0x000008, "Wrong alignment on UMassEnvQueryTestProcessor_MassEntityTags");
static_assert(sizeof(UMassEnvQueryTestProcessor_MassEntityTags) == 0x000420, "Wrong size on UMassEnvQueryTestProcessor_MassEntityTags");

// Class MassEQS.MassEnvQueryTest_MassEntityTags
// 0x0018 (0x0238 - 0x0220)
class UMassEnvQueryTest_MassEntityTags final : public UMassEnvQueryTest
{
public:
	EMassEntityTagsTestMode                       TagTestMode;                                       // 0x0220(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInstancedStruct>               Tags;                                              // 0x0228(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassEnvQueryTest_MassEntityTags">();
	}
	static class UMassEnvQueryTest_MassEntityTags* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEnvQueryTest_MassEntityTags>();
	}
};
static_assert(alignof(UMassEnvQueryTest_MassEntityTags) == 0x000008, "Wrong alignment on UMassEnvQueryTest_MassEntityTags");
static_assert(sizeof(UMassEnvQueryTest_MassEntityTags) == 0x000238, "Wrong size on UMassEnvQueryTest_MassEntityTags");
static_assert(offsetof(UMassEnvQueryTest_MassEntityTags, TagTestMode) == 0x000220, "Member 'UMassEnvQueryTest_MassEntityTags::TagTestMode' has a wrong offset!");
static_assert(offsetof(UMassEnvQueryTest_MassEntityTags, Tags) == 0x000228, "Member 'UMassEnvQueryTest_MassEntityTags::Tags' has a wrong offset!");

// Class MassEQS.MassEQSBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UMassEQSBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool ContainsEntity(const TArray<struct FMassEnvQueryEntityInfoBlueprintWrapper>& EntityList, const struct FMassEnvQueryEntityInfoBlueprintWrapper& EntityInfo);
	static bool EntityComparison(const struct FMassEnvQueryEntityInfoBlueprintWrapper& A, const struct FMassEnvQueryEntityInfoBlueprintWrapper& B);
	static class FString EntityToString(const struct FMassEnvQueryEntityInfoBlueprintWrapper& EntityInfo);
	static struct FVector GetCachedEntityPosition(const struct FMassEnvQueryEntityInfoBlueprintWrapper& EntityInfo);
	static struct FVector GetCurrentEntityPosition(const class AActor* Owner, const struct FMassEnvQueryEntityInfoBlueprintWrapper& EntityInfo);
	static TArray<struct FMassEnvQueryEntityInfoBlueprintWrapper> GetEnviromentQueryResultAsEntityInfo(const class UEnvQueryInstanceBlueprintWrapper* QueryInstance);
	static void SendSignalToEntity(const class AActor* Owner, const struct FMassEnvQueryEntityInfoBlueprintWrapper& EntityInfo, const class FName Signal);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassEQSBlueprintLibrary">();
	}
	static class UMassEQSBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEQSBlueprintLibrary>();
	}
};
static_assert(alignof(UMassEQSBlueprintLibrary) == 0x000008, "Wrong alignment on UMassEQSBlueprintLibrary");
static_assert(sizeof(UMassEQSBlueprintLibrary) == 0x000028, "Wrong size on UMassEQSBlueprintLibrary");

// Class MassEQS.MassEQSSubsystem
// 0x00E8 (0x0120 - 0x0038)
class UMassEQSSubsystem final : public UMassSubsystemBase
{
public:
	uint8                                         Pad_38[0xE8];                                      // 0x0038(0x00E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassEQSSubsystem">();
	}
	static class UMassEQSSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassEQSSubsystem>();
	}
};
static_assert(alignof(UMassEQSSubsystem) == 0x000008, "Wrong alignment on UMassEQSSubsystem");
static_assert(sizeof(UMassEQSSubsystem) == 0x000120, "Wrong size on UMassEQSSubsystem");

// Class MassEQS.MassEQSRequestInterface
// 0x0000 (0x0000 - 0x0000)
class IMassEQSRequestInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassEQSRequestInterface">();
	}
	static class IMassEQSRequestInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMassEQSRequestInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IMassEQSRequestInterface) == 0x000001, "Wrong alignment on IMassEQSRequestInterface");
static_assert(sizeof(IMassEQSRequestInterface) == 0x000001, "Wrong size on IMassEQSRequestInterface");

}

