#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassEQS

#include "Basic.hpp"

#include "AIModule_structs.hpp"


namespace SDK
{

// Enum MassEQS.EMassEntityTagsTestMode
// NumValues: 0x0004
enum class EMassEntityTagsTestMode : uint8
{
	Any                                      = 0,
	All                                      = 1,
	None                                     = 2,
	EMassEntityTagsTestMode_MAX              = 3,
};

// ScriptStruct MassEQS.MassEnvQueryEntityInfoBlueprintWrapper
// 0x0070 (0x0070 - 0x0000)
struct FMassEnvQueryEntityInfoBlueprintWrapper final
{
public:
	uint8                                         Pad_0[0x70];                                       // 0x0000(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassEnvQueryEntityInfoBlueprintWrapper) == 0x000001, "Wrong alignment on FMassEnvQueryEntityInfoBlueprintWrapper");
static_assert(sizeof(FMassEnvQueryEntityInfoBlueprintWrapper) == 0x000070, "Wrong size on FMassEnvQueryEntityInfoBlueprintWrapper");

// ScriptStruct MassEQS.MassEnvQueryEntityInfo
// 0x0070 (0x0070 - 0x0000)
struct FMassEnvQueryEntityInfo final
{
public:
	uint8                                         Pad_0[0x70];                                       // 0x0000(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassEnvQueryEntityInfo) == 0x000001, "Wrong alignment on FMassEnvQueryEntityInfo");
static_assert(sizeof(FMassEnvQueryEntityInfo) == 0x000070, "Wrong size on FMassEnvQueryEntityInfo");

// ScriptStruct MassEQS.MassEQSRequestHandle
// 0x0000 (0x0008 - 0x0008)
struct FMassEQSRequestHandle final : public FIndexedHandleBase
{
};
static_assert(alignof(FMassEQSRequestHandle) == 0x000001, "Wrong alignment on FMassEQSRequestHandle");
static_assert(sizeof(FMassEQSRequestHandle) == 0x000008, "Wrong size on FMassEQSRequestHandle");

}

