#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassAIBehavior

#include "Basic.hpp"

#include "MassEntity_structs.hpp"
#include "MassEntity_classes.hpp"
#include "MassSpawner_classes.hpp"
#include "MassAIBehavior_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "StateTreeModule_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "MassSignals_classes.hpp"


namespace SDK
{

// Class MassAIBehavior.MassBehaviorSettings
// 0x0038 (0x0060 - 0x0028)
class UMassBehaviorSettings final : public UMassModuleSettings
{
public:
	int32                                         MaxActivationsPerLOD[0x4];                         // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   DynamicStateTreeProcessorClass;                    // 0x0038(0x0028)(Edit, Config, NoClear, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassBehaviorSettings">();
	}
	static class UMassBehaviorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassBehaviorSettings>();
	}
};
static_assert(alignof(UMassBehaviorSettings) == 0x000008, "Wrong alignment on UMassBehaviorSettings");
static_assert(sizeof(UMassBehaviorSettings) == 0x000060, "Wrong size on UMassBehaviorSettings");
static_assert(offsetof(UMassBehaviorSettings, MaxActivationsPerLOD) == 0x000028, "Member 'UMassBehaviorSettings::MaxActivationsPerLOD' has a wrong offset!");
static_assert(offsetof(UMassBehaviorSettings, DynamicStateTreeProcessorClass) == 0x000038, "Member 'UMassBehaviorSettings::DynamicStateTreeProcessorClass' has a wrong offset!");

// Class MassAIBehavior.MassComponentHitSubsystem
// 0x0100 (0x0148 - 0x0048)
class UMassComponentHitSubsystem final : public UMassTickableSubsystemBase
{
public:
	class UMassSignalSubsystem*                   SignalSubsystem;                                   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMassAgentSubsystem*                    AgentSubsystem;                                    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FMassEntityHandle, struct FMassHitResult> HitResults;                                // 0x0058(0x0050)(Protected, NativeAccessSpecifierProtected)
	TMap<class UActorComponent*, struct FMassEntityHandle> ComponentToEntityMap;                     // 0x00A8(0x0050)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<struct FMassEntityHandle, class UActorComponent*> EntityToComponentMap;                     // 0x00F8(0x0050)(ExportObject, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	void OnHitCallback(class UPrimitiveComponent* HitComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassComponentHitSubsystem">();
	}
	static class UMassComponentHitSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassComponentHitSubsystem>();
	}
};
static_assert(alignof(UMassComponentHitSubsystem) == 0x000008, "Wrong alignment on UMassComponentHitSubsystem");
static_assert(sizeof(UMassComponentHitSubsystem) == 0x000148, "Wrong size on UMassComponentHitSubsystem");
static_assert(offsetof(UMassComponentHitSubsystem, SignalSubsystem) == 0x000048, "Member 'UMassComponentHitSubsystem::SignalSubsystem' has a wrong offset!");
static_assert(offsetof(UMassComponentHitSubsystem, AgentSubsystem) == 0x000050, "Member 'UMassComponentHitSubsystem::AgentSubsystem' has a wrong offset!");
static_assert(offsetof(UMassComponentHitSubsystem, HitResults) == 0x000058, "Member 'UMassComponentHitSubsystem::HitResults' has a wrong offset!");
static_assert(offsetof(UMassComponentHitSubsystem, ComponentToEntityMap) == 0x0000A8, "Member 'UMassComponentHitSubsystem::ComponentToEntityMap' has a wrong offset!");
static_assert(offsetof(UMassComponentHitSubsystem, EntityToComponentMap) == 0x0000F8, "Member 'UMassComponentHitSubsystem::EntityToComponentMap' has a wrong offset!");

// Class MassAIBehavior.MassLookAtProcessor
// 0x0370 (0x0430 - 0x00C0)
class UMassLookAtProcessor final : public UMassProcessor
{
public:
	float                                         QueryExtent;                                       // 0x00C0(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         duration;                                          // 0x00C4(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DurationVariation;                                 // 0x00C8(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DebugZOffset;                                      // 0x00CC(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AngleThresholdInDegrees;                           // 0x00D0(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D4[0x35C];                                     // 0x00D4(0x035C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassLookAtProcessor">();
	}
	static class UMassLookAtProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLookAtProcessor>();
	}
};
static_assert(alignof(UMassLookAtProcessor) == 0x000008, "Wrong alignment on UMassLookAtProcessor");
static_assert(sizeof(UMassLookAtProcessor) == 0x000430, "Wrong size on UMassLookAtProcessor");
static_assert(offsetof(UMassLookAtProcessor, QueryExtent) == 0x0000C0, "Member 'UMassLookAtProcessor::QueryExtent' has a wrong offset!");
static_assert(offsetof(UMassLookAtProcessor, duration) == 0x0000C4, "Member 'UMassLookAtProcessor::duration' has a wrong offset!");
static_assert(offsetof(UMassLookAtProcessor, DurationVariation) == 0x0000C8, "Member 'UMassLookAtProcessor::DurationVariation' has a wrong offset!");
static_assert(offsetof(UMassLookAtProcessor, DebugZOffset) == 0x0000CC, "Member 'UMassLookAtProcessor::DebugZOffset' has a wrong offset!");
static_assert(offsetof(UMassLookAtProcessor, AngleThresholdInDegrees) == 0x0000D0, "Member 'UMassLookAtProcessor::AngleThresholdInDegrees' has a wrong offset!");

// Class MassAIBehavior.MassLookAtTargetGridProcessor
// 0x09F0 (0x0AB0 - 0x00C0)
class UMassLookAtTargetGridProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0x9F0];                                     // 0x00C0(0x09F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassLookAtTargetGridProcessor">();
	}
	static class UMassLookAtTargetGridProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLookAtTargetGridProcessor>();
	}
};
static_assert(alignof(UMassLookAtTargetGridProcessor) == 0x000008, "Wrong alignment on UMassLookAtTargetGridProcessor");
static_assert(sizeof(UMassLookAtTargetGridProcessor) == 0x000AB0, "Wrong size on UMassLookAtTargetGridProcessor");

// Class MassAIBehavior.MassLookAtTargetRemoverProcessor
// 0x0358 (0x0430 - 0x00D8)
class UMassLookAtTargetRemoverProcessor final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_D8[0x358];                                     // 0x00D8(0x0358)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassLookAtTargetRemoverProcessor">();
	}
	static class UMassLookAtTargetRemoverProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLookAtTargetRemoverProcessor>();
	}
};
static_assert(alignof(UMassLookAtTargetRemoverProcessor) == 0x000008, "Wrong alignment on UMassLookAtTargetRemoverProcessor");
static_assert(sizeof(UMassLookAtTargetRemoverProcessor) == 0x000430, "Wrong size on UMassLookAtTargetRemoverProcessor");

// Class MassAIBehavior.MassLookAtRequestInitializer
// 0x0358 (0x0430 - 0x00D8)
class UMassLookAtRequestInitializer final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_D8[0x358];                                     // 0x00D8(0x0358)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassLookAtRequestInitializer">();
	}
	static class UMassLookAtRequestInitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLookAtRequestInitializer>();
	}
};
static_assert(alignof(UMassLookAtRequestInitializer) == 0x000008, "Wrong alignment on UMassLookAtRequestInitializer");
static_assert(sizeof(UMassLookAtRequestInitializer) == 0x000430, "Wrong size on UMassLookAtRequestInitializer");

// Class MassAIBehavior.MassLookAtRequestDeinitializer
// 0x0358 (0x0430 - 0x00D8)
class UMassLookAtRequestDeinitializer final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_D8[0x358];                                     // 0x00D8(0x0358)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassLookAtRequestDeinitializer">();
	}
	static class UMassLookAtRequestDeinitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLookAtRequestDeinitializer>();
	}
};
static_assert(alignof(UMassLookAtRequestDeinitializer) == 0x000008, "Wrong alignment on UMassLookAtRequestDeinitializer");
static_assert(sizeof(UMassLookAtRequestDeinitializer) == 0x000430, "Wrong size on UMassLookAtRequestDeinitializer");

// Class MassAIBehavior.MassLookAtSettings
// 0x00E8 (0x0120 - 0x0038)
class UMassLookAtSettings final : public UDeveloperSettings
{
public:
	struct FMassLookAtPriorityInfo                Priorities[0x10];                                  // 0x0038(0x000C)(Edit, Config, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector                                DefaultTargetLocationOffset;                       // 0x00F8(0x0018)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        TargetHeightRatio;                                 // 0x0110(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                        FixedOffsetFromTargetHeight;                       // 0x0118(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassLookAtSettings">();
	}
	static class UMassLookAtSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLookAtSettings>();
	}
};
static_assert(alignof(UMassLookAtSettings) == 0x000008, "Wrong alignment on UMassLookAtSettings");
static_assert(sizeof(UMassLookAtSettings) == 0x000120, "Wrong size on UMassLookAtSettings");
static_assert(offsetof(UMassLookAtSettings, Priorities) == 0x000038, "Member 'UMassLookAtSettings::Priorities' has a wrong offset!");
static_assert(offsetof(UMassLookAtSettings, DefaultTargetLocationOffset) == 0x0000F8, "Member 'UMassLookAtSettings::DefaultTargetLocationOffset' has a wrong offset!");
static_assert(offsetof(UMassLookAtSettings, TargetHeightRatio) == 0x000110, "Member 'UMassLookAtSettings::TargetHeightRatio' has a wrong offset!");
static_assert(offsetof(UMassLookAtSettings, FixedOffsetFromTargetHeight) == 0x000118, "Member 'UMassLookAtSettings::FixedOffsetFromTargetHeight' has a wrong offset!");

// Class MassAIBehavior.MassLookAtSubsystem
// 0x0198 (0x01E0 - 0x0048)
class UMassLookAtSubsystem final : public UMassTickableSubsystemBase
{
public:
	uint8                                         Pad_48[0x198];                                     // 0x0048(0x0198)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FMassLookAtRequestHandle CreateLookAtActorRequest(class AActor* ViewerActor, const struct FMassLookAtPriority& Priority, class AActor* TargetActor, EMassLookAtInterpolationSpeed InterpolationSpeed, float CustomInterpolationSpeed) const;
	struct FMassLookAtRequestHandle CreateLookAtPositionRequest(class AActor* ViewerActor, const struct FMassLookAtPriority& Priority, const struct FVector& TargetLocation, EMassLookAtInterpolationSpeed InterpolationSpeed, float CustomInterpolationSpeed) const;
	void DeleteRequest(const struct FMassLookAtRequestHandle& RequestHandle) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassLookAtSubsystem">();
	}
	static class UMassLookAtSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLookAtSubsystem>();
	}
};
static_assert(alignof(UMassLookAtSubsystem) == 0x000008, "Wrong alignment on UMassLookAtSubsystem");
static_assert(sizeof(UMassLookAtSubsystem) == 0x0001E0, "Wrong size on UMassLookAtSubsystem");

// Class MassAIBehavior.MassLookAtTargetTrait
// 0x0008 (0x0030 - 0x0028)
class UMassLookAtTargetTrait final : public UMassEntityTraitBase
{
public:
	bool                                          bShouldUseCapsuleComponentToSetTargetOffset;       // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMassLookAtPriority                    Priority;                                          // 0x0029(0x0001)(Edit, Config, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassLookAtTargetTrait">();
	}
	static class UMassLookAtTargetTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLookAtTargetTrait>();
	}
};
static_assert(alignof(UMassLookAtTargetTrait) == 0x000008, "Wrong alignment on UMassLookAtTargetTrait");
static_assert(sizeof(UMassLookAtTargetTrait) == 0x000030, "Wrong size on UMassLookAtTargetTrait");
static_assert(offsetof(UMassLookAtTargetTrait, bShouldUseCapsuleComponentToSetTargetOffset) == 0x000028, "Member 'UMassLookAtTargetTrait::bShouldUseCapsuleComponentToSetTargetOffset' has a wrong offset!");
static_assert(offsetof(UMassLookAtTargetTrait, Priority) == 0x000029, "Member 'UMassLookAtTargetTrait::Priority' has a wrong offset!");

// Class MassAIBehavior.MassLookAtTrait
// 0x0000 (0x0028 - 0x0028)
class UMassLookAtTrait final : public UMassEntityTraitBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassLookAtTrait">();
	}
	static class UMassLookAtTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLookAtTrait>();
	}
};
static_assert(alignof(UMassLookAtTrait) == 0x000008, "Wrong alignment on UMassLookAtTrait");
static_assert(sizeof(UMassLookAtTrait) == 0x000028, "Wrong size on UMassLookAtTrait");

// Class MassAIBehavior.MassStateTreeFragmentDestructor
// 0x0368 (0x0440 - 0x00D8)
class UMassStateTreeFragmentDestructor final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_D8[0x358];                                     // 0x00D8(0x0358)(Fixing Size After Last Property [ Dumper-7 ])
	class UMassSignalSubsystem*                   SignalSubsystem;                                   // 0x0430(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassStateTreeFragmentDestructor">();
	}
	static class UMassStateTreeFragmentDestructor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassStateTreeFragmentDestructor>();
	}
};
static_assert(alignof(UMassStateTreeFragmentDestructor) == 0x000008, "Wrong alignment on UMassStateTreeFragmentDestructor");
static_assert(sizeof(UMassStateTreeFragmentDestructor) == 0x000440, "Wrong size on UMassStateTreeFragmentDestructor");
static_assert(offsetof(UMassStateTreeFragmentDestructor, SignalSubsystem) == 0x000430, "Member 'UMassStateTreeFragmentDestructor::SignalSubsystem' has a wrong offset!");

// Class MassAIBehavior.MassStateTreeActivationProcessor
// 0x0350 (0x0410 - 0x00C0)
class UMassStateTreeActivationProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0x350];                                     // 0x00C0(0x0350)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassStateTreeActivationProcessor">();
	}
	static class UMassStateTreeActivationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassStateTreeActivationProcessor>();
	}
};
static_assert(alignof(UMassStateTreeActivationProcessor) == 0x000008, "Wrong alignment on UMassStateTreeActivationProcessor");
static_assert(sizeof(UMassStateTreeActivationProcessor) == 0x000410, "Wrong size on UMassStateTreeActivationProcessor");

// Class MassAIBehavior.MassStateTreeProcessor
// 0x01A0 (0x0670 - 0x04D0)
class UMassStateTreeProcessor final : public UMassSignalProcessorBase
{
public:
	uint8                                         Pad_4D0[0x188];                                    // 0x04D0(0x0188)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStateTree*>                     HandledStateTrees;                                 // 0x0658(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	bool                                          bProcessEntitiesInParallel;                        // 0x0668(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_669[0x7];                                      // 0x0669(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassStateTreeProcessor">();
	}
	static class UMassStateTreeProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassStateTreeProcessor>();
	}
};
static_assert(alignof(UMassStateTreeProcessor) == 0x000008, "Wrong alignment on UMassStateTreeProcessor");
static_assert(sizeof(UMassStateTreeProcessor) == 0x000670, "Wrong size on UMassStateTreeProcessor");
static_assert(offsetof(UMassStateTreeProcessor, HandledStateTrees) == 0x000658, "Member 'UMassStateTreeProcessor::HandledStateTrees' has a wrong offset!");
static_assert(offsetof(UMassStateTreeProcessor, bProcessEntitiesInParallel) == 0x000668, "Member 'UMassStateTreeProcessor::bProcessEntitiesInParallel' has a wrong offset!");

// Class MassAIBehavior.MassStateTreeSchema
// 0x0010 (0x0038 - 0x0028)
class UMassStateTreeSchema final : public UStateTreeSchema
{
public:
	TArray<struct FMassStateTreeDependency>       Dependencies;                                      // 0x0028(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassStateTreeSchema">();
	}
	static class UMassStateTreeSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassStateTreeSchema>();
	}
};
static_assert(alignof(UMassStateTreeSchema) == 0x000008, "Wrong alignment on UMassStateTreeSchema");
static_assert(sizeof(UMassStateTreeSchema) == 0x000038, "Wrong size on UMassStateTreeSchema");
static_assert(offsetof(UMassStateTreeSchema, Dependencies) == 0x000028, "Member 'UMassStateTreeSchema::Dependencies' has a wrong offset!");

// Class MassAIBehavior.MassStateTreeSubsystem
// 0x00E0 (0x0118 - 0x0038)
class UMassStateTreeSubsystem final : public UMassSubsystemBase
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMassStateTreeInstanceDataItem> InstanceDataArray;                                 // 0x0048(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<uint32, class UMassStateTreeProcessor*>  RequirementsHashToProcessor;                       // 0x0068(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x50];                                      // 0x00B8(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UMassSimulationSubsystem*               SimulationSubsystem;                               // 0x0108(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UMassStateTreeProcessor>    DynamicProcessorClass;                             // 0x0110(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassStateTreeSubsystem">();
	}
	static class UMassStateTreeSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassStateTreeSubsystem>();
	}
};
static_assert(alignof(UMassStateTreeSubsystem) == 0x000008, "Wrong alignment on UMassStateTreeSubsystem");
static_assert(sizeof(UMassStateTreeSubsystem) == 0x000118, "Wrong size on UMassStateTreeSubsystem");
static_assert(offsetof(UMassStateTreeSubsystem, InstanceDataArray) == 0x000048, "Member 'UMassStateTreeSubsystem::InstanceDataArray' has a wrong offset!");
static_assert(offsetof(UMassStateTreeSubsystem, RequirementsHashToProcessor) == 0x000068, "Member 'UMassStateTreeSubsystem::RequirementsHashToProcessor' has a wrong offset!");
static_assert(offsetof(UMassStateTreeSubsystem, SimulationSubsystem) == 0x000108, "Member 'UMassStateTreeSubsystem::SimulationSubsystem' has a wrong offset!");
static_assert(offsetof(UMassStateTreeSubsystem, DynamicProcessorClass) == 0x000110, "Member 'UMassStateTreeSubsystem::DynamicProcessorClass' has a wrong offset!");

// Class MassAIBehavior.MassStateTreeTrait
// 0x0008 (0x0030 - 0x0028)
class UMassStateTreeTrait final : public UMassEntityTraitBase
{
public:
	class UStateTree*                             StateTree;                                         // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassStateTreeTrait">();
	}
	static class UMassStateTreeTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassStateTreeTrait>();
	}
};
static_assert(alignof(UMassStateTreeTrait) == 0x000008, "Wrong alignment on UMassStateTreeTrait");
static_assert(sizeof(UMassStateTreeTrait) == 0x000030, "Wrong size on UMassStateTreeTrait");
static_assert(offsetof(UMassStateTreeTrait, StateTree) == 0x000028, "Member 'UMassStateTreeTrait::StateTree' has a wrong offset!");

// Class MassAIBehavior.MassZoneGraphAnnotationTagsInitializer
// 0x0358 (0x0430 - 0x00D8)
class UMassZoneGraphAnnotationTagsInitializer final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_D8[0x358];                                     // 0x00D8(0x0358)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassZoneGraphAnnotationTagsInitializer">();
	}
	static class UMassZoneGraphAnnotationTagsInitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassZoneGraphAnnotationTagsInitializer>();
	}
};
static_assert(alignof(UMassZoneGraphAnnotationTagsInitializer) == 0x000008, "Wrong alignment on UMassZoneGraphAnnotationTagsInitializer");
static_assert(sizeof(UMassZoneGraphAnnotationTagsInitializer) == 0x000430, "Wrong size on UMassZoneGraphAnnotationTagsInitializer");

// Class MassAIBehavior.MassZoneGraphAnnotationTagUpdateProcessor
// 0x0010 (0x04E0 - 0x04D0)
class UMassZoneGraphAnnotationTagUpdateProcessor final : public UMassSignalProcessorBase
{
public:
	uint8                                         Pad_4D0[0x10];                                     // 0x04D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassZoneGraphAnnotationTagUpdateProcessor">();
	}
	static class UMassZoneGraphAnnotationTagUpdateProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassZoneGraphAnnotationTagUpdateProcessor>();
	}
};
static_assert(alignof(UMassZoneGraphAnnotationTagUpdateProcessor) == 0x000008, "Wrong alignment on UMassZoneGraphAnnotationTagUpdateProcessor");
static_assert(sizeof(UMassZoneGraphAnnotationTagUpdateProcessor) == 0x0004E0, "Wrong size on UMassZoneGraphAnnotationTagUpdateProcessor");

// Class MassAIBehavior.MassZoneGraphAnnotationTrait
// 0x0000 (0x0028 - 0x0028)
class UMassZoneGraphAnnotationTrait final : public UMassEntityTraitBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassZoneGraphAnnotationTrait">();
	}
	static class UMassZoneGraphAnnotationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassZoneGraphAnnotationTrait>();
	}
};
static_assert(alignof(UMassZoneGraphAnnotationTrait) == 0x000008, "Wrong alignment on UMassZoneGraphAnnotationTrait");
static_assert(sizeof(UMassZoneGraphAnnotationTrait) == 0x000028, "Wrong size on UMassZoneGraphAnnotationTrait");

}

