#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassNavMeshNavigation

#include "Basic.hpp"

#include "MassEntity_structs.hpp"


namespace SDK
{

// ScriptStruct MassNavMeshNavigation.MassNavMeshPathPoint
// 0x0050 (0x0050 - 0x0000)
struct FMassNavMeshPathPoint final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassNavMeshPathPoint) == 0x000001, "Wrong alignment on FMassNavMeshPathPoint");
static_assert(sizeof(FMassNavMeshPathPoint) == 0x000050, "Wrong size on FMassNavMeshPathPoint");

// ScriptStruct MassNavMeshNavigation.MassNavMeshShortPathFragment
// 0x0290 (0x0290 - 0x0000)
struct FMassNavMeshShortPathFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x290];                                      // 0x0000(0x0290)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassNavMeshShortPathFragment) == 0x000001, "Wrong alignment on FMassNavMeshShortPathFragment");
static_assert(sizeof(FMassNavMeshShortPathFragment) == 0x000290, "Wrong size on FMassNavMeshShortPathFragment");

// ScriptStruct MassNavMeshNavigation.MassNavMeshCachedPathFragment
// 0x0028 (0x0028 - 0x0000)
struct FMassNavMeshCachedPathFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassNavMeshCachedPathFragment) == 0x000001, "Wrong alignment on FMassNavMeshCachedPathFragment");
static_assert(sizeof(FMassNavMeshCachedPathFragment) == 0x000028, "Wrong size on FMassNavMeshCachedPathFragment");

// ScriptStruct MassNavMeshNavigation.MassNavMeshBoundaryFragment
// 0x0018 (0x0018 - 0x0000)
struct FMassNavMeshBoundaryFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassNavMeshBoundaryFragment) == 0x000001, "Wrong alignment on FMassNavMeshBoundaryFragment");
static_assert(sizeof(FMassNavMeshBoundaryFragment) == 0x000018, "Wrong size on FMassNavMeshBoundaryFragment");

}

