#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassTraffic

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MassTraffic_structs.hpp"


namespace SDK::Params
{

// Function MassTraffic.MassTrafficFunctionLibrary.DespawnNonPlayerDrivenParkedVehicles
// 0x0008 (0x0008 - 0x0000)
struct MassTrafficFunctionLibrary_DespawnNonPlayerDrivenParkedVehicles final
{
public:
	class AMassSpawner*                           ParkedVehiclesMassSpawner;                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassTrafficFunctionLibrary_DespawnNonPlayerDrivenParkedVehicles) == 0x000008, "Wrong alignment on MassTrafficFunctionLibrary_DespawnNonPlayerDrivenParkedVehicles");
static_assert(sizeof(MassTrafficFunctionLibrary_DespawnNonPlayerDrivenParkedVehicles) == 0x000008, "Wrong size on MassTrafficFunctionLibrary_DespawnNonPlayerDrivenParkedVehicles");
static_assert(offsetof(MassTrafficFunctionLibrary_DespawnNonPlayerDrivenParkedVehicles, ParkedVehiclesMassSpawner) == 0x000000, "Member 'MassTrafficFunctionLibrary_DespawnNonPlayerDrivenParkedVehicles::ParkedVehiclesMassSpawner' has a wrong offset!");

// Function MassTraffic.MassTrafficFunctionLibrary.GetPackedTrafficVehicleInstanceCustomData
// 0x0018 (0x0018 - 0x0000)
struct MassTrafficFunctionLibrary_GetPackedTrafficVehicleInstanceCustomData final
{
public:
	const class UPrimitiveComponent*              PrimitiveComponent;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassTrafficPackedVehicleInstanceCustomData OutPackedCustomData;                          // 0x0008(0x0004)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         DataIndex;                                         // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MassTrafficFunctionLibrary_GetPackedTrafficVehicleInstanceCustomData) == 0x000008, "Wrong alignment on MassTrafficFunctionLibrary_GetPackedTrafficVehicleInstanceCustomData");
static_assert(sizeof(MassTrafficFunctionLibrary_GetPackedTrafficVehicleInstanceCustomData) == 0x000018, "Wrong size on MassTrafficFunctionLibrary_GetPackedTrafficVehicleInstanceCustomData");
static_assert(offsetof(MassTrafficFunctionLibrary_GetPackedTrafficVehicleInstanceCustomData, PrimitiveComponent) == 0x000000, "Member 'MassTrafficFunctionLibrary_GetPackedTrafficVehicleInstanceCustomData::PrimitiveComponent' has a wrong offset!");
static_assert(offsetof(MassTrafficFunctionLibrary_GetPackedTrafficVehicleInstanceCustomData, OutPackedCustomData) == 0x000008, "Member 'MassTrafficFunctionLibrary_GetPackedTrafficVehicleInstanceCustomData::OutPackedCustomData' has a wrong offset!");
static_assert(offsetof(MassTrafficFunctionLibrary_GetPackedTrafficVehicleInstanceCustomData, DataIndex) == 0x00000C, "Member 'MassTrafficFunctionLibrary_GetPackedTrafficVehicleInstanceCustomData::DataIndex' has a wrong offset!");
static_assert(offsetof(MassTrafficFunctionLibrary_GetPackedTrafficVehicleInstanceCustomData, ReturnValue) == 0x000010, "Member 'MassTrafficFunctionLibrary_GetPackedTrafficVehicleInstanceCustomData::ReturnValue' has a wrong offset!");

// Function MassTraffic.MassTrafficFunctionLibrary.PackTrafficVehicleInstanceCustomData
// 0x0018 (0x0018 - 0x0000)
struct MassTrafficFunctionLibrary_PackTrafficVehicleInstanceCustomData final
{
public:
	struct FMassTrafficVehicleInstanceCustomData  CustomData;                                        // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMassTrafficPackedVehicleInstanceCustomData ReturnValue;                                  // 0x0014(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassTrafficFunctionLibrary_PackTrafficVehicleInstanceCustomData) == 0x000001, "Wrong alignment on MassTrafficFunctionLibrary_PackTrafficVehicleInstanceCustomData");
static_assert(sizeof(MassTrafficFunctionLibrary_PackTrafficVehicleInstanceCustomData) == 0x000018, "Wrong size on MassTrafficFunctionLibrary_PackTrafficVehicleInstanceCustomData");
static_assert(offsetof(MassTrafficFunctionLibrary_PackTrafficVehicleInstanceCustomData, CustomData) == 0x000000, "Member 'MassTrafficFunctionLibrary_PackTrafficVehicleInstanceCustomData::CustomData' has a wrong offset!");
static_assert(offsetof(MassTrafficFunctionLibrary_PackTrafficVehicleInstanceCustomData, ReturnValue) == 0x000014, "Member 'MassTrafficFunctionLibrary_PackTrafficVehicleInstanceCustomData::ReturnValue' has a wrong offset!");

// Function MassTraffic.MassTrafficFunctionLibrary.RemoveVehiclesOverlappingPlayers
// 0x0008 (0x0008 - 0x0000)
struct MassTrafficFunctionLibrary_RemoveVehiclesOverlappingPlayers final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassTrafficFunctionLibrary_RemoveVehiclesOverlappingPlayers) == 0x000008, "Wrong alignment on MassTrafficFunctionLibrary_RemoveVehiclesOverlappingPlayers");
static_assert(sizeof(MassTrafficFunctionLibrary_RemoveVehiclesOverlappingPlayers) == 0x000008, "Wrong size on MassTrafficFunctionLibrary_RemoveVehiclesOverlappingPlayers");
static_assert(offsetof(MassTrafficFunctionLibrary_RemoveVehiclesOverlappingPlayers, WorldContextObject) == 0x000000, "Member 'MassTrafficFunctionLibrary_RemoveVehiclesOverlappingPlayers::WorldContextObject' has a wrong offset!");

// Function MassTraffic.MassTrafficFunctionLibrary.UnpackTrafficVehicleInstanceCustomData
// 0x0018 (0x0018 - 0x0000)
struct MassTrafficFunctionLibrary_UnpackTrafficVehicleInstanceCustomData final
{
public:
	struct FMassTrafficPackedVehicleInstanceCustomData PackedCustomData;                             // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMassTrafficVehicleInstanceCustomData  ReturnValue;                                       // 0x0004(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassTrafficFunctionLibrary_UnpackTrafficVehicleInstanceCustomData) == 0x000001, "Wrong alignment on MassTrafficFunctionLibrary_UnpackTrafficVehicleInstanceCustomData");
static_assert(sizeof(MassTrafficFunctionLibrary_UnpackTrafficVehicleInstanceCustomData) == 0x000018, "Wrong size on MassTrafficFunctionLibrary_UnpackTrafficVehicleInstanceCustomData");
static_assert(offsetof(MassTrafficFunctionLibrary_UnpackTrafficVehicleInstanceCustomData, PackedCustomData) == 0x000000, "Member 'MassTrafficFunctionLibrary_UnpackTrafficVehicleInstanceCustomData::PackedCustomData' has a wrong offset!");
static_assert(offsetof(MassTrafficFunctionLibrary_UnpackTrafficVehicleInstanceCustomData, ReturnValue) == 0x000004, "Member 'MassTrafficFunctionLibrary_UnpackTrafficVehicleInstanceCustomData::ReturnValue' has a wrong offset!");

// Function MassTraffic.MassTrafficInstancePlaybackLibrary.AnimStateFromDataAsset
// 0x0028 (0x0028 - 0x0000)
struct MassTrafficInstancePlaybackLibrary_AnimStateFromDataAsset final
{
public:
	const class UAnimToTextureDataAsset*          DataAsset;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StateIndex;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassTrafficAnimState                  AnimState;                                         // 0x000C(0x0014)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MassTrafficInstancePlaybackLibrary_AnimStateFromDataAsset) == 0x000008, "Wrong alignment on MassTrafficInstancePlaybackLibrary_AnimStateFromDataAsset");
static_assert(sizeof(MassTrafficInstancePlaybackLibrary_AnimStateFromDataAsset) == 0x000028, "Wrong size on MassTrafficInstancePlaybackLibrary_AnimStateFromDataAsset");
static_assert(offsetof(MassTrafficInstancePlaybackLibrary_AnimStateFromDataAsset, DataAsset) == 0x000000, "Member 'MassTrafficInstancePlaybackLibrary_AnimStateFromDataAsset::DataAsset' has a wrong offset!");
static_assert(offsetof(MassTrafficInstancePlaybackLibrary_AnimStateFromDataAsset, StateIndex) == 0x000008, "Member 'MassTrafficInstancePlaybackLibrary_AnimStateFromDataAsset::StateIndex' has a wrong offset!");
static_assert(offsetof(MassTrafficInstancePlaybackLibrary_AnimStateFromDataAsset, AnimState) == 0x00000C, "Member 'MassTrafficInstancePlaybackLibrary_AnimStateFromDataAsset::AnimState' has a wrong offset!");
static_assert(offsetof(MassTrafficInstancePlaybackLibrary_AnimStateFromDataAsset, ReturnValue) == 0x000020, "Member 'MassTrafficInstancePlaybackLibrary_AnimStateFromDataAsset::ReturnValue' has a wrong offset!");

// Function MassTraffic.MassTrafficParkingSpacesDataAsset.GenerateRandomVehicleName
// 0x0010 (0x0010 - 0x0000)
struct MassTrafficParkingSpacesDataAsset_GenerateRandomVehicleName final
{
public:
	TArray<class FName>                           VehicleIdList;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassTrafficParkingSpacesDataAsset_GenerateRandomVehicleName) == 0x000008, "Wrong alignment on MassTrafficParkingSpacesDataAsset_GenerateRandomVehicleName");
static_assert(sizeof(MassTrafficParkingSpacesDataAsset_GenerateRandomVehicleName) == 0x000010, "Wrong size on MassTrafficParkingSpacesDataAsset_GenerateRandomVehicleName");
static_assert(offsetof(MassTrafficParkingSpacesDataAsset_GenerateRandomVehicleName, VehicleIdList) == 0x000000, "Member 'MassTrafficParkingSpacesDataAsset_GenerateRandomVehicleName::VehicleIdList' has a wrong offset!");

// Function MassTraffic.MassTrafficSubsystem.GetNumParkedVehicleAgents
// 0x0004 (0x0004 - 0x0000)
struct MassTrafficSubsystem_GetNumParkedVehicleAgents final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassTrafficSubsystem_GetNumParkedVehicleAgents) == 0x000004, "Wrong alignment on MassTrafficSubsystem_GetNumParkedVehicleAgents");
static_assert(sizeof(MassTrafficSubsystem_GetNumParkedVehicleAgents) == 0x000004, "Wrong size on MassTrafficSubsystem_GetNumParkedVehicleAgents");
static_assert(offsetof(MassTrafficSubsystem_GetNumParkedVehicleAgents, ReturnValue) == 0x000000, "Member 'MassTrafficSubsystem_GetNumParkedVehicleAgents::ReturnValue' has a wrong offset!");

// Function MassTraffic.MassTrafficSubsystem.GetNumTrafficVehicleAgents
// 0x0004 (0x0004 - 0x0000)
struct MassTrafficSubsystem_GetNumTrafficVehicleAgents final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassTrafficSubsystem_GetNumTrafficVehicleAgents) == 0x000004, "Wrong alignment on MassTrafficSubsystem_GetNumTrafficVehicleAgents");
static_assert(sizeof(MassTrafficSubsystem_GetNumTrafficVehicleAgents) == 0x000004, "Wrong size on MassTrafficSubsystem_GetNumTrafficVehicleAgents");
static_assert(offsetof(MassTrafficSubsystem_GetNumTrafficVehicleAgents, ReturnValue) == 0x000000, "Member 'MassTrafficSubsystem_GetNumTrafficVehicleAgents::ReturnValue' has a wrong offset!");

// Function MassTraffic.MassTrafficSubsystem.HasParkedVehicleAgents
// 0x0001 (0x0001 - 0x0000)
struct MassTrafficSubsystem_HasParkedVehicleAgents final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassTrafficSubsystem_HasParkedVehicleAgents) == 0x000001, "Wrong alignment on MassTrafficSubsystem_HasParkedVehicleAgents");
static_assert(sizeof(MassTrafficSubsystem_HasParkedVehicleAgents) == 0x000001, "Wrong size on MassTrafficSubsystem_HasParkedVehicleAgents");
static_assert(offsetof(MassTrafficSubsystem_HasParkedVehicleAgents, ReturnValue) == 0x000000, "Member 'MassTrafficSubsystem_HasParkedVehicleAgents::ReturnValue' has a wrong offset!");

// Function MassTraffic.MassTrafficSubsystem.HasTrafficVehicleAgents
// 0x0001 (0x0001 - 0x0000)
struct MassTrafficSubsystem_HasTrafficVehicleAgents final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassTrafficSubsystem_HasTrafficVehicleAgents) == 0x000001, "Wrong alignment on MassTrafficSubsystem_HasTrafficVehicleAgents");
static_assert(sizeof(MassTrafficSubsystem_HasTrafficVehicleAgents) == 0x000001, "Wrong size on MassTrafficSubsystem_HasTrafficVehicleAgents");
static_assert(offsetof(MassTrafficSubsystem_HasTrafficVehicleAgents, ReturnValue) == 0x000000, "Member 'MassTrafficSubsystem_HasTrafficVehicleAgents::ReturnValue' has a wrong offset!");

// Function MassTraffic.MassTrafficVehicleControlInterface.SetVehicleInputs
// 0x0014 (0x0014 - 0x0000)
struct MassTrafficVehicleControlInterface_SetVehicleInputs final
{
public:
	float                                         Throttle;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Brake;                                             // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHandBrake;                                        // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Steering;                                          // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetSteering;                                      // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MassTrafficVehicleControlInterface_SetVehicleInputs) == 0x000004, "Wrong alignment on MassTrafficVehicleControlInterface_SetVehicleInputs");
static_assert(sizeof(MassTrafficVehicleControlInterface_SetVehicleInputs) == 0x000014, "Wrong size on MassTrafficVehicleControlInterface_SetVehicleInputs");
static_assert(offsetof(MassTrafficVehicleControlInterface_SetVehicleInputs, Throttle) == 0x000000, "Member 'MassTrafficVehicleControlInterface_SetVehicleInputs::Throttle' has a wrong offset!");
static_assert(offsetof(MassTrafficVehicleControlInterface_SetVehicleInputs, Brake) == 0x000004, "Member 'MassTrafficVehicleControlInterface_SetVehicleInputs::Brake' has a wrong offset!");
static_assert(offsetof(MassTrafficVehicleControlInterface_SetVehicleInputs, bHandBrake) == 0x000008, "Member 'MassTrafficVehicleControlInterface_SetVehicleInputs::bHandBrake' has a wrong offset!");
static_assert(offsetof(MassTrafficVehicleControlInterface_SetVehicleInputs, Steering) == 0x00000C, "Member 'MassTrafficVehicleControlInterface_SetVehicleInputs::Steering' has a wrong offset!");
static_assert(offsetof(MassTrafficVehicleControlInterface_SetVehicleInputs, bSetSteering) == 0x000010, "Member 'MassTrafficVehicleControlInterface_SetVehicleInputs::bSetSteering' has a wrong offset!");

// Function MassTraffic.MassTrafficLowVehicleMoveTargetInterface.SetMoveTargetTransform
// 0x0070 (0x0070 - 0x0000)
struct MassTrafficLowVehicleMoveTargetInterface_SetMoveTargetTransform final
{
public:
	struct FTransform                             TransformIn;                                       // 0x0000(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveSpeedIn;                                       // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0xC];                                       // 0x0064(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MassTrafficLowVehicleMoveTargetInterface_SetMoveTargetTransform) == 0x000004, "Wrong alignment on MassTrafficLowVehicleMoveTargetInterface_SetMoveTargetTransform");
static_assert(sizeof(MassTrafficLowVehicleMoveTargetInterface_SetMoveTargetTransform) == 0x000070, "Wrong size on MassTrafficLowVehicleMoveTargetInterface_SetMoveTargetTransform");
static_assert(offsetof(MassTrafficLowVehicleMoveTargetInterface_SetMoveTargetTransform, TransformIn) == 0x000000, "Member 'MassTrafficLowVehicleMoveTargetInterface_SetMoveTargetTransform::TransformIn' has a wrong offset!");
static_assert(offsetof(MassTrafficLowVehicleMoveTargetInterface_SetMoveTargetTransform, MoveSpeedIn) == 0x000060, "Member 'MassTrafficLowVehicleMoveTargetInterface_SetMoveTargetTransform::MoveSpeedIn' has a wrong offset!");

// Function MassTraffic.MassTrafficVehicleBusInterface.PlayDoorAnim
// 0x0001 (0x0001 - 0x0000)
struct MassTrafficVehicleBusInterface_PlayDoorAnim final
{
public:
	bool                                          bOpenDoor;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassTrafficVehicleBusInterface_PlayDoorAnim) == 0x000001, "Wrong alignment on MassTrafficVehicleBusInterface_PlayDoorAnim");
static_assert(sizeof(MassTrafficVehicleBusInterface_PlayDoorAnim) == 0x000001, "Wrong size on MassTrafficVehicleBusInterface_PlayDoorAnim");
static_assert(offsetof(MassTrafficVehicleBusInterface_PlayDoorAnim, bOpenDoor) == 0x000000, "Member 'MassTrafficVehicleBusInterface_PlayDoorAnim::bOpenDoor' has a wrong offset!");

// Function MassTraffic.MassTrafficVehicleBusInterface.SetBusState
// 0x0001 (0x0001 - 0x0000)
struct MassTrafficVehicleBusInterface_SetBusState final
{
public:
	EBusStateType                                 InBusState;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassTrafficVehicleBusInterface_SetBusState) == 0x000001, "Wrong alignment on MassTrafficVehicleBusInterface_SetBusState");
static_assert(sizeof(MassTrafficVehicleBusInterface_SetBusState) == 0x000001, "Wrong size on MassTrafficVehicleBusInterface_SetBusState");
static_assert(offsetof(MassTrafficVehicleBusInterface_SetBusState, InBusState) == 0x000000, "Member 'MassTrafficVehicleBusInterface_SetBusState::InBusState' has a wrong offset!");

// Function MassTraffic.MassTrafficVehicleBusInterface.SetDoorCollision
// 0x0001 (0x0001 - 0x0000)
struct MassTrafficVehicleBusInterface_SetDoorCollision final
{
public:
	bool                                          bInEnable;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassTrafficVehicleBusInterface_SetDoorCollision) == 0x000001, "Wrong alignment on MassTrafficVehicleBusInterface_SetDoorCollision");
static_assert(sizeof(MassTrafficVehicleBusInterface_SetDoorCollision) == 0x000001, "Wrong size on MassTrafficVehicleBusInterface_SetDoorCollision");
static_assert(offsetof(MassTrafficVehicleBusInterface_SetDoorCollision, bInEnable) == 0x000000, "Member 'MassTrafficVehicleBusInterface_SetDoorCollision::bInEnable' has a wrong offset!");

// Function MassTraffic.MassTrafficVehicleBusInterface.UpdateBusDoorState
// 0x0001 (0x0001 - 0x0000)
struct MassTrafficVehicleBusInterface_UpdateBusDoorState final
{
public:
	bool                                          bOpen;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassTrafficVehicleBusInterface_UpdateBusDoorState) == 0x000001, "Wrong alignment on MassTrafficVehicleBusInterface_UpdateBusDoorState");
static_assert(sizeof(MassTrafficVehicleBusInterface_UpdateBusDoorState) == 0x000001, "Wrong size on MassTrafficVehicleBusInterface_UpdateBusDoorState");
static_assert(offsetof(MassTrafficVehicleBusInterface_UpdateBusDoorState, bOpen) == 0x000000, "Member 'MassTrafficVehicleBusInterface_UpdateBusDoorState::bOpen' has a wrong offset!");

// Function MassTraffic.MassTrafficVehicleBusInterface.IsPlayerGettingOn
// 0x0001 (0x0001 - 0x0000)
struct MassTrafficVehicleBusInterface_IsPlayerGettingOn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassTrafficVehicleBusInterface_IsPlayerGettingOn) == 0x000001, "Wrong alignment on MassTrafficVehicleBusInterface_IsPlayerGettingOn");
static_assert(sizeof(MassTrafficVehicleBusInterface_IsPlayerGettingOn) == 0x000001, "Wrong size on MassTrafficVehicleBusInterface_IsPlayerGettingOn");
static_assert(offsetof(MassTrafficVehicleBusInterface_IsPlayerGettingOn, ReturnValue) == 0x000000, "Member 'MassTrafficVehicleBusInterface_IsPlayerGettingOn::ReturnValue' has a wrong offset!");

// Function MassTraffic.MassTrafficVehicleBusInterface.IsQuestVehiclePlayerGetOnAlready
// 0x0001 (0x0001 - 0x0000)
struct MassTrafficVehicleBusInterface_IsQuestVehiclePlayerGetOnAlready final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassTrafficVehicleBusInterface_IsQuestVehiclePlayerGetOnAlready) == 0x000001, "Wrong alignment on MassTrafficVehicleBusInterface_IsQuestVehiclePlayerGetOnAlready");
static_assert(sizeof(MassTrafficVehicleBusInterface_IsQuestVehiclePlayerGetOnAlready) == 0x000001, "Wrong size on MassTrafficVehicleBusInterface_IsQuestVehiclePlayerGetOnAlready");
static_assert(offsetof(MassTrafficVehicleBusInterface_IsQuestVehiclePlayerGetOnAlready, ReturnValue) == 0x000000, "Member 'MassTrafficVehicleBusInterface_IsQuestVehiclePlayerGetOnAlready::ReturnValue' has a wrong offset!");

// Function MassTraffic.MassTrafficTrainControlInterface.PlayDoorAnim
// 0x0008 (0x0008 - 0x0000)
struct MassTrafficTrainControlInterface_PlayDoorAnim final
{
public:
	bool                                          bOpenDoor;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DoorSide;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassTrafficTrainControlInterface_PlayDoorAnim) == 0x000004, "Wrong alignment on MassTrafficTrainControlInterface_PlayDoorAnim");
static_assert(sizeof(MassTrafficTrainControlInterface_PlayDoorAnim) == 0x000008, "Wrong size on MassTrafficTrainControlInterface_PlayDoorAnim");
static_assert(offsetof(MassTrafficTrainControlInterface_PlayDoorAnim, bOpenDoor) == 0x000000, "Member 'MassTrafficTrainControlInterface_PlayDoorAnim::bOpenDoor' has a wrong offset!");
static_assert(offsetof(MassTrafficTrainControlInterface_PlayDoorAnim, DoorSide) == 0x000004, "Member 'MassTrafficTrainControlInterface_PlayDoorAnim::DoorSide' has a wrong offset!");

// Function MassTraffic.MassTrafficTrainControlInterface.TrainStateChange
// 0x0001 (0x0001 - 0x0000)
struct MassTrafficTrainControlInterface_TrainStateChange final
{
public:
	ETrainState                                   CurTrainState;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassTrafficTrainControlInterface_TrainStateChange) == 0x000001, "Wrong alignment on MassTrafficTrainControlInterface_TrainStateChange");
static_assert(sizeof(MassTrafficTrainControlInterface_TrainStateChange) == 0x000001, "Wrong size on MassTrafficTrainControlInterface_TrainStateChange");
static_assert(offsetof(MassTrafficTrainControlInterface_TrainStateChange, CurTrainState) == 0x000000, "Member 'MassTrafficTrainControlInterface_TrainStateChange::CurTrainState' has a wrong offset!");

// Function MassTraffic.MassTrafficTrainSpawnerControlInterface.RegistToTrainControllerActor
// 0x0008 (0x0008 - 0x0000)
struct MassTrafficTrainSpawnerControlInterface_RegistToTrainControllerActor final
{
public:
	class AActor*                                 TrainSpawnerIn;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassTrafficTrainSpawnerControlInterface_RegistToTrainControllerActor) == 0x000008, "Wrong alignment on MassTrafficTrainSpawnerControlInterface_RegistToTrainControllerActor");
static_assert(sizeof(MassTrafficTrainSpawnerControlInterface_RegistToTrainControllerActor) == 0x000008, "Wrong size on MassTrafficTrainSpawnerControlInterface_RegistToTrainControllerActor");
static_assert(offsetof(MassTrafficTrainSpawnerControlInterface_RegistToTrainControllerActor, TrainSpawnerIn) == 0x000000, "Member 'MassTrafficTrainSpawnerControlInterface_RegistToTrainControllerActor::TrainSpawnerIn' has a wrong offset!");

// Function MassTraffic.MassTrafficVehicleInterface.OnDriverRemoved
// 0x0120 (0x0120 - 0x0000)
struct MassTrafficVehicleInterface_OnDriverRemoved final
{
public:
	struct FMassTrafficDriverTypeData             DriverTypeData;                                    // 0x0000(0x00A0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMassTrafficInstancePlaybackData       DriverInstanceData;                                // 0x00A0(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0xC];                                       // 0x00B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             DriverTransformWorldSpace;                         // 0x00C0(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassTrafficVehicleInterface_OnDriverRemoved) == 0x000001, "Wrong alignment on MassTrafficVehicleInterface_OnDriverRemoved");
static_assert(sizeof(MassTrafficVehicleInterface_OnDriverRemoved) == 0x000120, "Wrong size on MassTrafficVehicleInterface_OnDriverRemoved");
static_assert(offsetof(MassTrafficVehicleInterface_OnDriverRemoved, DriverTypeData) == 0x000000, "Member 'MassTrafficVehicleInterface_OnDriverRemoved::DriverTypeData' has a wrong offset!");
static_assert(offsetof(MassTrafficVehicleInterface_OnDriverRemoved, DriverInstanceData) == 0x0000A0, "Member 'MassTrafficVehicleInterface_OnDriverRemoved::DriverInstanceData' has a wrong offset!");
static_assert(offsetof(MassTrafficVehicleInterface_OnDriverRemoved, DriverTransformWorldSpace) == 0x0000C0, "Member 'MassTrafficVehicleInterface_OnDriverRemoved::DriverTransformWorldSpace' has a wrong offset!");

// Function MassTraffic.MassTrafficVehicleInterface.GetDamageState
// 0x0001 (0x0001 - 0x0000)
struct MassTrafficVehicleInterface_GetDamageState final
{
public:
	EMassTrafficVehicleDamageState                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassTrafficVehicleInterface_GetDamageState) == 0x000001, "Wrong alignment on MassTrafficVehicleInterface_GetDamageState");
static_assert(sizeof(MassTrafficVehicleInterface_GetDamageState) == 0x000001, "Wrong size on MassTrafficVehicleInterface_GetDamageState");
static_assert(offsetof(MassTrafficVehicleInterface_GetDamageState, ReturnValue) == 0x000000, "Member 'MassTrafficVehicleInterface_GetDamageState::ReturnValue' has a wrong offset!");

}

