#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassEQS

#include "Basic.hpp"

#include "MassEQS_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MassEQS.MassEQSBlueprintLibrary.ContainsEntity
// 0x0090 (0x0090 - 0x0000)
struct MassEQSBlueprintLibrary_ContainsEntity final
{
public:
	TArray<struct FMassEnvQueryEntityInfoBlueprintWrapper> EntityList;                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMassEnvQueryEntityInfoBlueprintWrapper EntityInfo;                                       // 0x0010(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0080(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0xF];                                       // 0x0081(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MassEQSBlueprintLibrary_ContainsEntity) == 0x000008, "Wrong alignment on MassEQSBlueprintLibrary_ContainsEntity");
static_assert(sizeof(MassEQSBlueprintLibrary_ContainsEntity) == 0x000090, "Wrong size on MassEQSBlueprintLibrary_ContainsEntity");
static_assert(offsetof(MassEQSBlueprintLibrary_ContainsEntity, EntityList) == 0x000000, "Member 'MassEQSBlueprintLibrary_ContainsEntity::EntityList' has a wrong offset!");
static_assert(offsetof(MassEQSBlueprintLibrary_ContainsEntity, EntityInfo) == 0x000010, "Member 'MassEQSBlueprintLibrary_ContainsEntity::EntityInfo' has a wrong offset!");
static_assert(offsetof(MassEQSBlueprintLibrary_ContainsEntity, ReturnValue) == 0x000080, "Member 'MassEQSBlueprintLibrary_ContainsEntity::ReturnValue' has a wrong offset!");

// Function MassEQS.MassEQSBlueprintLibrary.EntityComparison
// 0x00F0 (0x00F0 - 0x0000)
struct MassEQSBlueprintLibrary_EntityComparison final
{
public:
	struct FMassEnvQueryEntityInfoBlueprintWrapper A;                                                // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMassEnvQueryEntityInfoBlueprintWrapper B;                                                // 0x0070(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0xF];                                       // 0x00E1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MassEQSBlueprintLibrary_EntityComparison) == 0x000001, "Wrong alignment on MassEQSBlueprintLibrary_EntityComparison");
static_assert(sizeof(MassEQSBlueprintLibrary_EntityComparison) == 0x0000F0, "Wrong size on MassEQSBlueprintLibrary_EntityComparison");
static_assert(offsetof(MassEQSBlueprintLibrary_EntityComparison, A) == 0x000000, "Member 'MassEQSBlueprintLibrary_EntityComparison::A' has a wrong offset!");
static_assert(offsetof(MassEQSBlueprintLibrary_EntityComparison, B) == 0x000070, "Member 'MassEQSBlueprintLibrary_EntityComparison::B' has a wrong offset!");
static_assert(offsetof(MassEQSBlueprintLibrary_EntityComparison, ReturnValue) == 0x0000E0, "Member 'MassEQSBlueprintLibrary_EntityComparison::ReturnValue' has a wrong offset!");

// Function MassEQS.MassEQSBlueprintLibrary.EntityToString
// 0x0080 (0x0080 - 0x0000)
struct MassEQSBlueprintLibrary_EntityToString final
{
public:
	struct FMassEnvQueryEntityInfoBlueprintWrapper EntityInfo;                                       // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0070(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassEQSBlueprintLibrary_EntityToString) == 0x000008, "Wrong alignment on MassEQSBlueprintLibrary_EntityToString");
static_assert(sizeof(MassEQSBlueprintLibrary_EntityToString) == 0x000080, "Wrong size on MassEQSBlueprintLibrary_EntityToString");
static_assert(offsetof(MassEQSBlueprintLibrary_EntityToString, EntityInfo) == 0x000000, "Member 'MassEQSBlueprintLibrary_EntityToString::EntityInfo' has a wrong offset!");
static_assert(offsetof(MassEQSBlueprintLibrary_EntityToString, ReturnValue) == 0x000070, "Member 'MassEQSBlueprintLibrary_EntityToString::ReturnValue' has a wrong offset!");

// Function MassEQS.MassEQSBlueprintLibrary.GetCachedEntityPosition
// 0x0090 (0x0090 - 0x0000)
struct MassEQSBlueprintLibrary_GetCachedEntityPosition final
{
public:
	struct FMassEnvQueryEntityInfoBlueprintWrapper EntityInfo;                                       // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0070(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MassEQSBlueprintLibrary_GetCachedEntityPosition) == 0x000001, "Wrong alignment on MassEQSBlueprintLibrary_GetCachedEntityPosition");
static_assert(sizeof(MassEQSBlueprintLibrary_GetCachedEntityPosition) == 0x000090, "Wrong size on MassEQSBlueprintLibrary_GetCachedEntityPosition");
static_assert(offsetof(MassEQSBlueprintLibrary_GetCachedEntityPosition, EntityInfo) == 0x000000, "Member 'MassEQSBlueprintLibrary_GetCachedEntityPosition::EntityInfo' has a wrong offset!");
static_assert(offsetof(MassEQSBlueprintLibrary_GetCachedEntityPosition, ReturnValue) == 0x000070, "Member 'MassEQSBlueprintLibrary_GetCachedEntityPosition::ReturnValue' has a wrong offset!");

// Function MassEQS.MassEQSBlueprintLibrary.GetCurrentEntityPosition
// 0x00A0 (0x00A0 - 0x0000)
struct MassEQSBlueprintLibrary_GetCurrentEntityPosition final
{
public:
	const class AActor*                           Owner;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassEnvQueryEntityInfoBlueprintWrapper EntityInfo;                                       // 0x0010(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0080(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MassEQSBlueprintLibrary_GetCurrentEntityPosition) == 0x000008, "Wrong alignment on MassEQSBlueprintLibrary_GetCurrentEntityPosition");
static_assert(sizeof(MassEQSBlueprintLibrary_GetCurrentEntityPosition) == 0x0000A0, "Wrong size on MassEQSBlueprintLibrary_GetCurrentEntityPosition");
static_assert(offsetof(MassEQSBlueprintLibrary_GetCurrentEntityPosition, Owner) == 0x000000, "Member 'MassEQSBlueprintLibrary_GetCurrentEntityPosition::Owner' has a wrong offset!");
static_assert(offsetof(MassEQSBlueprintLibrary_GetCurrentEntityPosition, EntityInfo) == 0x000010, "Member 'MassEQSBlueprintLibrary_GetCurrentEntityPosition::EntityInfo' has a wrong offset!");
static_assert(offsetof(MassEQSBlueprintLibrary_GetCurrentEntityPosition, ReturnValue) == 0x000080, "Member 'MassEQSBlueprintLibrary_GetCurrentEntityPosition::ReturnValue' has a wrong offset!");

// Function MassEQS.MassEQSBlueprintLibrary.GetEnviromentQueryResultAsEntityInfo
// 0x0018 (0x0018 - 0x0000)
struct MassEQSBlueprintLibrary_GetEnviromentQueryResultAsEntityInfo final
{
public:
	const class UEnvQueryInstanceBlueprintWrapper* QueryInstance;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMassEnvQueryEntityInfoBlueprintWrapper> ReturnValue;                              // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassEQSBlueprintLibrary_GetEnviromentQueryResultAsEntityInfo) == 0x000008, "Wrong alignment on MassEQSBlueprintLibrary_GetEnviromentQueryResultAsEntityInfo");
static_assert(sizeof(MassEQSBlueprintLibrary_GetEnviromentQueryResultAsEntityInfo) == 0x000018, "Wrong size on MassEQSBlueprintLibrary_GetEnviromentQueryResultAsEntityInfo");
static_assert(offsetof(MassEQSBlueprintLibrary_GetEnviromentQueryResultAsEntityInfo, QueryInstance) == 0x000000, "Member 'MassEQSBlueprintLibrary_GetEnviromentQueryResultAsEntityInfo::QueryInstance' has a wrong offset!");
static_assert(offsetof(MassEQSBlueprintLibrary_GetEnviromentQueryResultAsEntityInfo, ReturnValue) == 0x000008, "Member 'MassEQSBlueprintLibrary_GetEnviromentQueryResultAsEntityInfo::ReturnValue' has a wrong offset!");

// Function MassEQS.MassEQSBlueprintLibrary.SendSignalToEntity
// 0x0090 (0x0090 - 0x0000)
struct MassEQSBlueprintLibrary_SendSignalToEntity final
{
public:
	const class AActor*                           Owner;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassEnvQueryEntityInfoBlueprintWrapper EntityInfo;                                       // 0x0010(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   Signal;                                            // 0x0080(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MassEQSBlueprintLibrary_SendSignalToEntity) == 0x000008, "Wrong alignment on MassEQSBlueprintLibrary_SendSignalToEntity");
static_assert(sizeof(MassEQSBlueprintLibrary_SendSignalToEntity) == 0x000090, "Wrong size on MassEQSBlueprintLibrary_SendSignalToEntity");
static_assert(offsetof(MassEQSBlueprintLibrary_SendSignalToEntity, Owner) == 0x000000, "Member 'MassEQSBlueprintLibrary_SendSignalToEntity::Owner' has a wrong offset!");
static_assert(offsetof(MassEQSBlueprintLibrary_SendSignalToEntity, EntityInfo) == 0x000010, "Member 'MassEQSBlueprintLibrary_SendSignalToEntity::EntityInfo' has a wrong offset!");
static_assert(offsetof(MassEQSBlueprintLibrary_SendSignalToEntity, Signal) == 0x000080, "Member 'MassEQSBlueprintLibrary_SendSignalToEntity::Signal' has a wrong offset!");

}

