#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassAIBehavior

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "MassAIBehavior_structs.hpp"


namespace SDK::Params
{

// Function MassAIBehavior.MassComponentHitSubsystem.OnHitCallback
// 0x0138 (0x0138 - 0x0000)
struct MassComponentHitSubsystem_OnHitCallback final
{
public:
	class UPrimitiveComponent*                    HitComp;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0030(0x0108)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassComponentHitSubsystem_OnHitCallback) == 0x000008, "Wrong alignment on MassComponentHitSubsystem_OnHitCallback");
static_assert(sizeof(MassComponentHitSubsystem_OnHitCallback) == 0x000138, "Wrong size on MassComponentHitSubsystem_OnHitCallback");
static_assert(offsetof(MassComponentHitSubsystem_OnHitCallback, HitComp) == 0x000000, "Member 'MassComponentHitSubsystem_OnHitCallback::HitComp' has a wrong offset!");
static_assert(offsetof(MassComponentHitSubsystem_OnHitCallback, OtherActor) == 0x000008, "Member 'MassComponentHitSubsystem_OnHitCallback::OtherActor' has a wrong offset!");
static_assert(offsetof(MassComponentHitSubsystem_OnHitCallback, OtherComp) == 0x000010, "Member 'MassComponentHitSubsystem_OnHitCallback::OtherComp' has a wrong offset!");
static_assert(offsetof(MassComponentHitSubsystem_OnHitCallback, NormalImpulse) == 0x000018, "Member 'MassComponentHitSubsystem_OnHitCallback::NormalImpulse' has a wrong offset!");
static_assert(offsetof(MassComponentHitSubsystem_OnHitCallback, Hit) == 0x000030, "Member 'MassComponentHitSubsystem_OnHitCallback::Hit' has a wrong offset!");

// Function MassAIBehavior.MassLookAtSubsystem.CreateLookAtActorRequest
// 0x0030 (0x0030 - 0x0000)
struct MassLookAtSubsystem_CreateLookAtActorRequest final
{
public:
	class AActor*                                 ViewerActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassLookAtPriority                    Priority;                                          // 0x0008(0x0001)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TargetActor;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMassLookAtInterpolationSpeed                 InterpolationSpeed;                                // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CustomInterpolationSpeed;                          // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassLookAtRequestHandle               ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassLookAtSubsystem_CreateLookAtActorRequest) == 0x000008, "Wrong alignment on MassLookAtSubsystem_CreateLookAtActorRequest");
static_assert(sizeof(MassLookAtSubsystem_CreateLookAtActorRequest) == 0x000030, "Wrong size on MassLookAtSubsystem_CreateLookAtActorRequest");
static_assert(offsetof(MassLookAtSubsystem_CreateLookAtActorRequest, ViewerActor) == 0x000000, "Member 'MassLookAtSubsystem_CreateLookAtActorRequest::ViewerActor' has a wrong offset!");
static_assert(offsetof(MassLookAtSubsystem_CreateLookAtActorRequest, Priority) == 0x000008, "Member 'MassLookAtSubsystem_CreateLookAtActorRequest::Priority' has a wrong offset!");
static_assert(offsetof(MassLookAtSubsystem_CreateLookAtActorRequest, TargetActor) == 0x000010, "Member 'MassLookAtSubsystem_CreateLookAtActorRequest::TargetActor' has a wrong offset!");
static_assert(offsetof(MassLookAtSubsystem_CreateLookAtActorRequest, InterpolationSpeed) == 0x000018, "Member 'MassLookAtSubsystem_CreateLookAtActorRequest::InterpolationSpeed' has a wrong offset!");
static_assert(offsetof(MassLookAtSubsystem_CreateLookAtActorRequest, CustomInterpolationSpeed) == 0x00001C, "Member 'MassLookAtSubsystem_CreateLookAtActorRequest::CustomInterpolationSpeed' has a wrong offset!");
static_assert(offsetof(MassLookAtSubsystem_CreateLookAtActorRequest, ReturnValue) == 0x000020, "Member 'MassLookAtSubsystem_CreateLookAtActorRequest::ReturnValue' has a wrong offset!");

// Function MassAIBehavior.MassLookAtSubsystem.CreateLookAtPositionRequest
// 0x0040 (0x0040 - 0x0000)
struct MassLookAtSubsystem_CreateLookAtPositionRequest final
{
public:
	class AActor*                                 ViewerActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassLookAtPriority                    Priority;                                          // 0x0008(0x0001)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TargetLocation;                                    // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMassLookAtInterpolationSpeed                 InterpolationSpeed;                                // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CustomInterpolationSpeed;                          // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassLookAtRequestHandle               ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassLookAtSubsystem_CreateLookAtPositionRequest) == 0x000008, "Wrong alignment on MassLookAtSubsystem_CreateLookAtPositionRequest");
static_assert(sizeof(MassLookAtSubsystem_CreateLookAtPositionRequest) == 0x000040, "Wrong size on MassLookAtSubsystem_CreateLookAtPositionRequest");
static_assert(offsetof(MassLookAtSubsystem_CreateLookAtPositionRequest, ViewerActor) == 0x000000, "Member 'MassLookAtSubsystem_CreateLookAtPositionRequest::ViewerActor' has a wrong offset!");
static_assert(offsetof(MassLookAtSubsystem_CreateLookAtPositionRequest, Priority) == 0x000008, "Member 'MassLookAtSubsystem_CreateLookAtPositionRequest::Priority' has a wrong offset!");
static_assert(offsetof(MassLookAtSubsystem_CreateLookAtPositionRequest, TargetLocation) == 0x000010, "Member 'MassLookAtSubsystem_CreateLookAtPositionRequest::TargetLocation' has a wrong offset!");
static_assert(offsetof(MassLookAtSubsystem_CreateLookAtPositionRequest, InterpolationSpeed) == 0x000028, "Member 'MassLookAtSubsystem_CreateLookAtPositionRequest::InterpolationSpeed' has a wrong offset!");
static_assert(offsetof(MassLookAtSubsystem_CreateLookAtPositionRequest, CustomInterpolationSpeed) == 0x00002C, "Member 'MassLookAtSubsystem_CreateLookAtPositionRequest::CustomInterpolationSpeed' has a wrong offset!");
static_assert(offsetof(MassLookAtSubsystem_CreateLookAtPositionRequest, ReturnValue) == 0x000030, "Member 'MassLookAtSubsystem_CreateLookAtPositionRequest::ReturnValue' has a wrong offset!");

// Function MassAIBehavior.MassLookAtSubsystem.DeleteRequest
// 0x0010 (0x0010 - 0x0000)
struct MassLookAtSubsystem_DeleteRequest final
{
public:
	struct FMassLookAtRequestHandle               RequestHandle;                                     // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassLookAtSubsystem_DeleteRequest) == 0x000001, "Wrong alignment on MassLookAtSubsystem_DeleteRequest");
static_assert(sizeof(MassLookAtSubsystem_DeleteRequest) == 0x000010, "Wrong size on MassLookAtSubsystem_DeleteRequest");
static_assert(offsetof(MassLookAtSubsystem_DeleteRequest, RequestHandle) == 0x000000, "Member 'MassLookAtSubsystem_DeleteRequest::RequestHandle' has a wrong offset!");

}

