#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassNavMeshNavigation

#include "Basic.hpp"

#include "MassEntity_classes.hpp"
#include "MassSpawner_classes.hpp"


namespace SDK
{

// Class MassNavMeshNavigation.MassNavMeshNavigationBoundaryProcessor
// 0x0350 (0x0410 - 0x00C0)
class UMassNavMeshNavigationBoundaryProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0x350];                                     // 0x00C0(0x0350)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassNavMeshNavigationBoundaryProcessor">();
	}
	static class UMassNavMeshNavigationBoundaryProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassNavMeshNavigationBoundaryProcessor>();
	}
};
static_assert(alignof(UMassNavMeshNavigationBoundaryProcessor) == 0x000008, "Wrong alignment on UMassNavMeshNavigationBoundaryProcessor");
static_assert(sizeof(UMassNavMeshNavigationBoundaryProcessor) == 0x000410, "Wrong size on UMassNavMeshNavigationBoundaryProcessor");

// Class MassNavMeshNavigation.MassNavMeshPathFollowProcessor
// 0x0360 (0x0420 - 0x00C0)
class UMassNavMeshPathFollowProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0x350];                                     // 0x00C0(0x0350)(Fixing Size After Last Property [ Dumper-7 ])
	class UMassSignalSubsystem*                   SignalSubsystem;                                   // 0x0410(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassNavMeshPathFollowProcessor">();
	}
	static class UMassNavMeshPathFollowProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassNavMeshPathFollowProcessor>();
	}
};
static_assert(alignof(UMassNavMeshPathFollowProcessor) == 0x000008, "Wrong alignment on UMassNavMeshPathFollowProcessor");
static_assert(sizeof(UMassNavMeshPathFollowProcessor) == 0x000420, "Wrong size on UMassNavMeshPathFollowProcessor");
static_assert(offsetof(UMassNavMeshPathFollowProcessor, SignalSubsystem) == 0x000410, "Member 'UMassNavMeshPathFollowProcessor::SignalSubsystem' has a wrong offset!");

// Class MassNavMeshNavigation.MassNavMeshNavigationTrait
// 0x0000 (0x0028 - 0x0028)
class UMassNavMeshNavigationTrait final : public UMassEntityTraitBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassNavMeshNavigationTrait">();
	}
	static class UMassNavMeshNavigationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassNavMeshNavigationTrait>();
	}
};
static_assert(alignof(UMassNavMeshNavigationTrait) == 0x000008, "Wrong alignment on UMassNavMeshNavigationTrait");
static_assert(sizeof(UMassNavMeshNavigationTrait) == 0x000028, "Wrong size on UMassNavMeshNavigationTrait");

}

