#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassTraffic

#include "Basic.hpp"

#include "MassRepresentation_classes.hpp"
#include "MassEntity_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MassTraffic_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MassReplication_classes.hpp"
#include "ZoneGraph_structs.hpp"
#include "MassSpawner_classes.hpp"
#include "MassLOD_structs.hpp"
#include "MassLOD_classes.hpp"
#include "MassCommon_structs.hpp"


namespace SDK
{

// Class MassTraffic.HTMassSimpleVisualizationProcessor
// 0x0000 (0x0420 - 0x0420)
class UHTMassSimpleVisualizationProcessor : public UMassVisualizationProcessor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTMassSimpleVisualizationProcessor">();
	}
	static class UHTMassSimpleVisualizationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTMassSimpleVisualizationProcessor>();
	}
};
static_assert(alignof(UHTMassSimpleVisualizationProcessor) == 0x000008, "Wrong alignment on UHTMassSimpleVisualizationProcessor");
static_assert(sizeof(UHTMassSimpleVisualizationProcessor) == 0x000420, "Wrong size on UHTMassSimpleVisualizationProcessor");

// Class MassTraffic.MassTrafficProcessorBase
// 0x0018 (0x00D8 - 0x00C0)
class UMassTrafficProcessorBase : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0x10];                                      // 0x00C0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                LogOwner;                                          // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficProcessorBase">();
	}
	static class UMassTrafficProcessorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficProcessorBase>();
	}
};
static_assert(alignof(UMassTrafficProcessorBase) == 0x000008, "Wrong alignment on UMassTrafficProcessorBase");
static_assert(sizeof(UMassTrafficProcessorBase) == 0x0000D8, "Wrong size on UMassTrafficProcessorBase");
static_assert(offsetof(UMassTrafficProcessorBase, LogOwner) == 0x0000D0, "Member 'UMassTrafficProcessorBase::LogOwner' has a wrong offset!");

// Class MassTraffic.MassTrafficActorVehiclePhysicsProcessor
// 0x0358 (0x0430 - 0x00D8)
class UMassTrafficActorVehiclePhysicsProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_D8[0x358];                                     // 0x00D8(0x0358)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficActorVehiclePhysicsProcessor">();
	}
	static class UMassTrafficActorVehiclePhysicsProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficActorVehiclePhysicsProcessor>();
	}
};
static_assert(alignof(UMassTrafficActorVehiclePhysicsProcessor) == 0x000008, "Wrong alignment on UMassTrafficActorVehiclePhysicsProcessor");
static_assert(sizeof(UMassTrafficActorVehiclePhysicsProcessor) == 0x000430, "Wrong size on UMassTrafficActorVehiclePhysicsProcessor");

// Class MassTraffic.TrafficClientBubbleInfo
// 0x0250 (0x0530 - 0x02E0)
class ATrafficClientBubbleInfo final : public AMassClientBubbleInfoBase
{
public:
	struct FTrafficClientBubbleSerializer         TrafficSerializer;                                 // 0x02E0(0x0250)(Net, Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TrafficClientBubbleInfo">();
	}
	static class ATrafficClientBubbleInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrafficClientBubbleInfo>();
	}
};
static_assert(alignof(ATrafficClientBubbleInfo) == 0x000008, "Wrong alignment on ATrafficClientBubbleInfo");
static_assert(sizeof(ATrafficClientBubbleInfo) == 0x000530, "Wrong size on ATrafficClientBubbleInfo");
static_assert(offsetof(ATrafficClientBubbleInfo, TrafficSerializer) == 0x0002E0, "Member 'ATrafficClientBubbleInfo::TrafficSerializer' has a wrong offset!");

// Class MassTraffic.MassTrafficChooseNextLaneProcessor
// 0x0358 (0x0430 - 0x00D8)
class UMassTrafficChooseNextLaneProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_D8[0x358];                                     // 0x00D8(0x0358)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficChooseNextLaneProcessor">();
	}
	static class UMassTrafficChooseNextLaneProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficChooseNextLaneProcessor>();
	}
};
static_assert(alignof(UMassTrafficChooseNextLaneProcessor) == 0x000008, "Wrong alignment on UMassTrafficChooseNextLaneProcessor");
static_assert(sizeof(UMassTrafficChooseNextLaneProcessor) == 0x000430, "Wrong size on UMassTrafficChooseNextLaneProcessor");

// Class MassTraffic.MassTrafficDamageRepairProcessor
// 0x0358 (0x0430 - 0x00D8)
class UMassTrafficDamageRepairProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_D8[0x358];                                     // 0x00D8(0x0358)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficDamageRepairProcessor">();
	}
	static class UMassTrafficDamageRepairProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficDamageRepairProcessor>();
	}
};
static_assert(alignof(UMassTrafficDamageRepairProcessor) == 0x000008, "Wrong alignment on UMassTrafficDamageRepairProcessor");
static_assert(sizeof(UMassTrafficDamageRepairProcessor) == 0x000430, "Wrong size on UMassTrafficDamageRepairProcessor");

// Class MassTraffic.MassTrafficDriverTypesDataAsset
// 0x0010 (0x0040 - 0x0030)
class UMassTrafficDriverTypesDataAsset final : public UDataAsset
{
public:
	TArray<struct FMassTrafficDriverTypeData>     DriverTypes;                                       // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficDriverTypesDataAsset">();
	}
	static class UMassTrafficDriverTypesDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficDriverTypesDataAsset>();
	}
};
static_assert(alignof(UMassTrafficDriverTypesDataAsset) == 0x000008, "Wrong alignment on UMassTrafficDriverTypesDataAsset");
static_assert(sizeof(UMassTrafficDriverTypesDataAsset) == 0x000040, "Wrong size on UMassTrafficDriverTypesDataAsset");
static_assert(offsetof(UMassTrafficDriverTypesDataAsset, DriverTypes) == 0x000030, "Member 'UMassTrafficDriverTypesDataAsset::DriverTypes' has a wrong offset!");

// Class MassTraffic.MassTrafficDriverVisualizationProcessor
// 0x0370 (0x0430 - 0x00C0)
class UMassTrafficDriverVisualizationProcessor final : public UMassProcessor
{
public:
	float                                         PlaybackSteeringThreshold;                         // 0x00C0(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LowSpeedThreshold;                                 // 0x00C4(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LookIdleMinDistSqrd;                               // 0x00C8(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LookIdleMinDotToPlayer;                            // 0x00CC(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AlternateDrivingStanceRatio;                       // 0x00D0(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMassTrafficVehicleDamageState                RemoveDriverDamageThreshold;                       // 0x00D4(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 World;                                             // 0x00D8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E0[0x350];                                     // 0x00E0(0x0350)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficDriverVisualizationProcessor">();
	}
	static class UMassTrafficDriverVisualizationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficDriverVisualizationProcessor>();
	}
};
static_assert(alignof(UMassTrafficDriverVisualizationProcessor) == 0x000008, "Wrong alignment on UMassTrafficDriverVisualizationProcessor");
static_assert(sizeof(UMassTrafficDriverVisualizationProcessor) == 0x000430, "Wrong size on UMassTrafficDriverVisualizationProcessor");
static_assert(offsetof(UMassTrafficDriverVisualizationProcessor, PlaybackSteeringThreshold) == 0x0000C0, "Member 'UMassTrafficDriverVisualizationProcessor::PlaybackSteeringThreshold' has a wrong offset!");
static_assert(offsetof(UMassTrafficDriverVisualizationProcessor, LowSpeedThreshold) == 0x0000C4, "Member 'UMassTrafficDriverVisualizationProcessor::LowSpeedThreshold' has a wrong offset!");
static_assert(offsetof(UMassTrafficDriverVisualizationProcessor, LookIdleMinDistSqrd) == 0x0000C8, "Member 'UMassTrafficDriverVisualizationProcessor::LookIdleMinDistSqrd' has a wrong offset!");
static_assert(offsetof(UMassTrafficDriverVisualizationProcessor, LookIdleMinDotToPlayer) == 0x0000CC, "Member 'UMassTrafficDriverVisualizationProcessor::LookIdleMinDotToPlayer' has a wrong offset!");
static_assert(offsetof(UMassTrafficDriverVisualizationProcessor, AlternateDrivingStanceRatio) == 0x0000D0, "Member 'UMassTrafficDriverVisualizationProcessor::AlternateDrivingStanceRatio' has a wrong offset!");
static_assert(offsetof(UMassTrafficDriverVisualizationProcessor, RemoveDriverDamageThreshold) == 0x0000D4, "Member 'UMassTrafficDriverVisualizationProcessor::RemoveDriverDamageThreshold' has a wrong offset!");
static_assert(offsetof(UMassTrafficDriverVisualizationProcessor, World) == 0x0000D8, "Member 'UMassTrafficDriverVisualizationProcessor::World' has a wrong offset!");

// Class MassTraffic.MassTrafficDriverVisualizationTrait
// 0x0028 (0x0050 - 0x0028)
class UMassTrafficDriverVisualizationTrait final : public UMassEntityTraitBase
{
public:
	struct FMassTrafficDriversParameters          Params_0;                                          // 0x0028(0x0020)(Edit, NativeAccessSpecifierPublic)
	TSubclassOf<class UMassRepresentationSubsystem> RepresentationSubsystemClass;                    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficDriverVisualizationTrait">();
	}
	static class UMassTrafficDriverVisualizationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficDriverVisualizationTrait>();
	}
};
static_assert(alignof(UMassTrafficDriverVisualizationTrait) == 0x000008, "Wrong alignment on UMassTrafficDriverVisualizationTrait");
static_assert(sizeof(UMassTrafficDriverVisualizationTrait) == 0x000050, "Wrong size on UMassTrafficDriverVisualizationTrait");
static_assert(offsetof(UMassTrafficDriverVisualizationTrait, Params_0) == 0x000028, "Member 'UMassTrafficDriverVisualizationTrait::Params_0' has a wrong offset!");
static_assert(offsetof(UMassTrafficDriverVisualizationTrait, RepresentationSubsystemClass) == 0x000048, "Member 'UMassTrafficDriverVisualizationTrait::RepresentationSubsystemClass' has a wrong offset!");

// Class MassTraffic.MassTrafficDriverInitializer
// 0x0368 (0x0440 - 0x00D8)
class UMassTrafficDriverInitializer final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_D8[0x368];                                     // 0x00D8(0x0368)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficDriverInitializer">();
	}
	static class UMassTrafficDriverInitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficDriverInitializer>();
	}
};
static_assert(alignof(UMassTrafficDriverInitializer) == 0x000008, "Wrong alignment on UMassTrafficDriverInitializer");
static_assert(sizeof(UMassTrafficDriverInitializer) == 0x000440, "Wrong size on UMassTrafficDriverInitializer");

// Class MassTraffic.EvaluateSequenceAnimInstance
// 0x0018 (0x0400 - 0x03E8)
class UEvaluateSequenceAnimInstance final : public UAnimInstance
{
public:
	class UAnimSequence*                          SequenceToEvaluate;                                // 0x03E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeToEvaluate;                                    // 0x03F0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F4[0xC];                                      // 0x03F4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EvaluateSequenceAnimInstance">();
	}
	static class UEvaluateSequenceAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEvaluateSequenceAnimInstance>();
	}
};
static_assert(alignof(UEvaluateSequenceAnimInstance) == 0x000008, "Wrong alignment on UEvaluateSequenceAnimInstance");
static_assert(sizeof(UEvaluateSequenceAnimInstance) == 0x000400, "Wrong size on UEvaluateSequenceAnimInstance");
static_assert(offsetof(UEvaluateSequenceAnimInstance, SequenceToEvaluate) == 0x0003E8, "Member 'UEvaluateSequenceAnimInstance::SequenceToEvaluate' has a wrong offset!");
static_assert(offsetof(UEvaluateSequenceAnimInstance, TimeToEvaluate) == 0x0003F0, "Member 'UEvaluateSequenceAnimInstance::TimeToEvaluate' has a wrong offset!");

// Class MassTraffic.MassTrafficFieldActor
// 0x0008 (0x02D0 - 0x02C8)
class AMassTrafficFieldActor final : public AActor
{
public:
	class UMassTrafficFieldComponent*             FieldComponent;                                    // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficFieldActor">();
	}
	static class AMassTrafficFieldActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMassTrafficFieldActor>();
	}
};
static_assert(alignof(AMassTrafficFieldActor) == 0x000008, "Wrong alignment on AMassTrafficFieldActor");
static_assert(sizeof(AMassTrafficFieldActor) == 0x0002D0, "Wrong size on AMassTrafficFieldActor");
static_assert(offsetof(AMassTrafficFieldActor, FieldComponent) == 0x0002C8, "Member 'AMassTrafficFieldActor::FieldComponent' has a wrong offset!");

// Class MassTraffic.MassTrafficFieldComponent
// 0x0078 (0x05C0 - 0x0548)
class UMassTrafficFieldComponent final : public UPrimitiveComponent
{
public:
	bool                                          bEnabled;                                          // 0x0548(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMassTrafficFieldInclusionMode                InclusionMode;                                     // 0x0549(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54A[0x6];                                      // 0x054A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Extent;                                            // 0x0550(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FZoneGraphTagFilter                    LaneTagFilter;                                     // 0x0568(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class UMassTrafficFieldOperationBase*> Operations;                                        // 0x0580(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FColor                                 Color;                                             // 0x0590(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Alpha;                                             // 0x0594(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_595[0x2B];                                     // 0x0595(0x002B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficFieldComponent">();
	}
	static class UMassTrafficFieldComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficFieldComponent>();
	}
};
static_assert(alignof(UMassTrafficFieldComponent) == 0x000008, "Wrong alignment on UMassTrafficFieldComponent");
static_assert(sizeof(UMassTrafficFieldComponent) == 0x0005C0, "Wrong size on UMassTrafficFieldComponent");
static_assert(offsetof(UMassTrafficFieldComponent, bEnabled) == 0x000548, "Member 'UMassTrafficFieldComponent::bEnabled' has a wrong offset!");
static_assert(offsetof(UMassTrafficFieldComponent, InclusionMode) == 0x000549, "Member 'UMassTrafficFieldComponent::InclusionMode' has a wrong offset!");
static_assert(offsetof(UMassTrafficFieldComponent, Extent) == 0x000550, "Member 'UMassTrafficFieldComponent::Extent' has a wrong offset!");
static_assert(offsetof(UMassTrafficFieldComponent, LaneTagFilter) == 0x000568, "Member 'UMassTrafficFieldComponent::LaneTagFilter' has a wrong offset!");
static_assert(offsetof(UMassTrafficFieldComponent, Operations) == 0x000580, "Member 'UMassTrafficFieldComponent::Operations' has a wrong offset!");
static_assert(offsetof(UMassTrafficFieldComponent, Color) == 0x000590, "Member 'UMassTrafficFieldComponent::Color' has a wrong offset!");
static_assert(offsetof(UMassTrafficFieldComponent, Alpha) == 0x000594, "Member 'UMassTrafficFieldComponent::Alpha' has a wrong offset!");

// Class MassTraffic.MassTrafficFieldOperationBase
// 0x0000 (0x0028 - 0x0028)
class UMassTrafficFieldOperationBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficFieldOperationBase">();
	}
	static class UMassTrafficFieldOperationBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficFieldOperationBase>();
	}
};
static_assert(alignof(UMassTrafficFieldOperationBase) == 0x000008, "Wrong alignment on UMassTrafficFieldOperationBase");
static_assert(sizeof(UMassTrafficFieldOperationBase) == 0x000028, "Wrong size on UMassTrafficFieldOperationBase");

// Class MassTraffic.MassTrafficBeginPlayFieldOperationBase
// 0x0000 (0x0028 - 0x0028)
class UMassTrafficBeginPlayFieldOperationBase : public UMassTrafficFieldOperationBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficBeginPlayFieldOperationBase">();
	}
	static class UMassTrafficBeginPlayFieldOperationBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficBeginPlayFieldOperationBase>();
	}
};
static_assert(alignof(UMassTrafficBeginPlayFieldOperationBase) == 0x000008, "Wrong alignment on UMassTrafficBeginPlayFieldOperationBase");
static_assert(sizeof(UMassTrafficBeginPlayFieldOperationBase) == 0x000028, "Wrong size on UMassTrafficBeginPlayFieldOperationBase");

// Class MassTraffic.MassTrafficFieldOperationsProcessorBase
// 0x0010 (0x00E8 - 0x00D8)
class UMassTrafficFieldOperationsProcessorBase : public UMassTrafficProcessorBase
{
public:
	TSubclassOf<class UMassTrafficFieldOperationBase> Operation;                                     // 0x00D8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMassTrafficSubsystem*                  CachedMassTrafficSubsystem;                        // 0x00E0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficFieldOperationsProcessorBase">();
	}
	static class UMassTrafficFieldOperationsProcessorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficFieldOperationsProcessorBase>();
	}
};
static_assert(alignof(UMassTrafficFieldOperationsProcessorBase) == 0x000008, "Wrong alignment on UMassTrafficFieldOperationsProcessorBase");
static_assert(sizeof(UMassTrafficFieldOperationsProcessorBase) == 0x0000E8, "Wrong size on UMassTrafficFieldOperationsProcessorBase");
static_assert(offsetof(UMassTrafficFieldOperationsProcessorBase, Operation) == 0x0000D8, "Member 'UMassTrafficFieldOperationsProcessorBase::Operation' has a wrong offset!");
static_assert(offsetof(UMassTrafficFieldOperationsProcessorBase, CachedMassTrafficSubsystem) == 0x0000E0, "Member 'UMassTrafficFieldOperationsProcessorBase::CachedMassTrafficSubsystem' has a wrong offset!");

// Class MassTraffic.MassTrafficForceTrafficVehicleViewerLODFieldOperation
// 0x0008 (0x0030 - 0x0028)
class UMassTrafficForceTrafficVehicleViewerLODFieldOperation final : public UMassTrafficFieldOperationBase
{
public:
	EMassLOD                                      LOD;                                               // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficForceTrafficVehicleViewerLODFieldOperation">();
	}
	static class UMassTrafficForceTrafficVehicleViewerLODFieldOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficForceTrafficVehicleViewerLODFieldOperation>();
	}
};
static_assert(alignof(UMassTrafficForceTrafficVehicleViewerLODFieldOperation) == 0x000008, "Wrong alignment on UMassTrafficForceTrafficVehicleViewerLODFieldOperation");
static_assert(sizeof(UMassTrafficForceTrafficVehicleViewerLODFieldOperation) == 0x000030, "Wrong size on UMassTrafficForceTrafficVehicleViewerLODFieldOperation");
static_assert(offsetof(UMassTrafficForceTrafficVehicleViewerLODFieldOperation, LOD) == 0x000028, "Member 'UMassTrafficForceTrafficVehicleViewerLODFieldOperation::LOD' has a wrong offset!");

// Class MassTraffic.MassTrafficSetLaneSpeedLimitFieldOperation
// 0x0008 (0x0030 - 0x0028)
class UMassTrafficSetLaneSpeedLimitFieldOperation final : public UMassTrafficBeginPlayFieldOperationBase
{
public:
	float                                         SpeedLimitMPH;                                     // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficSetLaneSpeedLimitFieldOperation">();
	}
	static class UMassTrafficSetLaneSpeedLimitFieldOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficSetLaneSpeedLimitFieldOperation>();
	}
};
static_assert(alignof(UMassTrafficSetLaneSpeedLimitFieldOperation) == 0x000008, "Wrong alignment on UMassTrafficSetLaneSpeedLimitFieldOperation");
static_assert(sizeof(UMassTrafficSetLaneSpeedLimitFieldOperation) == 0x000030, "Wrong size on UMassTrafficSetLaneSpeedLimitFieldOperation");
static_assert(offsetof(UMassTrafficSetLaneSpeedLimitFieldOperation, SpeedLimitMPH) == 0x000028, "Member 'UMassTrafficSetLaneSpeedLimitFieldOperation::SpeedLimitMPH' has a wrong offset!");

// Class MassTraffic.MassTrafficVisualLoggingFieldOperation
// 0x0008 (0x0030 - 0x0028)
class UMassTrafficVisualLoggingFieldOperation final : public UMassTrafficFieldOperationBase
{
public:
	bool                                          bVisLog;                                           // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficVisualLoggingFieldOperation">();
	}
	static class UMassTrafficVisualLoggingFieldOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficVisualLoggingFieldOperation>();
	}
};
static_assert(alignof(UMassTrafficVisualLoggingFieldOperation) == 0x000008, "Wrong alignment on UMassTrafficVisualLoggingFieldOperation");
static_assert(sizeof(UMassTrafficVisualLoggingFieldOperation) == 0x000030, "Wrong size on UMassTrafficVisualLoggingFieldOperation");
static_assert(offsetof(UMassTrafficVisualLoggingFieldOperation, bVisLog) == 0x000028, "Member 'UMassTrafficVisualLoggingFieldOperation::bVisLog' has a wrong offset!");

// Class MassTraffic.MassTrafficRetimeIntersectionPeriodsFieldOperation
// 0x0010 (0x0038 - 0x0028)
class UMassTrafficRetimeIntersectionPeriodsFieldOperation final : public UMassTrafficFieldOperationBase
{
public:
	float                                         VehiclesOnlyPeriodDurationMult;                    // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         PedestriansOnlyPeriodDurationMult;                 // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         VehicleAndPedestrianPeriodDurationMult;            // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EmptyPeriodDurationMult;                           // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficRetimeIntersectionPeriodsFieldOperation">();
	}
	static class UMassTrafficRetimeIntersectionPeriodsFieldOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficRetimeIntersectionPeriodsFieldOperation>();
	}
};
static_assert(alignof(UMassTrafficRetimeIntersectionPeriodsFieldOperation) == 0x000008, "Wrong alignment on UMassTrafficRetimeIntersectionPeriodsFieldOperation");
static_assert(sizeof(UMassTrafficRetimeIntersectionPeriodsFieldOperation) == 0x000038, "Wrong size on UMassTrafficRetimeIntersectionPeriodsFieldOperation");
static_assert(offsetof(UMassTrafficRetimeIntersectionPeriodsFieldOperation, VehiclesOnlyPeriodDurationMult) == 0x000028, "Member 'UMassTrafficRetimeIntersectionPeriodsFieldOperation::VehiclesOnlyPeriodDurationMult' has a wrong offset!");
static_assert(offsetof(UMassTrafficRetimeIntersectionPeriodsFieldOperation, PedestriansOnlyPeriodDurationMult) == 0x00002C, "Member 'UMassTrafficRetimeIntersectionPeriodsFieldOperation::PedestriansOnlyPeriodDurationMult' has a wrong offset!");
static_assert(offsetof(UMassTrafficRetimeIntersectionPeriodsFieldOperation, VehicleAndPedestrianPeriodDurationMult) == 0x000030, "Member 'UMassTrafficRetimeIntersectionPeriodsFieldOperation::VehicleAndPedestrianPeriodDurationMult' has a wrong offset!");
static_assert(offsetof(UMassTrafficRetimeIntersectionPeriodsFieldOperation, EmptyPeriodDurationMult) == 0x000034, "Member 'UMassTrafficRetimeIntersectionPeriodsFieldOperation::EmptyPeriodDurationMult' has a wrong offset!");

// Class MassTraffic.MassTrafficVisualLoggingFieldOperationProcessor
// 0x0000 (0x00E8 - 0x00E8)
class UMassTrafficVisualLoggingFieldOperationProcessor final : public UMassTrafficFieldOperationsProcessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficVisualLoggingFieldOperationProcessor">();
	}
	static class UMassTrafficVisualLoggingFieldOperationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficVisualLoggingFieldOperationProcessor>();
	}
};
static_assert(alignof(UMassTrafficVisualLoggingFieldOperationProcessor) == 0x000008, "Wrong alignment on UMassTrafficVisualLoggingFieldOperationProcessor");
static_assert(sizeof(UMassTrafficVisualLoggingFieldOperationProcessor) == 0x0000E8, "Wrong size on UMassTrafficVisualLoggingFieldOperationProcessor");

// Class MassTraffic.MassTrafficFrameStartFieldOperationsProcessor
// 0x0000 (0x00E8 - 0x00E8)
class UMassTrafficFrameStartFieldOperationsProcessor final : public UMassTrafficFieldOperationsProcessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficFrameStartFieldOperationsProcessor">();
	}
	static class UMassTrafficFrameStartFieldOperationsProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficFrameStartFieldOperationsProcessor>();
	}
};
static_assert(alignof(UMassTrafficFrameStartFieldOperationsProcessor) == 0x000008, "Wrong alignment on UMassTrafficFrameStartFieldOperationsProcessor");
static_assert(sizeof(UMassTrafficFrameStartFieldOperationsProcessor) == 0x0000E8, "Wrong size on UMassTrafficFrameStartFieldOperationsProcessor");

// Class MassTraffic.MassTrafficPostCalcVisualizationLODFieldOperationsProcessor
// 0x0000 (0x00E8 - 0x00E8)
class UMassTrafficPostCalcVisualizationLODFieldOperationsProcessor final : public UMassTrafficFieldOperationsProcessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficPostCalcVisualizationLODFieldOperationsProcessor">();
	}
	static class UMassTrafficPostCalcVisualizationLODFieldOperationsProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficPostCalcVisualizationLODFieldOperationsProcessor>();
	}
};
static_assert(alignof(UMassTrafficPostCalcVisualizationLODFieldOperationsProcessor) == 0x000008, "Wrong alignment on UMassTrafficPostCalcVisualizationLODFieldOperationsProcessor");
static_assert(sizeof(UMassTrafficPostCalcVisualizationLODFieldOperationsProcessor) == 0x0000E8, "Wrong size on UMassTrafficPostCalcVisualizationLODFieldOperationsProcessor");

// Class MassTraffic.MassTrafficFindDeviantParkedVehiclesProcessor
// 0x0358 (0x0430 - 0x00D8)
class UMassTrafficFindDeviantParkedVehiclesProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_D8[0x358];                                     // 0x00D8(0x0358)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficFindDeviantParkedVehiclesProcessor">();
	}
	static class UMassTrafficFindDeviantParkedVehiclesProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficFindDeviantParkedVehiclesProcessor>();
	}
};
static_assert(alignof(UMassTrafficFindDeviantParkedVehiclesProcessor) == 0x000008, "Wrong alignment on UMassTrafficFindDeviantParkedVehiclesProcessor");
static_assert(sizeof(UMassTrafficFindDeviantParkedVehiclesProcessor) == 0x000430, "Wrong size on UMassTrafficFindDeviantParkedVehiclesProcessor");

// Class MassTraffic.MassTrafficFindDeviantTrafficVehiclesProcessor
// 0x09F8 (0x0AD0 - 0x00D8)
class UMassTrafficFindDeviantTrafficVehiclesProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_D8[0x9F8];                                     // 0x00D8(0x09F8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficFindDeviantTrafficVehiclesProcessor">();
	}
	static class UMassTrafficFindDeviantTrafficVehiclesProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficFindDeviantTrafficVehiclesProcessor>();
	}
};
static_assert(alignof(UMassTrafficFindDeviantTrafficVehiclesProcessor) == 0x000008, "Wrong alignment on UMassTrafficFindDeviantTrafficVehiclesProcessor");
static_assert(sizeof(UMassTrafficFindDeviantTrafficVehiclesProcessor) == 0x000AD0, "Wrong size on UMassTrafficFindDeviantTrafficVehiclesProcessor");

// Class MassTraffic.MassTrafficFindNextVehicleProcessor
// 0x0358 (0x0430 - 0x00D8)
class UMassTrafficFindNextVehicleProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_D8[0x358];                                     // 0x00D8(0x0358)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficFindNextVehicleProcessor">();
	}
	static class UMassTrafficFindNextVehicleProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficFindNextVehicleProcessor>();
	}
};
static_assert(alignof(UMassTrafficFindNextVehicleProcessor) == 0x000008, "Wrong alignment on UMassTrafficFindNextVehicleProcessor");
static_assert(sizeof(UMassTrafficFindNextVehicleProcessor) == 0x000430, "Wrong size on UMassTrafficFindNextVehicleProcessor");

// Class MassTraffic.MassTrafficFindObstaclesProcessor
// 0x06A8 (0x0780 - 0x00D8)
class UMassTrafficFindObstaclesProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_D8[0x6A8];                                     // 0x00D8(0x06A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficFindObstaclesProcessor">();
	}
	static class UMassTrafficFindObstaclesProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficFindObstaclesProcessor>();
	}
};
static_assert(alignof(UMassTrafficFindObstaclesProcessor) == 0x000008, "Wrong alignment on UMassTrafficFindObstaclesProcessor");
static_assert(sizeof(UMassTrafficFindObstaclesProcessor) == 0x000780, "Wrong size on UMassTrafficFindObstaclesProcessor");

// Class MassTraffic.MassTrafficFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UMassTrafficFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void DespawnNonPlayerDrivenParkedVehicles(class AMassSpawner* ParkedVehiclesMassSpawner);
	static bool GetPackedTrafficVehicleInstanceCustomData(const class UPrimitiveComponent* PrimitiveComponent, struct FMassTrafficPackedVehicleInstanceCustomData* OutPackedCustomData, int32 DataIndex);
	static struct FMassTrafficPackedVehicleInstanceCustomData PackTrafficVehicleInstanceCustomData(const struct FMassTrafficVehicleInstanceCustomData& CustomData);
	static void RemoveVehiclesOverlappingPlayers(class UObject* WorldContextObject);
	static struct FMassTrafficVehicleInstanceCustomData UnpackTrafficVehicleInstanceCustomData(const struct FMassTrafficPackedVehicleInstanceCustomData& PackedCustomData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficFunctionLibrary">();
	}
	static class UMassTrafficFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficFunctionLibrary>();
	}
};
static_assert(alignof(UMassTrafficFunctionLibrary) == 0x000008, "Wrong alignment on UMassTrafficFunctionLibrary");
static_assert(sizeof(UMassTrafficFunctionLibrary) == 0x000028, "Wrong size on UMassTrafficFunctionLibrary");

// Class MassTraffic.MassTrafficInitInterpolationProcessor
// 0x0358 (0x0430 - 0x00D8)
class UMassTrafficInitInterpolationProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_D8[0x358];                                     // 0x00D8(0x0358)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficInitInterpolationProcessor">();
	}
	static class UMassTrafficInitInterpolationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficInitInterpolationProcessor>();
	}
};
static_assert(alignof(UMassTrafficInitInterpolationProcessor) == 0x000008, "Wrong alignment on UMassTrafficInitInterpolationProcessor");
static_assert(sizeof(UMassTrafficInitInterpolationProcessor) == 0x000430, "Wrong size on UMassTrafficInitInterpolationProcessor");

// Class MassTraffic.MassTrafficInitIntersectionsProcessor
// 0x0358 (0x0430 - 0x00D8)
class UMassTrafficInitIntersectionsProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_D8[0x358];                                     // 0x00D8(0x0358)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficInitIntersectionsProcessor">();
	}
	static class UMassTrafficInitIntersectionsProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficInitIntersectionsProcessor>();
	}
};
static_assert(alignof(UMassTrafficInitIntersectionsProcessor) == 0x000008, "Wrong alignment on UMassTrafficInitIntersectionsProcessor");
static_assert(sizeof(UMassTrafficInitIntersectionsProcessor) == 0x000430, "Wrong size on UMassTrafficInitIntersectionsProcessor");

// Class MassTraffic.MassTrafficInitParkedVehiclesProcessor
// 0x0358 (0x0430 - 0x00D8)
class UMassTrafficInitParkedVehiclesProcessor final : public UMassTrafficProcessorBase
{
public:
	struct FRandomStream                          RandomStream;                                      // 0x00D8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_E0[0x350];                                     // 0x00E0(0x0350)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficInitParkedVehiclesProcessor">();
	}
	static class UMassTrafficInitParkedVehiclesProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficInitParkedVehiclesProcessor>();
	}
};
static_assert(alignof(UMassTrafficInitParkedVehiclesProcessor) == 0x000008, "Wrong alignment on UMassTrafficInitParkedVehiclesProcessor");
static_assert(sizeof(UMassTrafficInitParkedVehiclesProcessor) == 0x000430, "Wrong size on UMassTrafficInitParkedVehiclesProcessor");
static_assert(offsetof(UMassTrafficInitParkedVehiclesProcessor, RandomStream) == 0x0000D8, "Member 'UMassTrafficInitParkedVehiclesProcessor::RandomStream' has a wrong offset!");

// Class MassTraffic.MassTrafficInitTrafficVehicleSpeedProcessor
// 0x0358 (0x0430 - 0x00D8)
class UMassTrafficInitTrafficVehicleSpeedProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_D8[0x358];                                     // 0x00D8(0x0358)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficInitTrafficVehicleSpeedProcessor">();
	}
	static class UMassTrafficInitTrafficVehicleSpeedProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficInitTrafficVehicleSpeedProcessor>();
	}
};
static_assert(alignof(UMassTrafficInitTrafficVehicleSpeedProcessor) == 0x000008, "Wrong alignment on UMassTrafficInitTrafficVehicleSpeedProcessor");
static_assert(sizeof(UMassTrafficInitTrafficVehicleSpeedProcessor) == 0x000430, "Wrong size on UMassTrafficInitTrafficVehicleSpeedProcessor");

// Class MassTraffic.MassTrafficInitTrafficVehiclesProcessor
// 0x0358 (0x0430 - 0x00D8)
class UMassTrafficInitTrafficVehiclesProcessor : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_D8[0x358];                                     // 0x00D8(0x0358)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficInitTrafficVehiclesProcessor">();
	}
	static class UMassTrafficInitTrafficVehiclesProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficInitTrafficVehiclesProcessor>();
	}
};
static_assert(alignof(UMassTrafficInitTrafficVehiclesProcessor) == 0x000008, "Wrong alignment on UMassTrafficInitTrafficVehiclesProcessor");
static_assert(sizeof(UMassTrafficInitTrafficVehiclesProcessor) == 0x000430, "Wrong size on UMassTrafficInitTrafficVehiclesProcessor");

// Class MassTraffic.MassTrafficInstancePlaybackLibrary
// 0x0000 (0x0028 - 0x0028)
class UMassTrafficInstancePlaybackLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool AnimStateFromDataAsset(const class UAnimToTextureDataAsset* DataAsset, int32 StateIndex, struct FMassTrafficAnimState* AnimState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficInstancePlaybackLibrary">();
	}
	static class UMassTrafficInstancePlaybackLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficInstancePlaybackLibrary>();
	}
};
static_assert(alignof(UMassTrafficInstancePlaybackLibrary) == 0x000008, "Wrong alignment on UMassTrafficInstancePlaybackLibrary");
static_assert(sizeof(UMassTrafficInstancePlaybackLibrary) == 0x000028, "Wrong size on UMassTrafficInstancePlaybackLibrary");

// Class MassTraffic.MassTrafficInterpolationProcessor
// 0x06A8 (0x0780 - 0x00D8)
class UMassTrafficInterpolationProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_D8[0x6A8];                                     // 0x00D8(0x06A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficInterpolationProcessor">();
	}
	static class UMassTrafficInterpolationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficInterpolationProcessor>();
	}
};
static_assert(alignof(UMassTrafficInterpolationProcessor) == 0x000008, "Wrong alignment on UMassTrafficInterpolationProcessor");
static_assert(sizeof(UMassTrafficInterpolationProcessor) == 0x000780, "Wrong size on UMassTrafficInterpolationProcessor");

// Class MassTraffic.MassTrafficIntersectionSimulationTrait
// 0x0000 (0x0028 - 0x0028)
class UMassTrafficIntersectionSimulationTrait final : public UMassEntityTraitBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficIntersectionSimulationTrait">();
	}
	static class UMassTrafficIntersectionSimulationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficIntersectionSimulationTrait>();
	}
};
static_assert(alignof(UMassTrafficIntersectionSimulationTrait) == 0x000008, "Wrong alignment on UMassTrafficIntersectionSimulationTrait");
static_assert(sizeof(UMassTrafficIntersectionSimulationTrait) == 0x000028, "Wrong size on UMassTrafficIntersectionSimulationTrait");

// Class MassTraffic.MassTrafficIntersectionSpawnDataGenerator
// 0x0038 (0x0068 - 0x0030)
class UMassTrafficIntersectionSpawnDataGenerator final : public UMassEntitySpawnDataGeneratorBase
{
public:
	int32                                         IntersectionEntityConfigIndex;                     // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMassTrafficLightTypesDataAsset*        TrafficLightTypesData;                             // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMassTrafficLightInstancesDataAsset*    TrafficLightInstanceData;                          // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TrafficLightSearchDistance;                        // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IntersectionSideToCrosswalkSearchDistance;         // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StandardTrafficGoSeconds;                          // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StandardMinimumTrafficGoSeconds;                   // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StandardCrosswalkGoSeconds;                        // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UnidirectionalTrafficStraightRightLeftGoSeconds;   // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UnidirectionalTrafficStraightRightGoSeconds;       // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BidirectionalTrafficStraightRightGoSeconds;        // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficIntersectionSpawnDataGenerator">();
	}
	static class UMassTrafficIntersectionSpawnDataGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficIntersectionSpawnDataGenerator>();
	}
};
static_assert(alignof(UMassTrafficIntersectionSpawnDataGenerator) == 0x000008, "Wrong alignment on UMassTrafficIntersectionSpawnDataGenerator");
static_assert(sizeof(UMassTrafficIntersectionSpawnDataGenerator) == 0x000068, "Wrong size on UMassTrafficIntersectionSpawnDataGenerator");
static_assert(offsetof(UMassTrafficIntersectionSpawnDataGenerator, IntersectionEntityConfigIndex) == 0x000030, "Member 'UMassTrafficIntersectionSpawnDataGenerator::IntersectionEntityConfigIndex' has a wrong offset!");
static_assert(offsetof(UMassTrafficIntersectionSpawnDataGenerator, TrafficLightTypesData) == 0x000038, "Member 'UMassTrafficIntersectionSpawnDataGenerator::TrafficLightTypesData' has a wrong offset!");
static_assert(offsetof(UMassTrafficIntersectionSpawnDataGenerator, TrafficLightInstanceData) == 0x000040, "Member 'UMassTrafficIntersectionSpawnDataGenerator::TrafficLightInstanceData' has a wrong offset!");
static_assert(offsetof(UMassTrafficIntersectionSpawnDataGenerator, TrafficLightSearchDistance) == 0x000048, "Member 'UMassTrafficIntersectionSpawnDataGenerator::TrafficLightSearchDistance' has a wrong offset!");
static_assert(offsetof(UMassTrafficIntersectionSpawnDataGenerator, IntersectionSideToCrosswalkSearchDistance) == 0x00004C, "Member 'UMassTrafficIntersectionSpawnDataGenerator::IntersectionSideToCrosswalkSearchDistance' has a wrong offset!");
static_assert(offsetof(UMassTrafficIntersectionSpawnDataGenerator, StandardTrafficGoSeconds) == 0x000050, "Member 'UMassTrafficIntersectionSpawnDataGenerator::StandardTrafficGoSeconds' has a wrong offset!");
static_assert(offsetof(UMassTrafficIntersectionSpawnDataGenerator, StandardMinimumTrafficGoSeconds) == 0x000054, "Member 'UMassTrafficIntersectionSpawnDataGenerator::StandardMinimumTrafficGoSeconds' has a wrong offset!");
static_assert(offsetof(UMassTrafficIntersectionSpawnDataGenerator, StandardCrosswalkGoSeconds) == 0x000058, "Member 'UMassTrafficIntersectionSpawnDataGenerator::StandardCrosswalkGoSeconds' has a wrong offset!");
static_assert(offsetof(UMassTrafficIntersectionSpawnDataGenerator, UnidirectionalTrafficStraightRightLeftGoSeconds) == 0x00005C, "Member 'UMassTrafficIntersectionSpawnDataGenerator::UnidirectionalTrafficStraightRightLeftGoSeconds' has a wrong offset!");
static_assert(offsetof(UMassTrafficIntersectionSpawnDataGenerator, UnidirectionalTrafficStraightRightGoSeconds) == 0x000060, "Member 'UMassTrafficIntersectionSpawnDataGenerator::UnidirectionalTrafficStraightRightGoSeconds' has a wrong offset!");
static_assert(offsetof(UMassTrafficIntersectionSpawnDataGenerator, BidirectionalTrafficStraightRightGoSeconds) == 0x000064, "Member 'UMassTrafficIntersectionSpawnDataGenerator::BidirectionalTrafficStraightRightGoSeconds' has a wrong offset!");

// Class MassTraffic.MassTrafficLaneChangingProcessor
// 0x06A8 (0x0780 - 0x00D8)
class UMassTrafficLaneChangingProcessor : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_D8[0x6A8];                                     // 0x00D8(0x06A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficLaneChangingProcessor">();
	}
	static class UMassTrafficLaneChangingProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficLaneChangingProcessor>();
	}
};
static_assert(alignof(UMassTrafficLaneChangingProcessor) == 0x000008, "Wrong alignment on UMassTrafficLaneChangingProcessor");
static_assert(sizeof(UMassTrafficLaneChangingProcessor) == 0x000780, "Wrong size on UMassTrafficLaneChangingProcessor");

// Class MassTraffic.MassTrafficLightRepresentationActorManagement
// 0x0000 (0x0028 - 0x0028)
class UMassTrafficLightRepresentationActorManagement final : public UMassRepresentationActorManagement
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficLightRepresentationActorManagement">();
	}
	static class UMassTrafficLightRepresentationActorManagement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficLightRepresentationActorManagement>();
	}
};
static_assert(alignof(UMassTrafficLightRepresentationActorManagement) == 0x000008, "Wrong alignment on UMassTrafficLightRepresentationActorManagement");
static_assert(sizeof(UMassTrafficLightRepresentationActorManagement) == 0x000028, "Wrong size on UMassTrafficLightRepresentationActorManagement");

// Class MassTraffic.MassTrafficLightTypesDataAsset
// 0x0010 (0x0040 - 0x0030)
class UMassTrafficLightTypesDataAsset final : public UDataAsset
{
public:
	TArray<struct FMassTrafficLightTypeData>      TrafficLightTypes;                                 // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficLightTypesDataAsset">();
	}
	static class UMassTrafficLightTypesDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficLightTypesDataAsset>();
	}
};
static_assert(alignof(UMassTrafficLightTypesDataAsset) == 0x000008, "Wrong alignment on UMassTrafficLightTypesDataAsset");
static_assert(sizeof(UMassTrafficLightTypesDataAsset) == 0x000040, "Wrong size on UMassTrafficLightTypesDataAsset");
static_assert(offsetof(UMassTrafficLightTypesDataAsset, TrafficLightTypes) == 0x000030, "Member 'UMassTrafficLightTypesDataAsset::TrafficLightTypes' has a wrong offset!");

// Class MassTraffic.MassTrafficLightInstancesDataAsset
// 0x0028 (0x0058 - 0x0030)
class UMassTrafficLightInstancesDataAsset final : public UDataAsset
{
public:
	class UMassTrafficLightTypesDataAsset*        TrafficLightTypesData;                             // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMassTrafficLightInstanceDesc>  TrafficLights;                                     // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumTrafficLights;                                  // 0x0048(0x0004)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0xC];                                       // 0x004C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficLightInstancesDataAsset">();
	}
	static class UMassTrafficLightInstancesDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficLightInstancesDataAsset>();
	}
};
static_assert(alignof(UMassTrafficLightInstancesDataAsset) == 0x000008, "Wrong alignment on UMassTrafficLightInstancesDataAsset");
static_assert(sizeof(UMassTrafficLightInstancesDataAsset) == 0x000058, "Wrong size on UMassTrafficLightInstancesDataAsset");
static_assert(offsetof(UMassTrafficLightInstancesDataAsset, TrafficLightTypesData) == 0x000030, "Member 'UMassTrafficLightInstancesDataAsset::TrafficLightTypesData' has a wrong offset!");
static_assert(offsetof(UMassTrafficLightInstancesDataAsset, TrafficLights) == 0x000038, "Member 'UMassTrafficLightInstancesDataAsset::TrafficLights' has a wrong offset!");
static_assert(offsetof(UMassTrafficLightInstancesDataAsset, NumTrafficLights) == 0x000048, "Member 'UMassTrafficLightInstancesDataAsset::NumTrafficLights' has a wrong offset!");

// Class MassTraffic.MassTrafficIntersectionVisualizationLODProcessor
// 0x0000 (0x0E20 - 0x0E20)
class UMassTrafficIntersectionVisualizationLODProcessor final : public UMassVisualizationLODProcessor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficIntersectionVisualizationLODProcessor">();
	}
	static class UMassTrafficIntersectionVisualizationLODProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficIntersectionVisualizationLODProcessor>();
	}
};
static_assert(alignof(UMassTrafficIntersectionVisualizationLODProcessor) == 0x000008, "Wrong alignment on UMassTrafficIntersectionVisualizationLODProcessor");
static_assert(sizeof(UMassTrafficIntersectionVisualizationLODProcessor) == 0x000E20, "Wrong size on UMassTrafficIntersectionVisualizationLODProcessor");

// Class MassTraffic.MassTrafficIntersectionLODCollectorProcessor
// 0x0000 (0x0E20 - 0x0E20)
class UMassTrafficIntersectionLODCollectorProcessor final : public UMassLODCollectorProcessor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficIntersectionLODCollectorProcessor">();
	}
	static class UMassTrafficIntersectionLODCollectorProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficIntersectionLODCollectorProcessor>();
	}
};
static_assert(alignof(UMassTrafficIntersectionLODCollectorProcessor) == 0x000008, "Wrong alignment on UMassTrafficIntersectionLODCollectorProcessor");
static_assert(sizeof(UMassTrafficIntersectionLODCollectorProcessor) == 0x000E20, "Wrong size on UMassTrafficIntersectionLODCollectorProcessor");

// Class MassTraffic.MassTrafficLightVisualizationProcessor
// 0x0000 (0x0420 - 0x0420)
class UMassTrafficLightVisualizationProcessor final : public UHTMassSimpleVisualizationProcessor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficLightVisualizationProcessor">();
	}
	static class UMassTrafficLightVisualizationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficLightVisualizationProcessor>();
	}
};
static_assert(alignof(UMassTrafficLightVisualizationProcessor) == 0x000008, "Wrong alignment on UMassTrafficLightVisualizationProcessor");
static_assert(sizeof(UMassTrafficLightVisualizationProcessor) == 0x000420, "Wrong size on UMassTrafficLightVisualizationProcessor");

// Class MassTraffic.MassTrafficLightUpdateCustomVisualizationProcessor
// 0x0360 (0x0420 - 0x00C0)
class UMassTrafficLightUpdateCustomVisualizationProcessor final : public UMassProcessor
{
public:
	class UWorld*                                 World;                                             // 0x00C0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C8[0x358];                                     // 0x00C8(0x0358)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficLightUpdateCustomVisualizationProcessor">();
	}
	static class UMassTrafficLightUpdateCustomVisualizationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficLightUpdateCustomVisualizationProcessor>();
	}
};
static_assert(alignof(UMassTrafficLightUpdateCustomVisualizationProcessor) == 0x000008, "Wrong alignment on UMassTrafficLightUpdateCustomVisualizationProcessor");
static_assert(sizeof(UMassTrafficLightUpdateCustomVisualizationProcessor) == 0x000420, "Wrong size on UMassTrafficLightUpdateCustomVisualizationProcessor");
static_assert(offsetof(UMassTrafficLightUpdateCustomVisualizationProcessor, World) == 0x0000C0, "Member 'UMassTrafficLightUpdateCustomVisualizationProcessor::World' has a wrong offset!");

// Class MassTraffic.MassTrafficLightVisualizationTrait
// 0x0020 (0x01C0 - 0x01A0)
class UMassTrafficLightVisualizationTrait final : public UMassVisualizationTrait
{
public:
	struct FMassTrafficLightsParameters           TrafficLightsParams;                               // 0x01A0(0x0018)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B8[0x8];                                      // 0x01B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficLightVisualizationTrait">();
	}
	static class UMassTrafficLightVisualizationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficLightVisualizationTrait>();
	}
};
static_assert(alignof(UMassTrafficLightVisualizationTrait) == 0x000008, "Wrong alignment on UMassTrafficLightVisualizationTrait");
static_assert(sizeof(UMassTrafficLightVisualizationTrait) == 0x0001C0, "Wrong size on UMassTrafficLightVisualizationTrait");
static_assert(offsetof(UMassTrafficLightVisualizationTrait, TrafficLightsParams) == 0x0001A0, "Member 'UMassTrafficLightVisualizationTrait::TrafficLightsParams' has a wrong offset!");

// Class MassTraffic.MassTrafficObstacleTrait
// 0x0018 (0x0040 - 0x0028)
class UMassTrafficObstacleTrait final : public UMassEntityTraitBase
{
public:
	struct FAgentRadiusFragment                   RadiusFragment;                                    // 0x0028(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bSmallBoxObstacle;                                 // 0x002C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
