#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassAIBehavior

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "SmartObjectsModule_structs.hpp"
#include "MassSmartObjects_structs.hpp"
#include "MassNavigation_structs.hpp"
#include "MassEntity_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ZoneGraph_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MassMovement_structs.hpp"


namespace SDK
{

// Enum MassAIBehavior.MassCrowdHitType
// NumValues: 0x0003
enum class EMassCrowdHitType : uint8
{
	TakeDamage                               = 0,
	MoveHit                                  = 1,
	MassCrowdHitType_MAX                     = 2,
};

// Enum MassAIBehavior.EMassLookAtMode
// NumValues: 0x0004
enum class EMassLookAtMode : uint8
{
	LookForward                              = 0,
	LookAlongPath                            = 1,
	LookAtEntity                             = 2,
	EMassLookAtMode_MAX                      = 3,
};

// Enum MassAIBehavior.EMassLookAtGazeMode
// NumValues: 0x0004
enum class EMassLookAtGazeMode : uint8
{
	None                                     = 0,
	Constant                                 = 1,
	Glance                                   = 2,
	EMassLookAtGazeMode_MAX                  = 3,
};

// Enum MassAIBehavior.EMassLookAtInterpolationSpeed
// NumValues: 0x0006
enum class EMassLookAtInterpolationSpeed : uint8
{
	Instant                                  = 0,
	Fast                                     = 1,
	Regular                                  = 2,
	Slow                                     = 3,
	Custom                                   = 4,
	EMassLookAtInterpolationSpeed_MAX        = 5,
};

// Enum MassAIBehavior.EMassLookAtPriorities
// NumValues: 0x0004
enum class EMassLookAtPriorities : uint8
{
	MaxPriorities                            = 16,
	MaxPriorityIndex                         = 15,
	LowestPriority                           = 15,
	EMassLookAtPriorities_MAX                = 17,
};

// ScriptStruct MassAIBehavior.MassClaimSmartObjectTaskInstanceData
// 0x0038 (0x0038 - 0x0000)
struct FMassClaimSmartObjectTaskInstanceData final
{
public:
	struct FStateTreeStructRef                    CandidateSlots;                                    // 0x0000(0x0010)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FSmartObjectClaimHandle                ClaimedSlot;                                       // 0x0010(0x0028)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassClaimSmartObjectTaskInstanceData) == 0x000001, "Wrong alignment on FMassClaimSmartObjectTaskInstanceData");
static_assert(sizeof(FMassClaimSmartObjectTaskInstanceData) == 0x000038, "Wrong size on FMassClaimSmartObjectTaskInstanceData");
static_assert(offsetof(FMassClaimSmartObjectTaskInstanceData, CandidateSlots) == 0x000000, "Member 'FMassClaimSmartObjectTaskInstanceData::CandidateSlots' has a wrong offset!");
static_assert(offsetof(FMassClaimSmartObjectTaskInstanceData, ClaimedSlot) == 0x000010, "Member 'FMassClaimSmartObjectTaskInstanceData::ClaimedSlot' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassStateTreeTaskBase
// 0x0000 (0x0028 - 0x0028)
struct FMassStateTreeTaskBase : public FStateTreeTaskBase
{
};
static_assert(alignof(FMassStateTreeTaskBase) == 0x000004, "Wrong alignment on FMassStateTreeTaskBase");
static_assert(sizeof(FMassStateTreeTaskBase) == 0x000028, "Wrong size on FMassStateTreeTaskBase");

// ScriptStruct MassAIBehavior.MassClaimSmartObjectTask
// 0x0018 (0x0040 - 0x0028)
struct FMassClaimSmartObjectTask final : public FMassStateTreeTaskBase
{
public:
	uint8                                         Pad_28[0x14];                                      // 0x0028(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InteractionCooldown;                               // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
static_assert(alignof(FMassClaimSmartObjectTask) == 0x000004, "Wrong alignment on FMassClaimSmartObjectTask");
static_assert(sizeof(FMassClaimSmartObjectTask) == 0x000040, "Wrong size on FMassClaimSmartObjectTask");
static_assert(offsetof(FMassClaimSmartObjectTask, InteractionCooldown) == 0x00003C, "Member 'FMassClaimSmartObjectTask::InteractionCooldown' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassComponentHitEvaluatorInstanceData
// 0x0018 (0x0018 - 0x0000)
struct FMassComponentHitEvaluatorInstanceData final
{
public:
	bool                                          bGotHit;                                           // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassEntityHandle                      LastHitEntity;                                     // 0x0008(0x0008)(Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMassCrowdHitType                             HitType;                                           // 0x0010(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassComponentHitEvaluatorInstanceData) == 0x000001, "Wrong alignment on FMassComponentHitEvaluatorInstanceData");
static_assert(sizeof(FMassComponentHitEvaluatorInstanceData) == 0x000018, "Wrong size on FMassComponentHitEvaluatorInstanceData");
static_assert(offsetof(FMassComponentHitEvaluatorInstanceData, bGotHit) == 0x000000, "Member 'FMassComponentHitEvaluatorInstanceData::bGotHit' has a wrong offset!");
static_assert(offsetof(FMassComponentHitEvaluatorInstanceData, LastHitEntity) == 0x000008, "Member 'FMassComponentHitEvaluatorInstanceData::LastHitEntity' has a wrong offset!");
static_assert(offsetof(FMassComponentHitEvaluatorInstanceData, HitType) == 0x000010, "Member 'FMassComponentHitEvaluatorInstanceData::HitType' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassStateTreeEvaluatorBase
// 0x0000 (0x0020 - 0x0020)
struct FMassStateTreeEvaluatorBase : public FStateTreeEvaluatorBase
{
};
static_assert(alignof(FMassStateTreeEvaluatorBase) == 0x000004, "Wrong alignment on FMassStateTreeEvaluatorBase");
static_assert(sizeof(FMassStateTreeEvaluatorBase) == 0x000020, "Wrong size on FMassStateTreeEvaluatorBase");

// ScriptStruct MassAIBehavior.MassComponentHitEvaluator
// 0x0008 (0x0028 - 0x0020)
struct FMassComponentHitEvaluator final : public FMassStateTreeEvaluatorBase
{
public:
	uint8                                         Pad_20[0x8];                                       // 0x0020(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassComponentHitEvaluator) == 0x000004, "Wrong alignment on FMassComponentHitEvaluator");
static_assert(sizeof(FMassComponentHitEvaluator) == 0x000028, "Wrong size on FMassComponentHitEvaluator");

// ScriptStruct MassAIBehavior.MassHitResult
// 0x0020 (0x0020 - 0x0000)
struct FMassHitResult final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassHitResult) == 0x000001, "Wrong alignment on FMassHitResult");
static_assert(sizeof(FMassHitResult) == 0x000020, "Wrong size on FMassHitResult");

// ScriptStruct MassAIBehavior.MassFindSmartObjectTargetInstanceData
// 0x0050 (0x0050 - 0x0000)
struct FMassFindSmartObjectTargetInstanceData final
{
public:
	struct FSmartObjectClaimHandle                ClaimedSlot;                                       // 0x0000(0x0028)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FMassTargetLocation                    SmartObjectLocation;                               // 0x0028(0x0028)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassFindSmartObjectTargetInstanceData) == 0x000001, "Wrong alignment on FMassFindSmartObjectTargetInstanceData");
static_assert(sizeof(FMassFindSmartObjectTargetInstanceData) == 0x000050, "Wrong size on FMassFindSmartObjectTargetInstanceData");
static_assert(offsetof(FMassFindSmartObjectTargetInstanceData, ClaimedSlot) == 0x000000, "Member 'FMassFindSmartObjectTargetInstanceData::ClaimedSlot' has a wrong offset!");
static_assert(offsetof(FMassFindSmartObjectTargetInstanceData, SmartObjectLocation) == 0x000028, "Member 'FMassFindSmartObjectTargetInstanceData::SmartObjectLocation' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassFindSmartObjectTargetTask
// 0x0008 (0x0030 - 0x0028)
struct FMassFindSmartObjectTargetTask final : public FMassStateTreeTaskBase
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassFindSmartObjectTargetTask) == 0x000004, "Wrong alignment on FMassFindSmartObjectTargetTask");
static_assert(sizeof(FMassFindSmartObjectTargetTask) == 0x000030, "Wrong size on FMassFindSmartObjectTargetTask");

// ScriptStruct MassAIBehavior.MassFindSmartObjectTaskInstanceData
// 0x00C0 (0x00C0 - 0x0000)
struct FMassFindSmartObjectTaskInstanceData final
{
public:
	struct FMassSmartObjectCandidateSlots         FoundCandidateSlots;                               // 0x0000(0x00A4)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bHasCandidateSlots;                                // 0x00A4(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassSmartObjectRequestID              SearchRequestID;                                   // 0x00A8(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
	double                                        NextUpdate;                                        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FZoneGraphLaneHandle                   LastLane;                                          // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassFindSmartObjectTaskInstanceData) == 0x000008, "Wrong alignment on FMassFindSmartObjectTaskInstanceData");
static_assert(sizeof(FMassFindSmartObjectTaskInstanceData) == 0x0000C0, "Wrong size on FMassFindSmartObjectTaskInstanceData");
static_assert(offsetof(FMassFindSmartObjectTaskInstanceData, FoundCandidateSlots) == 0x000000, "Member 'FMassFindSmartObjectTaskInstanceData::FoundCandidateSlots' has a wrong offset!");
static_assert(offsetof(FMassFindSmartObjectTaskInstanceData, bHasCandidateSlots) == 0x0000A4, "Member 'FMassFindSmartObjectTaskInstanceData::bHasCandidateSlots' has a wrong offset!");
static_assert(offsetof(FMassFindSmartObjectTaskInstanceData, SearchRequestID) == 0x0000A8, "Member 'FMassFindSmartObjectTaskInstanceData::SearchRequestID' has a wrong offset!");
static_assert(offsetof(FMassFindSmartObjectTaskInstanceData, NextUpdate) == 0x0000B0, "Member 'FMassFindSmartObjectTaskInstanceData::NextUpdate' has a wrong offset!");
static_assert(offsetof(FMassFindSmartObjectTaskInstanceData, LastLane) == 0x0000B8, "Member 'FMassFindSmartObjectTaskInstanceData::LastLane' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassFindSmartObjectTask
// 0x0070 (0x0098 - 0x0028)
struct FMassFindSmartObjectTask : public FMassStateTreeTaskBase
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      ActivityRequirements;                              // 0x0048(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)
	float                                         SearchInterval;                                    // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFindFromLaneLocation;                             // 0x0094(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassFindSmartObjectTask) == 0x000004, "Wrong alignment on FMassFindSmartObjectTask");
static_assert(sizeof(FMassFindSmartObjectTask) == 0x000098, "Wrong size on FMassFindSmartObjectTask");
static_assert(offsetof(FMassFindSmartObjectTask, ActivityRequirements) == 0x000048, "Member 'FMassFindSmartObjectTask::ActivityRequirements' has a wrong offset!");
static_assert(offsetof(FMassFindSmartObjectTask, SearchInterval) == 0x000090, "Member 'FMassFindSmartObjectTask::SearchInterval' has a wrong offset!");
static_assert(offsetof(FMassFindSmartObjectTask, bFindFromLaneLocation) == 0x000094, "Member 'FMassFindSmartObjectTask::bFindFromLaneLocation' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassLookAtFragment
// 0x00A0 (0x00A0 - 0x0000)
struct FMassLookAtFragment final : public FMassFragment
{
public:
	struct FVector                                MainTargetLocation;                                // 0x0000(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                GazeTargetLocation;                                // 0x0018(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Direction;                                         // 0x0030(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                GazeDirection;                                     // 0x0048(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassEntityHandle                      TrackedEntity;                                     // 0x0060(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassEntityHandle                      GazeTrackedEntity;                                 // 0x0068(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        GazeStartTime;                                     // 0x0070(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GazeDuration;                                      // 0x0078(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        LastSeenActionID;                                  // 0x007C(0x0002)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMassLookAtMode                               LookAtMode;                                        // 0x007E(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMassLookAtInterpolationSpeed                 InterpolationSpeed;                                // 0x007F(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CustomInterpolationSpeed;                          // 0x0080(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMassLookAtGazeMode                           RandomGazeMode;                                    // 0x0084(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         RandomGazeYawVariation;                            // 0x0085(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         RandomGazePitchVariation;                          // 0x0086(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bRandomGazeEntities : 1;                           // 0x0087(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	struct FVector                                AttentionLocation;                                 // 0x0088(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassLookAtFragment) == 0x000008, "Wrong alignment on FMassLookAtFragment");
static_assert(sizeof(FMassLookAtFragment) == 0x0000A0, "Wrong size on FMassLookAtFragment");
static_assert(offsetof(FMassLookAtFragment, MainTargetLocation) == 0x000000, "Member 'FMassLookAtFragment::MainTargetLocation' has a wrong offset!");
static_assert(offsetof(FMassLookAtFragment, GazeTargetLocation) == 0x000018, "Member 'FMassLookAtFragment::GazeTargetLocation' has a wrong offset!");
static_assert(offsetof(FMassLookAtFragment, Direction) == 0x000030, "Member 'FMassLookAtFragment::Direction' has a wrong offset!");
static_assert(offsetof(FMassLookAtFragment, GazeDirection) == 0x000048, "Member 'FMassLookAtFragment::GazeDirection' has a wrong offset!");
static_assert(offsetof(FMassLookAtFragment, TrackedEntity) == 0x000060, "Member 'FMassLookAtFragment::TrackedEntity' has a wrong offset!");
static_assert(offsetof(FMassLookAtFragment, GazeTrackedEntity) == 0x000068, "Member 'FMassLookAtFragment::GazeTrackedEntity' has a wrong offset!");
static_assert(offsetof(FMassLookAtFragment, GazeStartTime) == 0x000070, "Member 'FMassLookAtFragment::GazeStartTime' has a wrong offset!");
static_assert(offsetof(FMassLookAtFragment, GazeDuration) == 0x000078, "Member 'FMassLookAtFragment::GazeDuration' has a wrong offset!");
static_assert(offsetof(FMassLookAtFragment, LastSeenActionID) == 0x00007C, "Member 'FMassLookAtFragment::LastSeenActionID' has a wrong offset!");
static_assert(offsetof(FMassLookAtFragment, LookAtMode) == 0x00007E, "Member 'FMassLookAtFragment::LookAtMode' has a wrong offset!");
static_assert(offsetof(FMassLookAtFragment, InterpolationSpeed) == 0x00007F, "Member 'FMassLookAtFragment::InterpolationSpeed' has a wrong offset!");
static_assert(offsetof(FMassLookAtFragment, CustomInterpolationSpeed) == 0x000080, "Member 'FMassLookAtFragment::CustomInterpolationSpeed' has a wrong offset!");
static_assert(offsetof(FMassLookAtFragment, RandomGazeMode) == 0x000084, "Member 'FMassLookAtFragment::RandomGazeMode' has a wrong offset!");
static_assert(offsetof(FMassLookAtFragment, RandomGazeYawVariation) == 0x000085, "Member 'FMassLookAtFragment::RandomGazeYawVariation' has a wrong offset!");
static_assert(offsetof(FMassLookAtFragment, RandomGazePitchVariation) == 0x000086, "Member 'FMassLookAtFragment::RandomGazePitchVariation' has a wrong offset!");
static_assert(offsetof(FMassLookAtFragment, AttentionLocation) == 0x000088, "Member 'FMassLookAtFragment::AttentionLocation' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassLookAtTargetTag
// 0x0000 (0x0001 - 0x0001)
struct FMassLookAtTargetTag final : public FMassTag
{
};
static_assert(alignof(FMassLookAtTargetTag) == 0x000001, "Wrong alignment on FMassLookAtTargetTag");
static_assert(sizeof(FMassLookAtTargetTag) == 0x000001, "Wrong size on FMassLookAtTargetTag");

// ScriptStruct MassAIBehavior.MassLookAtPriority
// 0x0001 (0x0001 - 0x0000)
struct FMassLookAtPriority final
{
public:
	uint8                                         Value;                                             // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FMassLookAtPriority) == 0x000001, "Wrong alignment on FMassLookAtPriority");
static_assert(sizeof(FMassLookAtPriority) == 0x000001, "Wrong size on FMassLookAtPriority");
static_assert(offsetof(FMassLookAtPriority, Value) == 0x000000, "Member 'FMassLookAtPriority::Value' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassLookAtRequestFragment
// 0x0018 (0x0018 - 0x0000)
struct FMassLookAtRequestFragment final : public FMassFragment
{
public:
	struct FMassEntityHandle                      ViewerEntity;                                      // 0x0000(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassEntityHandle                      TargetEntity;                                      // 0x0008(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassLookAtPriority                    Priority;                                          // 0x0010(0x0001)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	EMassLookAtMode                               LookAtMode;                                        // 0x0011(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMassLookAtInterpolationSpeed                 InterpolationSpeed;                                // 0x0012(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CustomInterpolationSpeed;                          // 0x0014(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassLookAtRequestFragment) == 0x000004, "Wrong alignment on FMassLookAtRequestFragment");
static_assert(sizeof(FMassLookAtRequestFragment) == 0x000018, "Wrong size on FMassLookAtRequestFragment");
static_assert(offsetof(FMassLookAtRequestFragment, ViewerEntity) == 0x000000, "Member 'FMassLookAtRequestFragment::ViewerEntity' has a wrong offset!");
static_assert(offsetof(FMassLookAtRequestFragment, TargetEntity) == 0x000008, "Member 'FMassLookAtRequestFragment::TargetEntity' has a wrong offset!");
static_assert(offsetof(FMassLookAtRequestFragment, Priority) == 0x000010, "Member 'FMassLookAtRequestFragment::Priority' has a wrong offset!");
static_assert(offsetof(FMassLookAtRequestFragment, LookAtMode) == 0x000011, "Member 'FMassLookAtRequestFragment::LookAtMode' has a wrong offset!");
static_assert(offsetof(FMassLookAtRequestFragment, InterpolationSpeed) == 0x000012, "Member 'FMassLookAtRequestFragment::InterpolationSpeed' has a wrong offset!");
static_assert(offsetof(FMassLookAtRequestFragment, CustomInterpolationSpeed) == 0x000014, "Member 'FMassLookAtRequestFragment::CustomInterpolationSpeed' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassLookAtTargetFragment
// 0x0028 (0x0028 - 0x0000)
struct FMassLookAtTargetFragment final : public FMassFragment
{
public:
	struct FVector                                Offset;                                            // 0x0000(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassLookAtPriority                    Priority;                                          // 0x0018(0x0001)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0xF];                                       // 0x0019(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassLookAtTargetFragment) == 0x000001, "Wrong alignment on FMassLookAtTargetFragment");
static_assert(sizeof(FMassLookAtTargetFragment) == 0x000028, "Wrong size on FMassLookAtTargetFragment");
static_assert(offsetof(FMassLookAtTargetFragment, Offset) == 0x000000, "Member 'FMassLookAtTargetFragment::Offset' has a wrong offset!");
static_assert(offsetof(FMassLookAtTargetFragment, Priority) == 0x000018, "Member 'FMassLookAtTargetFragment::Priority' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassInLookAtTargetGridTag
// 0x0000 (0x0001 - 0x0001)
struct FMassInLookAtTargetGridTag final : public FMassTag
{
};
static_assert(alignof(FMassInLookAtTargetGridTag) == 0x000001, "Wrong alignment on FMassInLookAtTargetGridTag");
static_assert(sizeof(FMassInLookAtTargetGridTag) == 0x000001, "Wrong size on FMassInLookAtTargetGridTag");

// ScriptStruct MassAIBehavior.MassLookAtTrajectoryPoint
// 0x0020 (0x0020 - 0x0000)
struct FMassLookAtTrajectoryPoint final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassLookAtTrajectoryPoint) == 0x000001, "Wrong alignment on FMassLookAtTrajectoryPoint");
static_assert(sizeof(FMassLookAtTrajectoryPoint) == 0x000020, "Wrong size on FMassLookAtTrajectoryPoint");

// ScriptStruct MassAIBehavior.MassLookAtTrajectoryFragment
// 0x0070 (0x0070 - 0x0000)
struct FMassLookAtTrajectoryFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x70];                                       // 0x0000(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassLookAtTrajectoryFragment) == 0x000001, "Wrong alignment on FMassLookAtTrajectoryFragment");
static_assert(sizeof(FMassLookAtTrajectoryFragment) == 0x000070, "Wrong size on FMassLookAtTrajectoryFragment");

// ScriptStruct MassAIBehavior.MassLookAtRequestHandle
// 0x0010 (0x0010 - 0x0000)
struct FMassLookAtRequestHandle final
{
public:
	struct FMassEntityHandle                      Request;                                           // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassEntityHandle                      Target;                                            // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassLookAtRequestHandle) == 0x000001, "Wrong alignment on FMassLookAtRequestHandle");
static_assert(sizeof(FMassLookAtRequestHandle) == 0x000010, "Wrong size on FMassLookAtRequestHandle");
static_assert(offsetof(FMassLookAtRequestHandle, Request) == 0x000000, "Member 'FMassLookAtRequestHandle::Request' has a wrong offset!");
static_assert(offsetof(FMassLookAtRequestHandle, Target) == 0x000008, "Member 'FMassLookAtRequestHandle::Target' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassLookAtTaskInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FMassLookAtTaskInstanceData final
{
public:
	struct FMassEntityHandle                      TargetEntity;                                      // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         duration;                                          // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassLookAtTaskInstanceData) == 0x000004, "Wrong alignment on FMassLookAtTaskInstanceData");
static_assert(sizeof(FMassLookAtTaskInstanceData) == 0x000010, "Wrong size on FMassLookAtTaskInstanceData");
static_assert(offsetof(FMassLookAtTaskInstanceData, TargetEntity) == 0x000000, "Member 'FMassLookAtTaskInstanceData::TargetEntity' has a wrong offset!");
static_assert(offsetof(FMassLookAtTaskInstanceData, duration) == 0x000008, "Member 'FMassLookAtTaskInstanceData::duration' has a wrong offset!");
static_assert(offsetof(FMassLookAtTaskInstanceData, Time) == 0x00000C, "Member 'FMassLookAtTaskInstanceData::Time' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassLookAtTask
// 0x0018 (0x0040 - 0x0028)
struct FMassLookAtTask final : public FMassStateTreeTaskBase
{
public:
	uint8                                         Pad_28[0xC];                                       // 0x0028(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassLookAtPriority                    Priority;                                          // 0x0034(0x0001)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	EMassLookAtMode                               LookAtMode;                                        // 0x0035(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMassLookAtInterpolationSpeed                 InterpolationSpeed;                                // 0x0036(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CustomInterpolationSpeed;                          // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMassLookAtGazeMode                           RandomGazeMode;                                    // 0x003C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         RandomGazeYawVariation;                            // 0x003D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         RandomGazePitchVariation;                          // 0x003E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRandomGazeEntities;                               // 0x003F(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
static_assert(alignof(FMassLookAtTask) == 0x000004, "Wrong alignment on FMassLookAtTask");
static_assert(sizeof(FMassLookAtTask) == 0x000040, "Wrong size on FMassLookAtTask");
static_assert(offsetof(FMassLookAtTask, Priority) == 0x000034, "Member 'FMassLookAtTask::Priority' has a wrong offset!");
static_assert(offsetof(FMassLookAtTask, LookAtMode) == 0x000035, "Member 'FMassLookAtTask::LookAtMode' has a wrong offset!");
static_assert(offsetof(FMassLookAtTask, InterpolationSpeed) == 0x000036, "Member 'FMassLookAtTask::InterpolationSpeed' has a wrong offset!");
static_assert(offsetof(FMassLookAtTask, CustomInterpolationSpeed) == 0x000038, "Member 'FMassLookAtTask::CustomInterpolationSpeed' has a wrong offset!");
static_assert(offsetof(FMassLookAtTask, RandomGazeMode) == 0x00003C, "Member 'FMassLookAtTask::RandomGazeMode' has a wrong offset!");
static_assert(offsetof(FMassLookAtTask, RandomGazeYawVariation) == 0x00003D, "Member 'FMassLookAtTask::RandomGazeYawVariation' has a wrong offset!");
static_assert(offsetof(FMassLookAtTask, RandomGazePitchVariation) == 0x00003E, "Member 'FMassLookAtTask::RandomGazePitchVariation' has a wrong offset!");
static_assert(offsetof(FMassLookAtTask, bRandomGazeEntities) == 0x00003F, "Member 'FMassLookAtTask::bRandomGazeEntities' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassLookAtPriorityInfo
// 0x000C (0x000C - 0x0000)
struct FMassLookAtPriorityInfo final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassLookAtPriority                    Priority;                                          // 0x0008(0x0001)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassLookAtPriorityInfo) == 0x000004, "Wrong alignment on FMassLookAtPriorityInfo");
static_assert(sizeof(FMassLookAtPriorityInfo) == 0x00000C, "Wrong size on FMassLookAtPriorityInfo");
static_assert(offsetof(FMassLookAtPriorityInfo, Name) == 0x000000, "Member 'FMassLookAtPriorityInfo::Name' has a wrong offset!");
static_assert(offsetof(FMassLookAtPriorityInfo, Priority) == 0x000008, "Member 'FMassLookAtPriorityInfo::Priority' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassNavMeshAnimateTaskInstanceData
// 0x0008 (0x0008 - 0x0000)
struct FMassNavMeshAnimateTaskInstanceData final
{
public:
	float                                         duration;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassNavMeshAnimateTaskInstanceData) == 0x000004, "Wrong alignment on FMassNavMeshAnimateTaskInstanceData");
static_assert(sizeof(FMassNavMeshAnimateTaskInstanceData) == 0x000008, "Wrong size on FMassNavMeshAnimateTaskInstanceData");
static_assert(offsetof(FMassNavMeshAnimateTaskInstanceData, duration) == 0x000000, "Member 'FMassNavMeshAnimateTaskInstanceData::duration' has a wrong offset!");
static_assert(offsetof(FMassNavMeshAnimateTaskInstanceData, Time) == 0x000004, "Member 'FMassNavMeshAnimateTaskInstanceData::Time' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassNavMeshAnimateTask
// 0x0018 (0x0040 - 0x0028)
struct FMassNavMeshAnimateTask final : public FMassStateTreeTaskBase
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassNavMeshAnimateTask) == 0x000004, "Wrong alignment on FMassNavMeshAnimateTask");
static_assert(sizeof(FMassNavMeshAnimateTask) == 0x000040, "Wrong size on FMassNavMeshAnimateTask");

// ScriptStruct MassAIBehavior.MassNavMeshPathFollowTaskInstanceData
// 0x0050 (0x0050 - 0x0000)
struct FMassNavMeshPathFollowTaskInstanceData final
{
public:
	struct FMassTargetLocation                    TargetLocation;                                    // 0x0000(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FMassMovementStyleRef                  MovementStyle;                                     // 0x0028(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SpeedScale;                                        // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CorridorWidth;                                     // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffsetFromBoundaries;                              // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndDistanceThreshold;                              // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassNavMeshPathFollowTaskInstanceData) == 0x000004, "Wrong alignment on FMassNavMeshPathFollowTaskInstanceData");
static_assert(sizeof(FMassNavMeshPathFollowTaskInstanceData) == 0x000050, "Wrong size on FMassNavMeshPathFollowTaskInstanceData");
static_assert(offsetof(FMassNavMeshPathFollowTaskInstanceData, TargetLocation) == 0x000000, "Member 'FMassNavMeshPathFollowTaskInstanceData::TargetLocation' has a wrong offset!");
static_assert(offsetof(FMassNavMeshPathFollowTaskInstanceData, MovementStyle) == 0x000028, "Member 'FMassNavMeshPathFollowTaskInstanceData::MovementStyle' has a wrong offset!");
static_assert(offsetof(FMassNavMeshPathFollowTaskInstanceData, SpeedScale) == 0x000040, "Member 'FMassNavMeshPathFollowTaskInstanceData::SpeedScale' has a wrong offset!");
static_assert(offsetof(FMassNavMeshPathFollowTaskInstanceData, CorridorWidth) == 0x000044, "Member 'FMassNavMeshPathFollowTaskInstanceData::CorridorWidth' has a wrong offset!");
static_assert(offsetof(FMassNavMeshPathFollowTaskInstanceData, OffsetFromBoundaries) == 0x000048, "Member 'FMassNavMeshPathFollowTaskInstanceData::OffsetFromBoundaries' has a wrong offset!");
static_assert(offsetof(FMassNavMeshPathFollowTaskInstanceData, EndDistanceThreshold) == 0x00004C, "Member 'FMassNavMeshPathFollowTaskInstanceData::EndDistanceThreshold' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassNavMeshPathFollowTask
// 0x0030 (0x0058 - 0x0028)
struct FMassNavMeshPathFollowTask final : public FMassStateTreeTaskBase
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassNavMeshPathFollowTask) == 0x000004, "Wrong alignment on FMassNavMeshPathFollowTask");
static_assert(sizeof(FMassNavMeshPathFollowTask) == 0x000058, "Wrong size on FMassNavMeshPathFollowTask");

// ScriptStruct MassAIBehavior.MassNavMeshStandTaskInstanceData
// 0x0008 (0x0008 - 0x0000)
struct FMassNavMeshStandTaskInstanceData final
{
public:
	float                                         duration;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassNavMeshStandTaskInstanceData) == 0x000004, "Wrong alignment on FMassNavMeshStandTaskInstanceData");
static_assert(sizeof(FMassNavMeshStandTaskInstanceData) == 0x000008, "Wrong size on FMassNavMeshStandTaskInstanceData");
static_assert(offsetof(FMassNavMeshStandTaskInstanceData, duration) == 0x000000, "Member 'FMassNavMeshStandTaskInstanceData::duration' has a wrong offset!");
static_assert(offsetof(FMassNavMeshStandTaskInstanceData, Time) == 0x000004, "Member 'FMassNavMeshStandTaskInstanceData::Time' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassNavMeshStandTask
// 0x0020 (0x0048 - 0x0028)
struct FMassNavMeshStandTask final : public FMassStateTreeTaskBase
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassNavMeshStandTask) == 0x000004, "Wrong alignment on FMassNavMeshStandTask");
static_assert(sizeof(FMassNavMeshStandTask) == 0x000048, "Wrong size on FMassNavMeshStandTask");

// ScriptStruct MassAIBehavior.MassStateTreeDependency
// 0x0010 (0x0010 - 0x0000)
struct FMassStateTreeDependency final
{
public:
	class UStruct*                                Type;                                              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMassFragmentAccess                           Access;                                            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassStateTreeDependency) == 0x000008, "Wrong alignment on FMassStateTreeDependency");
static_assert(sizeof(FMassStateTreeDependency) == 0x000010, "Wrong size on FMassStateTreeDependency");
static_assert(offsetof(FMassStateTreeDependency, Type) == 0x000000, "Member 'FMassStateTreeDependency::Type' has a wrong offset!");
static_assert(offsetof(FMassStateTreeDependency, Access) == 0x000008, "Member 'FMassStateTreeDependency::Access' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassExecutionExtension
// 0x0010 (0x0018 - 0x0008)
struct FMassExecutionExtension final : public FStateTreeExecutionExtension
{
public:
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassExecutionExtension) == 0x000001, "Wrong alignment on FMassExecutionExtension");
static_assert(sizeof(FMassExecutionExtension) == 0x000018, "Wrong size on FMassExecutionExtension");

// ScriptStruct MassAIBehavior.MassStateTreeInstanceFragment
// 0x0010 (0x0010 - 0x0000)
struct FMassStateTreeInstanceFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassStateTreeInstanceFragment) == 0x000001, "Wrong alignment on FMassStateTreeInstanceFragment");
static_assert(sizeof(FMassStateTreeInstanceFragment) == 0x000010, "Wrong size on FMassStateTreeInstanceFragment");

// ScriptStruct MassAIBehavior.MassStateTreeSharedFragment
// 0x0008 (0x0008 - 0x0000)
struct FMassStateTreeSharedFragment final : public FMassConstSharedFragment
{
public:
	class UStateTree*                             StateTree;                                         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassStateTreeSharedFragment) == 0x000008, "Wrong alignment on FMassStateTreeSharedFragment");
static_assert(sizeof(FMassStateTreeSharedFragment) == 0x000008, "Wrong size on FMassStateTreeSharedFragment");
static_assert(offsetof(FMassStateTreeSharedFragment, StateTree) == 0x000000, "Member 'FMassStateTreeSharedFragment::StateTree' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassStateTreeActivatedTag
// 0x0000 (0x0001 - 0x0001)
struct FMassStateTreeActivatedTag final : public FMassTag
{
};
static_assert(alignof(FMassStateTreeActivatedTag) == 0x000001, "Wrong alignment on FMassStateTreeActivatedTag");
static_assert(sizeof(FMassStateTreeActivatedTag) == 0x000001, "Wrong size on FMassStateTreeActivatedTag");

// ScriptStruct MassAIBehavior.MassStateTreeInstanceDataItem
// 0x0018 (0x0018 - 0x0000)
struct FMassStateTreeInstanceDataItem final
{
public:
	struct FStateTreeInstanceData                 InstanceData;                                      // 0x0000(0x0010)(NativeAccessSpecifierPublic)
	int32                                         Generation;                                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassStateTreeInstanceDataItem) == 0x000004, "Wrong alignment on FMassStateTreeInstanceDataItem");
static_assert(sizeof(FMassStateTreeInstanceDataItem) == 0x000018, "Wrong size on FMassStateTreeInstanceDataItem");
static_assert(offsetof(FMassStateTreeInstanceDataItem, InstanceData) == 0x000000, "Member 'FMassStateTreeInstanceDataItem::InstanceData' has a wrong offset!");
static_assert(offsetof(FMassStateTreeInstanceDataItem, Generation) == 0x000010, "Member 'FMassStateTreeInstanceDataItem::Generation' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassUseSmartObjectTaskInstanceData
// 0x0028 (0x0028 - 0x0000)
struct FMassUseSmartObjectTaskInstanceData final
{
public:
	struct FSmartObjectClaimHandle                ClaimedSlot;                                       // 0x0000(0x0028)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassUseSmartObjectTaskInstanceData) == 0x000001, "Wrong alignment on FMassUseSmartObjectTaskInstanceData");
static_assert(sizeof(FMassUseSmartObjectTaskInstanceData) == 0x000028, "Wrong size on FMassUseSmartObjectTaskInstanceData");
static_assert(offsetof(FMassUseSmartObjectTaskInstanceData, ClaimedSlot) == 0x000000, "Member 'FMassUseSmartObjectTaskInstanceData::ClaimedSlot' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassUseSmartObjectTask
// 0x0018 (0x0040 - 0x0028)
struct FMassUseSmartObjectTask final : public FMassStateTreeTaskBase
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassUseSmartObjectTask) == 0x000004, "Wrong alignment on FMassUseSmartObjectTask");
static_assert(sizeof(FMassUseSmartObjectTask) == 0x000040, "Wrong size on FMassUseSmartObjectTask");

// ScriptStruct MassAIBehavior.MassZoneGraphAnnotationEvaluatorInstanceData
// 0x0008 (0x0008 - 0x0000)
struct FMassZoneGraphAnnotationEvaluatorInstanceData final
{
public:
	struct FZoneGraphTagMask                      AnnotationTags;                                    // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassZoneGraphAnnotationEvaluatorInstanceData) == 0x000001, "Wrong alignment on FMassZoneGraphAnnotationEvaluatorInstanceData");
static_assert(sizeof(FMassZoneGraphAnnotationEvaluatorInstanceData) == 0x000008, "Wrong size on FMassZoneGraphAnnotationEvaluatorInstanceData");
static_assert(offsetof(FMassZoneGraphAnnotationEvaluatorInstanceData, AnnotationTags) == 0x000000, "Member 'FMassZoneGraphAnnotationEvaluatorInstanceData::AnnotationTags' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassZoneGraphAnnotationEvaluator
// 0x0008 (0x0028 - 0x0020)
struct FMassZoneGraphAnnotationEvaluator final : public FMassStateTreeEvaluatorBase
{
public:
	uint8                                         Pad_20[0x8];                                       // 0x0020(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassZoneGraphAnnotationEvaluator) == 0x000004, "Wrong alignment on FMassZoneGraphAnnotationEvaluator");
static_assert(sizeof(FMassZoneGraphAnnotationEvaluator) == 0x000028, "Wrong size on FMassZoneGraphAnnotationEvaluator");

// ScriptStruct MassAIBehavior.MassZoneGraphAnnotationFragment
// 0x0008 (0x0008 - 0x0000)
struct FMassZoneGraphAnnotationFragment final : public FMassFragment
{
public:
	struct FZoneGraphTagMask                      Tags;                                              // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassZoneGraphAnnotationFragment) == 0x000001, "Wrong alignment on FMassZoneGraphAnnotationFragment");
static_assert(sizeof(FMassZoneGraphAnnotationFragment) == 0x000008, "Wrong size on FMassZoneGraphAnnotationFragment");
static_assert(offsetof(FMassZoneGraphAnnotationFragment, Tags) == 0x000000, "Member 'FMassZoneGraphAnnotationFragment::Tags' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassZoneGraphAnnotationVariableTickChunkFragment
// 0x0008 (0x0008 - 0x0000)
struct FMassZoneGraphAnnotationVariableTickChunkFragment final : public FMassChunkFragment
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassZoneGraphAnnotationVariableTickChunkFragment) == 0x000001, "Wrong alignment on FMassZoneGraphAnnotationVariableTickChunkFragment");
static_assert(sizeof(FMassZoneGraphAnnotationVariableTickChunkFragment) == 0x000008, "Wrong size on FMassZoneGraphAnnotationVariableTickChunkFragment");

// ScriptStruct MassAIBehavior.MassZoneGraphTargetLocation
// 0x0060 (0x0060 - 0x0000)
struct FMassZoneGraphTargetLocation final
{
public:
	uint8                                         Pad_0[0x60];                                       // 0x0000(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassZoneGraphTargetLocation) == 0x000001, "Wrong alignment on FMassZoneGraphTargetLocation");
static_assert(sizeof(FMassZoneGraphTargetLocation) == 0x000060, "Wrong size on FMassZoneGraphTargetLocation");

// ScriptStruct MassAIBehavior.MassZoneGraphFindEscapeTargetInstanceData
// 0x0060 (0x0060 - 0x0000)
struct FMassZoneGraphFindEscapeTargetInstanceData final
{
public:
	struct FMassZoneGraphTargetLocation           EscapeTargetLocation;                              // 0x0000(0x0060)(Edit, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassZoneGraphFindEscapeTargetInstanceData) == 0x000001, "Wrong alignment on FMassZoneGraphFindEscapeTargetInstanceData");
static_assert(sizeof(FMassZoneGraphFindEscapeTargetInstanceData) == 0x000060, "Wrong size on FMassZoneGraphFindEscapeTargetInstanceData");
static_assert(offsetof(FMassZoneGraphFindEscapeTargetInstanceData, EscapeTargetLocation) == 0x000000, "Member 'FMassZoneGraphFindEscapeTargetInstanceData::EscapeTargetLocation' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassZoneGraphFindEscapeTarget
// 0x0018 (0x0040 - 0x0028)
struct FMassZoneGraphFindEscapeTarget final : public FMassStateTreeTaskBase
{
public:
	uint8                                         Pad_28[0x12];                                      // 0x0028(0x0012)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneGraphTag                          DisturbanceAnnotationTag;                          // 0x003A(0x0001)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassZoneGraphFindEscapeTarget) == 0x000004, "Wrong alignment on FMassZoneGraphFindEscapeTarget");
static_assert(sizeof(FMassZoneGraphFindEscapeTarget) == 0x000040, "Wrong size on FMassZoneGraphFindEscapeTarget");
static_assert(offsetof(FMassZoneGraphFindEscapeTarget, DisturbanceAnnotationTag) == 0x00003A, "Member 'FMassZoneGraphFindEscapeTarget::DisturbanceAnnotationTag' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassZoneGraphFindSmartObjectTargetInstanceData
// 0x0088 (0x0088 - 0x0000)
struct FMassZoneGraphFindSmartObjectTargetInstanceData final
{
public:
	struct FSmartObjectClaimHandle                ClaimedSlot;                                       // 0x0000(0x0028)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FMassZoneGraphTargetLocation           SmartObjectLocation;                               // 0x0028(0x0060)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassZoneGraphFindSmartObjectTargetInstanceData) == 0x000001, "Wrong alignment on FMassZoneGraphFindSmartObjectTargetInstanceData");
static_assert(sizeof(FMassZoneGraphFindSmartObjectTargetInstanceData) == 0x000088, "Wrong size on FMassZoneGraphFindSmartObjectTargetInstanceData");
static_assert(offsetof(FMassZoneGraphFindSmartObjectTargetInstanceData, ClaimedSlot) == 0x000000, "Member 'FMassZoneGraphFindSmartObjectTargetInstanceData::ClaimedSlot' has a wrong offset!");
static_assert(offsetof(FMassZoneGraphFindSmartObjectTargetInstanceData, SmartObjectLocation) == 0x000028, "Member 'FMassZoneGraphFindSmartObjectTargetInstanceData::SmartObjectLocation' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassZoneGraphFindSmartObjectTarget
// 0x0018 (0x0040 - 0x0028)
struct FMassZoneGraphFindSmartObjectTarget final : public FMassStateTreeTaskBase
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassZoneGraphFindSmartObjectTarget) == 0x000004, "Wrong alignment on FMassZoneGraphFindSmartObjectTarget");
static_assert(sizeof(FMassZoneGraphFindSmartObjectTarget) == 0x000040, "Wrong size on FMassZoneGraphFindSmartObjectTarget");

// ScriptStruct MassAIBehavior.MassZoneGraphPathFollowTaskInstanceData
// 0x0030 (0x0030 - 0x0000)
struct FMassZoneGraphPathFollowTaskInstanceData final
{
public:
	struct FStateTreeStructRef                    TargetLocation;                                    // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMassMovementStyleRef                  MovementStyle;                                     // 0x0010(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SpeedScale;                                        // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassZoneGraphPathFollowTaskInstanceData) == 0x000004, "Wrong alignment on FMassZoneGraphPathFollowTaskInstanceData");
static_assert(sizeof(FMassZoneGraphPathFollowTaskInstanceData) == 0x000030, "Wrong size on FMassZoneGraphPathFollowTaskInstanceData");
static_assert(offsetof(FMassZoneGraphPathFollowTaskInstanceData, TargetLocation) == 0x000000, "Member 'FMassZoneGraphPathFollowTaskInstanceData::TargetLocation' has a wrong offset!");
static_assert(offsetof(FMassZoneGraphPathFollowTaskInstanceData, MovementStyle) == 0x000010, "Member 'FMassZoneGraphPathFollowTaskInstanceData::MovementStyle' has a wrong offset!");
static_assert(offsetof(FMassZoneGraphPathFollowTaskInstanceData, SpeedScale) == 0x000028, "Member 'FMassZoneGraphPathFollowTaskInstanceData::SpeedScale' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassZoneGraphPathFollowTask
// 0x0030 (0x0058 - 0x0028)
struct FMassZoneGraphPathFollowTask final : public FMassStateTreeTaskBase
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassZoneGraphPathFollowTask) == 0x000004, "Wrong alignment on FMassZoneGraphPathFollowTask");
static_assert(sizeof(FMassZoneGraphPathFollowTask) == 0x000058, "Wrong size on FMassZoneGraphPathFollowTask");

// ScriptStruct MassAIBehavior.MassZoneGraphStandTaskInstanceData
// 0x0008 (0x0008 - 0x0000)
struct FMassZoneGraphStandTaskInstanceData final
{
public:
	float                                         duration;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassZoneGraphStandTaskInstanceData) == 0x000004, "Wrong alignment on FMassZoneGraphStandTaskInstanceData");
static_assert(sizeof(FMassZoneGraphStandTaskInstanceData) == 0x000008, "Wrong size on FMassZoneGraphStandTaskInstanceData");
static_assert(offsetof(FMassZoneGraphStandTaskInstanceData, duration) == 0x000000, "Member 'FMassZoneGraphStandTaskInstanceData::duration' has a wrong offset!");
static_assert(offsetof(FMassZoneGraphStandTaskInstanceData, Time) == 0x000004, "Member 'FMassZoneGraphStandTaskInstanceData::Time' has a wrong offset!");

// ScriptStruct MassAIBehavior.MassZoneGraphStandTask
// 0x0030 (0x0058 - 0x0028)
struct FMassZoneGraphStandTask final : public FMassStateTreeTaskBase
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassZoneGraphStandTask) == 0x000004, "Wrong alignment on FMassZoneGraphStandTask");
static_assert(sizeof(FMassZoneGraphStandTask) == 0x000058, "Wrong size on FMassZoneGraphStandTask");

// ScriptStruct MassAIBehavior.ZoneGraphTagFilterConditionInstanceData
// 0x0008 (0x0008 - 0x0000)
struct FZoneGraphTagFilterConditionInstanceData final
{
public:
	struct FZoneGraphTagMask                      Tags;                                              // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FZoneGraphTagFilterConditionInstanceData) == 0x000001, "Wrong alignment on FZoneGraphTagFilterConditionInstanceData");
static_assert(sizeof(FZoneGraphTagFilterConditionInstanceData) == 0x000008, "Wrong size on FZoneGraphTagFilterConditionInstanceData");
static_assert(offsetof(FZoneGraphTagFilterConditionInstanceData, Tags) == 0x000000, "Member 'FZoneGraphTagFilterConditionInstanceData::Tags' has a wrong offset!");

// ScriptStruct MassAIBehavior.ZoneGraphTagFilterCondition
// 0x0020 (0x0048 - 0x0028)
struct FZoneGraphTagFilterCondition final : public FStateTreeConditionBase
{
public:
	struct FZoneGraphTagFilter                    Filter;                                            // 0x0028(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bInvert;                                           // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FZoneGraphTagFilterCondition) == 0x000004, "Wrong alignment on FZoneGraphTagFilterCondition");
static_assert(sizeof(FZoneGraphTagFilterCondition) == 0x000048, "Wrong size on FZoneGraphTagFilterCondition");
static_assert(offsetof(FZoneGraphTagFilterCondition, Filter) == 0x000028, "Member 'FZoneGraphTagFilterCondition::Filter' has a wrong offset!");
static_assert(offsetof(FZoneGraphTagFilterCondition, bInvert) == 0x000040, "Member 'FZoneGraphTagFilterCondition::bInvert' has a wrong offset!");

// ScriptStruct MassAIBehavior.ZoneGraphTagMaskConditionInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FZoneGraphTagMaskConditionInstanceData final
{
public:
	struct FZoneGraphTagMask                      Left;                                              // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
