#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshModelingTools

#include "Basic.hpp"


namespace SDK::Params
{

// Function MeshModelingTools.MeshConstraintProperties.IsPreventNormalFlipsEnabled
// 0x0001 (0x0001 - 0x0000)
struct MeshConstraintProperties_IsPreventNormalFlipsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MeshConstraintProperties_IsPreventNormalFlipsEnabled) == 0x000001, "Wrong alignment on MeshConstraintProperties_IsPreventNormalFlipsEnabled");
static_assert(sizeof(MeshConstraintProperties_IsPreventNormalFlipsEnabled) == 0x000001, "Wrong size on MeshConstraintProperties_IsPreventNormalFlipsEnabled");
static_assert(offsetof(MeshConstraintProperties_IsPreventNormalFlipsEnabled, ReturnValue) == 0x000000, "Member 'MeshConstraintProperties_IsPreventNormalFlipsEnabled::ReturnValue' has a wrong offset!");

// Function MeshModelingTools.MeshConstraintProperties.IsPreventTinyTrianglesEnabled
// 0x0001 (0x0001 - 0x0000)
struct MeshConstraintProperties_IsPreventTinyTrianglesEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MeshConstraintProperties_IsPreventTinyTrianglesEnabled) == 0x000001, "Wrong alignment on MeshConstraintProperties_IsPreventTinyTrianglesEnabled");
static_assert(sizeof(MeshConstraintProperties_IsPreventTinyTrianglesEnabled) == 0x000001, "Wrong size on MeshConstraintProperties_IsPreventTinyTrianglesEnabled");
static_assert(offsetof(MeshConstraintProperties_IsPreventTinyTrianglesEnabled, ReturnValue) == 0x000000, "Member 'MeshConstraintProperties_IsPreventTinyTrianglesEnabled::ReturnValue' has a wrong offset!");

// Function MeshModelingTools.ConvertToPolygonsToolProperties.GetGroupOptionsList
// 0x0010 (0x0010 - 0x0000)
struct ConvertToPolygonsToolProperties_GetGroupOptionsList final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConvertToPolygonsToolProperties_GetGroupOptionsList) == 0x000008, "Wrong alignment on ConvertToPolygonsToolProperties_GetGroupOptionsList");
static_assert(sizeof(ConvertToPolygonsToolProperties_GetGroupOptionsList) == 0x000010, "Wrong size on ConvertToPolygonsToolProperties_GetGroupOptionsList");
static_assert(offsetof(ConvertToPolygonsToolProperties_GetGroupOptionsList, ReturnValue) == 0x000000, "Member 'ConvertToPolygonsToolProperties_GetGroupOptionsList::ReturnValue' has a wrong offset!");

// Function MeshModelingTools.DisplaceMeshCommonProperties.GetWeightMapsFunc
// 0x0010 (0x0010 - 0x0000)
struct DisplaceMeshCommonProperties_GetWeightMapsFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DisplaceMeshCommonProperties_GetWeightMapsFunc) == 0x000008, "Wrong alignment on DisplaceMeshCommonProperties_GetWeightMapsFunc");
static_assert(sizeof(DisplaceMeshCommonProperties_GetWeightMapsFunc) == 0x000010, "Wrong size on DisplaceMeshCommonProperties_GetWeightMapsFunc");
static_assert(offsetof(DisplaceMeshCommonProperties_GetWeightMapsFunc, ReturnValue) == 0x000000, "Member 'DisplaceMeshCommonProperties_GetWeightMapsFunc::ReturnValue' has a wrong offset!");

// Function MeshModelingTools.SelectiveTessellationProperties.GetMaterialIDsFunc
// 0x0010 (0x0010 - 0x0000)
struct SelectiveTessellationProperties_GetMaterialIDsFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SelectiveTessellationProperties_GetMaterialIDsFunc) == 0x000008, "Wrong alignment on SelectiveTessellationProperties_GetMaterialIDsFunc");
static_assert(sizeof(SelectiveTessellationProperties_GetMaterialIDsFunc) == 0x000010, "Wrong size on SelectiveTessellationProperties_GetMaterialIDsFunc");
static_assert(offsetof(SelectiveTessellationProperties_GetMaterialIDsFunc, ReturnValue) == 0x000000, "Member 'SelectiveTessellationProperties_GetMaterialIDsFunc::ReturnValue' has a wrong offset!");

// Function MeshModelingTools.MeshAttributePaintToolProperties.GetAttributeNames
// 0x0010 (0x0010 - 0x0000)
struct MeshAttributePaintToolProperties_GetAttributeNames final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MeshAttributePaintToolProperties_GetAttributeNames) == 0x000008, "Wrong alignment on MeshAttributePaintToolProperties_GetAttributeNames");
static_assert(sizeof(MeshAttributePaintToolProperties_GetAttributeNames) == 0x000010, "Wrong size on MeshAttributePaintToolProperties_GetAttributeNames");
static_assert(offsetof(MeshAttributePaintToolProperties_GetAttributeNames, ReturnValue) == 0x000000, "Member 'MeshAttributePaintToolProperties_GetAttributeNames::ReturnValue' has a wrong offset!");

// Function MeshModelingTools.MeshVertexPaintToolUtilityActions.GetWeightMapsFunc
// 0x0010 (0x0010 - 0x0000)
struct MeshVertexPaintToolUtilityActions_GetWeightMapsFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MeshVertexPaintToolUtilityActions_GetWeightMapsFunc) == 0x000008, "Wrong alignment on MeshVertexPaintToolUtilityActions_GetWeightMapsFunc");
static_assert(sizeof(MeshVertexPaintToolUtilityActions_GetWeightMapsFunc) == 0x000010, "Wrong size on MeshVertexPaintToolUtilityActions_GetWeightMapsFunc");
static_assert(offsetof(MeshVertexPaintToolUtilityActions_GetWeightMapsFunc, ReturnValue) == 0x000000, "Member 'MeshVertexPaintToolUtilityActions_GetWeightMapsFunc::ReturnValue' has a wrong offset!");

// Function MeshModelingTools.MeshVertexPaintToolUtilityActions.GetLODNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct MeshVertexPaintToolUtilityActions_GetLODNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MeshVertexPaintToolUtilityActions_GetLODNamesFunc) == 0x000008, "Wrong alignment on MeshVertexPaintToolUtilityActions_GetLODNamesFunc");
static_assert(sizeof(MeshVertexPaintToolUtilityActions_GetLODNamesFunc) == 0x000010, "Wrong size on MeshVertexPaintToolUtilityActions_GetLODNamesFunc");
static_assert(offsetof(MeshVertexPaintToolUtilityActions_GetLODNamesFunc, ReturnValue) == 0x000000, "Member 'MeshVertexPaintToolUtilityActions_GetLODNamesFunc::ReturnValue' has a wrong offset!");

// Function MeshModelingTools.ExistingMeshMaterialProperties.GetUVChannelNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct ExistingMeshMaterialProperties_GetUVChannelNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ExistingMeshMaterialProperties_GetUVChannelNamesFunc) == 0x000008, "Wrong alignment on ExistingMeshMaterialProperties_GetUVChannelNamesFunc");
static_assert(sizeof(ExistingMeshMaterialProperties_GetUVChannelNamesFunc) == 0x000010, "Wrong size on ExistingMeshMaterialProperties_GetUVChannelNamesFunc");
static_assert(offsetof(ExistingMeshMaterialProperties_GetUVChannelNamesFunc, ReturnValue) == 0x000000, "Member 'ExistingMeshMaterialProperties_GetUVChannelNamesFunc::ReturnValue' has a wrong offset!");

// Function MeshModelingTools.MeshUVChannelProperties.GetUVChannelNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct MeshUVChannelProperties_GetUVChannelNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MeshUVChannelProperties_GetUVChannelNamesFunc) == 0x000008, "Wrong alignment on MeshUVChannelProperties_GetUVChannelNamesFunc");
static_assert(sizeof(MeshUVChannelProperties_GetUVChannelNamesFunc) == 0x000010, "Wrong size on MeshUVChannelProperties_GetUVChannelNamesFunc");
static_assert(offsetof(MeshUVChannelProperties_GetUVChannelNamesFunc, ReturnValue) == 0x000000, "Member 'MeshUVChannelProperties_GetUVChannelNamesFunc::ReturnValue' has a wrong offset!");

}

