#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshManager

#include "Basic.hpp"

#include "HTWorldPartition_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MeshManager.EditorStaticMeshActor
// 0x0008 (0x02D0 - 0x02C8)
class AEditorStaticMeshActor final : public AHTEditorActor
{
public:
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EditorStaticMeshActor">();
	}
	static class AEditorStaticMeshActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEditorStaticMeshActor>();
	}
};
static_assert(alignof(AEditorStaticMeshActor) == 0x000008, "Wrong alignment on AEditorStaticMeshActor");
static_assert(sizeof(AEditorStaticMeshActor) == 0x0002D0, "Wrong size on AEditorStaticMeshActor");
static_assert(offsetof(AEditorStaticMeshActor, StaticMeshComponent) == 0x0002C8, "Member 'AEditorStaticMeshActor::StaticMeshComponent' has a wrong offset!");

// Class MeshManager.ReplaceStaticMeshWithBPDataAsset
// 0x0068 (0x0098 - 0x0030)
class UReplaceStaticMeshWithBPDataAsset final : public UDataAsset
{
public:
	TMap<class UStaticMesh*, TSubclassOf<class AActor>> ReplaceConfig;                               // 0x0030(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class FName>                           IgnoreDatalayerNames;                              // 0x0080(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   IngoreActorTag;                                    // 0x0090(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReplaceStaticMeshWithBPDataAsset">();
	}
	static class UReplaceStaticMeshWithBPDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReplaceStaticMeshWithBPDataAsset>();
	}
};
static_assert(alignof(UReplaceStaticMeshWithBPDataAsset) == 0x000008, "Wrong alignment on UReplaceStaticMeshWithBPDataAsset");
static_assert(sizeof(UReplaceStaticMeshWithBPDataAsset) == 0x000098, "Wrong size on UReplaceStaticMeshWithBPDataAsset");
static_assert(offsetof(UReplaceStaticMeshWithBPDataAsset, ReplaceConfig) == 0x000030, "Member 'UReplaceStaticMeshWithBPDataAsset::ReplaceConfig' has a wrong offset!");
static_assert(offsetof(UReplaceStaticMeshWithBPDataAsset, IgnoreDatalayerNames) == 0x000080, "Member 'UReplaceStaticMeshWithBPDataAsset::IgnoreDatalayerNames' has a wrong offset!");
static_assert(offsetof(UReplaceStaticMeshWithBPDataAsset, IngoreActorTag) == 0x000090, "Member 'UReplaceStaticMeshWithBPDataAsset::IngoreActorTag' has a wrong offset!");

// Class MeshManager.MeshManagerWorldPartitionActor
// 0x0000 (0x02D0 - 0x02D0)
class AMeshManagerWorldPartitionActor final : public AHTPartitionActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshManagerWorldPartitionActor">();
	}
	static class AMeshManagerWorldPartitionActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMeshManagerWorldPartitionActor>();
	}
};
static_assert(alignof(AMeshManagerWorldPartitionActor) == 0x000008, "Wrong alignment on AMeshManagerWorldPartitionActor");
static_assert(sizeof(AMeshManagerWorldPartitionActor) == 0x0002D0, "Wrong size on AMeshManagerWorldPartitionActor");

}

