#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshBlend

#include "Basic.hpp"

#include "MeshBlend_structs.hpp"


namespace SDK::Params
{

// Function MeshBlend.MeshBlendBPLibrary.ClearBlendOptionFromActor
// 0x0008 (0x0008 - 0x0000)
struct MeshBlendBPLibrary_ClearBlendOptionFromActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MeshBlendBPLibrary_ClearBlendOptionFromActor) == 0x000008, "Wrong alignment on MeshBlendBPLibrary_ClearBlendOptionFromActor");
static_assert(sizeof(MeshBlendBPLibrary_ClearBlendOptionFromActor) == 0x000008, "Wrong size on MeshBlendBPLibrary_ClearBlendOptionFromActor");
static_assert(offsetof(MeshBlendBPLibrary_ClearBlendOptionFromActor, Actor) == 0x000000, "Member 'MeshBlendBPLibrary_ClearBlendOptionFromActor::Actor' has a wrong offset!");

// Function MeshBlend.MeshBlendBPLibrary.ClearBlendUserDataFromMesh
// 0x0008 (0x0008 - 0x0000)
struct MeshBlendBPLibrary_ClearBlendUserDataFromMesh final
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MeshBlendBPLibrary_ClearBlendUserDataFromMesh) == 0x000008, "Wrong alignment on MeshBlendBPLibrary_ClearBlendUserDataFromMesh");
static_assert(sizeof(MeshBlendBPLibrary_ClearBlendUserDataFromMesh) == 0x000008, "Wrong size on MeshBlendBPLibrary_ClearBlendUserDataFromMesh");
static_assert(offsetof(MeshBlendBPLibrary_ClearBlendUserDataFromMesh, Mesh) == 0x000000, "Member 'MeshBlendBPLibrary_ClearBlendUserDataFromMesh::Mesh' has a wrong offset!");

// Function MeshBlend.MeshBlendBPLibrary.DisableBlendOnActor
// 0x0008 (0x0008 - 0x0000)
struct MeshBlendBPLibrary_DisableBlendOnActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MeshBlendBPLibrary_DisableBlendOnActor) == 0x000008, "Wrong alignment on MeshBlendBPLibrary_DisableBlendOnActor");
static_assert(sizeof(MeshBlendBPLibrary_DisableBlendOnActor) == 0x000008, "Wrong size on MeshBlendBPLibrary_DisableBlendOnActor");
static_assert(offsetof(MeshBlendBPLibrary_DisableBlendOnActor, Actor) == 0x000000, "Member 'MeshBlendBPLibrary_DisableBlendOnActor::Actor' has a wrong offset!");

// Function MeshBlend.MeshBlendBPLibrary.RefreshBlendOnActor
// 0x0010 (0x0010 - 0x0000)
struct MeshBlendBPLibrary_RefreshBlendOnActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSoftReset;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MeshBlendBPLibrary_RefreshBlendOnActor) == 0x000008, "Wrong alignment on MeshBlendBPLibrary_RefreshBlendOnActor");
static_assert(sizeof(MeshBlendBPLibrary_RefreshBlendOnActor) == 0x000010, "Wrong size on MeshBlendBPLibrary_RefreshBlendOnActor");
static_assert(offsetof(MeshBlendBPLibrary_RefreshBlendOnActor, Actor) == 0x000000, "Member 'MeshBlendBPLibrary_RefreshBlendOnActor::Actor' has a wrong offset!");
static_assert(offsetof(MeshBlendBPLibrary_RefreshBlendOnActor, bSoftReset) == 0x000008, "Member 'MeshBlendBPLibrary_RefreshBlendOnActor::bSoftReset' has a wrong offset!");

// Function MeshBlend.MeshBlendBPLibrary.SetBlendOptionOnActor
// 0x0010 (0x0010 - 0x0000)
struct MeshBlendBPLibrary_SetBlendOptionOnActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAutoBlendOption                              NewBlendOption;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MeshBlendBPLibrary_SetBlendOptionOnActor) == 0x000008, "Wrong alignment on MeshBlendBPLibrary_SetBlendOptionOnActor");
static_assert(sizeof(MeshBlendBPLibrary_SetBlendOptionOnActor) == 0x000010, "Wrong size on MeshBlendBPLibrary_SetBlendOptionOnActor");
static_assert(offsetof(MeshBlendBPLibrary_SetBlendOptionOnActor, Actor) == 0x000000, "Member 'MeshBlendBPLibrary_SetBlendOptionOnActor::Actor' has a wrong offset!");
static_assert(offsetof(MeshBlendBPLibrary_SetBlendOptionOnActor, NewBlendOption) == 0x000008, "Member 'MeshBlendBPLibrary_SetBlendOptionOnActor::NewBlendOption' has a wrong offset!");

// Function MeshBlend.MeshBlendBPLibrary.SetBlendUserDataOnMesh
// 0x0010 (0x0010 - 0x0000)
struct MeshBlendBPLibrary_SetBlendUserDataOnMesh final
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAutoBlendOption                              NewBlendOption;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MeshBlendBPLibrary_SetBlendUserDataOnMesh) == 0x000008, "Wrong alignment on MeshBlendBPLibrary_SetBlendUserDataOnMesh");
static_assert(sizeof(MeshBlendBPLibrary_SetBlendUserDataOnMesh) == 0x000010, "Wrong size on MeshBlendBPLibrary_SetBlendUserDataOnMesh");
static_assert(offsetof(MeshBlendBPLibrary_SetBlendUserDataOnMesh, Mesh) == 0x000000, "Member 'MeshBlendBPLibrary_SetBlendUserDataOnMesh::Mesh' has a wrong offset!");
static_assert(offsetof(MeshBlendBPLibrary_SetBlendUserDataOnMesh, NewBlendOption) == 0x000008, "Member 'MeshBlendBPLibrary_SetBlendUserDataOnMesh::NewBlendOption' has a wrong offset!");

}

