#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshBlend

#include "Basic.hpp"

#include "MeshBlend_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class MeshBlend.AutoBlendUserData
// 0x0008 (0x0030 - 0x0028)
class UAutoBlendUserData final : public UAssetUserData
{
public:
	EAutoBlendOption                              AutoBlendOption;                                   // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AutoBlendUserData">();
	}
	static class UAutoBlendUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutoBlendUserData>();
	}
};
static_assert(alignof(UAutoBlendUserData) == 0x000008, "Wrong alignment on UAutoBlendUserData");
static_assert(sizeof(UAutoBlendUserData) == 0x000030, "Wrong size on UAutoBlendUserData");
static_assert(offsetof(UAutoBlendUserData, AutoBlendOption) == 0x000028, "Member 'UAutoBlendUserData::AutoBlendOption' has a wrong offset!");

// Class MeshBlend.MeshBlendActivator
// 0x0110 (0x03D8 - 0x02C8)
class AMeshBlendActivator final : public AActor
{
public:
	float                                         ProcessBudget;                                     // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentMaxRadius;                                  // 0x02CC(0x0004)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EProcessStage                                 CurrentProcessStage;                               // 0x02D0(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D1[0xA7];                                     // 0x02D1(0x00A7)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FString>                           MaterialsMissingAutoBlendID;                       // 0x0378(0x0050)(Transient, DuplicateTransient, NativeAccessSpecifierPrivate)
	bool                                          CachedCVarMeshBlendEnable;                         // 0x03C8(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          CachedMeshBlendRunInEditor;                        // 0x03C9(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          IsBlendingEnabled;                                 // 0x03CA(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          IsInitialized;                                     // 0x03CB(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshBlendProcessor*                    MeshBlendProcessor;                                // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshBlendActivator">();
	}
	static class AMeshBlendActivator* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMeshBlendActivator>();
	}
};
static_assert(alignof(AMeshBlendActivator) == 0x000008, "Wrong alignment on AMeshBlendActivator");
static_assert(sizeof(AMeshBlendActivator) == 0x0003D8, "Wrong size on AMeshBlendActivator");
static_assert(offsetof(AMeshBlendActivator, ProcessBudget) == 0x0002C8, "Member 'AMeshBlendActivator::ProcessBudget' has a wrong offset!");
static_assert(offsetof(AMeshBlendActivator, CurrentMaxRadius) == 0x0002CC, "Member 'AMeshBlendActivator::CurrentMaxRadius' has a wrong offset!");
static_assert(offsetof(AMeshBlendActivator, CurrentProcessStage) == 0x0002D0, "Member 'AMeshBlendActivator::CurrentProcessStage' has a wrong offset!");
static_assert(offsetof(AMeshBlendActivator, MaterialsMissingAutoBlendID) == 0x000378, "Member 'AMeshBlendActivator::MaterialsMissingAutoBlendID' has a wrong offset!");
static_assert(offsetof(AMeshBlendActivator, CachedCVarMeshBlendEnable) == 0x0003C8, "Member 'AMeshBlendActivator::CachedCVarMeshBlendEnable' has a wrong offset!");
static_assert(offsetof(AMeshBlendActivator, CachedMeshBlendRunInEditor) == 0x0003C9, "Member 'AMeshBlendActivator::CachedMeshBlendRunInEditor' has a wrong offset!");
static_assert(offsetof(AMeshBlendActivator, IsBlendingEnabled) == 0x0003CA, "Member 'AMeshBlendActivator::IsBlendingEnabled' has a wrong offset!");
static_assert(offsetof(AMeshBlendActivator, IsInitialized) == 0x0003CB, "Member 'AMeshBlendActivator::IsInitialized' has a wrong offset!");
static_assert(offsetof(AMeshBlendActivator, MeshBlendProcessor) == 0x0003D0, "Member 'AMeshBlendActivator::MeshBlendProcessor' has a wrong offset!");

// Class MeshBlend.MeshBlendBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UMeshBlendBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ClearBlendOptionFromActor(class AActor* Actor);
	static void ClearBlendUserDataFromMesh(class UStaticMesh* Mesh);
	static void DisableBlendOnActor(class AActor* Actor);
	static void RefreshBlendOnActor(class AActor* Actor, bool bSoftReset);
	static void SetBlendOptionOnActor(class AActor* Actor, EAutoBlendOption NewBlendOption);
	static void SetBlendUserDataOnMesh(class UStaticMesh* Mesh, EAutoBlendOption NewBlendOption);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshBlendBPLibrary">();
	}
	static class UMeshBlendBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshBlendBPLibrary>();
	}
};
static_assert(alignof(UMeshBlendBPLibrary) == 0x000008, "Wrong alignment on UMeshBlendBPLibrary");
static_assert(sizeof(UMeshBlendBPLibrary) == 0x000028, "Wrong size on UMeshBlendBPLibrary");

// Class MeshBlend.MeshBlendProcessor
// 0x0068 (0x0090 - 0x0028)
class UMeshBlendProcessor final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<uint8, struct FBlendValueBucket>         BlendValueBucket;                                  // 0x0040(0x0050)(Transient, DuplicateTransient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshBlendProcessor">();
	}
	static class UMeshBlendProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshBlendProcessor>();
	}
};
static_assert(alignof(UMeshBlendProcessor) == 0x000008, "Wrong alignment on UMeshBlendProcessor");
static_assert(sizeof(UMeshBlendProcessor) == 0x000090, "Wrong size on UMeshBlendProcessor");
static_assert(offsetof(UMeshBlendProcessor, BlendValueBucket) == 0x000040, "Member 'UMeshBlendProcessor::BlendValueBucket' has a wrong offset!");

// Class MeshBlend.MeshBlendSubSystem
// 0x0018 (0x0048 - 0x0030)
class UMeshBlendSubSystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             NoiseTexture;                                      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshBlendSubSystem">();
	}
	static class UMeshBlendSubSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshBlendSubSystem>();
	}
};
static_assert(alignof(UMeshBlendSubSystem) == 0x000008, "Wrong alignment on UMeshBlendSubSystem");
static_assert(sizeof(UMeshBlendSubSystem) == 0x000048, "Wrong size on UMeshBlendSubSystem");
static_assert(offsetof(UMeshBlendSubSystem, NoiseTexture) == 0x000040, "Member 'UMeshBlendSubSystem::NoiseTexture' has a wrong offset!");

}

