#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MotionWarping

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MotionWarping_structs.hpp"


namespace SDK
{

// Class MotionWarping.MotionWarpingBaseAdapter
// 0x0010 (0x0038 - 0x0028)
class UMotionWarpingBaseAdapter : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MotionWarpingBaseAdapter">();
	}
	static class UMotionWarpingBaseAdapter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionWarpingBaseAdapter>();
	}
};
static_assert(alignof(UMotionWarpingBaseAdapter) == 0x000008, "Wrong alignment on UMotionWarpingBaseAdapter");
static_assert(sizeof(UMotionWarpingBaseAdapter) == 0x000038, "Wrong size on UMotionWarpingBaseAdapter");

// Class MotionWarping.MotionWarpingCharacterAdapter
// 0x0008 (0x0040 - 0x0038)
class UMotionWarpingCharacterAdapter final : public UMotionWarpingBaseAdapter
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MotionWarpingCharacterAdapter">();
	}
	static class UMotionWarpingCharacterAdapter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionWarpingCharacterAdapter>();
	}
};
static_assert(alignof(UMotionWarpingCharacterAdapter) == 0x000008, "Wrong alignment on UMotionWarpingCharacterAdapter");
static_assert(sizeof(UMotionWarpingCharacterAdapter) == 0x000040, "Wrong size on UMotionWarpingCharacterAdapter");

// Class MotionWarping.MotionWarpingSwitchOffCondition
// 0x0020 (0x0048 - 0x0028)
class UMotionWarpingSwitchOffCondition : public UObject
{
public:
	bool                                          bUseWarpTargetAsTargetLocation;                    // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESwitchOffConditionEffect                     Effect;                                            // 0x0029(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 OwnerActor;                                        // 0x0030(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 TargetActor;                                       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MotionWarpingSwitchOffCondition">();
	}
	static class UMotionWarpingSwitchOffCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionWarpingSwitchOffCondition>();
	}
};
static_assert(alignof(UMotionWarpingSwitchOffCondition) == 0x000008, "Wrong alignment on UMotionWarpingSwitchOffCondition");
static_assert(sizeof(UMotionWarpingSwitchOffCondition) == 0x000048, "Wrong size on UMotionWarpingSwitchOffCondition");
static_assert(offsetof(UMotionWarpingSwitchOffCondition, bUseWarpTargetAsTargetLocation) == 0x000028, "Member 'UMotionWarpingSwitchOffCondition::bUseWarpTargetAsTargetLocation' has a wrong offset!");
static_assert(offsetof(UMotionWarpingSwitchOffCondition, Effect) == 0x000029, "Member 'UMotionWarpingSwitchOffCondition::Effect' has a wrong offset!");
static_assert(offsetof(UMotionWarpingSwitchOffCondition, OwnerActor) == 0x000030, "Member 'UMotionWarpingSwitchOffCondition::OwnerActor' has a wrong offset!");
static_assert(offsetof(UMotionWarpingSwitchOffCondition, TargetActor) == 0x000038, "Member 'UMotionWarpingSwitchOffCondition::TargetActor' has a wrong offset!");

// Class MotionWarping.MotionWarpingSwitchOffDistanceCondition
// 0x0008 (0x0050 - 0x0048)
class UMotionWarpingSwitchOffDistanceCondition final : public UMotionWarpingSwitchOffCondition
{
public:
	ESwitchOffConditionDistanceOp                 Operator;                                          // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESwitchOffConditionDistanceAxesType           AxesType;                                          // 0x0049(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Distance;                                          // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UMotionWarpingSwitchOffDistanceCondition* CreateSwitchOffDistanceCondition(class AActor*& InOwnerActor, ESwitchOffConditionEffect InEffect, ESwitchOffConditionDistanceOp InOperator, float InDistance, bool InbUseWarpTargetAsTargetLocation, class AActor* InTargetActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MotionWarpingSwitchOffDistanceCondition">();
	}
	static class UMotionWarpingSwitchOffDistanceCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionWarpingSwitchOffDistanceCondition>();
	}
};
static_assert(alignof(UMotionWarpingSwitchOffDistanceCondition) == 0x000008, "Wrong alignment on UMotionWarpingSwitchOffDistanceCondition");
static_assert(sizeof(UMotionWarpingSwitchOffDistanceCondition) == 0x000050, "Wrong size on UMotionWarpingSwitchOffDistanceCondition");
static_assert(offsetof(UMotionWarpingSwitchOffDistanceCondition, Operator) == 0x000048, "Member 'UMotionWarpingSwitchOffDistanceCondition::Operator' has a wrong offset!");
static_assert(offsetof(UMotionWarpingSwitchOffDistanceCondition, AxesType) == 0x000049, "Member 'UMotionWarpingSwitchOffDistanceCondition::AxesType' has a wrong offset!");
static_assert(offsetof(UMotionWarpingSwitchOffDistanceCondition, Distance) == 0x00004C, "Member 'UMotionWarpingSwitchOffDistanceCondition::Distance' has a wrong offset!");

// Class MotionWarping.MotionWarpingSwitchOffAngleToTargetCondition
// 0x0010 (0x0058 - 0x0048)
class UMotionWarpingSwitchOffAngleToTargetCondition final : public UMotionWarpingSwitchOffCondition
{
public:
	ESwitchOffConditionAngleOp                    Operator;                                          // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Angle;                                             // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIgnoreZAxis;                                      // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UMotionWarpingSwitchOffAngleToTargetCondition* CreateSwitchOffAngleToTargetCondition(class AActor*& InOwnerActor, ESwitchOffConditionEffect InEffect, ESwitchOffConditionAngleOp InOperator, float InAngle, bool bInIgnoreZAxis, bool bInUseWarpTargetAsTargetLocation, class AActor* InTargetActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MotionWarpingSwitchOffAngleToTargetCondition">();
	}
	static class UMotionWarpingSwitchOffAngleToTargetCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionWarpingSwitchOffAngleToTargetCondition>();
	}
};
static_assert(alignof(UMotionWarpingSwitchOffAngleToTargetCondition) == 0x000008, "Wrong alignment on UMotionWarpingSwitchOffAngleToTargetCondition");
static_assert(sizeof(UMotionWarpingSwitchOffAngleToTargetCondition) == 0x000058, "Wrong size on UMotionWarpingSwitchOffAngleToTargetCondition");
static_assert(offsetof(UMotionWarpingSwitchOffAngleToTargetCondition, Operator) == 0x000048, "Member 'UMotionWarpingSwitchOffAngleToTargetCondition::Operator' has a wrong offset!");
static_assert(offsetof(UMotionWarpingSwitchOffAngleToTargetCondition, Angle) == 0x00004C, "Member 'UMotionWarpingSwitchOffAngleToTargetCondition::Angle' has a wrong offset!");
static_assert(offsetof(UMotionWarpingSwitchOffAngleToTargetCondition, bIgnoreZAxis) == 0x000050, "Member 'UMotionWarpingSwitchOffAngleToTargetCondition::bIgnoreZAxis' has a wrong offset!");

// Class MotionWarping.MotionWarpingSwitchOffCompositeCondition
// 0x0018 (0x0060 - 0x0048)
class UMotionWarpingSwitchOffCompositeCondition final : public UMotionWarpingSwitchOffCondition
{
public:
	class UMotionWarpingSwitchOffCondition*       SwitchOffConditionA;                               // 0x0048(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESwitchOffConditionCompositeOp                LogicOperator;                                     // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMotionWarpingSwitchOffCondition*       SwitchOffConditionB;                               // 0x0058(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UMotionWarpingSwitchOffCompositeCondition* CreateSwitchOffCompositeCondition(class AActor*& InOwnerActor, ESwitchOffConditionEffect InEffect, class UMotionWarpingSwitchOffCondition*& InSwitchOffConditionA, ESwitchOffConditionCompositeOp InLogicOperator, class UMotionWarpingSwitchOffCondition*& InSwitchOffConditionB, bool bInUseWarpTargetAsTargetLocation, class AActor* InTargetActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MotionWarpingSwitchOffCompositeCondition">();
	}
	static class UMotionWarpingSwitchOffCompositeCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionWarpingSwitchOffCompositeCondition>();
	}
};
static_assert(alignof(UMotionWarpingSwitchOffCompositeCondition) == 0x000008, "Wrong alignment on UMotionWarpingSwitchOffCompositeCondition");
static_assert(sizeof(UMotionWarpingSwitchOffCompositeCondition) == 0x000060, "Wrong size on UMotionWarpingSwitchOffCompositeCondition");
static_assert(offsetof(UMotionWarpingSwitchOffCompositeCondition, SwitchOffConditionA) == 0x000048, "Member 'UMotionWarpingSwitchOffCompositeCondition::SwitchOffConditionA' has a wrong offset!");
static_assert(offsetof(UMotionWarpingSwitchOffCompositeCondition, LogicOperator) == 0x000050, "Member 'UMotionWarpingSwitchOffCompositeCondition::LogicOperator' has a wrong offset!");
static_assert(offsetof(UMotionWarpingSwitchOffCompositeCondition, SwitchOffConditionB) == 0x000058, "Member 'UMotionWarpingSwitchOffCompositeCondition::SwitchOffConditionB' has a wrong offset!");

// Class MotionWarping.MotionWarpingSwitchOffBlueprintableCondition
// 0x0000 (0x0048 - 0x0048)
class UMotionWarpingSwitchOffBlueprintableCondition final : public UMotionWarpingSwitchOffCondition
{
public:
	static class UMotionWarpingSwitchOffBlueprintableCondition* CreateSwitchOffBlueprintableCondition(class AActor*& InOwnerActor, ESwitchOffConditionEffect InEffect, TSubclassOf<class UMotionWarpingSwitchOffBlueprintableCondition> InBlueprintableCondition, bool bInUseWarpTargetAsTargetLocation, class AActor* InTargetActor);

	bool BP_Check(const class AActor* InOwnerActor, const class AActor* InTargetActor, const struct FVector& InTargetLocation, bool bInUseWarpTargetAsTargetLocation) const;
	class FString BP_ExtraDebugInfo(const class AActor* InOwnerActor, const class AActor* InTargetActor, const struct FVector& InTargetLocation, bool bInUseWarpTargetAsTargetLocation) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MotionWarpingSwitchOffBlueprintableCondition">();
	}
	static class UMotionWarpingSwitchOffBlueprintableCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionWarpingSwitchOffBlueprintableCondition>();
	}
};
static_assert(alignof(UMotionWarpingSwitchOffBlueprintableCondition) == 0x000008, "Wrong alignment on UMotionWarpingSwitchOffBlueprintableCondition");
static_assert(sizeof(UMotionWarpingSwitchOffBlueprintableCondition) == 0x000048, "Wrong size on UMotionWarpingSwitchOffBlueprintableCondition");

// Class MotionWarping.AnimNotifyState_MotionWarping
// 0x0008 (0x0038 - 0x0030)
class UAnimNotifyState_MotionWarping : public UAnimNotifyState
{
public:
	class URootMotionModifier*                    RootMotionModifier;                                // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class URootMotionModifier* AddRootMotionModifier(class UMotionWarpingComponent* MotionWarpingComp, const class UAnimSequenceBase* Animation, float StartTime, float EndTime) const;
	void OnRootMotionModifierActivate(class UMotionWarpingComponent* MotionWarpingComp, class URootMotionModifier* Modifier) const;
	void OnRootMotionModifierDeactivate(class UMotionWarpingComponent* MotionWarpingComp, class URootMotionModifier* Modifier) const;
	void OnRootMotionModifierUpdate(class UMotionWarpingComponent* MotionWarpingComp, class URootMotionModifier* Modifier) const;
	void OnWarpBegin(class UMotionWarpingComponent* MotionWarpingComp, class URootMotionModifier* Modifier) const;
	void OnWarpEnd(class UMotionWarpingComponent* MotionWarpingComp, class URootMotionModifier* Modifier) const;
	void OnWarpUpdate(class UMotionWarpingComponent* MotionWarpingComp, class URootMotionModifier* Modifier) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_MotionWarping">();
	}
	static class UAnimNotifyState_MotionWarping* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_MotionWarping>();
	}
};
static_assert(alignof(UAnimNotifyState_MotionWarping) == 0x000008, "Wrong alignment on UAnimNotifyState_MotionWarping");
static_assert(sizeof(UAnimNotifyState_MotionWarping) == 0x000038, "Wrong size on UAnimNotifyState_MotionWarping");
static_assert(offsetof(UAnimNotifyState_MotionWarping, RootMotionModifier) == 0x000030, "Member 'UAnimNotifyState_MotionWarping::RootMotionModifier' has a wrong offset!");

// Class MotionWarping.AttributeBasedRootMotionComponent
// 0x00F0 (0x01B0 - 0x00C0)
class UAttributeBasedRootMotionComponent final : public UActorComponent
{
public:
	bool                                          bEnableRootMotion;                                 // 0x00C0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EAttributeBasedRootMotionMode                 Mode;                                              // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x38];                                      // 0x00C8(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class ACharacter>              CharacterOwner;                                    // 0x0100(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_108[0xA8];                                     // 0x0108(0x00A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AttributeBasedRootMotionComponent">();
	}
	static class UAttributeBasedRootMotionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAttributeBasedRootMotionComponent>();
	}
};
static_assert(alignof(UAttributeBasedRootMotionComponent) == 0x000008, "Wrong alignment on UAttributeBasedRootMotionComponent");
static_assert(sizeof(UAttributeBasedRootMotionComponent) == 0x0001B0, "Wrong size on UAttributeBasedRootMotionComponent");
static_assert(offsetof(UAttributeBasedRootMotionComponent, bEnableRootMotion) == 0x0000C0, "Member 'UAttributeBasedRootMotionComponent::bEnableRootMotion' has a wrong offset!");
static_assert(offsetof(UAttributeBasedRootMotionComponent, Mode) == 0x0000C4, "Member 'UAttributeBasedRootMotionComponent::Mode' has a wrong offset!");
static_assert(offsetof(UAttributeBasedRootMotionComponent, CharacterOwner) == 0x000100, "Member 'UAttributeBasedRootMotionComponent::CharacterOwner' has a wrong offset!");

// Class MotionWarping.MotionWarpingUtilities
// 0x0000 (0x0028 - 0x0028)
class UMotionWarpingUtilities final : public UBlueprintFunctionLibrary
{
public:
	static void ExtractBoneTransformFromAnimationAtTime(const class UAnimInstance* AnimInstance, const class UAnimSequenceBase* Animation, float Time, bool bExtractRootMotion, class FName BoneName, bool bLocalSpace, struct FTransform* OutTransform);
	static struct FTransform ExtractRootMotionFromAnimation(const class UAnimSequenceBase* Animation, float StartTime, float EndTime);
	static void GetMotionWarpingWindowsForWarpTargetFromAnimation(const class UAnimSequenceBase* Animation, class FName WarpTargetName, TArray<struct FMotionWarpingWindowData>* OutWindows);
	static void GetMotionWarpingWindowsFromAnimation(const class UAnimSequenceBase* Animation, TArray<struct FMotionWarpingWindowData>* OutWindows);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MotionWarpingUtilities">();
	}
	static class UMotionWarpingUtilities* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionWarpingUtilities>();
	}
};
static_assert(alignof(UMotionWarpingUtilities) == 0x000008, "Wrong alignment on UMotionWarpingUtilities");
static_assert(sizeof(UMotionWarpingUtilities) == 0x000028, "Wrong size on UMotionWarpingUtilities");

// Class MotionWarping.MotionWarpingComponent
// 0x0050 (0x0110 - 0x00C0)
class UMotionWarpingComponent : public UActorComponent
{
public:
	bool                                          bSearchForWindowsInAnimsWithinMontages;            // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UMotionWarpingComponent* MotionWarpingComp)> OnPreUpdate;    // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UMotionWarpingBaseAdapter*              OwnerAdapter;                                      // 0x00D8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class URootMotionModifier*>            Modifiers;                                         // 0x00E0(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<struct FMotionWarpingTarget>           WarpTargets;                                       // 0x00F0(0x0010)(Net, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FSwitchOffConditionData>        SwitchOffConditions;                               // 0x0100(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	void AddOrUpdateWarpTarget(const struct FMotionWarpingTarget& WarpTarget);
	void AddOrUpdateWarpTargetFromComponent(class FName WarpTargetName, const class USceneComponent* Component, class FName BoneName, bool bFollowComponent, EWarpTargetLocationOffsetDirection LocationOffsetDirection, const struct FVector& LocationOffset, const struct FRotator& RotationOffset);
	void AddOrUpdateWarpTargetFromLocation(class FName WarpTargetName, const struct FVector& TargetLocation);
	void AddOrUpdateWarpTargetFromLocationAndRotation(class FName WarpTargetName, const struct FVector& TargetLocation, const struct FRotator& TargetRotation);
	void AddOrUpdateWarpTargetFromTransform(class FName WarpTargetName, const struct FTransform& TargetTransform);
	void AddSwitchOffCondition(class FName WarpTargetName, class UMotionWarpingSwitchOffCondition* Condition);
	void DisableAllRootMotionModifiers();
	int32 RemoveAllWarpTargets();
	int32 RemoveWarpTarget(class FName WarpTargetName);
	int32 RemoveWarpTargets(const TArray<class FName>& WarpTargetNames);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MotionWarpingComponent">();
	}
	static class UMotionWarpingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionWarpingComponent>();
	}
};
static_assert(alignof(UMotionWarpingComponent) == 0x000008, "Wrong alignment on UMotionWarpingComponent");
static_assert(sizeof(UMotionWarpingComponent) == 0x000110, "Wrong size on UMotionWarpingComponent");
static_assert(offsetof(UMotionWarpingComponent, bSearchForWindowsInAnimsWithinMontages) == 0x0000C0, "Member 'UMotionWarpingComponent::bSearchForWindowsInAnimsWithinMontages' has a wrong offset!");
static_assert(offsetof(UMotionWarpingComponent, OnPreUpdate) == 0x0000C8, "Member 'UMotionWarpingComponent::OnPreUpdate' has a wrong offset!");
static_assert(offsetof(UMotionWarpingComponent, OwnerAdapter) == 0x0000D8, "Member 'UMotionWarpingComponent::OwnerAdapter' has a wrong offset!");
static_assert(offsetof(UMotionWarpingComponent, Modifiers) == 0x0000E0, "Member 'UMotionWarpingComponent::Modifiers' has a wrong offset!");
static_assert(offsetof(UMotionWarpingComponent, WarpTargets) == 0x0000F0, "Member 'UMotionWarpingComponent::WarpTargets' has a wrong offset!");
static_assert(offsetof(UMotionWarpingComponent, SwitchOffConditions) == 0x000100, "Member 'UMotionWarpingComponent::SwitchOffConditions' has a wrong offset!");

// Class MotionWarping.RootMotionModifier
// 0x0130 (0x0158 - 0x0028)
#pragma pack(push, 0x1)
class alignas(0x08) URootMotionModifier : public UObject
{
public:
	TWeakObjectPtr<class UAnimSequenceBase>       Animation;                                         // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndTime;                                           // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PreviousPosition;                                  // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurrentPosition;                                   // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayRate;                                          // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             StartTransform;                                    // 0x0050(0x0060)(BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActualStartTime;                                   // 0x00B0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0xC];                                       // 0x00B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TotalRootMotionWithinWindow;                       // 0x00C0(0x0060)(BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UMotionWarpingComponent* MotionWarpingComp, class URootMotionModifier* RootMotionModifier)> OnActivateDelegate; // 0x0120(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UMotionWarpingComponent* MotionWarpingComp, class URootMotionModifier* RootMotionModifier)> OnUpdateDelegate; // 0x0130(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UMotionWarpingComponent* MotionWarpingComp, class URootMotionModifier* RootMotionModifier)> OnDeactivateDelegate; // 0x0140(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERootMotionModifierState                      State;                                             // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RootMotionModifier">();
	}
	static class URootMotionModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<URootMotionModifier>();
	}
};
#pragma pack(pop)
static_assert(alignof(URootMotionModifier) == 0x000008, "Wrong alignment on URootMotionModifier");
static_assert(sizeof(URootMotionModifier) == 0x000158, "Wrong size on URootMotionModifier");
static_assert(offsetof(URootMotionModifier, Animation) == 0x000028, "Member 'URootMotionModifier::Animation' has a wrong offset!");
static_assert(offsetof(URootMotionModifier, StartTime) == 0x000030, "Member 'URootMotionModifier::StartTime' has a wrong offset!");
static_assert(offsetof(URootMotionModifier, EndTime) == 0x000034, "Member 'URootMotionModifier::EndTime' has a wrong offset!");
static_assert(offsetof(URootMotionModifier, PreviousPosition) == 0x000038, "Member 'URootMotionModifier::PreviousPosition' has a wrong offset!");
static_assert(offsetof(URootMotionModifier, CurrentPosition) == 0x00003C, "Member 'URootMotionModifier::CurrentPosition' has a wrong offset!");
static_assert(offsetof(URootMotionModifier, Weight) == 0x000040, "Member 'URootMotionModifier::Weight' has a wrong offset!");
static_assert(offsetof(URootMotionModifier, PlayRate) == 0x000044, "Member 'URootMotionModifier::PlayRate' has a wrong offset!");
static_assert(offsetof(URootMotionModifier, StartTransform) == 0x000050, "Member 'URootMotionModifier::StartTransform' has a wrong offset!");
static_assert(offsetof(URootMotionModifier, ActualStartTime) == 0x0000B0, "Member 'URootMotionModifier::ActualStartTime' has a wrong offset!");
static_assert(offsetof(URootMotionModifier, TotalRootMotionWithinWindow) == 0x0000C0, "Member 'URootMotionModifier::TotalRootMotionWithinWindow' has a wrong offset!");
static_assert(offsetof(URootMotionModifier, OnActivateDelegate) == 0x000120, "Member 'URootMotionModifier::OnActivateDelegate' has a wrong offset!");
static_assert(offsetof(URootMotionModifier, OnUpdateDelegate) == 0x000130, "Member 'URootMotionModifier::OnUpdateDelegate' has a wrong offset!");
static_assert(offsetof(URootMotionModifier, OnDeactivateDelegate) == 0x000140, "Member 'URootMotionModifier::OnDeactivateDelegate' has a wrong offset!");
static_assert(offsetof(URootMotionModifier, State) == 0x000150, "Member 'URootMotionModifier::State' has a wrong offset!");

// Class MotionWarping.RootMotionModifier_Warp
// 0x01E0 (0x0338 - 0x0158)
#pragma pack(push, 0x1)
class alignas(0x08) URootMotionModifier_Warp : public URootMotionModifier
{
public:
	class FName                                   WarpTargetName;                                    // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWarpPointAnimProvider                        WarpPointAnimProvider;                             // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_161[0xF];                                      // 0x0161(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             WarpPointAnimTransform;                            // 0x0170(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   WarpPointAnimBoneName;                             // 0x01D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWarpTranslation;                                  // 0x01D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreZAxis;                                      // 0x01D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWarpToFeetLocation;                               // 0x01DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAlphaBlendOption                             AddTranslationEasingFunc;                          // 0x01DB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            AddTranslationEasingCurve;                         // 0x01E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWarpRotation;                                     // 0x01E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMotionWarpRotationType                       RotationType;                                      // 0x01E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMotionWarpRotationMethod                     RotationMethod;                                    // 0x01EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSubtractRemainingRootMotion;                      // 0x01EB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WarpRotationTimeMultiplier;                        // 0x01EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WarpMaxRotationRate;                               // 0x01F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F4[0xC];                                      // 0x01F4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CachedTargetTransform;                             // 0x0200(0x0060)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTransform                             RootMotionRemainingAfterNotify;                    // 0x0260(0x0060)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C0[0x78];                                     // 0x02C0(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RootMotionModifier_Warp">();
	}
	static class URootMotionModifier_Warp* GetDefaultObj()
	{
		return GetDefaultObjImpl<URootMotionModifier_Warp>();
	}
};
#pragma pack(pop)
static_assert(alignof(URootMotionModifier_Warp) == 0x000008, "Wrong alignment on URootMotionModifier_Warp");
static_assert(sizeof(URootMotionModifier_Warp) == 0x000338, "Wrong size on URootMotionModifier_Warp");
static_assert(offsetof(URootMotionModifier_Warp, WarpTargetName) == 0x000158, "Member 'URootMotionModifier_Warp::WarpTargetName' has a wrong offset!");
static_assert(offsetof(URootMotionModifier_Warp, WarpPointAnimProvider) == 0x000160, "Member 'URootMotionModifier_Warp::WarpPointAnimProvider' has a wrong offset!");
static_assert(offsetof(URootMotionModifier_Warp, WarpPointAnimTransform) == 0x000170, "Member 'URootMotionModifier_Warp::WarpPointAnimTransform' has a wrong offset!");
static_assert(offsetof(URootMotionModifier_Warp, WarpPointAnimBoneName) == 0x0001D0, "Member 'URootMotionModifier_Warp::WarpPointAnimBoneName' has a wrong offset!");
static_assert(offsetof(URootMotionModifier_Warp, bWarpTranslation) == 0x0001D8, "Member 'URootMotionModifier_Warp::bWarpTranslation' has a wrong offset!");
static_assert(offsetof(URootMotionModifier_Warp, bIgnoreZAxis) == 0x0001D9, "Member 'URootMotionModifier_Warp::bIgnoreZAxis' has a wrong offset!");
static_assert(offsetof(URootMotionModifier_Warp, bWarpToFeetLocation) == 0x0001DA, "Member 'URootMotionModifier_Warp::bWarpToFeetLocation' has a wrong offset!");
static_assert(offsetof(URootMotionModifier_Warp, AddTranslationEasingFunc) == 0x0001DB, "Member 'URootMotionModifier_Warp::AddTranslationEasingFunc' has a wrong offset!");
static_assert(offsetof(URootMotionModifier_Warp, AddTranslationEasingCurve) == 0x0001E0, "Member 'URootMotionModifier_Warp::AddTranslationEasingCurve' has a wrong offset!");
static_assert(offsetof(URootMotionModifier_Warp, bWarpRotation) == 0x0001E8, "Member 'URootMotionModifier_Warp::bWarpRotation' has a wrong offset!");
static_assert(offsetof(URootMotionModifier_Warp, RotationType) == 0x0001E9, "Member 'URootMotionModifier_Warp::RotationType' has a wrong offset!");
static_assert(offsetof(URootMotionModifier_Warp, RotationMethod) == 0x0001EA, "Member 'URootMotionModifier_Warp::RotationMethod' has a wrong offset!");
static_assert(offsetof(URootMotionModifier_Warp, bSubtractRemainingRootMotion) == 0x0001EB, "Member 'URootMotionModifier_Warp::bSubtractRemainingRootMotion' has a wrong offset!");
static_assert(offsetof(URootMotionModifier_Warp, WarpRotationTimeMultiplier) == 0x0001EC, "Member 'URootMotionModifier_Warp::WarpRotationTimeMultiplier' has a wrong offset!");
static_assert(offsetof(URootMotionModifier_Warp, WarpMaxRotationRate) == 0x0001F0, "Member 'URootMotionModifier_Warp::WarpMaxRotationRate' has a wrong offset!");
static_assert(offsetof(URootMotionModifier_Warp, CachedTargetTransform) == 0x000200, "Member 'URootMotionModifier_Warp::CachedTargetTransform' has a wrong offset!");
static_assert(offsetof(URootMotionModifier_Warp, RootMotionRemainingAfterNotify) == 0x000260, "Member 'URootMotionModifier_Warp::RootMotionRemainingAfterNotify' has a wrong offset!");

// Class MotionWarping.RootMotionModifier_SimpleWarp
// 0x0008 (0x0340 - 0x0338)
class URootMotionModifier_SimpleWarp final : public URootMotionModifier_Warp
{
public:
	uint8                                         Pad_338[0x8];                                      // 0x0338(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RootMotionModifier_SimpleWarp">();
	}
	static class URootMotionModifier_SimpleWarp* GetDefaultObj()
	{
		return GetDefaultObjImpl<URootMotionModifier_SimpleWarp>();
	}
};
static_assert(alignof(URootMotionModifier_SimpleWarp) == 0x000008, "Wrong alignment on URootMotionModifier_SimpleWarp");
static_assert(sizeof(URootMotionModifier_SimpleWarp) == 0x000340, "Wrong size on URootMotionModifier_SimpleWarp");

// Class MotionWarping.RootMotionModifier_Scale
// 0x0018 (0x0170 - 0x0158)
class URootMotionModifier_Scale final : public URootMotionModifier
{
public:
	struct FVector                                Scale;                                             // 0x0158(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class URootMotionModifier_Scale* AddRootMotionModifierScale(class UMotionWarpingComponent* InMotionWarpingComp, const class UAnimSequenceBase* InAnimation, float InStartTime, float InEndTime, const struct FVector& InScale);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RootMotionModifier_Scale">();
	}
	static class URootMotionModifier_Scale* GetDefaultObj()
	{
		return GetDefaultObjImpl<URootMotionModifier_Scale>();
	}
};
static_assert(alignof(URootMotionModifier_Scale) == 0x000008, "Wrong alignment on URootMotionModifier_Scale");
static_assert(sizeof(URootMotionModifier_Scale) == 0x000170, "Wrong size on URootMotionModifier_Scale");
static_assert(offsetof(URootMotionModifier_Scale, Scale) == 0x000158, "Member 'URootMotionModifier_Scale::Scale' has a wrong offset!");

// Class MotionWarping.RootMotionModifier_AdjustmentBlendWarp
// 0x0158 (0x0490 - 0x0338)
class URootMotionModifier_AdjustmentBlendWarp final : public URootMotionModifier_Warp
{
public:
	bool                                          bWarpIKBones;                                      // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           IKBones;                                           // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FTransform                             CachedMeshTransform;                               // 0x0350(0x0060)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTransform                             CachedMeshRelativeTransform;                       // 0x03B0(0x0060)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTransform                             CachedRootMotion;                                  // 0x0410(0x0060)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAnimSequenceTrackContainer            result;                                            // 0x0470(0x0020)(Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RootMotionModifier_AdjustmentBlendWarp">();
	}
	static class URootMotionModifier_AdjustmentBlendWarp* GetDefaultObj()
	{
		return GetDefaultObjImpl<URootMotionModifier_AdjustmentBlendWarp>();
	}
};
static_assert(alignof(URootMotionModifier_AdjustmentBlendWarp) == 0x000008, "Wrong alignment on URootMotionModifier_AdjustmentBlendWarp");
static_assert(sizeof(URootMotionModifier_AdjustmentBlendWarp) == 0x000490, "Wrong size on URootMotionModifier_AdjustmentBlendWarp");
static_assert(offsetof(URootMotionModifier_AdjustmentBlendWarp, bWarpIKBones) == 0x000338, "Member 'URootMotionModifier_AdjustmentBlendWarp::bWarpIKBones' has a wrong offset!");
static_assert(offsetof(URootMotionModifier_AdjustmentBlendWarp, IKBones) == 0x000340, "Member 'URootMotionModifier_AdjustmentBlendWarp::IKBones' has a wrong offset!");
static_assert(offsetof(URootMotionModifier_AdjustmentBlendWarp, CachedMeshTransform) == 0x000350, "Member 'URootMotionModifier_AdjustmentBlendWarp::CachedMeshTransform' has a wrong offset!");
static_assert(offsetof(URootMotionModifier_AdjustmentBlendWarp, CachedMeshRelativeTransform) == 0x0003B0, "Member 'URootMotionModifier_AdjustmentBlendWarp::CachedMeshRelativeTransform' has a wrong offset!");
static_assert(offsetof(URootMotionModifier_AdjustmentBlendWarp, CachedRootMotion) == 0x000410, "Member 'URootMotionModifier_AdjustmentBlendWarp::CachedRootMotion' has a wrong offset!");
static_assert(offsetof(URootMotionModifier_AdjustmentBlendWarp, result) == 0x000470, "Member 'URootMotionModifier_AdjustmentBlendWarp::result' has a wrong offset!");

// Class MotionWarping.RootMotionModifier_SkewWarp
// 0x0008 (0x0340 - 0x0338)
class URootMotionModifier_SkewWarp : public URootMotionModifier_Warp
{
public:
	float                                         MaxSpeedClampRatio;                                // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class URootMotionModifier_SkewWarp* AddRootMotionModifierSkewWarp(class UMotionWarpingComponent* InMotionWarpingComp, const class UAnimSequenceBase* InAnimation, float InStartTime, float InEndTime, class FName InWarpTargetName, EWarpPointAnimProvider InWarpPointAnimProvider, const struct FTransform& InWarpPointAnimTransform, class FName InWarpPointAnimBoneName, bool bInWarpTranslation, bool bInIgnoreZAxis, bool bInWarpRotation, EMotionWarpRotationType InRotationType, EMotionWarpRotationMethod InRotationMethod, float InWarpRotationTimeMultiplier, float InWarpMaxRotationRate);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RootMotionModifier_SkewWarp">();
	}
	static class URootMotionModifier_SkewWarp* GetDefaultObj()
	{
		return GetDefaultObjImpl<URootMotionModifier_SkewWarp>();
	}
};
