#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MotionWarping

#include "Basic.hpp"

#include "MotionWarping_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MotionWarping.MotionWarpingSwitchOffDistanceCondition.CreateSwitchOffDistanceCondition
// 0x0028 (0x0028 - 0x0000)
struct MotionWarpingSwitchOffDistanceCondition_CreateSwitchOffDistanceCondition final
{
public:
	class AActor*                                 InOwnerActor;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESwitchOffConditionEffect                     InEffect;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESwitchOffConditionDistanceOp                 InOperator;                                        // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InDistance;                                        // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InbUseWarpTargetAsTargetLocation;                  // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 InTargetActor;                                     // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMotionWarpingSwitchOffDistanceCondition* ReturnValue;                                     // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionWarpingSwitchOffDistanceCondition_CreateSwitchOffDistanceCondition) == 0x000008, "Wrong alignment on MotionWarpingSwitchOffDistanceCondition_CreateSwitchOffDistanceCondition");
static_assert(sizeof(MotionWarpingSwitchOffDistanceCondition_CreateSwitchOffDistanceCondition) == 0x000028, "Wrong size on MotionWarpingSwitchOffDistanceCondition_CreateSwitchOffDistanceCondition");
static_assert(offsetof(MotionWarpingSwitchOffDistanceCondition_CreateSwitchOffDistanceCondition, InOwnerActor) == 0x000000, "Member 'MotionWarpingSwitchOffDistanceCondition_CreateSwitchOffDistanceCondition::InOwnerActor' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffDistanceCondition_CreateSwitchOffDistanceCondition, InEffect) == 0x000008, "Member 'MotionWarpingSwitchOffDistanceCondition_CreateSwitchOffDistanceCondition::InEffect' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffDistanceCondition_CreateSwitchOffDistanceCondition, InOperator) == 0x000009, "Member 'MotionWarpingSwitchOffDistanceCondition_CreateSwitchOffDistanceCondition::InOperator' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffDistanceCondition_CreateSwitchOffDistanceCondition, InDistance) == 0x00000C, "Member 'MotionWarpingSwitchOffDistanceCondition_CreateSwitchOffDistanceCondition::InDistance' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffDistanceCondition_CreateSwitchOffDistanceCondition, InbUseWarpTargetAsTargetLocation) == 0x000010, "Member 'MotionWarpingSwitchOffDistanceCondition_CreateSwitchOffDistanceCondition::InbUseWarpTargetAsTargetLocation' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffDistanceCondition_CreateSwitchOffDistanceCondition, InTargetActor) == 0x000018, "Member 'MotionWarpingSwitchOffDistanceCondition_CreateSwitchOffDistanceCondition::InTargetActor' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffDistanceCondition_CreateSwitchOffDistanceCondition, ReturnValue) == 0x000020, "Member 'MotionWarpingSwitchOffDistanceCondition_CreateSwitchOffDistanceCondition::ReturnValue' has a wrong offset!");

// Function MotionWarping.MotionWarpingSwitchOffAngleToTargetCondition.CreateSwitchOffAngleToTargetCondition
// 0x0028 (0x0028 - 0x0000)
struct MotionWarpingSwitchOffAngleToTargetCondition_CreateSwitchOffAngleToTargetCondition final
{
public:
	class AActor*                                 InOwnerActor;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESwitchOffConditionEffect                     InEffect;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESwitchOffConditionAngleOp                    InOperator;                                        // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InAngle;                                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInIgnoreZAxis;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInUseWarpTargetAsTargetLocation;                  // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 InTargetActor;                                     // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMotionWarpingSwitchOffAngleToTargetCondition* ReturnValue;                                // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionWarpingSwitchOffAngleToTargetCondition_CreateSwitchOffAngleToTargetCondition) == 0x000008, "Wrong alignment on MotionWarpingSwitchOffAngleToTargetCondition_CreateSwitchOffAngleToTargetCondition");
static_assert(sizeof(MotionWarpingSwitchOffAngleToTargetCondition_CreateSwitchOffAngleToTargetCondition) == 0x000028, "Wrong size on MotionWarpingSwitchOffAngleToTargetCondition_CreateSwitchOffAngleToTargetCondition");
static_assert(offsetof(MotionWarpingSwitchOffAngleToTargetCondition_CreateSwitchOffAngleToTargetCondition, InOwnerActor) == 0x000000, "Member 'MotionWarpingSwitchOffAngleToTargetCondition_CreateSwitchOffAngleToTargetCondition::InOwnerActor' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffAngleToTargetCondition_CreateSwitchOffAngleToTargetCondition, InEffect) == 0x000008, "Member 'MotionWarpingSwitchOffAngleToTargetCondition_CreateSwitchOffAngleToTargetCondition::InEffect' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffAngleToTargetCondition_CreateSwitchOffAngleToTargetCondition, InOperator) == 0x000009, "Member 'MotionWarpingSwitchOffAngleToTargetCondition_CreateSwitchOffAngleToTargetCondition::InOperator' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffAngleToTargetCondition_CreateSwitchOffAngleToTargetCondition, InAngle) == 0x00000C, "Member 'MotionWarpingSwitchOffAngleToTargetCondition_CreateSwitchOffAngleToTargetCondition::InAngle' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffAngleToTargetCondition_CreateSwitchOffAngleToTargetCondition, bInIgnoreZAxis) == 0x000010, "Member 'MotionWarpingSwitchOffAngleToTargetCondition_CreateSwitchOffAngleToTargetCondition::bInIgnoreZAxis' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffAngleToTargetCondition_CreateSwitchOffAngleToTargetCondition, bInUseWarpTargetAsTargetLocation) == 0x000011, "Member 'MotionWarpingSwitchOffAngleToTargetCondition_CreateSwitchOffAngleToTargetCondition::bInUseWarpTargetAsTargetLocation' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffAngleToTargetCondition_CreateSwitchOffAngleToTargetCondition, InTargetActor) == 0x000018, "Member 'MotionWarpingSwitchOffAngleToTargetCondition_CreateSwitchOffAngleToTargetCondition::InTargetActor' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffAngleToTargetCondition_CreateSwitchOffAngleToTargetCondition, ReturnValue) == 0x000020, "Member 'MotionWarpingSwitchOffAngleToTargetCondition_CreateSwitchOffAngleToTargetCondition::ReturnValue' has a wrong offset!");

// Function MotionWarping.MotionWarpingSwitchOffCompositeCondition.CreateSwitchOffCompositeCondition
// 0x0040 (0x0040 - 0x0000)
struct MotionWarpingSwitchOffCompositeCondition_CreateSwitchOffCompositeCondition final
{
public:
	class AActor*                                 InOwnerActor;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESwitchOffConditionEffect                     InEffect;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMotionWarpingSwitchOffCondition*       InSwitchOffConditionA;                             // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESwitchOffConditionCompositeOp                InLogicOperator;                                   // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMotionWarpingSwitchOffCondition*       InSwitchOffConditionB;                             // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInUseWarpTargetAsTargetLocation;                  // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 InTargetActor;                                     // 0x0030(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMotionWarpingSwitchOffCompositeCondition* ReturnValue;                                    // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionWarpingSwitchOffCompositeCondition_CreateSwitchOffCompositeCondition) == 0x000008, "Wrong alignment on MotionWarpingSwitchOffCompositeCondition_CreateSwitchOffCompositeCondition");
static_assert(sizeof(MotionWarpingSwitchOffCompositeCondition_CreateSwitchOffCompositeCondition) == 0x000040, "Wrong size on MotionWarpingSwitchOffCompositeCondition_CreateSwitchOffCompositeCondition");
static_assert(offsetof(MotionWarpingSwitchOffCompositeCondition_CreateSwitchOffCompositeCondition, InOwnerActor) == 0x000000, "Member 'MotionWarpingSwitchOffCompositeCondition_CreateSwitchOffCompositeCondition::InOwnerActor' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffCompositeCondition_CreateSwitchOffCompositeCondition, InEffect) == 0x000008, "Member 'MotionWarpingSwitchOffCompositeCondition_CreateSwitchOffCompositeCondition::InEffect' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffCompositeCondition_CreateSwitchOffCompositeCondition, InSwitchOffConditionA) == 0x000010, "Member 'MotionWarpingSwitchOffCompositeCondition_CreateSwitchOffCompositeCondition::InSwitchOffConditionA' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffCompositeCondition_CreateSwitchOffCompositeCondition, InLogicOperator) == 0x000018, "Member 'MotionWarpingSwitchOffCompositeCondition_CreateSwitchOffCompositeCondition::InLogicOperator' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffCompositeCondition_CreateSwitchOffCompositeCondition, InSwitchOffConditionB) == 0x000020, "Member 'MotionWarpingSwitchOffCompositeCondition_CreateSwitchOffCompositeCondition::InSwitchOffConditionB' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffCompositeCondition_CreateSwitchOffCompositeCondition, bInUseWarpTargetAsTargetLocation) == 0x000028, "Member 'MotionWarpingSwitchOffCompositeCondition_CreateSwitchOffCompositeCondition::bInUseWarpTargetAsTargetLocation' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffCompositeCondition_CreateSwitchOffCompositeCondition, InTargetActor) == 0x000030, "Member 'MotionWarpingSwitchOffCompositeCondition_CreateSwitchOffCompositeCondition::InTargetActor' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffCompositeCondition_CreateSwitchOffCompositeCondition, ReturnValue) == 0x000038, "Member 'MotionWarpingSwitchOffCompositeCondition_CreateSwitchOffCompositeCondition::ReturnValue' has a wrong offset!");

// Function MotionWarping.MotionWarpingSwitchOffBlueprintableCondition.CreateSwitchOffBlueprintableCondition
// 0x0030 (0x0030 - 0x0000)
struct MotionWarpingSwitchOffBlueprintableCondition_CreateSwitchOffBlueprintableCondition final
{
public:
	class AActor*                                 InOwnerActor;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESwitchOffConditionEffect                     InEffect;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UMotionWarpingSwitchOffBlueprintableCondition> InBlueprintableCondition;       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInUseWarpTargetAsTargetLocation;                  // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 InTargetActor;                                     // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMotionWarpingSwitchOffBlueprintableCondition* ReturnValue;                                // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionWarpingSwitchOffBlueprintableCondition_CreateSwitchOffBlueprintableCondition) == 0x000008, "Wrong alignment on MotionWarpingSwitchOffBlueprintableCondition_CreateSwitchOffBlueprintableCondition");
static_assert(sizeof(MotionWarpingSwitchOffBlueprintableCondition_CreateSwitchOffBlueprintableCondition) == 0x000030, "Wrong size on MotionWarpingSwitchOffBlueprintableCondition_CreateSwitchOffBlueprintableCondition");
static_assert(offsetof(MotionWarpingSwitchOffBlueprintableCondition_CreateSwitchOffBlueprintableCondition, InOwnerActor) == 0x000000, "Member 'MotionWarpingSwitchOffBlueprintableCondition_CreateSwitchOffBlueprintableCondition::InOwnerActor' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffBlueprintableCondition_CreateSwitchOffBlueprintableCondition, InEffect) == 0x000008, "Member 'MotionWarpingSwitchOffBlueprintableCondition_CreateSwitchOffBlueprintableCondition::InEffect' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffBlueprintableCondition_CreateSwitchOffBlueprintableCondition, InBlueprintableCondition) == 0x000010, "Member 'MotionWarpingSwitchOffBlueprintableCondition_CreateSwitchOffBlueprintableCondition::InBlueprintableCondition' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffBlueprintableCondition_CreateSwitchOffBlueprintableCondition, bInUseWarpTargetAsTargetLocation) == 0x000018, "Member 'MotionWarpingSwitchOffBlueprintableCondition_CreateSwitchOffBlueprintableCondition::bInUseWarpTargetAsTargetLocation' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffBlueprintableCondition_CreateSwitchOffBlueprintableCondition, InTargetActor) == 0x000020, "Member 'MotionWarpingSwitchOffBlueprintableCondition_CreateSwitchOffBlueprintableCondition::InTargetActor' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffBlueprintableCondition_CreateSwitchOffBlueprintableCondition, ReturnValue) == 0x000028, "Member 'MotionWarpingSwitchOffBlueprintableCondition_CreateSwitchOffBlueprintableCondition::ReturnValue' has a wrong offset!");

// Function MotionWarping.MotionWarpingSwitchOffBlueprintableCondition.BP_Check
// 0x0030 (0x0030 - 0x0000)
struct MotionWarpingSwitchOffBlueprintableCondition_BP_Check final
{
public:
	const class AActor*                           InOwnerActor;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           InTargetActor;                                     // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InTargetLocation;                                  // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInUseWarpTargetAsTargetLocation;                  // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0029(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MotionWarpingSwitchOffBlueprintableCondition_BP_Check) == 0x000008, "Wrong alignment on MotionWarpingSwitchOffBlueprintableCondition_BP_Check");
static_assert(sizeof(MotionWarpingSwitchOffBlueprintableCondition_BP_Check) == 0x000030, "Wrong size on MotionWarpingSwitchOffBlueprintableCondition_BP_Check");
static_assert(offsetof(MotionWarpingSwitchOffBlueprintableCondition_BP_Check, InOwnerActor) == 0x000000, "Member 'MotionWarpingSwitchOffBlueprintableCondition_BP_Check::InOwnerActor' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffBlueprintableCondition_BP_Check, InTargetActor) == 0x000008, "Member 'MotionWarpingSwitchOffBlueprintableCondition_BP_Check::InTargetActor' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffBlueprintableCondition_BP_Check, InTargetLocation) == 0x000010, "Member 'MotionWarpingSwitchOffBlueprintableCondition_BP_Check::InTargetLocation' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffBlueprintableCondition_BP_Check, bInUseWarpTargetAsTargetLocation) == 0x000028, "Member 'MotionWarpingSwitchOffBlueprintableCondition_BP_Check::bInUseWarpTargetAsTargetLocation' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffBlueprintableCondition_BP_Check, ReturnValue) == 0x000029, "Member 'MotionWarpingSwitchOffBlueprintableCondition_BP_Check::ReturnValue' has a wrong offset!");

// Function MotionWarping.MotionWarpingSwitchOffBlueprintableCondition.BP_ExtraDebugInfo
// 0x0040 (0x0040 - 0x0000)
struct MotionWarpingSwitchOffBlueprintableCondition_BP_ExtraDebugInfo final
{
public:
	const class AActor*                           InOwnerActor;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           InTargetActor;                                     // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InTargetLocation;                                  // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInUseWarpTargetAsTargetLocation;                  // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionWarpingSwitchOffBlueprintableCondition_BP_ExtraDebugInfo) == 0x000008, "Wrong alignment on MotionWarpingSwitchOffBlueprintableCondition_BP_ExtraDebugInfo");
static_assert(sizeof(MotionWarpingSwitchOffBlueprintableCondition_BP_ExtraDebugInfo) == 0x000040, "Wrong size on MotionWarpingSwitchOffBlueprintableCondition_BP_ExtraDebugInfo");
static_assert(offsetof(MotionWarpingSwitchOffBlueprintableCondition_BP_ExtraDebugInfo, InOwnerActor) == 0x000000, "Member 'MotionWarpingSwitchOffBlueprintableCondition_BP_ExtraDebugInfo::InOwnerActor' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffBlueprintableCondition_BP_ExtraDebugInfo, InTargetActor) == 0x000008, "Member 'MotionWarpingSwitchOffBlueprintableCondition_BP_ExtraDebugInfo::InTargetActor' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffBlueprintableCondition_BP_ExtraDebugInfo, InTargetLocation) == 0x000010, "Member 'MotionWarpingSwitchOffBlueprintableCondition_BP_ExtraDebugInfo::InTargetLocation' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffBlueprintableCondition_BP_ExtraDebugInfo, bInUseWarpTargetAsTargetLocation) == 0x000028, "Member 'MotionWarpingSwitchOffBlueprintableCondition_BP_ExtraDebugInfo::bInUseWarpTargetAsTargetLocation' has a wrong offset!");
static_assert(offsetof(MotionWarpingSwitchOffBlueprintableCondition_BP_ExtraDebugInfo, ReturnValue) == 0x000030, "Member 'MotionWarpingSwitchOffBlueprintableCondition_BP_ExtraDebugInfo::ReturnValue' has a wrong offset!");

// Function MotionWarping.AnimNotifyState_MotionWarping.AddRootMotionModifier
// 0x0020 (0x0020 - 0x0000)
struct AnimNotifyState_MotionWarping_AddRootMotionModifier final
{
public:
	class UMotionWarpingComponent*                MotionWarpingComp;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UAnimSequenceBase*                Animation;                                         // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndTime;                                           // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URootMotionModifier*                    ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotifyState_MotionWarping_AddRootMotionModifier) == 0x000008, "Wrong alignment on AnimNotifyState_MotionWarping_AddRootMotionModifier");
static_assert(sizeof(AnimNotifyState_MotionWarping_AddRootMotionModifier) == 0x000020, "Wrong size on AnimNotifyState_MotionWarping_AddRootMotionModifier");
static_assert(offsetof(AnimNotifyState_MotionWarping_AddRootMotionModifier, MotionWarpingComp) == 0x000000, "Member 'AnimNotifyState_MotionWarping_AddRootMotionModifier::MotionWarpingComp' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MotionWarping_AddRootMotionModifier, Animation) == 0x000008, "Member 'AnimNotifyState_MotionWarping_AddRootMotionModifier::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MotionWarping_AddRootMotionModifier, StartTime) == 0x000010, "Member 'AnimNotifyState_MotionWarping_AddRootMotionModifier::StartTime' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MotionWarping_AddRootMotionModifier, EndTime) == 0x000014, "Member 'AnimNotifyState_MotionWarping_AddRootMotionModifier::EndTime' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MotionWarping_AddRootMotionModifier, ReturnValue) == 0x000018, "Member 'AnimNotifyState_MotionWarping_AddRootMotionModifier::ReturnValue' has a wrong offset!");

// Function MotionWarping.AnimNotifyState_MotionWarping.OnRootMotionModifierActivate
// 0x0010 (0x0010 - 0x0000)
struct AnimNotifyState_MotionWarping_OnRootMotionModifierActivate final
{
public:
	class UMotionWarpingComponent*                MotionWarpingComp;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URootMotionModifier*                    Modifier;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotifyState_MotionWarping_OnRootMotionModifierActivate) == 0x000008, "Wrong alignment on AnimNotifyState_MotionWarping_OnRootMotionModifierActivate");
static_assert(sizeof(AnimNotifyState_MotionWarping_OnRootMotionModifierActivate) == 0x000010, "Wrong size on AnimNotifyState_MotionWarping_OnRootMotionModifierActivate");
static_assert(offsetof(AnimNotifyState_MotionWarping_OnRootMotionModifierActivate, MotionWarpingComp) == 0x000000, "Member 'AnimNotifyState_MotionWarping_OnRootMotionModifierActivate::MotionWarpingComp' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MotionWarping_OnRootMotionModifierActivate, Modifier) == 0x000008, "Member 'AnimNotifyState_MotionWarping_OnRootMotionModifierActivate::Modifier' has a wrong offset!");

// Function MotionWarping.AnimNotifyState_MotionWarping.OnRootMotionModifierDeactivate
// 0x0010 (0x0010 - 0x0000)
struct AnimNotifyState_MotionWarping_OnRootMotionModifierDeactivate final
{
public:
	class UMotionWarpingComponent*                MotionWarpingComp;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URootMotionModifier*                    Modifier;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotifyState_MotionWarping_OnRootMotionModifierDeactivate) == 0x000008, "Wrong alignment on AnimNotifyState_MotionWarping_OnRootMotionModifierDeactivate");
static_assert(sizeof(AnimNotifyState_MotionWarping_OnRootMotionModifierDeactivate) == 0x000010, "Wrong size on AnimNotifyState_MotionWarping_OnRootMotionModifierDeactivate");
static_assert(offsetof(AnimNotifyState_MotionWarping_OnRootMotionModifierDeactivate, MotionWarpingComp) == 0x000000, "Member 'AnimNotifyState_MotionWarping_OnRootMotionModifierDeactivate::MotionWarpingComp' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MotionWarping_OnRootMotionModifierDeactivate, Modifier) == 0x000008, "Member 'AnimNotifyState_MotionWarping_OnRootMotionModifierDeactivate::Modifier' has a wrong offset!");

// Function MotionWarping.AnimNotifyState_MotionWarping.OnRootMotionModifierUpdate
// 0x0010 (0x0010 - 0x0000)
struct AnimNotifyState_MotionWarping_OnRootMotionModifierUpdate final
{
public:
	class UMotionWarpingComponent*                MotionWarpingComp;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URootMotionModifier*                    Modifier;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotifyState_MotionWarping_OnRootMotionModifierUpdate) == 0x000008, "Wrong alignment on AnimNotifyState_MotionWarping_OnRootMotionModifierUpdate");
static_assert(sizeof(AnimNotifyState_MotionWarping_OnRootMotionModifierUpdate) == 0x000010, "Wrong size on AnimNotifyState_MotionWarping_OnRootMotionModifierUpdate");
static_assert(offsetof(AnimNotifyState_MotionWarping_OnRootMotionModifierUpdate, MotionWarpingComp) == 0x000000, "Member 'AnimNotifyState_MotionWarping_OnRootMotionModifierUpdate::MotionWarpingComp' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MotionWarping_OnRootMotionModifierUpdate, Modifier) == 0x000008, "Member 'AnimNotifyState_MotionWarping_OnRootMotionModifierUpdate::Modifier' has a wrong offset!");

// Function MotionWarping.AnimNotifyState_MotionWarping.OnWarpBegin
// 0x0010 (0x0010 - 0x0000)
struct AnimNotifyState_MotionWarping_OnWarpBegin final
{
public:
	class UMotionWarpingComponent*                MotionWarpingComp;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URootMotionModifier*                    Modifier;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotifyState_MotionWarping_OnWarpBegin) == 0x000008, "Wrong alignment on AnimNotifyState_MotionWarping_OnWarpBegin");
static_assert(sizeof(AnimNotifyState_MotionWarping_OnWarpBegin) == 0x000010, "Wrong size on AnimNotifyState_MotionWarping_OnWarpBegin");
static_assert(offsetof(AnimNotifyState_MotionWarping_OnWarpBegin, MotionWarpingComp) == 0x000000, "Member 'AnimNotifyState_MotionWarping_OnWarpBegin::MotionWarpingComp' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MotionWarping_OnWarpBegin, Modifier) == 0x000008, "Member 'AnimNotifyState_MotionWarping_OnWarpBegin::Modifier' has a wrong offset!");

// Function MotionWarping.AnimNotifyState_MotionWarping.OnWarpEnd
// 0x0010 (0x0010 - 0x0000)
struct AnimNotifyState_MotionWarping_OnWarpEnd final
{
public:
	class UMotionWarpingComponent*                MotionWarpingComp;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URootMotionModifier*                    Modifier;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotifyState_MotionWarping_OnWarpEnd) == 0x000008, "Wrong alignment on AnimNotifyState_MotionWarping_OnWarpEnd");
static_assert(sizeof(AnimNotifyState_MotionWarping_OnWarpEnd) == 0x000010, "Wrong size on AnimNotifyState_MotionWarping_OnWarpEnd");
static_assert(offsetof(AnimNotifyState_MotionWarping_OnWarpEnd, MotionWarpingComp) == 0x000000, "Member 'AnimNotifyState_MotionWarping_OnWarpEnd::MotionWarpingComp' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MotionWarping_OnWarpEnd, Modifier) == 0x000008, "Member 'AnimNotifyState_MotionWarping_OnWarpEnd::Modifier' has a wrong offset!");

// Function MotionWarping.AnimNotifyState_MotionWarping.OnWarpUpdate
// 0x0010 (0x0010 - 0x0000)
struct AnimNotifyState_MotionWarping_OnWarpUpdate final
{
public:
	class UMotionWarpingComponent*                MotionWarpingComp;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URootMotionModifier*                    Modifier;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotifyState_MotionWarping_OnWarpUpdate) == 0x000008, "Wrong alignment on AnimNotifyState_MotionWarping_OnWarpUpdate");
static_assert(sizeof(AnimNotifyState_MotionWarping_OnWarpUpdate) == 0x000010, "Wrong size on AnimNotifyState_MotionWarping_OnWarpUpdate");
static_assert(offsetof(AnimNotifyState_MotionWarping_OnWarpUpdate, MotionWarpingComp) == 0x000000, "Member 'AnimNotifyState_MotionWarping_OnWarpUpdate::MotionWarpingComp' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_MotionWarping_OnWarpUpdate, Modifier) == 0x000008, "Member 'AnimNotifyState_MotionWarping_OnWarpUpdate::Modifier' has a wrong offset!");

// Function MotionWarping.MotionWarpingUtilities.ExtractBoneTransformFromAnimationAtTime
// 0x0090 (0x0090 - 0x0000)
struct MotionWarpingUtilities_ExtractBoneTransformFromAnimationAtTime final
{
public:
	const class UAnimInstance*                    AnimInstance;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UAnimSequenceBase*                Animation;                                         // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExtractRootMotion;                                // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BoneName;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLocalSpace;                                       // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0xF];                                       // 0x0021(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OutTransform;                                      // 0x0030(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionWarpingUtilities_ExtractBoneTransformFromAnimationAtTime) == 0x000008, "Wrong alignment on MotionWarpingUtilities_ExtractBoneTransformFromAnimationAtTime");
static_assert(sizeof(MotionWarpingUtilities_ExtractBoneTransformFromAnimationAtTime) == 0x000090, "Wrong size on MotionWarpingUtilities_ExtractBoneTransformFromAnimationAtTime");
static_assert(offsetof(MotionWarpingUtilities_ExtractBoneTransformFromAnimationAtTime, AnimInstance) == 0x000000, "Member 'MotionWarpingUtilities_ExtractBoneTransformFromAnimationAtTime::AnimInstance' has a wrong offset!");
static_assert(offsetof(MotionWarpingUtilities_ExtractBoneTransformFromAnimationAtTime, Animation) == 0x000008, "Member 'MotionWarpingUtilities_ExtractBoneTransformFromAnimationAtTime::Animation' has a wrong offset!");
static_assert(offsetof(MotionWarpingUtilities_ExtractBoneTransformFromAnimationAtTime, Time) == 0x000010, "Member 'MotionWarpingUtilities_ExtractBoneTransformFromAnimationAtTime::Time' has a wrong offset!");
static_assert(offsetof(MotionWarpingUtilities_ExtractBoneTransformFromAnimationAtTime, bExtractRootMotion) == 0x000014, "Member 'MotionWarpingUtilities_ExtractBoneTransformFromAnimationAtTime::bExtractRootMotion' has a wrong offset!");
static_assert(offsetof(MotionWarpingUtilities_ExtractBoneTransformFromAnimationAtTime, BoneName) == 0x000018, "Member 'MotionWarpingUtilities_ExtractBoneTransformFromAnimationAtTime::BoneName' has a wrong offset!");
static_assert(offsetof(MotionWarpingUtilities_ExtractBoneTransformFromAnimationAtTime, bLocalSpace) == 0x000020, "Member 'MotionWarpingUtilities_ExtractBoneTransformFromAnimationAtTime::bLocalSpace' has a wrong offset!");
static_assert(offsetof(MotionWarpingUtilities_ExtractBoneTransformFromAnimationAtTime, OutTransform) == 0x000030, "Member 'MotionWarpingUtilities_ExtractBoneTransformFromAnimationAtTime::OutTransform' has a wrong offset!");

// Function MotionWarping.MotionWarpingUtilities.ExtractRootMotionFromAnimation
// 0x0070 (0x0070 - 0x0000)
struct MotionWarpingUtilities_ExtractRootMotionFromAnimation final
{
public:
	const class UAnimSequenceBase*                Animation;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndTime;                                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionWarpingUtilities_ExtractRootMotionFromAnimation) == 0x000008, "Wrong alignment on MotionWarpingUtilities_ExtractRootMotionFromAnimation");
static_assert(sizeof(MotionWarpingUtilities_ExtractRootMotionFromAnimation) == 0x000070, "Wrong size on MotionWarpingUtilities_ExtractRootMotionFromAnimation");
static_assert(offsetof(MotionWarpingUtilities_ExtractRootMotionFromAnimation, Animation) == 0x000000, "Member 'MotionWarpingUtilities_ExtractRootMotionFromAnimation::Animation' has a wrong offset!");
static_assert(offsetof(MotionWarpingUtilities_ExtractRootMotionFromAnimation, StartTime) == 0x000008, "Member 'MotionWarpingUtilities_ExtractRootMotionFromAnimation::StartTime' has a wrong offset!");
static_assert(offsetof(MotionWarpingUtilities_ExtractRootMotionFromAnimation, EndTime) == 0x00000C, "Member 'MotionWarpingUtilities_ExtractRootMotionFromAnimation::EndTime' has a wrong offset!");
static_assert(offsetof(MotionWarpingUtilities_ExtractRootMotionFromAnimation, ReturnValue) == 0x000010, "Member 'MotionWarpingUtilities_ExtractRootMotionFromAnimation::ReturnValue' has a wrong offset!");

// Function MotionWarping.MotionWarpingUtilities.GetMotionWarpingWindowsForWarpTargetFromAnimation
// 0x0020 (0x0020 - 0x0000)
struct MotionWarpingUtilities_GetMotionWarpingWindowsForWarpTargetFromAnimation final
{
public:
	const class UAnimSequenceBase*                Animation;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   WarpTargetName;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMotionWarpingWindowData>       OutWindows;                                        // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionWarpingUtilities_GetMotionWarpingWindowsForWarpTargetFromAnimation) == 0x000008, "Wrong alignment on MotionWarpingUtilities_GetMotionWarpingWindowsForWarpTargetFromAnimation");
static_assert(sizeof(MotionWarpingUtilities_GetMotionWarpingWindowsForWarpTargetFromAnimation) == 0x000020, "Wrong size on MotionWarpingUtilities_GetMotionWarpingWindowsForWarpTargetFromAnimation");
static_assert(offsetof(MotionWarpingUtilities_GetMotionWarpingWindowsForWarpTargetFromAnimation, Animation) == 0x000000, "Member 'MotionWarpingUtilities_GetMotionWarpingWindowsForWarpTargetFromAnimation::Animation' has a wrong offset!");
static_assert(offsetof(MotionWarpingUtilities_GetMotionWarpingWindowsForWarpTargetFromAnimation, WarpTargetName) == 0x000008, "Member 'MotionWarpingUtilities_GetMotionWarpingWindowsForWarpTargetFromAnimation::WarpTargetName' has a wrong offset!");
static_assert(offsetof(MotionWarpingUtilities_GetMotionWarpingWindowsForWarpTargetFromAnimation, OutWindows) == 0x000010, "Member 'MotionWarpingUtilities_GetMotionWarpingWindowsForWarpTargetFromAnimation::OutWindows' has a wrong offset!");

// Function MotionWarping.MotionWarpingUtilities.GetMotionWarpingWindowsFromAnimation
// 0x0018 (0x0018 - 0x0000)
struct MotionWarpingUtilities_GetMotionWarpingWindowsFromAnimation final
{
public:
	const class UAnimSequenceBase*                Animation;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMotionWarpingWindowData>       OutWindows;                                        // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionWarpingUtilities_GetMotionWarpingWindowsFromAnimation) == 0x000008, "Wrong alignment on MotionWarpingUtilities_GetMotionWarpingWindowsFromAnimation");
static_assert(sizeof(MotionWarpingUtilities_GetMotionWarpingWindowsFromAnimation) == 0x000018, "Wrong size on MotionWarpingUtilities_GetMotionWarpingWindowsFromAnimation");
static_assert(offsetof(MotionWarpingUtilities_GetMotionWarpingWindowsFromAnimation, Animation) == 0x000000, "Member 'MotionWarpingUtilities_GetMotionWarpingWindowsFromAnimation::Animation' has a wrong offset!");
static_assert(offsetof(MotionWarpingUtilities_GetMotionWarpingWindowsFromAnimation, OutWindows) == 0x000008, "Member 'MotionWarpingUtilities_GetMotionWarpingWindowsFromAnimation::OutWindows' has a wrong offset!");

// Function MotionWarping.MotionWarpingComponent.AddOrUpdateWarpTarget
// 0x00E0 (0x00E0 - 0x0000)
struct MotionWarpingComponent_AddOrUpdateWarpTarget final
{
public:
	struct FMotionWarpingTarget                   WarpTarget;                                        // 0x0000(0x00E0)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionWarpingComponent_AddOrUpdateWarpTarget) == 0x000001, "Wrong alignment on MotionWarpingComponent_AddOrUpdateWarpTarget");
static_assert(sizeof(MotionWarpingComponent_AddOrUpdateWarpTarget) == 0x0000E0, "Wrong size on MotionWarpingComponent_AddOrUpdateWarpTarget");
static_assert(offsetof(MotionWarpingComponent_AddOrUpdateWarpTarget, WarpTarget) == 0x000000, "Member 'MotionWarpingComponent_AddOrUpdateWarpTarget::WarpTarget' has a wrong offset!");

// Function MotionWarping.MotionWarpingComponent.AddOrUpdateWarpTargetFromComponent
// 0x0050 (0x0050 - 0x0000)
struct MotionWarpingComponent_AddOrUpdateWarpTargetFromComponent final
{
public:
	class FName                                   WarpTargetName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class USceneComponent*                  Component;                                         // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFollowComponent;                                  // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWarpTargetLocationOffsetDirection            LocationOffsetDirection;                           // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocationOffset;                                    // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotationOffset;                                    // 0x0038(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionWarpingComponent_AddOrUpdateWarpTargetFromComponent) == 0x000008, "Wrong alignment on MotionWarpingComponent_AddOrUpdateWarpTargetFromComponent");
static_assert(sizeof(MotionWarpingComponent_AddOrUpdateWarpTargetFromComponent) == 0x000050, "Wrong size on MotionWarpingComponent_AddOrUpdateWarpTargetFromComponent");
static_assert(offsetof(MotionWarpingComponent_AddOrUpdateWarpTargetFromComponent, WarpTargetName) == 0x000000, "Member 'MotionWarpingComponent_AddOrUpdateWarpTargetFromComponent::WarpTargetName' has a wrong offset!");
static_assert(offsetof(MotionWarpingComponent_AddOrUpdateWarpTargetFromComponent, Component) == 0x000008, "Member 'MotionWarpingComponent_AddOrUpdateWarpTargetFromComponent::Component' has a wrong offset!");
static_assert(offsetof(MotionWarpingComponent_AddOrUpdateWarpTargetFromComponent, BoneName) == 0x000010, "Member 'MotionWarpingComponent_AddOrUpdateWarpTargetFromComponent::BoneName' has a wrong offset!");
static_assert(offsetof(MotionWarpingComponent_AddOrUpdateWarpTargetFromComponent, bFollowComponent) == 0x000018, "Member 'MotionWarpingComponent_AddOrUpdateWarpTargetFromComponent::bFollowComponent' has a wrong offset!");
static_assert(offsetof(MotionWarpingComponent_AddOrUpdateWarpTargetFromComponent, LocationOffsetDirection) == 0x000019, "Member 'MotionWarpingComponent_AddOrUpdateWarpTargetFromComponent::LocationOffsetDirection' has a wrong offset!");
static_assert(offsetof(MotionWarpingComponent_AddOrUpdateWarpTargetFromComponent, LocationOffset) == 0x000020, "Member 'MotionWarpingComponent_AddOrUpdateWarpTargetFromComponent::LocationOffset' has a wrong offset!");
static_assert(offsetof(MotionWarpingComponent_AddOrUpdateWarpTargetFromComponent, RotationOffset) == 0x000038, "Member 'MotionWarpingComponent_AddOrUpdateWarpTargetFromComponent::RotationOffset' has a wrong offset!");

// Function MotionWarping.MotionWarpingComponent.AddOrUpdateWarpTargetFromLocation
// 0x0020 (0x0020 - 0x0000)
struct MotionWarpingComponent_AddOrUpdateWarpTargetFromLocation final
{
public:
	class FName                                   WarpTargetName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetLocation;                                    // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionWarpingComponent_AddOrUpdateWarpTargetFromLocation) == 0x000004, "Wrong alignment on MotionWarpingComponent_AddOrUpdateWarpTargetFromLocation");
static_assert(sizeof(MotionWarpingComponent_AddOrUpdateWarpTargetFromLocation) == 0x000020, "Wrong size on MotionWarpingComponent_AddOrUpdateWarpTargetFromLocation");
static_assert(offsetof(MotionWarpingComponent_AddOrUpdateWarpTargetFromLocation, WarpTargetName) == 0x000000, "Member 'MotionWarpingComponent_AddOrUpdateWarpTargetFromLocation::WarpTargetName' has a wrong offset!");
static_assert(offsetof(MotionWarpingComponent_AddOrUpdateWarpTargetFromLocation, TargetLocation) == 0x000008, "Member 'MotionWarpingComponent_AddOrUpdateWarpTargetFromLocation::TargetLocation' has a wrong offset!");

// Function MotionWarping.MotionWarpingComponent.AddOrUpdateWarpTargetFromLocationAndRotation
// 0x0038 (0x0038 - 0x0000)
struct MotionWarpingComponent_AddOrUpdateWarpTargetFromLocationAndRotation final
{
public:
	class FName                                   WarpTargetName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetLocation;                                    // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               TargetRotation;                                    // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionWarpingComponent_AddOrUpdateWarpTargetFromLocationAndRotation) == 0x000004, "Wrong alignment on MotionWarpingComponent_AddOrUpdateWarpTargetFromLocationAndRotation");
static_assert(sizeof(MotionWarpingComponent_AddOrUpdateWarpTargetFromLocationAndRotation) == 0x000038, "Wrong size on MotionWarpingComponent_AddOrUpdateWarpTargetFromLocationAndRotation");
static_assert(offsetof(MotionWarpingComponent_AddOrUpdateWarpTargetFromLocationAndRotation, WarpTargetName) == 0x000000, "Member 'MotionWarpingComponent_AddOrUpdateWarpTargetFromLocationAndRotation::WarpTargetName' has a wrong offset!");
static_assert(offsetof(MotionWarpingComponent_AddOrUpdateWarpTargetFromLocationAndRotation, TargetLocation) == 0x000008, "Member 'MotionWarpingComponent_AddOrUpdateWarpTargetFromLocationAndRotation::TargetLocation' has a wrong offset!");
static_assert(offsetof(MotionWarpingComponent_AddOrUpdateWarpTargetFromLocationAndRotation, TargetRotation) == 0x000020, "Member 'MotionWarpingComponent_AddOrUpdateWarpTargetFromLocationAndRotation::TargetRotation' has a wrong offset!");

// Function MotionWarping.MotionWarpingComponent.AddOrUpdateWarpTargetFromTransform
// 0x0070 (0x0070 - 0x0000)
struct MotionWarpingComponent_AddOrUpdateWarpTargetFromTransform final
{
public:
	class FName                                   WarpTargetName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TargetTransform;                                   // 0x0010(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionWarpingComponent_AddOrUpdateWarpTargetFromTransform) == 0x000004, "Wrong alignment on MotionWarpingComponent_AddOrUpdateWarpTargetFromTransform");
static_assert(sizeof(MotionWarpingComponent_AddOrUpdateWarpTargetFromTransform) == 0x000070, "Wrong size on MotionWarpingComponent_AddOrUpdateWarpTargetFromTransform");
static_assert(offsetof(MotionWarpingComponent_AddOrUpdateWarpTargetFromTransform, WarpTargetName) == 0x000000, "Member 'MotionWarpingComponent_AddOrUpdateWarpTargetFromTransform::WarpTargetName' has a wrong offset!");
static_assert(offsetof(MotionWarpingComponent_AddOrUpdateWarpTargetFromTransform, TargetTransform) == 0x000010, "Member 'MotionWarpingComponent_AddOrUpdateWarpTargetFromTransform::TargetTransform' has a wrong offset!");

// Function MotionWarping.MotionWarpingComponent.AddSwitchOffCondition
// 0x0010 (0x0010 - 0x0000)
struct MotionWarpingComponent_AddSwitchOffCondition final
{
public:
	class FName                                   WarpTargetName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMotionWarpingSwitchOffCondition*       Condition;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionWarpingComponent_AddSwitchOffCondition) == 0x000008, "Wrong alignment on MotionWarpingComponent_AddSwitchOffCondition");
static_assert(sizeof(MotionWarpingComponent_AddSwitchOffCondition) == 0x000010, "Wrong size on MotionWarpingComponent_AddSwitchOffCondition");
static_assert(offsetof(MotionWarpingComponent_AddSwitchOffCondition, WarpTargetName) == 0x000000, "Member 'MotionWarpingComponent_AddSwitchOffCondition::WarpTargetName' has a wrong offset!");
static_assert(offsetof(MotionWarpingComponent_AddSwitchOffCondition, Condition) == 0x000008, "Member 'MotionWarpingComponent_AddSwitchOffCondition::Condition' has a wrong offset!");

// Function MotionWarping.MotionWarpingComponent.RemoveAllWarpTargets
// 0x0004 (0x0004 - 0x0000)
struct MotionWarpingComponent_RemoveAllWarpTargets final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionWarpingComponent_RemoveAllWarpTargets) == 0x000004, "Wrong alignment on MotionWarpingComponent_RemoveAllWarpTargets");
static_assert(sizeof(MotionWarpingComponent_RemoveAllWarpTargets) == 0x000004, "Wrong size on MotionWarpingComponent_RemoveAllWarpTargets");
static_assert(offsetof(MotionWarpingComponent_RemoveAllWarpTargets, ReturnValue) == 0x000000, "Member 'MotionWarpingComponent_RemoveAllWarpTargets::ReturnValue' has a wrong offset!");

// Function MotionWarping.MotionWarpingComponent.RemoveWarpTarget
// 0x000C (0x000C - 0x0000)
struct MotionWarpingComponent_RemoveWarpTarget final
{
public:
	class FName                                   WarpTargetName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionWarpingComponent_RemoveWarpTarget) == 0x000004, "Wrong alignment on MotionWarpingComponent_RemoveWarpTarget");
static_assert(sizeof(MotionWarpingComponent_RemoveWarpTarget) == 0x00000C, "Wrong size on MotionWarpingComponent_RemoveWarpTarget");
static_assert(offsetof(MotionWarpingComponent_RemoveWarpTarget, WarpTargetName) == 0x000000, "Member 'MotionWarpingComponent_RemoveWarpTarget::WarpTargetName' has a wrong offset!");
static_assert(offsetof(MotionWarpingComponent_RemoveWarpTarget, ReturnValue) == 0x000008, "Member 'MotionWarpingComponent_RemoveWarpTarget::ReturnValue' has a wrong offset!");

// Function MotionWarping.MotionWarpingComponent.RemoveWarpTargets
// 0x0018 (0x0018 - 0x0000)
struct MotionWarpingComponent_RemoveWarpTargets final
{
public:
	TArray<class FName>                           WarpTargetNames;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MotionWarpingComponent_RemoveWarpTargets) == 0x000008, "Wrong alignment on MotionWarpingComponent_RemoveWarpTargets");
static_assert(sizeof(MotionWarpingComponent_RemoveWarpTargets) == 0x000018, "Wrong size on MotionWarpingComponent_RemoveWarpTargets");
static_assert(offsetof(MotionWarpingComponent_RemoveWarpTargets, WarpTargetNames) == 0x000000, "Member 'MotionWarpingComponent_RemoveWarpTargets::WarpTargetNames' has a wrong offset!");
static_assert(offsetof(MotionWarpingComponent_RemoveWarpTargets, ReturnValue) == 0x000010, "Member 'MotionWarpingComponent_RemoveWarpTargets::ReturnValue' has a wrong offset!");

// Function MotionWarping.RootMotionModifier_Scale.AddRootMotionModifierScale
// 0x0038 (0x0038 - 0x0000)
struct RootMotionModifier_Scale_AddRootMotionModifierScale final
{
public:
	class UMotionWarpingComponent*                InMotionWarpingComp;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UAnimSequenceBase*                InAnimation;                                       // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InStartTime;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InEndTime;                                         // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InScale;                                           // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
