#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NamingTokens

#include "Basic.hpp"

#include "NamingTokens_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function NamingTokens.NamingTokens.OnPreEvaluate
// 0x0020 (0x0020 - 0x0000)
struct NamingTokens_OnPreEvaluate final
{
public:
	struct FNamingTokensEvaluationData            InEvaluationData;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(NamingTokens_OnPreEvaluate) == 0x000001, "Wrong alignment on NamingTokens_OnPreEvaluate");
static_assert(sizeof(NamingTokens_OnPreEvaluate) == 0x000020, "Wrong size on NamingTokens_OnPreEvaluate");
static_assert(offsetof(NamingTokens_OnPreEvaluate, InEvaluationData) == 0x000000, "Member 'NamingTokens_OnPreEvaluate::InEvaluationData' has a wrong offset!");

// Function NamingTokens.NamingTokens.ProcessTokenTemplateFunction
// 0x0010 (0x0010 - 0x0000)
struct NamingTokens_ProcessTokenTemplateFunction final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(NamingTokens_ProcessTokenTemplateFunction) == 0x000008, "Wrong alignment on NamingTokens_ProcessTokenTemplateFunction");
static_assert(sizeof(NamingTokens_ProcessTokenTemplateFunction) == 0x000010, "Wrong size on NamingTokens_ProcessTokenTemplateFunction");
static_assert(offsetof(NamingTokens_ProcessTokenTemplateFunction, ReturnValue) == 0x000000, "Member 'NamingTokens_ProcessTokenTemplateFunction::ReturnValue' has a wrong offset!");

// Function NamingTokens.NamingTokens.GetCurrentDateTime
// 0x0008 (0x0008 - 0x0000)
struct NamingTokens_GetCurrentDateTime final
{
public:
	struct FDateTime                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NamingTokens_GetCurrentDateTime) == 0x000001, "Wrong alignment on NamingTokens_GetCurrentDateTime");
static_assert(sizeof(NamingTokens_GetCurrentDateTime) == 0x000008, "Wrong size on NamingTokens_GetCurrentDateTime");
static_assert(offsetof(NamingTokens_GetCurrentDateTime, ReturnValue) == 0x000000, "Member 'NamingTokens_GetCurrentDateTime::ReturnValue' has a wrong offset!");

// Function NamingTokens.NamingTokensEngineSubsystem.EvaluateTokenString
// 0x0068 (0x0068 - 0x0000)
struct NamingTokensEngineSubsystem_EvaluateTokenString final
{
public:
	class FString                                 InTokenString;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNamingTokenFilterArgs                 InFilter;                                          // 0x0010(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        InContexts;                                        // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FNamingTokenResultData                 ReturnValue;                                       // 0x0038(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(NamingTokensEngineSubsystem_EvaluateTokenString) == 0x000008, "Wrong alignment on NamingTokensEngineSubsystem_EvaluateTokenString");
static_assert(sizeof(NamingTokensEngineSubsystem_EvaluateTokenString) == 0x000068, "Wrong size on NamingTokensEngineSubsystem_EvaluateTokenString");
static_assert(offsetof(NamingTokensEngineSubsystem_EvaluateTokenString, InTokenString) == 0x000000, "Member 'NamingTokensEngineSubsystem_EvaluateTokenString::InTokenString' has a wrong offset!");
static_assert(offsetof(NamingTokensEngineSubsystem_EvaluateTokenString, InFilter) == 0x000010, "Member 'NamingTokensEngineSubsystem_EvaluateTokenString::InFilter' has a wrong offset!");
static_assert(offsetof(NamingTokensEngineSubsystem_EvaluateTokenString, InContexts) == 0x000028, "Member 'NamingTokensEngineSubsystem_EvaluateTokenString::InContexts' has a wrong offset!");
static_assert(offsetof(NamingTokensEngineSubsystem_EvaluateTokenString, ReturnValue) == 0x000038, "Member 'NamingTokensEngineSubsystem_EvaluateTokenString::ReturnValue' has a wrong offset!");

// Function NamingTokens.NamingTokensEngineSubsystem.EvaluateTokenText
// 0x0068 (0x0068 - 0x0000)
struct NamingTokensEngineSubsystem_EvaluateTokenText final
{
public:
	class FText                                   InTokenText;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FNamingTokenFilterArgs                 InFilter;                                          // 0x0010(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        InContexts;                                        // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FNamingTokenResultData                 ReturnValue;                                       // 0x0038(0x0030)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(NamingTokensEngineSubsystem_EvaluateTokenText) == 0x000008, "Wrong alignment on NamingTokensEngineSubsystem_EvaluateTokenText");
static_assert(sizeof(NamingTokensEngineSubsystem_EvaluateTokenText) == 0x000068, "Wrong size on NamingTokensEngineSubsystem_EvaluateTokenText");
static_assert(offsetof(NamingTokensEngineSubsystem_EvaluateTokenText, InTokenText) == 0x000000, "Member 'NamingTokensEngineSubsystem_EvaluateTokenText::InTokenText' has a wrong offset!");
static_assert(offsetof(NamingTokensEngineSubsystem_EvaluateTokenText, InFilter) == 0x000010, "Member 'NamingTokensEngineSubsystem_EvaluateTokenText::InFilter' has a wrong offset!");
static_assert(offsetof(NamingTokensEngineSubsystem_EvaluateTokenText, InContexts) == 0x000028, "Member 'NamingTokensEngineSubsystem_EvaluateTokenText::InContexts' has a wrong offset!");
static_assert(offsetof(NamingTokensEngineSubsystem_EvaluateTokenText, ReturnValue) == 0x000038, "Member 'NamingTokensEngineSubsystem_EvaluateTokenText::ReturnValue' has a wrong offset!");

// Function NamingTokens.NamingTokensEngineSubsystem.RegisterGlobalNamespace
// 0x0010 (0x0010 - 0x0000)
struct NamingTokensEngineSubsystem_RegisterGlobalNamespace final
{
public:
	class FString                                 InNameSpace;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NamingTokensEngineSubsystem_RegisterGlobalNamespace) == 0x000008, "Wrong alignment on NamingTokensEngineSubsystem_RegisterGlobalNamespace");
static_assert(sizeof(NamingTokensEngineSubsystem_RegisterGlobalNamespace) == 0x000010, "Wrong size on NamingTokensEngineSubsystem_RegisterGlobalNamespace");
static_assert(offsetof(NamingTokensEngineSubsystem_RegisterGlobalNamespace, InNameSpace) == 0x000000, "Member 'NamingTokensEngineSubsystem_RegisterGlobalNamespace::InNameSpace' has a wrong offset!");

// Function NamingTokens.NamingTokensEngineSubsystem.UnregisterGlobalNamespace
// 0x0010 (0x0010 - 0x0000)
struct NamingTokensEngineSubsystem_UnregisterGlobalNamespace final
{
public:
	class FString                                 InNameSpace;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NamingTokensEngineSubsystem_UnregisterGlobalNamespace) == 0x000008, "Wrong alignment on NamingTokensEngineSubsystem_UnregisterGlobalNamespace");
static_assert(sizeof(NamingTokensEngineSubsystem_UnregisterGlobalNamespace) == 0x000010, "Wrong size on NamingTokensEngineSubsystem_UnregisterGlobalNamespace");
static_assert(offsetof(NamingTokensEngineSubsystem_UnregisterGlobalNamespace, InNameSpace) == 0x000000, "Member 'NamingTokensEngineSubsystem_UnregisterGlobalNamespace::InNameSpace' has a wrong offset!");

// Function NamingTokens.NamingTokensEngineSubsystem.GetAllNamespaces
// 0x0010 (0x0010 - 0x0000)
struct NamingTokensEngineSubsystem_GetAllNamespaces final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(NamingTokensEngineSubsystem_GetAllNamespaces) == 0x000008, "Wrong alignment on NamingTokensEngineSubsystem_GetAllNamespaces");
static_assert(sizeof(NamingTokensEngineSubsystem_GetAllNamespaces) == 0x000010, "Wrong size on NamingTokensEngineSubsystem_GetAllNamespaces");
static_assert(offsetof(NamingTokensEngineSubsystem_GetAllNamespaces, ReturnValue) == 0x000000, "Member 'NamingTokensEngineSubsystem_GetAllNamespaces::ReturnValue' has a wrong offset!");

// Function NamingTokens.NamingTokensEngineSubsystem.GetGlobalNamespaces
// 0x0010 (0x0010 - 0x0000)
struct NamingTokensEngineSubsystem_GetGlobalNamespaces final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(NamingTokensEngineSubsystem_GetGlobalNamespaces) == 0x000008, "Wrong alignment on NamingTokensEngineSubsystem_GetGlobalNamespaces");
static_assert(sizeof(NamingTokensEngineSubsystem_GetGlobalNamespaces) == 0x000010, "Wrong size on NamingTokensEngineSubsystem_GetGlobalNamespaces");
static_assert(offsetof(NamingTokensEngineSubsystem_GetGlobalNamespaces, ReturnValue) == 0x000000, "Member 'NamingTokensEngineSubsystem_GetGlobalNamespaces::ReturnValue' has a wrong offset!");

// Function NamingTokens.NamingTokensEngineSubsystem.GetMultipleNamingTokens
// 0x0020 (0x0020 - 0x0000)
struct NamingTokensEngineSubsystem_GetMultipleNamingTokens final
{
public:
	TArray<class FString>                         InNamespaces;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UNamingTokens*>                  ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(NamingTokensEngineSubsystem_GetMultipleNamingTokens) == 0x000008, "Wrong alignment on NamingTokensEngineSubsystem_GetMultipleNamingTokens");
static_assert(sizeof(NamingTokensEngineSubsystem_GetMultipleNamingTokens) == 0x000020, "Wrong size on NamingTokensEngineSubsystem_GetMultipleNamingTokens");
static_assert(offsetof(NamingTokensEngineSubsystem_GetMultipleNamingTokens, InNamespaces) == 0x000000, "Member 'NamingTokensEngineSubsystem_GetMultipleNamingTokens::InNamespaces' has a wrong offset!");
static_assert(offsetof(NamingTokensEngineSubsystem_GetMultipleNamingTokens, ReturnValue) == 0x000010, "Member 'NamingTokensEngineSubsystem_GetMultipleNamingTokens::ReturnValue' has a wrong offset!");

// Function NamingTokens.NamingTokensEngineSubsystem.GetNamingTokens
// 0x0018 (0x0018 - 0x0000)
struct NamingTokensEngineSubsystem_GetNamingTokens final
{
public:
	class FString                                 InNameSpace;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNamingTokens*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NamingTokensEngineSubsystem_GetNamingTokens) == 0x000008, "Wrong alignment on NamingTokensEngineSubsystem_GetNamingTokens");
static_assert(sizeof(NamingTokensEngineSubsystem_GetNamingTokens) == 0x000018, "Wrong size on NamingTokensEngineSubsystem_GetNamingTokens");
static_assert(offsetof(NamingTokensEngineSubsystem_GetNamingTokens, InNameSpace) == 0x000000, "Member 'NamingTokensEngineSubsystem_GetNamingTokens::InNameSpace' has a wrong offset!");
static_assert(offsetof(NamingTokensEngineSubsystem_GetNamingTokens, ReturnValue) == 0x000010, "Member 'NamingTokensEngineSubsystem_GetNamingTokens::ReturnValue' has a wrong offset!");

// Function NamingTokens.NamingTokensEngineSubsystem.GetNamingTokensNative
// 0x0018 (0x0018 - 0x0000)
struct NamingTokensEngineSubsystem_GetNamingTokensNative final
{
public:
	class FString                                 InNameSpace;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNamingTokens*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NamingTokensEngineSubsystem_GetNamingTokensNative) == 0x000008, "Wrong alignment on NamingTokensEngineSubsystem_GetNamingTokensNative");
static_assert(sizeof(NamingTokensEngineSubsystem_GetNamingTokensNative) == 0x000018, "Wrong size on NamingTokensEngineSubsystem_GetNamingTokensNative");
static_assert(offsetof(NamingTokensEngineSubsystem_GetNamingTokensNative, InNameSpace) == 0x000000, "Member 'NamingTokensEngineSubsystem_GetNamingTokensNative::InNameSpace' has a wrong offset!");
static_assert(offsetof(NamingTokensEngineSubsystem_GetNamingTokensNative, ReturnValue) == 0x000010, "Member 'NamingTokensEngineSubsystem_GetNamingTokensNative::ReturnValue' has a wrong offset!");

// Function NamingTokens.NamingTokensEngineSubsystem.IsGlobalNamespaceRegistered
// 0x0018 (0x0018 - 0x0000)
struct NamingTokensEngineSubsystem_IsGlobalNamespaceRegistered final
{
public:
	class FString                                 InNameSpace;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NamingTokensEngineSubsystem_IsGlobalNamespaceRegistered) == 0x000008, "Wrong alignment on NamingTokensEngineSubsystem_IsGlobalNamespaceRegistered");
static_assert(sizeof(NamingTokensEngineSubsystem_IsGlobalNamespaceRegistered) == 0x000018, "Wrong size on NamingTokensEngineSubsystem_IsGlobalNamespaceRegistered");
static_assert(offsetof(NamingTokensEngineSubsystem_IsGlobalNamespaceRegistered, InNameSpace) == 0x000000, "Member 'NamingTokensEngineSubsystem_IsGlobalNamespaceRegistered::InNameSpace' has a wrong offset!");
static_assert(offsetof(NamingTokensEngineSubsystem_IsGlobalNamespaceRegistered, ReturnValue) == 0x000010, "Member 'NamingTokensEngineSubsystem_IsGlobalNamespaceRegistered::ReturnValue' has a wrong offset!");

}

