#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NamingTokens

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct NamingTokens.NamingTokenValueData
// 0x0038 (0x0038 - 0x0000)
struct FNamingTokenValueData final
{
public:
	class FString                                 TokenKey;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProvidedNamespace;                                 // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   TokenValue;                                        // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          bWasEvaluated;                                     // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNamingTokenValueData) == 0x000008, "Wrong alignment on FNamingTokenValueData");
static_assert(sizeof(FNamingTokenValueData) == 0x000038, "Wrong size on FNamingTokenValueData");
static_assert(offsetof(FNamingTokenValueData, TokenKey) == 0x000000, "Member 'FNamingTokenValueData::TokenKey' has a wrong offset!");
static_assert(offsetof(FNamingTokenValueData, ProvidedNamespace) == 0x000010, "Member 'FNamingTokenValueData::ProvidedNamespace' has a wrong offset!");
static_assert(offsetof(FNamingTokenValueData, TokenValue) == 0x000020, "Member 'FNamingTokenValueData::TokenValue' has a wrong offset!");
static_assert(offsetof(FNamingTokenValueData, bWasEvaluated) == 0x000030, "Member 'FNamingTokenValueData::bWasEvaluated' has a wrong offset!");

// ScriptStruct NamingTokens.NamingTokenResultData
// 0x0030 (0x0030 - 0x0000)
struct FNamingTokenResultData final
{
public:
	class FText                                   OriginalText;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                   EvaluatedText;                                     // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FNamingTokenValueData>          TokenValues;                                       // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNamingTokenResultData) == 0x000008, "Wrong alignment on FNamingTokenResultData");
static_assert(sizeof(FNamingTokenResultData) == 0x000030, "Wrong size on FNamingTokenResultData");
static_assert(offsetof(FNamingTokenResultData, OriginalText) == 0x000000, "Member 'FNamingTokenResultData::OriginalText' has a wrong offset!");
static_assert(offsetof(FNamingTokenResultData, EvaluatedText) == 0x000010, "Member 'FNamingTokenResultData::EvaluatedText' has a wrong offset!");
static_assert(offsetof(FNamingTokenResultData, TokenValues) == 0x000020, "Member 'FNamingTokenResultData::TokenValues' has a wrong offset!");

// ScriptStruct NamingTokens.NamingTokenData
// 0x0048 (0x0048 - 0x0000)
struct FNamingTokenData final
{
public:
	class FString                                 TokenKey;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   DisplayName;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                   FunctionName;                                      // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNamingTokenData) == 0x000008, "Wrong alignment on FNamingTokenData");
static_assert(sizeof(FNamingTokenData) == 0x000048, "Wrong size on FNamingTokenData");
static_assert(offsetof(FNamingTokenData, TokenKey) == 0x000000, "Member 'FNamingTokenData::TokenKey' has a wrong offset!");
static_assert(offsetof(FNamingTokenData, DisplayName) == 0x000010, "Member 'FNamingTokenData::DisplayName' has a wrong offset!");
static_assert(offsetof(FNamingTokenData, Description) == 0x000020, "Member 'FNamingTokenData::Description' has a wrong offset!");
static_assert(offsetof(FNamingTokenData, FunctionName) == 0x000030, "Member 'FNamingTokenData::FunctionName' has a wrong offset!");

// ScriptStruct NamingTokens.NamingTokenFilterArgs
// 0x0018 (0x0018 - 0x0000)
struct FNamingTokenFilterArgs final
{
public:
	TArray<class FString>                         AdditionalNamespacesToInclude;                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIncludeGlobal;                                    // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceCaseSensitive;                               // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNativeOnly;                                       // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNamingTokenFilterArgs) == 0x000008, "Wrong alignment on FNamingTokenFilterArgs");
static_assert(sizeof(FNamingTokenFilterArgs) == 0x000018, "Wrong size on FNamingTokenFilterArgs");
static_assert(offsetof(FNamingTokenFilterArgs, AdditionalNamespacesToInclude) == 0x000000, "Member 'FNamingTokenFilterArgs::AdditionalNamespacesToInclude' has a wrong offset!");
static_assert(offsetof(FNamingTokenFilterArgs, bIncludeGlobal) == 0x000010, "Member 'FNamingTokenFilterArgs::bIncludeGlobal' has a wrong offset!");
static_assert(offsetof(FNamingTokenFilterArgs, bForceCaseSensitive) == 0x000011, "Member 'FNamingTokenFilterArgs::bForceCaseSensitive' has a wrong offset!");
static_assert(offsetof(FNamingTokenFilterArgs, bNativeOnly) == 0x000012, "Member 'FNamingTokenFilterArgs::bNativeOnly' has a wrong offset!");

// ScriptStruct NamingTokens.NamingTokensEvaluationData
// 0x0020 (0x0020 - 0x0000)
struct FNamingTokensEvaluationData final
{
public:
	struct FDateTime                              CurrentDateTime;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        Contexts;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNamingTokensEvaluationData) == 0x000008, "Wrong alignment on FNamingTokensEvaluationData");
static_assert(sizeof(FNamingTokensEvaluationData) == 0x000020, "Wrong size on FNamingTokensEvaluationData");
static_assert(offsetof(FNamingTokensEvaluationData, CurrentDateTime) == 0x000000, "Member 'FNamingTokensEvaluationData::CurrentDateTime' has a wrong offset!");
static_assert(offsetof(FNamingTokensEvaluationData, Contexts) == 0x000008, "Member 'FNamingTokensEvaluationData::Contexts' has a wrong offset!");

}

