#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NamingTokens

#include "Basic.hpp"

#include "NamingTokens_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class NamingTokens.NamingTokens
// 0x00D0 (0x00F8 - 0x0028)
class UNamingTokens : public UObject
{
public:
	uint8                                         Pad_28[0x90];                                      // 0x0028(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNamingTokenData>               CustomTokens;                                      // 0x00B8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FNamingTokensEvaluationData            CurrentEvaluationData;                             // 0x00C8(0x0020)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FString                                 Namespace;                                         // 0x00E8(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnPostEvaluate();
	void OnPreEvaluate(const struct FNamingTokensEvaluationData& InEvaluationData);
	class FText ProcessTokenTemplateFunction();

	struct FDateTime GetCurrentDateTime() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NamingTokens">();
	}
	static class UNamingTokens* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNamingTokens>();
	}
};
static_assert(alignof(UNamingTokens) == 0x000008, "Wrong alignment on UNamingTokens");
static_assert(sizeof(UNamingTokens) == 0x0000F8, "Wrong size on UNamingTokens");
static_assert(offsetof(UNamingTokens, CustomTokens) == 0x0000B8, "Member 'UNamingTokens::CustomTokens' has a wrong offset!");
static_assert(offsetof(UNamingTokens, CurrentEvaluationData) == 0x0000C8, "Member 'UNamingTokens::CurrentEvaluationData' has a wrong offset!");
static_assert(offsetof(UNamingTokens, Namespace) == 0x0000E8, "Member 'UNamingTokens::Namespace' has a wrong offset!");

// Class NamingTokens.GlobalNamingTokens
// 0x0000 (0x00F8 - 0x00F8)
class UGlobalNamingTokens final : public UNamingTokens
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GlobalNamingTokens">();
	}
	static class UGlobalNamingTokens* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGlobalNamingTokens>();
	}
};
static_assert(alignof(UGlobalNamingTokens) == 0x000008, "Wrong alignment on UGlobalNamingTokens");
static_assert(sizeof(UGlobalNamingTokens) == 0x0000F8, "Wrong size on UGlobalNamingTokens");

// Class NamingTokens.NamingTokensEngineSubsystem
// 0x0120 (0x0150 - 0x0030)
class UNamingTokensEngineSubsystem final : public UEngineSubsystem
{
public:
	TMap<class FString, class UNamingTokens*>     CachedNamingTokens;                                // 0x0030(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_80[0xD0];                                      // 0x0080(0x00D0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearCachedNamingTokens();
	struct FNamingTokenResultData EvaluateTokenString(const class FString& InTokenString, const struct FNamingTokenFilterArgs& InFilter, const TArray<class UObject*>& InContexts);
	struct FNamingTokenResultData EvaluateTokenText(const class FText& InTokenText, const struct FNamingTokenFilterArgs& InFilter, const TArray<class UObject*>& InContexts);
	void RegisterGlobalNamespace(const class FString& InNameSpace);
	void UnregisterGlobalNamespace(const class FString& InNameSpace);

	TArray<class FString> GetAllNamespaces() const;
	TArray<class FString> GetGlobalNamespaces() const;
	TArray<class UNamingTokens*> GetMultipleNamingTokens(const TArray<class FString>& InNamespaces) const;
	class UNamingTokens* GetNamingTokens(const class FString& InNameSpace) const;
	class UNamingTokens* GetNamingTokensNative(const class FString& InNameSpace) const;
	bool IsGlobalNamespaceRegistered(const class FString& InNameSpace) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NamingTokensEngineSubsystem">();
	}
	static class UNamingTokensEngineSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNamingTokensEngineSubsystem>();
	}
};
static_assert(alignof(UNamingTokensEngineSubsystem) == 0x000008, "Wrong alignment on UNamingTokensEngineSubsystem");
static_assert(sizeof(UNamingTokensEngineSubsystem) == 0x000150, "Wrong size on UNamingTokensEngineSubsystem");
static_assert(offsetof(UNamingTokensEngineSubsystem, CachedNamingTokens) == 0x000030, "Member 'UNamingTokensEngineSubsystem::CachedNamingTokens' has a wrong offset!");

}

