#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NavCorridor

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct NavCorridor.NavCorridorParams
// 0x0050 (0x0050 - 0x0000)
struct FNavCorridorParams final
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Width;                                             // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PathOffsetFromBoundaries;                          // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ObstacleTaperAngle;                                // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SmallSectorThreshold;                              // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LargeSectorThreshold;                              // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SimplifyEdgeThreshold;                             // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSimplifyFlipPortals;                              // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSimplifyConvexPortals;                            // 0x0049(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSimplifyConcavePortals;                           // 0x004A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNavCorridorParams) == 0x000004, "Wrong alignment on FNavCorridorParams");
static_assert(sizeof(FNavCorridorParams) == 0x000050, "Wrong size on FNavCorridorParams");
static_assert(offsetof(FNavCorridorParams, Width) == 0x000030, "Member 'FNavCorridorParams::Width' has a wrong offset!");
static_assert(offsetof(FNavCorridorParams, PathOffsetFromBoundaries) == 0x000034, "Member 'FNavCorridorParams::PathOffsetFromBoundaries' has a wrong offset!");
static_assert(offsetof(FNavCorridorParams, ObstacleTaperAngle) == 0x000038, "Member 'FNavCorridorParams::ObstacleTaperAngle' has a wrong offset!");
static_assert(offsetof(FNavCorridorParams, SmallSectorThreshold) == 0x00003C, "Member 'FNavCorridorParams::SmallSectorThreshold' has a wrong offset!");
static_assert(offsetof(FNavCorridorParams, LargeSectorThreshold) == 0x000040, "Member 'FNavCorridorParams::LargeSectorThreshold' has a wrong offset!");
static_assert(offsetof(FNavCorridorParams, SimplifyEdgeThreshold) == 0x000044, "Member 'FNavCorridorParams::SimplifyEdgeThreshold' has a wrong offset!");
static_assert(offsetof(FNavCorridorParams, bSimplifyFlipPortals) == 0x000048, "Member 'FNavCorridorParams::bSimplifyFlipPortals' has a wrong offset!");
static_assert(offsetof(FNavCorridorParams, bSimplifyConvexPortals) == 0x000049, "Member 'FNavCorridorParams::bSimplifyConvexPortals' has a wrong offset!");
static_assert(offsetof(FNavCorridorParams, bSimplifyConcavePortals) == 0x00004A, "Member 'FNavCorridorParams::bSimplifyConcavePortals' has a wrong offset!");

}

