#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Oceanology_Plugin

#include "Basic.hpp"

#include "Oceanology_Plugin_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class Oceanology_Plugin.Infinite_Compound
// 0x0020 (0x0270 - 0x0250)
class UInfinite_Compound final : public USceneComponent
{
public:
	bool                                          Realtime;                                          // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeJump;                                          // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInfinityCategory                             InfinityCategory;                                  // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_259[0x17];                                     // 0x0259(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Infinite_Compound">();
	}
	static class UInfinite_Compound* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInfinite_Compound>();
	}
};
static_assert(alignof(UInfinite_Compound) == 0x000008, "Wrong alignment on UInfinite_Compound");
static_assert(sizeof(UInfinite_Compound) == 0x000270, "Wrong size on UInfinite_Compound");
static_assert(offsetof(UInfinite_Compound, Realtime) == 0x000250, "Member 'UInfinite_Compound::Realtime' has a wrong offset!");
static_assert(offsetof(UInfinite_Compound, TimeJump) == 0x000254, "Member 'UInfinite_Compound::TimeJump' has a wrong offset!");
static_assert(offsetof(UInfinite_Compound, InfinityCategory) == 0x000258, "Member 'UInfinite_Compound::InfinityCategory' has a wrong offset!");

// Class Oceanology_Plugin.OceanologySwimVolume
// 0x0000 (0x0310 - 0x0310)
class AOceanologySwimVolume final : public APhysicsVolume
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OceanologySwimVolume">();
	}
	static class AOceanologySwimVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOceanologySwimVolume>();
	}
};
static_assert(alignof(AOceanologySwimVolume) == 0x000008, "Wrong alignment on AOceanologySwimVolume");
static_assert(sizeof(AOceanologySwimVolume) == 0x000310, "Wrong size on AOceanologySwimVolume");

// Class Oceanology_Plugin.Oceanology_PluginBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UOceanology_PluginBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static float Oceanology_PluginSampleFunction(float Param);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Oceanology_PluginBPLibrary">();
	}
	static class UOceanology_PluginBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOceanology_PluginBPLibrary>();
	}
};
static_assert(alignof(UOceanology_PluginBPLibrary) == 0x000008, "Wrong alignment on UOceanology_PluginBPLibrary");
static_assert(sizeof(UOceanology_PluginBPLibrary) == 0x000028, "Wrong size on UOceanology_PluginBPLibrary");

// Class Oceanology_Plugin.QuadTree
// 0x0010 (0x02D8 - 0x02C8)
class AQuadTree final : public AActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EditorTickIsEnabled;                               // 0x02D0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Procedural(class UHierarchicalInstancedStaticMeshComponent* HISMC, float GridSize, int32 GridTiles, float CellSize);
	void SetEditorTickEnabled(bool bEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"QuadTree">();
	}
	static class AQuadTree* GetDefaultObj()
	{
		return GetDefaultObjImpl<AQuadTree>();
	}
};
static_assert(alignof(AQuadTree) == 0x000008, "Wrong alignment on AQuadTree");
static_assert(sizeof(AQuadTree) == 0x0002D8, "Wrong size on AQuadTree");
static_assert(offsetof(AQuadTree, DefaultSceneRoot) == 0x0002C8, "Member 'AQuadTree::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AQuadTree, EditorTickIsEnabled) == 0x0002D0, "Member 'AQuadTree::EditorTickIsEnabled' has a wrong offset!");

}

