#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Oceanology_Plugin

#include "Basic.hpp"


namespace SDK::Params
{

// Function Oceanology_Plugin.Oceanology_PluginBPLibrary.Oceanology_PluginSampleFunction
// 0x0008 (0x0008 - 0x0000)
struct Oceanology_PluginBPLibrary_Oceanology_PluginSampleFunction final
{
public:
	float                                         Param;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Oceanology_PluginBPLibrary_Oceanology_PluginSampleFunction) == 0x000004, "Wrong alignment on Oceanology_PluginBPLibrary_Oceanology_PluginSampleFunction");
static_assert(sizeof(Oceanology_PluginBPLibrary_Oceanology_PluginSampleFunction) == 0x000008, "Wrong size on Oceanology_PluginBPLibrary_Oceanology_PluginSampleFunction");
static_assert(offsetof(Oceanology_PluginBPLibrary_Oceanology_PluginSampleFunction, Param) == 0x000000, "Member 'Oceanology_PluginBPLibrary_Oceanology_PluginSampleFunction::Param' has a wrong offset!");
static_assert(offsetof(Oceanology_PluginBPLibrary_Oceanology_PluginSampleFunction, ReturnValue) == 0x000004, "Member 'Oceanology_PluginBPLibrary_Oceanology_PluginSampleFunction::ReturnValue' has a wrong offset!");

// Function Oceanology_Plugin.QuadTree.Procedural
// 0x0018 (0x0018 - 0x0000)
struct QuadTree_Procedural final
{
public:
	class UHierarchicalInstancedStaticMeshComponent* HISMC;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GridSize;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GridTiles;                                         // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CellSize;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(QuadTree_Procedural) == 0x000008, "Wrong alignment on QuadTree_Procedural");
static_assert(sizeof(QuadTree_Procedural) == 0x000018, "Wrong size on QuadTree_Procedural");
static_assert(offsetof(QuadTree_Procedural, HISMC) == 0x000000, "Member 'QuadTree_Procedural::HISMC' has a wrong offset!");
static_assert(offsetof(QuadTree_Procedural, GridSize) == 0x000008, "Member 'QuadTree_Procedural::GridSize' has a wrong offset!");
static_assert(offsetof(QuadTree_Procedural, GridTiles) == 0x00000C, "Member 'QuadTree_Procedural::GridTiles' has a wrong offset!");
static_assert(offsetof(QuadTree_Procedural, CellSize) == 0x000010, "Member 'QuadTree_Procedural::CellSize' has a wrong offset!");

// Function Oceanology_Plugin.QuadTree.SetEditorTickEnabled
// 0x0001 (0x0001 - 0x0000)
struct QuadTree_SetEditorTickEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(QuadTree_SetEditorTickEnabled) == 0x000001, "Wrong alignment on QuadTree_SetEditorTickEnabled");
static_assert(sizeof(QuadTree_SetEditorTickEnabled) == 0x000001, "Wrong size on QuadTree_SetEditorTickEnabled");
static_assert(offsetof(QuadTree_SetEditorTickEnabled, bEnabled) == 0x000000, "Member 'QuadTree_SetEditorTickEnabled::bEnabled' has a wrong offset!");

}

