#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OneEngineSDK

#include "Basic.hpp"


namespace SDK
{

// Enum OneEngineSDK.EOnePsnAccountState
// NumValues: 0x0004
enum class EOnePsnAccountState : uint8
{
	Unknown                                  = 0,
	SignedOut                                = 1,
	SignedIn                                 = 2,
	EOnePsnAccountState_MAX                  = 3,
};

// Enum OneEngineSDK.EOnePSStoreIconPos
// NumValues: 0x0004
enum class EOnePSStoreIconPos : uint8
{
	Center                                   = 0,
	Left                                     = 1,
	Right                                    = 2,
	EOnePSStoreIconPos_MAX                   = 3,
};

// Enum OneEngineSDK.EOneEngineThirdType
// NumValues: 0x001D
enum class EOneEngineThirdType : uint8
{
	Guest                                    = 0,
	Facebook                                 = 1,
	Google                                   = 2,
	Twitter                                  = 3,
	Line                                     = 4,
	GooglePlay                               = 5,
	GameCenter                               = 6,
	Phone                                    = 7,
	Email                                    = 8,
	VK                                       = 9,
	Naver                                    = 10,
	Apple                                    = 11,
	WeChat                                   = 12,
	GuestInherit                             = 13,
	Yandex                                   = 14,
	MailRu                                   = 15,
	Infiplay                                 = 16,
	HW                                       = 17,
	ShareCode                                = 18,
	HONOR                                    = 19,
	STEAM                                    = 20,
	PCScanCode                               = 22,
	PlayStation                              = 23,
	APJ                                      = 24,
	Crunchyrool                              = 25,
	LinkAccount                              = 26,
	NaverCafe                                = 50,
	WMPass                                   = 100,
	EOneEngineThirdType_MAX                  = 101,
};

// Enum OneEngineSDK.EOnePermissionType
// NumValues: 0x000F
enum class EOnePermissionType : uint8
{
	Clipboard                                = 0,
	ReadExternalStorage                      = 1,
	WriteExternalStorage                     = 2,
	Camera                                   = 3,
	RecordAudio                              = 4,
	CoarseLocation                           = 5,
	FineLocation                             = 6,
	CallPhone                                = 7,
	ReadContacts                             = 8,
	ReadSms                                  = 9,
	ReadCalendar                             = 10,
	BodySensors                              = 11,
	Notification                             = 12,
	ATTTrack                                 = 13,
	EOnePermissionType_MAX                   = 14,
};

// Enum OneEngineSDK.EOneResEventState
// NumValues: 0x0004
enum class EOneResEventState : uint8
{
	Begin                                    = 0,
	Success                                  = 1,
	Failed                                   = 2,
	EOneResEventState_MAX                    = 3,
};

// Enum OneEngineSDK.EOneEngineSDKRegionType
// NumValues: 0x0003
enum class EOneEngineSDKRegionType : uint8
{
	Mainland                                 = 0,
	Oversea                                  = 1,
	EOneEngineSDKRegionType_MAX              = 2,
};

// Enum OneEngineSDK.EOneShareAppTarget
// NumValues: 0x0012
enum class EOneShareAppTarget : uint8
{
	PE_WeChatSession                         = 0,
	PE_WeChatMoment                          = 1,
	PE_QQ                                    = 2,
	PE_QZone                                 = 3,
	PE_Weibo                                 = 4,
	PE_Bilibili                              = 5,
	PE_Facebook                              = 6,
	PE_VK                                    = 7,
	PE_Instagram                             = 8,
	PE_Twitter                               = 9,
	PE_Line                                  = 10,
	PE_NaverGame                             = 11,
	PE_TikTok                                = 12,
	PE_Discord                               = 13,
	PE_Telegram                              = 14,
	PE_TaJiDuo                               = 15,
	PE_TapTap                                = 16,
	PE_Max                                   = 17,
};

// Enum OneEngineSDK.EOneUnlockSafeLockType
// NumValues: 0x0003
enum class EOneUnlockSafeLockType : uint8
{
	PushNotification                         = 0,
	DynamicCode                              = 1,
	EOneUnlockSafeLockType_MAX               = 2,
};

// Enum OneEngineSDK.EOneUnlockSafeLockResult
// NumValues: 0x0005
enum class EOneUnlockSafeLockResult : uint8
{
	WaitingToUnlock                          = 0,
	UnlockSucceeded                          = 1,
	UnlockTimedOut                           = 2,
	UnlockFailed                             = 3,
	EOneUnlockSafeLockResult_MAX             = 4,
};

// Enum OneEngineSDK.EOneAIHelpType
// NumValues: 0x0004
enum class EOneAIHelpType : uint8
{
	Unknown                                  = 0,
	RobotChat                                = 1,
	FAQ                                      = 2,
	EOneAIHelpType_MAX                       = 3,
};

// Enum OneEngineSDK.EOneNaverGameType
// NumValues: 0x0005
enum class EOneNaverGameType : uint8
{
	Banner                                   = 0,
	Sorry                                    = 1,
	Board                                    = 2,
	Feed                                     = 3,
	EOneNaverGameType_MAX                    = 4,
};

// Enum OneEngineSDK.EOneScreenOrientation
// NumValues: 0x0004
enum class EOneScreenOrientation : uint8
{
	Unknown                                  = 0,
	Portrait                                 = 1,
	Landscape                                = 2,
	EOneScreenOrientation_MAX                = 3,
};

// Enum OneEngineSDK.EOneShareType
// NumValues: 0x0005
enum class EOneShareType : uint8
{
	Image                                    = 0,
	WebPage                                  = 1,
	Text                                     = 2,
	ImageSnapShot                            = 3,
	EOneShareType_MAX                        = 4,
};

// Enum OneEngineSDK.EPSOneInputPhoneNumType
// NumValues: 0x0003
enum class EPSOneInputPhoneNumType : uint8
{
	PhoneNum                                 = 0,
	Email                                    = 1,
	EPSOneInputPhoneNumType_MAX              = 2,
};

// Enum OneEngineSDK.EPSLoginRegion
// NumValues: 0x0003
enum class EPSLoginRegion : uint8
{
	Mainland                                 = 0,
	Global                                   = 1,
	EPSLoginRegion_MAX                       = 2,
};

// Enum OneEngineSDK.EPSLoginCredentialType
// NumValues: 0x0003
enum class EPSLoginCredentialType : uint8
{
	Phone                                    = 0,
	Email                                    = 1,
	EPSLoginCredentialType_MAX               = 2,
};

// Enum OneEngineSDK.EPSLoginAuthMethod
// NumValues: 0x0003
enum class EPSLoginAuthMethod : uint8
{
	Password                                 = 0,
	VerificationCode                         = 1,
	EPSLoginAuthMethod_MAX                   = 2,
};

// ScriptStruct OneEngineSDK.OnePSUserProfile
// 0x0078 (0x0078 - 0x0000)
struct FOnePSUserProfile final
{
public:
	class FString                                 AccountId;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OnlineId;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AvatarUrl;                                         // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AboutMe;                                           // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsOfficiallyVerified;                             // 0x0040(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SDKuid;                                            // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerId;                                          // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleId;                                            // 0x0058(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleName;                                          // 0x0068(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOnePSUserProfile) == 0x000008, "Wrong alignment on FOnePSUserProfile");
static_assert(sizeof(FOnePSUserProfile) == 0x000078, "Wrong size on FOnePSUserProfile");
static_assert(offsetof(FOnePSUserProfile, AccountId) == 0x000000, "Member 'FOnePSUserProfile::AccountId' has a wrong offset!");
static_assert(offsetof(FOnePSUserProfile, OnlineId) == 0x000010, "Member 'FOnePSUserProfile::OnlineId' has a wrong offset!");
static_assert(offsetof(FOnePSUserProfile, AvatarUrl) == 0x000020, "Member 'FOnePSUserProfile::AvatarUrl' has a wrong offset!");
static_assert(offsetof(FOnePSUserProfile, AboutMe) == 0x000030, "Member 'FOnePSUserProfile::AboutMe' has a wrong offset!");
static_assert(offsetof(FOnePSUserProfile, bIsOfficiallyVerified) == 0x000040, "Member 'FOnePSUserProfile::bIsOfficiallyVerified' has a wrong offset!");
static_assert(offsetof(FOnePSUserProfile, SDKuid) == 0x000044, "Member 'FOnePSUserProfile::SDKuid' has a wrong offset!");
static_assert(offsetof(FOnePSUserProfile, ServerId) == 0x000048, "Member 'FOnePSUserProfile::ServerId' has a wrong offset!");
static_assert(offsetof(FOnePSUserProfile, RoleId) == 0x000058, "Member 'FOnePSUserProfile::RoleId' has a wrong offset!");
static_assert(offsetof(FOnePSUserProfile, RoleName) == 0x000068, "Member 'FOnePSUserProfile::RoleName' has a wrong offset!");

// ScriptStruct OneEngineSDK.OnePSUserProfileResponse
// 0x0020 (0x0020 - 0x0000)
struct FOnePSUserProfileResponse final
{
public:
	TArray<struct FOnePSUserProfile>              Profiles;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         Total;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NextOffset;                                        // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PreviousOffset;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FOnePSUserProfileResponse) == 0x000008, "Wrong alignment on FOnePSUserProfileResponse");
static_assert(sizeof(FOnePSUserProfileResponse) == 0x000020, "Wrong size on FOnePSUserProfileResponse");
static_assert(offsetof(FOnePSUserProfileResponse, Profiles) == 0x000000, "Member 'FOnePSUserProfileResponse::Profiles' has a wrong offset!");
static_assert(offsetof(FOnePSUserProfileResponse, Total) == 0x000010, "Member 'FOnePSUserProfileResponse::Total' has a wrong offset!");
static_assert(offsetof(FOnePSUserProfileResponse, NextOffset) == 0x000014, "Member 'FOnePSUserProfileResponse::NextOffset' has a wrong offset!");
static_assert(offsetof(FOnePSUserProfileResponse, PreviousOffset) == 0x000018, "Member 'FOnePSUserProfileResponse::PreviousOffset' has a wrong offset!");

// ScriptStruct OneEngineSDK.PSOneUserCenterModel
// 0x00E0 (0x00E0 - 0x0000)
struct FPSOneUserCenterModel final
{
public:
	class FString                                 UserName;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Nickname;                                          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CellPhone;                                         // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ShowCellPhone;                                     // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ShowEmail;                                         // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HeadImg;                                           // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RealName;                                          // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 IDNumber;                                          // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Email;                                             // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserId;                                            // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OneID;                                             // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NewUser;                                           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UserIP;                                            // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HavePwd;                                           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPSOneUserCenterModel) == 0x000008, "Wrong alignment on FPSOneUserCenterModel");
static_assert(sizeof(FPSOneUserCenterModel) == 0x0000E0, "Wrong size on FPSOneUserCenterModel");
static_assert(offsetof(FPSOneUserCenterModel, UserName) == 0x000000, "Member 'FPSOneUserCenterModel::UserName' has a wrong offset!");
static_assert(offsetof(FPSOneUserCenterModel, Nickname) == 0x000010, "Member 'FPSOneUserCenterModel::Nickname' has a wrong offset!");
static_assert(offsetof(FPSOneUserCenterModel, CellPhone) == 0x000020, "Member 'FPSOneUserCenterModel::CellPhone' has a wrong offset!");
static_assert(offsetof(FPSOneUserCenterModel, ShowCellPhone) == 0x000030, "Member 'FPSOneUserCenterModel::ShowCellPhone' has a wrong offset!");
static_assert(offsetof(FPSOneUserCenterModel, ShowEmail) == 0x000040, "Member 'FPSOneUserCenterModel::ShowEmail' has a wrong offset!");
static_assert(offsetof(FPSOneUserCenterModel, HeadImg) == 0x000050, "Member 'FPSOneUserCenterModel::HeadImg' has a wrong offset!");
static_assert(offsetof(FPSOneUserCenterModel, RealName) == 0x000060, "Member 'FPSOneUserCenterModel::RealName' has a wrong offset!");
static_assert(offsetof(FPSOneUserCenterModel, IDNumber) == 0x000070, "Member 'FPSOneUserCenterModel::IDNumber' has a wrong offset!");
static_assert(offsetof(FPSOneUserCenterModel, Email) == 0x000080, "Member 'FPSOneUserCenterModel::Email' has a wrong offset!");
static_assert(offsetof(FPSOneUserCenterModel, UserId) == 0x000090, "Member 'FPSOneUserCenterModel::UserId' has a wrong offset!");
static_assert(offsetof(FPSOneUserCenterModel, OneID) == 0x0000A0, "Member 'FPSOneUserCenterModel::OneID' has a wrong offset!");
static_assert(offsetof(FPSOneUserCenterModel, Token) == 0x0000B0, "Member 'FPSOneUserCenterModel::Token' has a wrong offset!");
static_assert(offsetof(FPSOneUserCenterModel, NewUser) == 0x0000C0, "Member 'FPSOneUserCenterModel::NewUser' has a wrong offset!");
static_assert(offsetof(FPSOneUserCenterModel, UserIP) == 0x0000C8, "Member 'FPSOneUserCenterModel::UserIP' has a wrong offset!");
static_assert(offsetof(FPSOneUserCenterModel, HavePwd) == 0x0000D8, "Member 'FPSOneUserCenterModel::HavePwd' has a wrong offset!");

// ScriptStruct OneEngineSDK.OnePushNotDisturbInfo
// 0x0028 (0x0028 - 0x0000)
struct FOnePushNotDisturbInfo final
{
public:
	bool                                          bNotDisturb;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NotDisturbStartTime;                               // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NotDisturbEndTime;                                 // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOnePushNotDisturbInfo) == 0x000008, "Wrong alignment on FOnePushNotDisturbInfo");
static_assert(sizeof(FOnePushNotDisturbInfo) == 0x000028, "Wrong size on FOnePushNotDisturbInfo");
static_assert(offsetof(FOnePushNotDisturbInfo, bNotDisturb) == 0x000000, "Member 'FOnePushNotDisturbInfo::bNotDisturb' has a wrong offset!");
static_assert(offsetof(FOnePushNotDisturbInfo, NotDisturbStartTime) == 0x000008, "Member 'FOnePushNotDisturbInfo::NotDisturbStartTime' has a wrong offset!");
static_assert(offsetof(FOnePushNotDisturbInfo, NotDisturbEndTime) == 0x000018, "Member 'FOnePushNotDisturbInfo::NotDisturbEndTime' has a wrong offset!");

// ScriptStruct OneEngineSDK.OnePSProductSku
// 0x00B0 (0x00B0 - 0x0000)
struct FOnePSProductSku final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Label;                                             // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EndDate;                                           // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Type;                                              // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Price;                                             // 0x0050(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DisplayPrice;                                      // 0x0058(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OriginalPrice;                                     // 0x0068(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DisplayOriginalPrice;                              // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UseLimit;                                          // 0x0080(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlusUpsellPrice;                                   // 0x0084(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DisplayPlusUpsellPrice;                            // 0x0088(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPlusPrice;                                       // 0x0098(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AnnotationName;                                    // 0x00A0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOnePSProductSku) == 0x000008, "Wrong alignment on FOnePSProductSku");
static_assert(sizeof(FOnePSProductSku) == 0x0000B0, "Wrong size on FOnePSProductSku");
static_assert(offsetof(FOnePSProductSku, ID) == 0x000000, "Member 'FOnePSProductSku::ID' has a wrong offset!");
static_assert(offsetof(FOnePSProductSku, Name) == 0x000010, "Member 'FOnePSProductSku::Name' has a wrong offset!");
static_assert(offsetof(FOnePSProductSku, Label) == 0x000020, "Member 'FOnePSProductSku::Label' has a wrong offset!");
static_assert(offsetof(FOnePSProductSku, EndDate) == 0x000030, "Member 'FOnePSProductSku::EndDate' has a wrong offset!");
static_assert(offsetof(FOnePSProductSku, Type) == 0x000040, "Member 'FOnePSProductSku::Type' has a wrong offset!");
static_assert(offsetof(FOnePSProductSku, Price) == 0x000050, "Member 'FOnePSProductSku::Price' has a wrong offset!");
static_assert(offsetof(FOnePSProductSku, DisplayPrice) == 0x000058, "Member 'FOnePSProductSku::DisplayPrice' has a wrong offset!");
static_assert(offsetof(FOnePSProductSku, OriginalPrice) == 0x000068, "Member 'FOnePSProductSku::OriginalPrice' has a wrong offset!");
static_assert(offsetof(FOnePSProductSku, DisplayOriginalPrice) == 0x000070, "Member 'FOnePSProductSku::DisplayOriginalPrice' has a wrong offset!");
static_assert(offsetof(FOnePSProductSku, UseLimit) == 0x000080, "Member 'FOnePSProductSku::UseLimit' has a wrong offset!");
static_assert(offsetof(FOnePSProductSku, PlusUpsellPrice) == 0x000084, "Member 'FOnePSProductSku::PlusUpsellPrice' has a wrong offset!");
static_assert(offsetof(FOnePSProductSku, DisplayPlusUpsellPrice) == 0x000088, "Member 'FOnePSProductSku::DisplayPlusUpsellPrice' has a wrong offset!");
static_assert(offsetof(FOnePSProductSku, IsPlusPrice) == 0x000098, "Member 'FOnePSProductSku::IsPlusPrice' has a wrong offset!");
static_assert(offsetof(FOnePSProductSku, AnnotationName) == 0x0000A0, "Member 'FOnePSProductSku::AnnotationName' has a wrong offset!");

// ScriptStruct OneEngineSDK.OnePSProductMediaImage
// 0x0030 (0x0030 - 0x0000)
struct FOnePSProductMediaImage final
{
public:
	class FString                                 Format;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Type;                                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 URL;                                               // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOnePSProductMediaImage) == 0x000008, "Wrong alignment on FOnePSProductMediaImage");
static_assert(sizeof(FOnePSProductMediaImage) == 0x000030, "Wrong size on FOnePSProductMediaImage");
static_assert(offsetof(FOnePSProductMediaImage, Format) == 0x000000, "Member 'FOnePSProductMediaImage::Format' has a wrong offset!");
static_assert(offsetof(FOnePSProductMediaImage, Type) == 0x000010, "Member 'FOnePSProductMediaImage::Type' has a wrong offset!");
static_assert(offsetof(FOnePSProductMediaImage, URL) == 0x000020, "Member 'FOnePSProductMediaImage::URL' has a wrong offset!");

// ScriptStruct OneEngineSDK.OnePSProductMedia
// 0x0010 (0x0010 - 0x0000)
struct FOnePSProductMedia final
{
public:
	TArray<struct FOnePSProductMediaImage>        Images;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOnePSProductMedia) == 0x000008, "Wrong alignment on FOnePSProductMedia");
static_assert(sizeof(FOnePSProductMedia) == 0x000010, "Wrong size on FOnePSProductMedia");
static_assert(offsetof(FOnePSProductMedia, Images) == 0x000000, "Member 'FOnePSProductMedia::Images' has a wrong offset!");

// ScriptStruct OneEngineSDK.OnePSProduct
// 0x0078 (0x0078 - 0x0000)
struct FOnePSProduct final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Label;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AgeLimit;                                          // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DisplayName;                                       // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Type;                                              // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FOnePSProductSku>               Skus;                                              // 0x0058(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FOnePSProductMedia                     Media;                                             // 0x0068(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOnePSProduct) == 0x000008, "Wrong alignment on FOnePSProduct");
static_assert(sizeof(FOnePSProduct) == 0x000078, "Wrong size on FOnePSProduct");
static_assert(offsetof(FOnePSProduct, ID) == 0x000000, "Member 'FOnePSProduct::ID' has a wrong offset!");
static_assert(offsetof(FOnePSProduct, Label) == 0x000010, "Member 'FOnePSProduct::Label' has a wrong offset!");
static_assert(offsetof(FOnePSProduct, AgeLimit) == 0x000020, "Member 'FOnePSProduct::AgeLimit' has a wrong offset!");
static_assert(offsetof(FOnePSProduct, DisplayName) == 0x000028, "Member 'FOnePSProduct::DisplayName' has a wrong offset!");
static_assert(offsetof(FOnePSProduct, Description) == 0x000038, "Member 'FOnePSProduct::Description' has a wrong offset!");
static_assert(offsetof(FOnePSProduct, Type) == 0x000048, "Member 'FOnePSProduct::Type' has a wrong offset!");
static_assert(offsetof(FOnePSProduct, Skus) == 0x000058, "Member 'FOnePSProduct::Skus' has a wrong offset!");
static_assert(offsetof(FOnePSProduct, Media) == 0x000068, "Member 'FOnePSProduct::Media' has a wrong offset!");

// ScriptStruct OneEngineSDK.OnePSProductCategory
// 0x0088 (0x0088 - 0x0000)
struct FOnePSProductCategory final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RawData;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ID;                                                // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Label;                                             // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AgeLimit;                                          // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DisplayName;                                       // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Type;                                              // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FOnePSProduct>                  Children;                                          // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FOnePSProductMedia                     Media;                                             // 0x0070(0x0010)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         TotalItemCount;                                    // 0x0080(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FOnePSProductCategory) == 0x000008, "Wrong alignment on FOnePSProductCategory");
static_assert(sizeof(FOnePSProductCategory) == 0x000088, "Wrong size on FOnePSProductCategory");
static_assert(offsetof(FOnePSProductCategory, Code) == 0x000000, "Member 'FOnePSProductCategory::Code' has a wrong offset!");
static_assert(offsetof(FOnePSProductCategory, RawData) == 0x000008, "Member 'FOnePSProductCategory::RawData' has a wrong offset!");
static_assert(offsetof(FOnePSProductCategory, ID) == 0x000018, "Member 'FOnePSProductCategory::ID' has a wrong offset!");
static_assert(offsetof(FOnePSProductCategory, Label) == 0x000028, "Member 'FOnePSProductCategory::Label' has a wrong offset!");
static_assert(offsetof(FOnePSProductCategory, AgeLimit) == 0x000038, "Member 'FOnePSProductCategory::AgeLimit' has a wrong offset!");
static_assert(offsetof(FOnePSProductCategory, DisplayName) == 0x000040, "Member 'FOnePSProductCategory::DisplayName' has a wrong offset!");
static_assert(offsetof(FOnePSProductCategory, Type) == 0x000050, "Member 'FOnePSProductCategory::Type' has a wrong offset!");
static_assert(offsetof(FOnePSProductCategory, Children) == 0x000060, "Member 'FOnePSProductCategory::Children' has a wrong offset!");
static_assert(offsetof(FOnePSProductCategory, Media) == 0x000070, "Member 'FOnePSProductCategory::Media' has a wrong offset!");
static_assert(offsetof(FOnePSProductCategory, TotalItemCount) == 0x000080, "Member 'FOnePSProductCategory::TotalItemCount' has a wrong offset!");

// ScriptStruct OneEngineSDK.OnePermissionInfo
// 0x0028 (0x0028 - 0x0000)
struct FOnePermissionInfo final
{
public:
	EOnePermissionType                            PermissionType;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Title;                                             // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Desc;                                              // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOnePermissionInfo) == 0x000008, "Wrong alignment on FOnePermissionInfo");
static_assert(sizeof(FOnePermissionInfo) == 0x000028, "Wrong size on FOnePermissionInfo");
static_assert(offsetof(FOnePermissionInfo, PermissionType) == 0x000000, "Member 'FOnePermissionInfo::PermissionType' has a wrong offset!");
static_assert(offsetof(FOnePermissionInfo, Title) == 0x000008, "Member 'FOnePermissionInfo::Title' has a wrong offset!");
static_assert(offsetof(FOnePermissionInfo, Desc) == 0x000018, "Member 'FOnePermissionInfo::Desc' has a wrong offset!");

// ScriptStruct OneEngineSDK.OnePushTypeInfo
// 0x0018 (0x0018 - 0x0000)
struct FOnePushTypeInfo final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOpen;                                             // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PushType;                                          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOnePushTypeInfo) == 0x000008, "Wrong alignment on FOnePushTypeInfo");
static_assert(sizeof(FOnePushTypeInfo) == 0x000018, "Wrong size on FOnePushTypeInfo");
static_assert(offsetof(FOnePushTypeInfo, Name) == 0x000000, "Member 'FOnePushTypeInfo::Name' has a wrong offset!");
static_assert(offsetof(FOnePushTypeInfo, bOpen) == 0x000010, "Member 'FOnePushTypeInfo::bOpen' has a wrong offset!");
static_assert(offsetof(FOnePushTypeInfo, PushType) == 0x000014, "Member 'FOnePushTypeInfo::PushType' has a wrong offset!");

// ScriptStruct OneEngineSDK.OneUserThirdInfo
// 0x0058 (0x0058 - 0x0000)
struct FOneUserThirdInfo final
{
public:
	class FString                                 UserId;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ThirdId;                                           // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Avatar;                                            // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserName;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Email;                                             // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOneEngineThirdType                           Type;                                              // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FOneUserThirdInfo) == 0x000008, "Wrong alignment on FOneUserThirdInfo");
static_assert(sizeof(FOneUserThirdInfo) == 0x000058, "Wrong size on FOneUserThirdInfo");
static_assert(offsetof(FOneUserThirdInfo, UserId) == 0x000000, "Member 'FOneUserThirdInfo::UserId' has a wrong offset!");
static_assert(offsetof(FOneUserThirdInfo, ThirdId) == 0x000010, "Member 'FOneUserThirdInfo::ThirdId' has a wrong offset!");
static_assert(offsetof(FOneUserThirdInfo, Avatar) == 0x000020, "Member 'FOneUserThirdInfo::Avatar' has a wrong offset!");
static_assert(offsetof(FOneUserThirdInfo, UserName) == 0x000030, "Member 'FOneUserThirdInfo::UserName' has a wrong offset!");
static_assert(offsetof(FOneUserThirdInfo, Email) == 0x000040, "Member 'FOneUserThirdInfo::Email' has a wrong offset!");
static_assert(offsetof(FOneUserThirdInfo, Type) == 0x000050, "Member 'FOneUserThirdInfo::Type' has a wrong offset!");

// ScriptStruct OneEngineSDK.OneUserInfo
// 0x00B0 (0x00B0 - 0x0000)
struct FOneUserInfo final
{
public:
	class FString                                 UserId;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 phone;                                             // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Avatar;                                            // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserName;                                          // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InheritCode;                                       // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPasswordExist;                                    // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CountryCode;                                       // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FOneUserThirdInfo>              Thirds;                                            // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	EOneEngineThirdType                           Type;                                              // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsNewCreate;                                      // 0x0089(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Age;                                               // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAdult;                                          // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AgeCountryCode;                                    // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         PrevLoginTime;                                     // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOneUserInfo) == 0x000008, "Wrong alignment on FOneUserInfo");
static_assert(sizeof(FOneUserInfo) == 0x0000B0, "Wrong size on FOneUserInfo");
static_assert(offsetof(FOneUserInfo, UserId) == 0x000000, "Member 'FOneUserInfo::UserId' has a wrong offset!");
static_assert(offsetof(FOneUserInfo, Token) == 0x000010, "Member 'FOneUserInfo::Token' has a wrong offset!");
static_assert(offsetof(FOneUserInfo, phone) == 0x000020, "Member 'FOneUserInfo::phone' has a wrong offset!");
static_assert(offsetof(FOneUserInfo, Avatar) == 0x000030, "Member 'FOneUserInfo::Avatar' has a wrong offset!");
static_assert(offsetof(FOneUserInfo, UserName) == 0x000040, "Member 'FOneUserInfo::UserName' has a wrong offset!");
static_assert(offsetof(FOneUserInfo, InheritCode) == 0x000050, "Member 'FOneUserInfo::InheritCode' has a wrong offset!");
static_assert(offsetof(FOneUserInfo, bPasswordExist) == 0x000060, "Member 'FOneUserInfo::bPasswordExist' has a wrong offset!");
static_assert(offsetof(FOneUserInfo, CountryCode) == 0x000068, "Member 'FOneUserInfo::CountryCode' has a wrong offset!");
static_assert(offsetof(FOneUserInfo, Thirds) == 0x000078, "Member 'FOneUserInfo::Thirds' has a wrong offset!");
static_assert(offsetof(FOneUserInfo, Type) == 0x000088, "Member 'FOneUserInfo::Type' has a wrong offset!");
static_assert(offsetof(FOneUserInfo, bIsNewCreate) == 0x000089, "Member 'FOneUserInfo::bIsNewCreate' has a wrong offset!");
static_assert(offsetof(FOneUserInfo, Age) == 0x00008C, "Member 'FOneUserInfo::Age' has a wrong offset!");
static_assert(offsetof(FOneUserInfo, bIsAdult) == 0x000090, "Member 'FOneUserInfo::bIsAdult' has a wrong offset!");
static_assert(offsetof(FOneUserInfo, AgeCountryCode) == 0x000098, "Member 'FOneUserInfo::AgeCountryCode' has a wrong offset!");
static_assert(offsetof(FOneUserInfo, PrevLoginTime) == 0x0000A8, "Member 'FOneUserInfo::PrevLoginTime' has a wrong offset!");

// ScriptStruct OneEngineSDK.OneAntiAddictionInfo
// 0x0080 (0x0080 - 0x0000)
struct FOneAntiAddictionInfo final
{
public:
	class FString                                 AppID;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserId;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Status;                                            // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HeartbeatInterval;                                 // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BannedType;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 BannedReason;                                      // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BreakNotice;                                       // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Realuser;                                          // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CivicType;                                         // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Age;                                               // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Gender;                                            // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AccountType;                                       // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RequestIp;                                         // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DayOnlineDuration;                                 // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FOneAntiAddictionInfo) == 0x000008, "Wrong alignment on FOneAntiAddictionInfo");
static_assert(sizeof(FOneAntiAddictionInfo) == 0x000080, "Wrong size on FOneAntiAddictionInfo");
static_assert(offsetof(FOneAntiAddictionInfo, AppID) == 0x000000, "Member 'FOneAntiAddictionInfo::AppID' has a wrong offset!");
static_assert(offsetof(FOneAntiAddictionInfo, UserId) == 0x000010, "Member 'FOneAntiAddictionInfo::UserId' has a wrong offset!");
static_assert(offsetof(FOneAntiAddictionInfo, Status) == 0x000020, "Member 'FOneAntiAddictionInfo::Status' has a wrong offset!");
static_assert(offsetof(FOneAntiAddictionInfo, HeartbeatInterval) == 0x000024, "Member 'FOneAntiAddictionInfo::HeartbeatInterval' has a wrong offset!");
static_assert(offsetof(FOneAntiAddictionInfo, BannedType) == 0x000028, "Member 'FOneAntiAddictionInfo::BannedType' has a wrong offset!");
static_assert(offsetof(FOneAntiAddictionInfo, BannedReason) == 0x000030, "Member 'FOneAntiAddictionInfo::BannedReason' has a wrong offset!");
static_assert(offsetof(FOneAntiAddictionInfo, BreakNotice) == 0x000040, "Member 'FOneAntiAddictionInfo::BreakNotice' has a wrong offset!");
static_assert(offsetof(FOneAntiAddictionInfo, Realuser) == 0x000050, "Member 'FOneAntiAddictionInfo::Realuser' has a wrong offset!");
static_assert(offsetof(FOneAntiAddictionInfo, CivicType) == 0x000054, "Member 'FOneAntiAddictionInfo::CivicType' has a wrong offset!");
static_assert(offsetof(FOneAntiAddictionInfo, Age) == 0x000058, "Member 'FOneAntiAddictionInfo::Age' has a wrong offset!");
static_assert(offsetof(FOneAntiAddictionInfo, Gender) == 0x00005C, "Member 'FOneAntiAddictionInfo::Gender' has a wrong offset!");
static_assert(offsetof(FOneAntiAddictionInfo, AccountType) == 0x000060, "Member 'FOneAntiAddictionInfo::AccountType' has a wrong offset!");
static_assert(offsetof(FOneAntiAddictionInfo, RequestIp) == 0x000068, "Member 'FOneAntiAddictionInfo::RequestIp' has a wrong offset!");
static_assert(offsetof(FOneAntiAddictionInfo, DayOnlineDuration) == 0x000078, "Member 'FOneAntiAddictionInfo::DayOnlineDuration' has a wrong offset!");

// ScriptStruct OneEngineSDK.OneRoleInfo
// 0x0070 (0x0070 - 0x0000)
struct FOneRoleInfo final
{
public:
	class FString                                 RoleId;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleName;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Vip;                                               // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Level;                                             // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerId;                                          // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerName;                                        // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CombatValue;                                       // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOneRoleInfo) == 0x000008, "Wrong alignment on FOneRoleInfo");
static_assert(sizeof(FOneRoleInfo) == 0x000070, "Wrong size on FOneRoleInfo");
static_assert(offsetof(FOneRoleInfo, RoleId) == 0x000000, "Member 'FOneRoleInfo::RoleId' has a wrong offset!");
static_assert(offsetof(FOneRoleInfo, RoleName) == 0x000010, "Member 'FOneRoleInfo::RoleName' has a wrong offset!");
static_assert(offsetof(FOneRoleInfo, Vip) == 0x000020, "Member 'FOneRoleInfo::Vip' has a wrong offset!");
static_assert(offsetof(FOneRoleInfo, Level) == 0x000030, "Member 'FOneRoleInfo::Level' has a wrong offset!");
static_assert(offsetof(FOneRoleInfo, ServerId) == 0x000040, "Member 'FOneRoleInfo::ServerId' has a wrong offset!");
static_assert(offsetof(FOneRoleInfo, ServerName) == 0x000050, "Member 'FOneRoleInfo::ServerName' has a wrong offset!");
static_assert(offsetof(FOneRoleInfo, CombatValue) == 0x000060, "Member 'FOneRoleInfo::CombatValue' has a wrong offset!");

// ScriptStruct OneEngineSDK.OneURCRoleInfo
// 0x0090 (0x0090 - 0x0000)
struct FOneURCRoleInfo final
{
public:
	class FString                                 UserId;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleId;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleName;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Level;                                             // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerId;                                          // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerName;                                        // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Gender;                                            // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Occupation;                                        // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LastLoginTime;                                     // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOneURCRoleInfo) == 0x000008, "Wrong alignment on FOneURCRoleInfo");
static_assert(sizeof(FOneURCRoleInfo) == 0x000090, "Wrong size on FOneURCRoleInfo");
static_assert(offsetof(FOneURCRoleInfo, UserId) == 0x000000, "Member 'FOneURCRoleInfo::UserId' has a wrong offset!");
static_assert(offsetof(FOneURCRoleInfo, RoleId) == 0x000010, "Member 'FOneURCRoleInfo::RoleId' has a wrong offset!");
static_assert(offsetof(FOneURCRoleInfo, RoleName) == 0x000020, "Member 'FOneURCRoleInfo::RoleName' has a wrong offset!");
static_assert(offsetof(FOneURCRoleInfo, Level) == 0x000030, "Member 'FOneURCRoleInfo::Level' has a wrong offset!");
static_assert(offsetof(FOneURCRoleInfo, ServerId) == 0x000040, "Member 'FOneURCRoleInfo::ServerId' has a wrong offset!");
static_assert(offsetof(FOneURCRoleInfo, ServerName) == 0x000050, "Member 'FOneURCRoleInfo::ServerName' has a wrong offset!");
static_assert(offsetof(FOneURCRoleInfo, Gender) == 0x000060, "Member 'FOneURCRoleInfo::Gender' has a wrong offset!");
static_assert(offsetof(FOneURCRoleInfo, Occupation) == 0x000070, "Member 'FOneURCRoleInfo::Occupation' has a wrong offset!");
static_assert(offsetof(FOneURCRoleInfo, LastLoginTime) == 0x000080, "Member 'FOneURCRoleInfo::LastLoginTime' has a wrong offset!");

// ScriptStruct OneEngineSDK.OneDeviceInfo
// 0x0070 (0x0070 - 0x0000)
struct FOneDeviceInfo final
{
public:
	class FString                                 DeviceID;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DeviceSys;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Ext;                                               // 0x0020(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOneDeviceInfo) == 0x000008, "Wrong alignment on FOneDeviceInfo");
static_assert(sizeof(FOneDeviceInfo) == 0x000070, "Wrong size on FOneDeviceInfo");
static_assert(offsetof(FOneDeviceInfo, DeviceID) == 0x000000, "Member 'FOneDeviceInfo::DeviceID' has a wrong offset!");
static_assert(offsetof(FOneDeviceInfo, DeviceSys) == 0x000010, "Member 'FOneDeviceInfo::DeviceSys' has a wrong offset!");
static_assert(offsetof(FOneDeviceInfo, Ext) == 0x000020, "Member 'FOneDeviceInfo::Ext' has a wrong offset!");

// ScriptStruct OneEngineSDK.UserIpInfo
// 0x0060 (0x0060 - 0x0000)
struct FUserIpInfo final
{
public:
	class FString                                 Attribution;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
