#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OneEngineSDK

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "OneEngineSDK_structs.hpp"


namespace SDK::Params
{

// Function OneEngineSDK.OnePSLocaleEnum.Arabic
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Arabic final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Arabic) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Arabic");
static_assert(sizeof(OnePSLocaleEnum_Arabic) == 0x000010, "Wrong size on OnePSLocaleEnum_Arabic");
static_assert(offsetof(OnePSLocaleEnum_Arabic, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Arabic::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Chinese_S
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Chinese_S final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Chinese_S) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Chinese_S");
static_assert(sizeof(OnePSLocaleEnum_Chinese_S) == 0x000010, "Wrong size on OnePSLocaleEnum_Chinese_S");
static_assert(offsetof(OnePSLocaleEnum_Chinese_S, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Chinese_S::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Chinese_T
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Chinese_T final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Chinese_T) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Chinese_T");
static_assert(sizeof(OnePSLocaleEnum_Chinese_T) == 0x000010, "Wrong size on OnePSLocaleEnum_Chinese_T");
static_assert(offsetof(OnePSLocaleEnum_Chinese_T, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Chinese_T::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Czech
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Czech final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Czech) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Czech");
static_assert(sizeof(OnePSLocaleEnum_Czech) == 0x000010, "Wrong size on OnePSLocaleEnum_Czech");
static_assert(offsetof(OnePSLocaleEnum_Czech, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Czech::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Danish
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Danish final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Danish) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Danish");
static_assert(sizeof(OnePSLocaleEnum_Danish) == 0x000010, "Wrong size on OnePSLocaleEnum_Danish");
static_assert(offsetof(OnePSLocaleEnum_Danish, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Danish::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Dutch
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Dutch final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Dutch) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Dutch");
static_assert(sizeof(OnePSLocaleEnum_Dutch) == 0x000010, "Wrong size on OnePSLocaleEnum_Dutch");
static_assert(offsetof(OnePSLocaleEnum_Dutch, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Dutch::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.English_GB
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_English_GB final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_English_GB) == 0x000008, "Wrong alignment on OnePSLocaleEnum_English_GB");
static_assert(sizeof(OnePSLocaleEnum_English_GB) == 0x000010, "Wrong size on OnePSLocaleEnum_English_GB");
static_assert(offsetof(OnePSLocaleEnum_English_GB, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_English_GB::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.English_US
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_English_US final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_English_US) == 0x000008, "Wrong alignment on OnePSLocaleEnum_English_US");
static_assert(sizeof(OnePSLocaleEnum_English_US) == 0x000010, "Wrong size on OnePSLocaleEnum_English_US");
static_assert(offsetof(OnePSLocaleEnum_English_US, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_English_US::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Finnish
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Finnish final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Finnish) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Finnish");
static_assert(sizeof(OnePSLocaleEnum_Finnish) == 0x000010, "Wrong size on OnePSLocaleEnum_Finnish");
static_assert(offsetof(OnePSLocaleEnum_Finnish, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Finnish::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.French
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_French final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_French) == 0x000008, "Wrong alignment on OnePSLocaleEnum_French");
static_assert(sizeof(OnePSLocaleEnum_French) == 0x000010, "Wrong size on OnePSLocaleEnum_French");
static_assert(offsetof(OnePSLocaleEnum_French, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_French::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.French_CA
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_French_CA final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_French_CA) == 0x000008, "Wrong alignment on OnePSLocaleEnum_French_CA");
static_assert(sizeof(OnePSLocaleEnum_French_CA) == 0x000010, "Wrong size on OnePSLocaleEnum_French_CA");
static_assert(offsetof(OnePSLocaleEnum_French_CA, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_French_CA::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.German
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_German final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_German) == 0x000008, "Wrong alignment on OnePSLocaleEnum_German");
static_assert(sizeof(OnePSLocaleEnum_German) == 0x000010, "Wrong size on OnePSLocaleEnum_German");
static_assert(offsetof(OnePSLocaleEnum_German, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_German::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Greek
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Greek final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Greek) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Greek");
static_assert(sizeof(OnePSLocaleEnum_Greek) == 0x000010, "Wrong size on OnePSLocaleEnum_Greek");
static_assert(offsetof(OnePSLocaleEnum_Greek, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Greek::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Hungarian
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Hungarian final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Hungarian) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Hungarian");
static_assert(sizeof(OnePSLocaleEnum_Hungarian) == 0x000010, "Wrong size on OnePSLocaleEnum_Hungarian");
static_assert(offsetof(OnePSLocaleEnum_Hungarian, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Hungarian::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Indonesian
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Indonesian final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Indonesian) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Indonesian");
static_assert(sizeof(OnePSLocaleEnum_Indonesian) == 0x000010, "Wrong size on OnePSLocaleEnum_Indonesian");
static_assert(offsetof(OnePSLocaleEnum_Indonesian, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Indonesian::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Italian
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Italian final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Italian) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Italian");
static_assert(sizeof(OnePSLocaleEnum_Italian) == 0x000010, "Wrong size on OnePSLocaleEnum_Italian");
static_assert(offsetof(OnePSLocaleEnum_Italian, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Italian::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Japanese
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Japanese final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Japanese) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Japanese");
static_assert(sizeof(OnePSLocaleEnum_Japanese) == 0x000010, "Wrong size on OnePSLocaleEnum_Japanese");
static_assert(offsetof(OnePSLocaleEnum_Japanese, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Japanese::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Korean
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Korean final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Korean) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Korean");
static_assert(sizeof(OnePSLocaleEnum_Korean) == 0x000010, "Wrong size on OnePSLocaleEnum_Korean");
static_assert(offsetof(OnePSLocaleEnum_Korean, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Korean::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Norwegian
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Norwegian final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Norwegian) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Norwegian");
static_assert(sizeof(OnePSLocaleEnum_Norwegian) == 0x000010, "Wrong size on OnePSLocaleEnum_Norwegian");
static_assert(offsetof(OnePSLocaleEnum_Norwegian, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Norwegian::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Polish
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Polish final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Polish) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Polish");
static_assert(sizeof(OnePSLocaleEnum_Polish) == 0x000010, "Wrong size on OnePSLocaleEnum_Polish");
static_assert(offsetof(OnePSLocaleEnum_Polish, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Polish::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Portuguese_BR
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Portuguese_BR final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Portuguese_BR) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Portuguese_BR");
static_assert(sizeof(OnePSLocaleEnum_Portuguese_BR) == 0x000010, "Wrong size on OnePSLocaleEnum_Portuguese_BR");
static_assert(offsetof(OnePSLocaleEnum_Portuguese_BR, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Portuguese_BR::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Portuguese_PT
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Portuguese_PT final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Portuguese_PT) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Portuguese_PT");
static_assert(sizeof(OnePSLocaleEnum_Portuguese_PT) == 0x000010, "Wrong size on OnePSLocaleEnum_Portuguese_PT");
static_assert(offsetof(OnePSLocaleEnum_Portuguese_PT, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Portuguese_PT::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Romanian
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Romanian final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Romanian) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Romanian");
static_assert(sizeof(OnePSLocaleEnum_Romanian) == 0x000010, "Wrong size on OnePSLocaleEnum_Romanian");
static_assert(offsetof(OnePSLocaleEnum_Romanian, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Romanian::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Russian
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Russian final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Russian) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Russian");
static_assert(sizeof(OnePSLocaleEnum_Russian) == 0x000010, "Wrong size on OnePSLocaleEnum_Russian");
static_assert(offsetof(OnePSLocaleEnum_Russian, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Russian::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Spanish
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Spanish final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Spanish) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Spanish");
static_assert(sizeof(OnePSLocaleEnum_Spanish) == 0x000010, "Wrong size on OnePSLocaleEnum_Spanish");
static_assert(offsetof(OnePSLocaleEnum_Spanish, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Spanish::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Spanish_LA
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Spanish_LA final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Spanish_LA) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Spanish_LA");
static_assert(sizeof(OnePSLocaleEnum_Spanish_LA) == 0x000010, "Wrong size on OnePSLocaleEnum_Spanish_LA");
static_assert(offsetof(OnePSLocaleEnum_Spanish_LA, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Spanish_LA::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Swedish
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Swedish final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Swedish) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Swedish");
static_assert(sizeof(OnePSLocaleEnum_Swedish) == 0x000010, "Wrong size on OnePSLocaleEnum_Swedish");
static_assert(offsetof(OnePSLocaleEnum_Swedish, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Swedish::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Thai
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Thai final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Thai) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Thai");
static_assert(sizeof(OnePSLocaleEnum_Thai) == 0x000010, "Wrong size on OnePSLocaleEnum_Thai");
static_assert(offsetof(OnePSLocaleEnum_Thai, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Thai::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Turkish
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Turkish final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Turkish) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Turkish");
static_assert(sizeof(OnePSLocaleEnum_Turkish) == 0x000010, "Wrong size on OnePSLocaleEnum_Turkish");
static_assert(offsetof(OnePSLocaleEnum_Turkish, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Turkish::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OnePSLocaleEnum.Vietnamese
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Vietnamese final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnePSLocaleEnum_Vietnamese) == 0x000008, "Wrong alignment on OnePSLocaleEnum_Vietnamese");
static_assert(sizeof(OnePSLocaleEnum_Vietnamese) == 0x000010, "Wrong size on OnePSLocaleEnum_Vietnamese");
static_assert(offsetof(OnePSLocaleEnum_Vietnamese, ReturnValue) == 0x000000, "Member 'OnePSLocaleEnum_Vietnamese::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OneEngineSDKPSSubsystem.CheckPremium
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKPSSubsystem_CheckPremium final
{
public:
	TDelegate<void(int32 Code, bool bIsPremium)>  OnCheckPremiumResult;                              // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OneEngineSDKPSSubsystem_CheckPremium) == 0x000004, "Wrong alignment on OneEngineSDKPSSubsystem_CheckPremium");
static_assert(sizeof(OneEngineSDKPSSubsystem_CheckPremium) == 0x000010, "Wrong size on OneEngineSDKPSSubsystem_CheckPremium");
static_assert(offsetof(OneEngineSDKPSSubsystem_CheckPremium, OnCheckPremiumResult) == 0x000000, "Member 'OneEngineSDKPSSubsystem_CheckPremium::OnCheckPremiumResult' has a wrong offset!");

// Function OneEngineSDK.OneEngineSDKPSSubsystem.FilterProfanity
// 0x0030 (0x0030 - 0x0000)
struct OneEngineSDKPSSubsystem_FilterProfanity final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Language;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 Code, const class FString& Text)> OnFilterProfanityResult;                  // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OneEngineSDKPSSubsystem_FilterProfanity) == 0x000008, "Wrong alignment on OneEngineSDKPSSubsystem_FilterProfanity");
static_assert(sizeof(OneEngineSDKPSSubsystem_FilterProfanity) == 0x000030, "Wrong size on OneEngineSDKPSSubsystem_FilterProfanity");
static_assert(offsetof(OneEngineSDKPSSubsystem_FilterProfanity, Text) == 0x000000, "Member 'OneEngineSDKPSSubsystem_FilterProfanity::Text' has a wrong offset!");
static_assert(offsetof(OneEngineSDKPSSubsystem_FilterProfanity, Language) == 0x000010, "Member 'OneEngineSDKPSSubsystem_FilterProfanity::Language' has a wrong offset!");
static_assert(offsetof(OneEngineSDKPSSubsystem_FilterProfanity, OnFilterProfanityResult) == 0x000020, "Member 'OneEngineSDKPSSubsystem_FilterProfanity::OnFilterProfanityResult' has a wrong offset!");

// Function OneEngineSDK.OneEngineSDKPSSubsystem.FilterProfanitySync
// 0x0038 (0x0038 - 0x0000)
struct OneEngineSDKPSSubsystem_FilterProfanitySync final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Language;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutResult;                                         // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(OneEngineSDKPSSubsystem_FilterProfanitySync) == 0x000008, "Wrong alignment on OneEngineSDKPSSubsystem_FilterProfanitySync");
static_assert(sizeof(OneEngineSDKPSSubsystem_FilterProfanitySync) == 0x000038, "Wrong size on OneEngineSDKPSSubsystem_FilterProfanitySync");
static_assert(offsetof(OneEngineSDKPSSubsystem_FilterProfanitySync, Text) == 0x000000, "Member 'OneEngineSDKPSSubsystem_FilterProfanitySync::Text' has a wrong offset!");
static_assert(offsetof(OneEngineSDKPSSubsystem_FilterProfanitySync, Language) == 0x000010, "Member 'OneEngineSDKPSSubsystem_FilterProfanitySync::Language' has a wrong offset!");
static_assert(offsetof(OneEngineSDKPSSubsystem_FilterProfanitySync, OutResult) == 0x000020, "Member 'OneEngineSDKPSSubsystem_FilterProfanitySync::OutResult' has a wrong offset!");
static_assert(offsetof(OneEngineSDKPSSubsystem_FilterProfanitySync, ReturnValue) == 0x000030, "Member 'OneEngineSDKPSSubsystem_FilterProfanitySync::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OneEngineSDKPSSubsystem.GetBlockingUsers
// 0x0018 (0x0018 - 0x0000)
struct OneEngineSDKPSSubsystem_GetBlockingUsers final
{
public:
	int32                                         Offset;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Limit;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FOnePSUserProfileResponse& ProfileList)> OnGetBlockingUsersResult;   // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OneEngineSDKPSSubsystem_GetBlockingUsers) == 0x000004, "Wrong alignment on OneEngineSDKPSSubsystem_GetBlockingUsers");
static_assert(sizeof(OneEngineSDKPSSubsystem_GetBlockingUsers) == 0x000018, "Wrong size on OneEngineSDKPSSubsystem_GetBlockingUsers");
static_assert(offsetof(OneEngineSDKPSSubsystem_GetBlockingUsers, Offset) == 0x000000, "Member 'OneEngineSDKPSSubsystem_GetBlockingUsers::Offset' has a wrong offset!");
static_assert(offsetof(OneEngineSDKPSSubsystem_GetBlockingUsers, Limit) == 0x000004, "Member 'OneEngineSDKPSSubsystem_GetBlockingUsers::Limit' has a wrong offset!");
static_assert(offsetof(OneEngineSDKPSSubsystem_GetBlockingUsers, OnGetBlockingUsersResult) == 0x000008, "Member 'OneEngineSDKPSSubsystem_GetBlockingUsers::OnGetBlockingUsersResult' has a wrong offset!");

// Function OneEngineSDK.OneEngineSDKPSSubsystem.GetCommunicationRestrictionStatus
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKPSSubsystem_GetCommunicationRestrictionStatus final
{
public:
	TDelegate<void(int32 result)>                 OnRestrictionStatusResult;                         // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OneEngineSDKPSSubsystem_GetCommunicationRestrictionStatus) == 0x000004, "Wrong alignment on OneEngineSDKPSSubsystem_GetCommunicationRestrictionStatus");
static_assert(sizeof(OneEngineSDKPSSubsystem_GetCommunicationRestrictionStatus) == 0x000010, "Wrong size on OneEngineSDKPSSubsystem_GetCommunicationRestrictionStatus");
static_assert(offsetof(OneEngineSDKPSSubsystem_GetCommunicationRestrictionStatus, OnRestrictionStatusResult) == 0x000000, "Member 'OneEngineSDKPSSubsystem_GetCommunicationRestrictionStatus::OnRestrictionStatusResult' has a wrong offset!");

// Function OneEngineSDK.OneEngineSDKPSSubsystem.GetCountryCode
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKPSSubsystem_GetCountryCode final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OneEngineSDKPSSubsystem_GetCountryCode) == 0x000008, "Wrong alignment on OneEngineSDKPSSubsystem_GetCountryCode");
static_assert(sizeof(OneEngineSDKPSSubsystem_GetCountryCode) == 0x000010, "Wrong size on OneEngineSDKPSSubsystem_GetCountryCode");
static_assert(offsetof(OneEngineSDKPSSubsystem_GetCountryCode, ReturnValue) == 0x000000, "Member 'OneEngineSDKPSSubsystem_GetCountryCode::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OneEngineSDKPSSubsystem.GetCountryRegion
// 0x0020 (0x0020 - 0x0000)
struct OneEngineSDKPSSubsystem_GetCountryRegion final
{
public:
	class FString                                 CountryCode;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OneEngineSDKPSSubsystem_GetCountryRegion) == 0x000008, "Wrong alignment on OneEngineSDKPSSubsystem_GetCountryRegion");
static_assert(sizeof(OneEngineSDKPSSubsystem_GetCountryRegion) == 0x000020, "Wrong size on OneEngineSDKPSSubsystem_GetCountryRegion");
static_assert(offsetof(OneEngineSDKPSSubsystem_GetCountryRegion, CountryCode) == 0x000000, "Member 'OneEngineSDKPSSubsystem_GetCountryRegion::CountryCode' has a wrong offset!");
static_assert(offsetof(OneEngineSDKPSSubsystem_GetCountryRegion, ReturnValue) == 0x000010, "Member 'OneEngineSDKPSSubsystem_GetCountryRegion::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OneEngineSDKPSSubsystem.GetFriends
// 0x0018 (0x0018 - 0x0000)
struct OneEngineSDKPSSubsystem_GetFriends final
{
public:
	int32                                         Offset;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Limit;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FOnePSUserProfileResponse& ProfileList)> OnGetFriendsResult;         // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OneEngineSDKPSSubsystem_GetFriends) == 0x000004, "Wrong alignment on OneEngineSDKPSSubsystem_GetFriends");
static_assert(sizeof(OneEngineSDKPSSubsystem_GetFriends) == 0x000018, "Wrong size on OneEngineSDKPSSubsystem_GetFriends");
static_assert(offsetof(OneEngineSDKPSSubsystem_GetFriends, Offset) == 0x000000, "Member 'OneEngineSDKPSSubsystem_GetFriends::Offset' has a wrong offset!");
static_assert(offsetof(OneEngineSDKPSSubsystem_GetFriends, Limit) == 0x000004, "Member 'OneEngineSDKPSSubsystem_GetFriends::Limit' has a wrong offset!");
static_assert(offsetof(OneEngineSDKPSSubsystem_GetFriends, OnGetFriendsResult) == 0x000008, "Member 'OneEngineSDKPSSubsystem_GetFriends::OnGetFriendsResult' has a wrong offset!");

// Function OneEngineSDK.OneEngineSDKPSSubsystem.GetProductInfoListPS
// 0x0028 (0x0028 - 0x0000)
struct OneEngineSDKPSSubsystem_GetProductInfoListPS final
{
public:
	int32                                         ServiceLabel;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CategoryLabel;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, const struct FOnePSProductCategory& Category, int32 Code, const class FString& Msg)> Callback; // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OneEngineSDKPSSubsystem_GetProductInfoListPS) == 0x000008, "Wrong alignment on OneEngineSDKPSSubsystem_GetProductInfoListPS");
static_assert(sizeof(OneEngineSDKPSSubsystem_GetProductInfoListPS) == 0x000028, "Wrong size on OneEngineSDKPSSubsystem_GetProductInfoListPS");
static_assert(offsetof(OneEngineSDKPSSubsystem_GetProductInfoListPS, ServiceLabel) == 0x000000, "Member 'OneEngineSDKPSSubsystem_GetProductInfoListPS::ServiceLabel' has a wrong offset!");
static_assert(offsetof(OneEngineSDKPSSubsystem_GetProductInfoListPS, CategoryLabel) == 0x000008, "Member 'OneEngineSDKPSSubsystem_GetProductInfoListPS::CategoryLabel' has a wrong offset!");
static_assert(offsetof(OneEngineSDKPSSubsystem_GetProductInfoListPS, Callback) == 0x000018, "Member 'OneEngineSDKPSSubsystem_GetProductInfoListPS::Callback' has a wrong offset!");

// Function OneEngineSDK.OneEngineSDKPSSubsystem.HideStoreIcon
// 0x0004 (0x0004 - 0x0000)
struct OneEngineSDKPSSubsystem_HideStoreIcon final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OneEngineSDKPSSubsystem_HideStoreIcon) == 0x000004, "Wrong alignment on OneEngineSDKPSSubsystem_HideStoreIcon");
static_assert(sizeof(OneEngineSDKPSSubsystem_HideStoreIcon) == 0x000004, "Wrong size on OneEngineSDKPSSubsystem_HideStoreIcon");
static_assert(offsetof(OneEngineSDKPSSubsystem_HideStoreIcon, ReturnValue) == 0x000000, "Member 'OneEngineSDKPSSubsystem_HideStoreIcon::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OneEngineSDKPSSubsystem.OpenCommerceDialogPremiumMode
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKPSSubsystem_OpenCommerceDialogPremiumMode final
{
public:
	TDelegate<void(int32 result)>                 OnOpenDialogResult;                                // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OneEngineSDKPSSubsystem_OpenCommerceDialogPremiumMode) == 0x000004, "Wrong alignment on OneEngineSDKPSSubsystem_OpenCommerceDialogPremiumMode");
static_assert(sizeof(OneEngineSDKPSSubsystem_OpenCommerceDialogPremiumMode) == 0x000010, "Wrong size on OneEngineSDKPSSubsystem_OpenCommerceDialogPremiumMode");
static_assert(offsetof(OneEngineSDKPSSubsystem_OpenCommerceDialogPremiumMode, OnOpenDialogResult) == 0x000000, "Member 'OneEngineSDKPSSubsystem_OpenCommerceDialogPremiumMode::OnOpenDialogResult' has a wrong offset!");

// Function OneEngineSDK.OneEngineSDKPSSubsystem.SetFontPath
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKPSSubsystem_SetFontPath final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OneEngineSDKPSSubsystem_SetFontPath) == 0x000008, "Wrong alignment on OneEngineSDKPSSubsystem_SetFontPath");
static_assert(sizeof(OneEngineSDKPSSubsystem_SetFontPath) == 0x000010, "Wrong size on OneEngineSDKPSSubsystem_SetFontPath");
static_assert(offsetof(OneEngineSDKPSSubsystem_SetFontPath, Path) == 0x000000, "Member 'OneEngineSDKPSSubsystem_SetFontPath::Path' has a wrong offset!");

// Function OneEngineSDK.OneEngineSDKPSSubsystem.ShowStoreIcon
// 0x0008 (0x0008 - 0x0000)
struct OneEngineSDKPSSubsystem_ShowStoreIcon final
{
public:
	EOnePSStoreIconPos                            Pos;                                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OneEngineSDKPSSubsystem_ShowStoreIcon) == 0x000004, "Wrong alignment on OneEngineSDKPSSubsystem_ShowStoreIcon");
static_assert(sizeof(OneEngineSDKPSSubsystem_ShowStoreIcon) == 0x000008, "Wrong size on OneEngineSDKPSSubsystem_ShowStoreIcon");
static_assert(offsetof(OneEngineSDKPSSubsystem_ShowStoreIcon, Pos) == 0x000000, "Member 'OneEngineSDKPSSubsystem_ShowStoreIcon::Pos' has a wrong offset!");
static_assert(offsetof(OneEngineSDKPSSubsystem_ShowStoreIcon, ReturnValue) == 0x000004, "Member 'OneEngineSDKPSSubsystem_ShowStoreIcon::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OneEngineSDKPSSubsystem.StartNotifyPremiumFeature
// 0x000C (0x000C - 0x0000)
struct OneEngineSDKPSSubsystem_StartNotifyPremiumFeature final
{
public:
	int32                                         Interval;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Mark;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OneEngineSDKPSSubsystem_StartNotifyPremiumFeature) == 0x000004, "Wrong alignment on OneEngineSDKPSSubsystem_StartNotifyPremiumFeature");
static_assert(sizeof(OneEngineSDKPSSubsystem_StartNotifyPremiumFeature) == 0x00000C, "Wrong size on OneEngineSDKPSSubsystem_StartNotifyPremiumFeature");
static_assert(offsetof(OneEngineSDKPSSubsystem_StartNotifyPremiumFeature, Interval) == 0x000000, "Member 'OneEngineSDKPSSubsystem_StartNotifyPremiumFeature::Interval' has a wrong offset!");
static_assert(offsetof(OneEngineSDKPSSubsystem_StartNotifyPremiumFeature, Mark) == 0x000004, "Member 'OneEngineSDKPSSubsystem_StartNotifyPremiumFeature::Mark' has a wrong offset!");
static_assert(offsetof(OneEngineSDKPSSubsystem_StartNotifyPremiumFeature, ReturnValue) == 0x000008, "Member 'OneEngineSDKPSSubsystem_StartNotifyPremiumFeature::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OneEngineSDKPSSubsystem.StopNotifyPremiumFeature
// 0x0004 (0x0004 - 0x0000)
struct OneEngineSDKPSSubsystem_StopNotifyPremiumFeature final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OneEngineSDKPSSubsystem_StopNotifyPremiumFeature) == 0x000004, "Wrong alignment on OneEngineSDKPSSubsystem_StopNotifyPremiumFeature");
static_assert(sizeof(OneEngineSDKPSSubsystem_StopNotifyPremiumFeature) == 0x000004, "Wrong size on OneEngineSDKPSSubsystem_StopNotifyPremiumFeature");
static_assert(offsetof(OneEngineSDKPSSubsystem_StopNotifyPremiumFeature, ReturnValue) == 0x000000, "Member 'OneEngineSDKPSSubsystem_StopNotifyPremiumFeature::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OneEngineSDKPSSubsystem.GetAccountId
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKPSSubsystem_GetAccountId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OneEngineSDKPSSubsystem_GetAccountId) == 0x000008, "Wrong alignment on OneEngineSDKPSSubsystem_GetAccountId");
static_assert(sizeof(OneEngineSDKPSSubsystem_GetAccountId) == 0x000010, "Wrong size on OneEngineSDKPSSubsystem_GetAccountId");
static_assert(offsetof(OneEngineSDKPSSubsystem_GetAccountId, ReturnValue) == 0x000000, "Member 'OneEngineSDKPSSubsystem_GetAccountId::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OneEngineSDKPSSubsystem.GetAccountState
// 0x0001 (0x0001 - 0x0000)
struct OneEngineSDKPSSubsystem_GetAccountState final
{
public:
	EOnePsnAccountState                           ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OneEngineSDKPSSubsystem_GetAccountState) == 0x000001, "Wrong alignment on OneEngineSDKPSSubsystem_GetAccountState");
static_assert(sizeof(OneEngineSDKPSSubsystem_GetAccountState) == 0x000001, "Wrong size on OneEngineSDKPSSubsystem_GetAccountState");
static_assert(offsetof(OneEngineSDKPSSubsystem_GetAccountState, ReturnValue) == 0x000000, "Member 'OneEngineSDKPSSubsystem_GetAccountState::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.OneEngineSDKPSSubsystem.GetOnlineId
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKPSSubsystem_GetOnlineId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OneEngineSDKPSSubsystem_GetOnlineId) == 0x000008, "Wrong alignment on OneEngineSDKPSSubsystem_GetOnlineId");
static_assert(sizeof(OneEngineSDKPSSubsystem_GetOnlineId) == 0x000010, "Wrong size on OneEngineSDKPSSubsystem_GetOnlineId");
static_assert(offsetof(OneEngineSDKPSSubsystem_GetOnlineId, ReturnValue) == 0x000000, "Member 'OneEngineSDKPSSubsystem_GetOnlineId::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.PSOneAvatarImage.HandleTextureDownloaded
// 0x0008 (0x0008 - 0x0000)
struct PSOneAvatarImage_HandleTextureDownloaded final
{
public:
	class UTexture2DDynamic*                      Texture;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSOneAvatarImage_HandleTextureDownloaded) == 0x000008, "Wrong alignment on PSOneAvatarImage_HandleTextureDownloaded");
static_assert(sizeof(PSOneAvatarImage_HandleTextureDownloaded) == 0x000008, "Wrong size on PSOneAvatarImage_HandleTextureDownloaded");
static_assert(offsetof(PSOneAvatarImage_HandleTextureDownloaded, Texture) == 0x000000, "Member 'PSOneAvatarImage_HandleTextureDownloaded::Texture' has a wrong offset!");

// Function OneEngineSDK.PSOneAvatarImage.SetImageURL
// 0x0010 (0x0010 - 0x0000)
struct PSOneAvatarImage_SetImageURL final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSOneAvatarImage_SetImageURL) == 0x000008, "Wrong alignment on PSOneAvatarImage_SetImageURL");
static_assert(sizeof(PSOneAvatarImage_SetImageURL) == 0x000010, "Wrong size on PSOneAvatarImage_SetImageURL");
static_assert(offsetof(PSOneAvatarImage_SetImageURL, URL) == 0x000000, "Member 'PSOneAvatarImage_SetImageURL::URL' has a wrong offset!");

// Function OneEngineSDK.PSOneAvatarImage.UpdateImage
// 0x0008 (0x0008 - 0x0000)
struct PSOneAvatarImage_UpdateImage final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSOneAvatarImage_UpdateImage) == 0x000008, "Wrong alignment on PSOneAvatarImage_UpdateImage");
static_assert(sizeof(PSOneAvatarImage_UpdateImage) == 0x000008, "Wrong size on PSOneAvatarImage_UpdateImage");
static_assert(offsetof(PSOneAvatarImage_UpdateImage, Texture) == 0x000000, "Member 'PSOneAvatarImage_UpdateImage::Texture' has a wrong offset!");

// Function OneEngineSDK.PSOneButtonBase.SetTitle
// 0x0010 (0x0010 - 0x0000)
struct PSOneButtonBase_SetTitle final
{
public:
	class FText                                   InTitle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSOneButtonBase_SetTitle) == 0x000008, "Wrong alignment on PSOneButtonBase_SetTitle");
static_assert(sizeof(PSOneButtonBase_SetTitle) == 0x000010, "Wrong size on PSOneButtonBase_SetTitle");
static_assert(offsetof(PSOneButtonBase_SetTitle, InTitle) == 0x000000, "Member 'PSOneButtonBase_SetTitle::InTitle' has a wrong offset!");

// Function OneEngineSDK.PSOneLogin.SetIsMainLand
// 0x0001 (0x0001 - 0x0000)
struct PSOneLogin_SetIsMainLand final
{
public:
	bool                                          bInIsMainLand;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSOneLogin_SetIsMainLand) == 0x000001, "Wrong alignment on PSOneLogin_SetIsMainLand");
static_assert(sizeof(PSOneLogin_SetIsMainLand) == 0x000001, "Wrong size on PSOneLogin_SetIsMainLand");
static_assert(offsetof(PSOneLogin_SetIsMainLand, bInIsMainLand) == 0x000000, "Member 'PSOneLogin_SetIsMainLand::bInIsMainLand' has a wrong offset!");

// Function OneEngineSDK.PSOneMultiLineTextBase.InternalOnTextChanged
// 0x0010 (0x0010 - 0x0000)
struct PSOneMultiLineTextBase_InternalOnTextChanged final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSOneMultiLineTextBase_InternalOnTextChanged) == 0x000008, "Wrong alignment on PSOneMultiLineTextBase_InternalOnTextChanged");
static_assert(sizeof(PSOneMultiLineTextBase_InternalOnTextChanged) == 0x000010, "Wrong size on PSOneMultiLineTextBase_InternalOnTextChanged");
static_assert(offsetof(PSOneMultiLineTextBase_InternalOnTextChanged, Text) == 0x000000, "Member 'PSOneMultiLineTextBase_InternalOnTextChanged::Text' has a wrong offset!");

// Function OneEngineSDK.PSOneMultiLineTextBase.InternalOnTextCommitted
// 0x0018 (0x0018 - 0x0000)
struct PSOneMultiLineTextBase_InternalOnTextCommitted final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ETextCommit                                   CommitType;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PSOneMultiLineTextBase_InternalOnTextCommitted) == 0x000008, "Wrong alignment on PSOneMultiLineTextBase_InternalOnTextCommitted");
static_assert(sizeof(PSOneMultiLineTextBase_InternalOnTextCommitted) == 0x000018, "Wrong size on PSOneMultiLineTextBase_InternalOnTextCommitted");
static_assert(offsetof(PSOneMultiLineTextBase_InternalOnTextCommitted, Text) == 0x000000, "Member 'PSOneMultiLineTextBase_InternalOnTextCommitted::Text' has a wrong offset!");
static_assert(offsetof(PSOneMultiLineTextBase_InternalOnTextCommitted, CommitType) == 0x000010, "Member 'PSOneMultiLineTextBase_InternalOnTextCommitted::CommitType' has a wrong offset!");

// Function OneEngineSDK.PSOneSelectAreaCode.BindData
// 0x0010 (0x0010 - 0x0000)
struct PSOneSelectAreaCode_BindData final
{
public:
	TArray<struct FPSOneAreaCode>                 InAreaCodes;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSOneSelectAreaCode_BindData) == 0x000008, "Wrong alignment on PSOneSelectAreaCode_BindData");
static_assert(sizeof(PSOneSelectAreaCode_BindData) == 0x000010, "Wrong size on PSOneSelectAreaCode_BindData");
static_assert(offsetof(PSOneSelectAreaCode_BindData, InAreaCodes) == 0x000000, "Member 'PSOneSelectAreaCode_BindData::InAreaCodes' has a wrong offset!");

// Function OneEngineSDK.PSOneTextFieldBase.InternalOnTextChanged
// 0x0010 (0x0010 - 0x0000)
struct PSOneTextFieldBase_InternalOnTextChanged final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSOneTextFieldBase_InternalOnTextChanged) == 0x000008, "Wrong alignment on PSOneTextFieldBase_InternalOnTextChanged");
static_assert(sizeof(PSOneTextFieldBase_InternalOnTextChanged) == 0x000010, "Wrong size on PSOneTextFieldBase_InternalOnTextChanged");
static_assert(offsetof(PSOneTextFieldBase_InternalOnTextChanged, Text) == 0x000000, "Member 'PSOneTextFieldBase_InternalOnTextChanged::Text' has a wrong offset!");

// Function OneEngineSDK.PSOneTextFieldBase.InternalOnTextCommitted
// 0x0018 (0x0018 - 0x0000)
struct PSOneTextFieldBase_InternalOnTextCommitted final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ETextCommit                                   CommitType;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PSOneTextFieldBase_InternalOnTextCommitted) == 0x000008, "Wrong alignment on PSOneTextFieldBase_InternalOnTextCommitted");
static_assert(sizeof(PSOneTextFieldBase_InternalOnTextCommitted) == 0x000018, "Wrong size on PSOneTextFieldBase_InternalOnTextCommitted");
static_assert(offsetof(PSOneTextFieldBase_InternalOnTextCommitted, Text) == 0x000000, "Member 'PSOneTextFieldBase_InternalOnTextCommitted::Text' has a wrong offset!");
static_assert(offsetof(PSOneTextFieldBase_InternalOnTextCommitted, CommitType) == 0x000010, "Member 'PSOneTextFieldBase_InternalOnTextCommitted::CommitType' has a wrong offset!");

// Function OneEngineSDK.PSOneUIManager.Get
// 0x0008 (0x0008 - 0x0000)
struct PSOneUIManager_Get final
{
public:
	class UPSOneUIManager*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSOneUIManager_Get) == 0x000008, "Wrong alignment on PSOneUIManager_Get");
static_assert(sizeof(PSOneUIManager_Get) == 0x000008, "Wrong size on PSOneUIManager_Get");
static_assert(offsetof(PSOneUIManager_Get, ReturnValue) == 0x000000, "Member 'PSOneUIManager_Get::ReturnValue' has a wrong offset!");

// Function OneEngineSDK.PSOneUIManager.ShowDelTips
// 0x0030 (0x0030 - 0x0000)
struct PSOneUIManager_ShowDelTips final
{
public:
	class FString                                 Tips;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 uid;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSOneUIManager_ShowDelTips) == 0x000008, "Wrong alignment on PSOneUIManager_ShowDelTips");
static_assert(sizeof(PSOneUIManager_ShowDelTips) == 0x000030, "Wrong size on PSOneUIManager_ShowDelTips");
static_assert(offsetof(PSOneUIManager_ShowDelTips, Tips) == 0x000000, "Member 'PSOneUIManager_ShowDelTips::Tips' has a wrong offset!");
static_assert(offsetof(PSOneUIManager_ShowDelTips, uid) == 0x000010, "Member 'PSOneUIManager_ShowDelTips::uid' has a wrong offset!");
static_assert(offsetof(PSOneUIManager_ShowDelTips, Token) == 0x000020, "Member 'PSOneUIManager_ShowDelTips::Token' has a wrong offset!");

// Function OneEngineSDK.PSOneUIManager.ShowLogin
// 0x0001 (0x0001 - 0x0000)
struct PSOneUIManager_ShowLogin final
{
public:
	bool                                          bIsMainland;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSOneUIManager_ShowLogin) == 0x000001, "Wrong alignment on PSOneUIManager_ShowLogin");
static_assert(sizeof(PSOneUIManager_ShowLogin) == 0x000001, "Wrong size on PSOneUIManager_ShowLogin");
static_assert(offsetof(PSOneUIManager_ShowLogin, bIsMainland) == 0x000000, "Member 'PSOneUIManager_ShowLogin::bIsMainland' has a wrong offset!");

// Function OneEngineSDK.PSOneUIManager.ShowLoginSuccessHint
// 0x0010 (0x0010 - 0x0000)
struct PSOneUIManager_ShowLoginSuccessHint final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSOneUIManager_ShowLoginSuccessHint) == 0x000008, "Wrong alignment on PSOneUIManager_ShowLoginSuccessHint");
static_assert(sizeof(PSOneUIManager_ShowLoginSuccessHint) == 0x000010, "Wrong size on PSOneUIManager_ShowLoginSuccessHint");
static_assert(offsetof(PSOneUIManager_ShowLoginSuccessHint, Text) == 0x000000, "Member 'PSOneUIManager_ShowLoginSuccessHint::Text' has a wrong offset!");

// Function OneEngineSDK.PSOneUIManager.ShowToast
// 0x0018 (0x0018 - 0x0000)
struct PSOneUIManager_ShowToast final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         duration;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HandleFocusWidget;                                 // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PSOneUIManager_ShowToast) == 0x000008, "Wrong alignment on PSOneUIManager_ShowToast");
static_assert(sizeof(PSOneUIManager_ShowToast) == 0x000018, "Wrong size on PSOneUIManager_ShowToast");
static_assert(offsetof(PSOneUIManager_ShowToast, Text) == 0x000000, "Member 'PSOneUIManager_ShowToast::Text' has a wrong offset!");
static_assert(offsetof(PSOneUIManager_ShowToast, duration) == 0x000010, "Member 'PSOneUIManager_ShowToast::duration' has a wrong offset!");
static_assert(offsetof(PSOneUIManager_ShowToast, HandleFocusWidget) == 0x000014, "Member 'PSOneUIManager_ShowToast::HandleFocusWidget' has a wrong offset!");

// Function OneEngineSDK.PSOneUIManager.ShowUserAgreement
// 0x0018 (0x0018 - 0x0000)
struct PSOneUIManager_ShowUserAgreement final
{
public:
	bool                                          bHasAgreed;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LoginOption;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LoginOptionString;                                 // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSOneUIManager_ShowUserAgreement) == 0x000008, "Wrong alignment on PSOneUIManager_ShowUserAgreement");
static_assert(sizeof(PSOneUIManager_ShowUserAgreement) == 0x000018, "Wrong size on PSOneUIManager_ShowUserAgreement");
static_assert(offsetof(PSOneUIManager_ShowUserAgreement, bHasAgreed) == 0x000000, "Member 'PSOneUIManager_ShowUserAgreement::bHasAgreed' has a wrong offset!");
static_assert(offsetof(PSOneUIManager_ShowUserAgreement, LoginOption) == 0x000004, "Member 'PSOneUIManager_ShowUserAgreement::LoginOption' has a wrong offset!");
static_assert(offsetof(PSOneUIManager_ShowUserAgreement, LoginOptionString) == 0x000008, "Member 'PSOneUIManager_ShowUserAgreement::LoginOptionString' has a wrong offset!");

// Function OneEngineSDK.PSOneUserCenter.BindData
// 0x0010 (0x0010 - 0x0000)
struct PSOneUserCenter_BindData final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSOneUserCenter_BindData) == 0x000008, "Wrong alignment on PSOneUserCenter_BindData");
static_assert(sizeof(PSOneUserCenter_BindData) == 0x000010, "Wrong size on PSOneUserCenter_BindData");
static_assert(offsetof(PSOneUserCenter_BindData, JsonString) == 0x000000, "Member 'PSOneUserCenter_BindData::JsonString' has a wrong offset!");

// Function OneEngineSDK.PSOneUserCenter.RefreshDeviceData
// 0x0010 (0x0010 - 0x0000)
struct PSOneUserCenter_RefreshDeviceData final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSOneUserCenter_RefreshDeviceData) == 0x000008, "Wrong alignment on PSOneUserCenter_RefreshDeviceData");
static_assert(sizeof(PSOneUserCenter_RefreshDeviceData) == 0x000010, "Wrong size on PSOneUserCenter_RefreshDeviceData");
static_assert(offsetof(PSOneUserCenter_RefreshDeviceData, JsonString) == 0x000000, "Member 'PSOneUserCenter_RefreshDeviceData::JsonString' has a wrong offset!");

// Function OneEngineSDK.PSOneUserCenter.UpdateBoundAccounts
// 0x0050 (0x0050 - 0x0000)
struct PSOneUserCenter_UpdateBoundAccounts final
{
public:
	TMap<int32, bool>                             Accounts;                                          // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PSOneUserCenter_UpdateBoundAccounts) == 0x000008, "Wrong alignment on PSOneUserCenter_UpdateBoundAccounts");
