#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OpacityMicroMap

#include "Basic.hpp"


namespace SDK
{

// Enum OpacityMicroMap.EOpacityMicromapFlags
// NumValues: 0x0002
enum class EOpacityMicromapFlags : uint8
{
	None                                     = 0,
	EOpacityMicromapFlags_MAX                = 1,
};

// ScriptStruct OpacityMicroMap.OpacityMicroMapUsageCount
// 0x000C (0x000C - 0x0000)
struct FOpacityMicroMapUsageCount final
{
public:
	uint32                                        Count;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        SubdivisionLevel;                                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Format;                                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOpacityMicroMapUsageCount) == 0x000004, "Wrong alignment on FOpacityMicroMapUsageCount");
static_assert(sizeof(FOpacityMicroMapUsageCount) == 0x00000C, "Wrong size on FOpacityMicroMapUsageCount");
static_assert(offsetof(FOpacityMicroMapUsageCount, Count) == 0x000000, "Member 'FOpacityMicroMapUsageCount::Count' has a wrong offset!");
static_assert(offsetof(FOpacityMicroMapUsageCount, SubdivisionLevel) == 0x000004, "Member 'FOpacityMicroMapUsageCount::SubdivisionLevel' has a wrong offset!");
static_assert(offsetof(FOpacityMicroMapUsageCount, Format) == 0x000008, "Member 'FOpacityMicroMapUsageCount::Format' has a wrong offset!");

// ScriptStruct OpacityMicroMap.OpacityMicromapDesc
// 0x0008 (0x0008 - 0x0000)
struct FOpacityMicromapDesc final
{
public:
	uint32                                        Offset;                                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        SubdivisionLevel;                                  // 0x0004(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        Format;                                            // 0x0006(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOpacityMicromapDesc) == 0x000004, "Wrong alignment on FOpacityMicromapDesc");
static_assert(sizeof(FOpacityMicromapDesc) == 0x000008, "Wrong size on FOpacityMicromapDesc");
static_assert(offsetof(FOpacityMicromapDesc, Offset) == 0x000000, "Member 'FOpacityMicromapDesc::Offset' has a wrong offset!");
static_assert(offsetof(FOpacityMicromapDesc, SubdivisionLevel) == 0x000004, "Member 'FOpacityMicromapDesc::SubdivisionLevel' has a wrong offset!");
static_assert(offsetof(FOpacityMicromapDesc, Format) == 0x000006, "Member 'FOpacityMicromapDesc::Format' has a wrong offset!");

}

