#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PatcherSDK

#include "Basic.hpp"

#include "PatcherSDK_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class PatcherSDK.PatcherSDKSubsystem
// 0x00F0 (0x0120 - 0x0030)
class UPatcherSDKSubsystem final : public UEngineSubsystem
{
public:
	TMulticastInlineDelegate<void(EPatcherVerCheck PatcherVerCheck, const struct FVersionInfo& VersionInfo)> VersionCheckDelegate; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int64 WillDownloadBytes, int64 UpdateNeedSpaceBytes, int64 FreeDiskspaceBytes)> PreDownloadDelegate; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int64 TotalSize, float Progress, int64 Speed)> DownloadDelegate;   // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 TotalCount, int32 Remaincount, EPatcherFileOper PatcherFileOper, const class FString& CurrentFixedFile)> FixResourceDelegate; // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EPatcherState PatcherState)> StateStartDelegate;                   // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EPatcherState PatcherState)> StateEndDelegate;                     // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EPatcherErr PatcherErr)> UpdateFinishDelegate;                     // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int64 TotalResouceByteSize, int64 TotalFixedResourceSize, int64 CurrentResourceTotalSize, EPatcherFileOper PatcherFileOper, const class FString& CurrentFile)> FixResourceFileStartDelegate; // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 result, const class FString& Desc)> ClearResCompletedDelegate; // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 TotalFileCount, int32 CheckedFileCount, int64 TotalBytes, int64 CheckedBytes, const class FString& CurrentResName, int64 CurrentFileSize, int64 CurrentCheckedSize)> LocalResCheckProgressDelegate; // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 TotalFileCount, int32 CheckedFileCount, int64 TotalBytes, int64 CheckedBytes, const class FString& CurrentResName, int64 CurrentFileSize, int64 CurrentCheckedSize)> DownloadResCheckProgressDelegate; // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& currentCDN, int64 CurrentSpeedBytesPerSecond, const class FString& Reverse)> LowSpeedNotifyDelegate; // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bHasPreRelease, const class FString& PreReleaseBranch, const class FString& PreReleaseResVersion)> PreReleaseCheckDelegate; // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int64 BaseBytes, int64 WillDownloadBaseBytes, int64 UpdateNeedSpaceBaseBytes, int64 AllBytes, int64 WillDownloadAllBytes, int64 UpdateNeedSpaceAllBytes, int64 FreeDiskspaceBytes)> PreDownloadWithTagsDelegate; // 0x0100(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_110[0x10];                                     // 0x0110(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 CancelDeleteBranchCache(const class FString& BranchName);
	void CancelUpdate();
	int32 CheckAndDoUpdateBaseResource(const class FString& Tags);
	int32 CheckBaseResource(const class FString& Tags, const struct FPatcherBaseResCheckStatusCallback& Callback);
	void Clear();
	int32 DeleteBranchCache(const class FString& BranchName, const struct FDeleteBranchCacheCallback& Callback);
	int32 DoUpdateBaseResource(bool ClearResource, const class FString& Tags);
	int32 EnableBackgroundtask(bool bEnable);
	void EnablePushNotify(bool bEnable);
	class FString GetCDNList();
	class FString GetConfigByKey(const class FString& Key);
	int64 GetDeviceFreeSpace();
	class FString GetExceptionFiles();
	class FString GetGameConfig(const class FString& Name_0, int32 FileType, int32* ErrorCode);
	class FString GetLocalAppversion();
	class FString GetLocalBranchs();
	class FString GetLocalResversion();
	class FString GetPatcherVersion();
	int64 GetPlayAssetsSize();
	class FString GetServerListFile();
	int32 Init(const class FString& ConfigPath, int32 SDKLogLevel, const struct FPatcherSDKPathInfo& PathInfo, const class FString& DeviceID, const class FString& MediaId);
	int32 InitWithJsonContent(const class FString& ConfigJsonContent, int32 SDKLogLevel, const struct FPatcherSDKPathInfo& PathInfo, const class FString& DeviceID, const class FString& MediaId);
	int32 IsBackgroundtaskEnabled();
	int32 PreReleaseCancel();
	int32 PreReleaseCheckStatus(const struct FPatcherPreReleaseCheckStatusCallback& Callback);
	int32 PreReleaseRequest(const struct FPreReleaseRequestCallback& Callback);
	int32 RefreshConfigWithCallback(TDelegate<void(int32 Code, const class FString& Desc, const class FString& Content)> Callback);
	void RefreshServerListWithCallback(bool bAsync, TDelegate<void(int32 Code, const class FString& Desc, const class FString& FilePath)> Callback);
	void RefreshServerlistWithURL(bool bAsync, const class FString& ServelistURL, TDelegate<void(int32 Code, const class FString& Desc, const class FString& FilePath)> Callback);
	void RequestAvailableVersions(TDelegate<void(int32 Code, const class FString& Desc, const class FString& Content)> Callback);
	int32 RequestCancelDownload(const class FString& URL, const class FString& LocalDir, const class FString& Name_0);
	int32 RequestCheckAppNeedUpdate(const class FString& ChannelId, const class FString& MediaId, TDelegate<void(int32 Code, const class FString& Desc, const class FString& Content)> Callback);
	int32 RequestDownloadFile(const class FString& URL, const class FString& LocalDir, const class FString& Name_0, const struct FPatcherRequestDownloadFileCallback& Callback);
	int32 RequestOnlineVersion(bool bAsync, TDelegate<void(int32 Code, const class FString& Version)> Callback);
	int32 RequestTagVersioninfo(const class FString& TagName, TDelegate<void(int32 Code, const class FString& Desc, const class FString& Content)> Callback);
	int32 RequestVersioninfo(TDelegate<void(int32 Code, const class FString& Desc, const class FString& Content)> Callback);
	int32 ResourceCheckResult(bool Async, const class FString& Dirs, const class FString& Filters, TDelegate<void(int32 Code, const class FString& Desc, const class FString& Content)> Callback);
	int32 RunCallbacks();
	int32 SetCDN(const class FString& URL);
	int32 SetCheckDirs(const class FString& Dirs);
	int32 SetFileException(const class FString& FilePath, EPatcherFileExceptionType Type);
	int32 SetFileExceptionResolveType(EPatcherFileExceptionResolveType Type);
	int32 SetInitialResDirMapping(const class FString& InitialDir, const class FString& ResDir, const class FString& CustomVersion);
	int32 SetMaxSpeed(int64 KBPerSecond);
	int32 SetMusicPath(const class FString& MusicPath, bool bExaminState);
	void SetNotifyContent(const class FString& JsonContent);
	int32 SetPatcherWorkDir(const class FString& WorkDirJsonContent);
	int32 SetVersion(const class FString& Version, const class FString& Resverse);
	int32 SetWriteLimit(int64 bytesPerSecond);
	int32 SetWriteLimitByTime(int64 writeTime, int64 WaitTime);
	int32 StartKeepAlive(EPatcherKeepAliveType Type, const class FString& Content);
	int32 StopKeepAlive();
	int32 TagCancelUpdate(int64 Task);
	int32 TagCheckResource(const class FString& Tags, const struct FPatcherTagCheckResourceCallback& Callback);
	int32 TagConfirmUpdate(int64 Task, bool bDoNext);
	int64 TagCreateUpdateTask(const class FString& Tag, const struct FPatcherTagResourceUpdateCallback& Callback, bool bAutoStart, int32 MaxThreads, int64 MaxBytesPerSecond);
	int32 TagDestroyUpdateTask(int64 Task);
	void TagGetTagList(TDelegate<void(int32 Code, const class FString& Desc, const TArray<struct FPatcherResourceInfo>& ResourceInfoArray)> Callback);
	class FString TagGetTagName(int64 Task);
	int64 TagGetTaskByTagName(const class FString& Tag);
	void TagGetTaskList(TDelegate<void(int32 Code, const class FString& Desc, const TArray<struct FPatcherResourceInfo>& ResourceInfoArray)> Callback);
	int32 TagStartUpdate(int64 Task);
	void Uninit();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PatcherSDKSubsystem">();
	}
	static class UPatcherSDKSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPatcherSDKSubsystem>();
	}
};
static_assert(alignof(UPatcherSDKSubsystem) == 0x000008, "Wrong alignment on UPatcherSDKSubsystem");
static_assert(sizeof(UPatcherSDKSubsystem) == 0x000120, "Wrong size on UPatcherSDKSubsystem");
static_assert(offsetof(UPatcherSDKSubsystem, VersionCheckDelegate) == 0x000030, "Member 'UPatcherSDKSubsystem::VersionCheckDelegate' has a wrong offset!");
static_assert(offsetof(UPatcherSDKSubsystem, PreDownloadDelegate) == 0x000040, "Member 'UPatcherSDKSubsystem::PreDownloadDelegate' has a wrong offset!");
static_assert(offsetof(UPatcherSDKSubsystem, DownloadDelegate) == 0x000050, "Member 'UPatcherSDKSubsystem::DownloadDelegate' has a wrong offset!");
static_assert(offsetof(UPatcherSDKSubsystem, FixResourceDelegate) == 0x000060, "Member 'UPatcherSDKSubsystem::FixResourceDelegate' has a wrong offset!");
static_assert(offsetof(UPatcherSDKSubsystem, StateStartDelegate) == 0x000070, "Member 'UPatcherSDKSubsystem::StateStartDelegate' has a wrong offset!");
static_assert(offsetof(UPatcherSDKSubsystem, StateEndDelegate) == 0x000080, "Member 'UPatcherSDKSubsystem::StateEndDelegate' has a wrong offset!");
static_assert(offsetof(UPatcherSDKSubsystem, UpdateFinishDelegate) == 0x000090, "Member 'UPatcherSDKSubsystem::UpdateFinishDelegate' has a wrong offset!");
static_assert(offsetof(UPatcherSDKSubsystem, FixResourceFileStartDelegate) == 0x0000A0, "Member 'UPatcherSDKSubsystem::FixResourceFileStartDelegate' has a wrong offset!");
static_assert(offsetof(UPatcherSDKSubsystem, ClearResCompletedDelegate) == 0x0000B0, "Member 'UPatcherSDKSubsystem::ClearResCompletedDelegate' has a wrong offset!");
static_assert(offsetof(UPatcherSDKSubsystem, LocalResCheckProgressDelegate) == 0x0000C0, "Member 'UPatcherSDKSubsystem::LocalResCheckProgressDelegate' has a wrong offset!");
static_assert(offsetof(UPatcherSDKSubsystem, DownloadResCheckProgressDelegate) == 0x0000D0, "Member 'UPatcherSDKSubsystem::DownloadResCheckProgressDelegate' has a wrong offset!");
static_assert(offsetof(UPatcherSDKSubsystem, LowSpeedNotifyDelegate) == 0x0000E0, "Member 'UPatcherSDKSubsystem::LowSpeedNotifyDelegate' has a wrong offset!");
static_assert(offsetof(UPatcherSDKSubsystem, PreReleaseCheckDelegate) == 0x0000F0, "Member 'UPatcherSDKSubsystem::PreReleaseCheckDelegate' has a wrong offset!");
static_assert(offsetof(UPatcherSDKSubsystem, PreDownloadWithTagsDelegate) == 0x000100, "Member 'UPatcherSDKSubsystem::PreDownloadWithTagsDelegate' has a wrong offset!");

}

