#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PCG

#include "Basic.hpp"

#include "ComputeFramework_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "PCG_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class PCG.PCGNodeSourceTextProvider
// 0x0000 (0x0000 - 0x0000)
class IPCGNodeSourceTextProvider final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGNodeSourceTextProvider">();
	}
	static class IPCGNodeSourceTextProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<IPCGNodeSourceTextProvider>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IPCGNodeSourceTextProvider) == 0x000001, "Wrong alignment on IPCGNodeSourceTextProvider");
static_assert(sizeof(IPCGNodeSourceTextProvider) == 0x000001, "Wrong size on IPCGNodeSourceTextProvider");

// Class PCG.PCGData
// 0x0020 (0x0048 - 0x0028)
class UPCGData : public UObject
{
public:
	uint64                                        uid;                                               // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UPCGMetadata*                           MetaData;                                          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UPCGMetadata* MutableMetadata();

	const class UPCGMetadata* ConstMetadata() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGData">();
	}
	static class UPCGData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGData>();
	}
};
static_assert(alignof(UPCGData) == 0x000008, "Wrong alignment on UPCGData");
static_assert(sizeof(UPCGData) == 0x000048, "Wrong size on UPCGData");
static_assert(offsetof(UPCGData, uid) == 0x000028, "Member 'UPCGData::uid' has a wrong offset!");
static_assert(offsetof(UPCGData, MetaData) == 0x000038, "Member 'UPCGData::MetaData' has a wrong offset!");

// Class PCG.PCGSettingsInterface
// 0x0008 (0x0050 - 0x0048)
class UPCGSettingsInterface : public UPCGData
{
public:
	bool                                          bEnabled;                                          // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebug;                                            // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGSettingsInterface">();
	}
	static class UPCGSettingsInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSettingsInterface>();
	}
};
static_assert(alignof(UPCGSettingsInterface) == 0x000008, "Wrong alignment on UPCGSettingsInterface");
static_assert(sizeof(UPCGSettingsInterface) == 0x000050, "Wrong size on UPCGSettingsInterface");
static_assert(offsetof(UPCGSettingsInterface, bEnabled) == 0x000048, "Member 'UPCGSettingsInterface::bEnabled' has a wrong offset!");
static_assert(offsetof(UPCGSettingsInterface, bDebug) == 0x000049, "Member 'UPCGSettingsInterface::bDebug' has a wrong offset!");

// Class PCG.PCGSettings
// 0x0070 (0x00C0 - 0x0050)
class UPCGSettings : public UPCGSettingsInterface
{
public:
	int32                                         Seed;                                              // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExecutionDependencyRequired;                      // 0x0054(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0xB];                                       // 0x0055(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUseSeed;                                          // 0x0060(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_61[0x3F];                                      // 0x0061(0x003F)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPCGSettingsOverridableParam>   CachedOverridableParams;                           // 0x00A0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_B0[0x1];                                       // 0x00B0(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bExecuteOnGPU;                                     // 0x00B1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDumpCookedHLSL;                                   // 0x00B2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDumpDataDescriptions;                             // 0x00B3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPrintShaderDebugValues;                           // 0x00B4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DebugBufferSize;                                   // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 BP_GetTypeUnionOfIncidentEdges(const class FName& PinLabel) const;
	bool UseSeed() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGSettings">();
	}
	static class UPCGSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSettings>();
	}
};
static_assert(alignof(UPCGSettings) == 0x000008, "Wrong alignment on UPCGSettings");
static_assert(sizeof(UPCGSettings) == 0x0000C0, "Wrong size on UPCGSettings");
static_assert(offsetof(UPCGSettings, Seed) == 0x000050, "Member 'UPCGSettings::Seed' has a wrong offset!");
static_assert(offsetof(UPCGSettings, bExecutionDependencyRequired) == 0x000054, "Member 'UPCGSettings::bExecutionDependencyRequired' has a wrong offset!");
static_assert(offsetof(UPCGSettings, bUseSeed) == 0x000060, "Member 'UPCGSettings::bUseSeed' has a wrong offset!");
static_assert(offsetof(UPCGSettings, CachedOverridableParams) == 0x0000A0, "Member 'UPCGSettings::CachedOverridableParams' has a wrong offset!");
static_assert(offsetof(UPCGSettings, bExecuteOnGPU) == 0x0000B1, "Member 'UPCGSettings::bExecuteOnGPU' has a wrong offset!");
static_assert(offsetof(UPCGSettings, bDumpCookedHLSL) == 0x0000B2, "Member 'UPCGSettings::bDumpCookedHLSL' has a wrong offset!");
static_assert(offsetof(UPCGSettings, bDumpDataDescriptions) == 0x0000B3, "Member 'UPCGSettings::bDumpDataDescriptions' has a wrong offset!");
static_assert(offsetof(UPCGSettings, bPrintShaderDebugValues) == 0x0000B4, "Member 'UPCGSettings::bPrintShaderDebugValues' has a wrong offset!");
static_assert(offsetof(UPCGSettings, DebugBufferSize) == 0x0000B8, "Member 'UPCGSettings::DebugBufferSize' has a wrong offset!");

// Class PCG.PCGAddComponentSettings
// 0x00E0 (0x01A0 - 0x00C0)
class UPCGAddComponentSettings final : public UPCGSettings
{
public:
	bool                                          bUseClassAttribute;                                // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     ClassAttribute;                                    // 0x00C8(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UActorComponent>            TemplateComponentClass;                            // 0x0108(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAllowTemplateComponentEditing;                    // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        TemplateComponent;                                 // 0x0118(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPCGAttributePropertyInputSelector     ActorReferenceAttribute;                           // 0x0120(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPCGAttributePropertyOutputNoSourceSelector ComponentReferenceAttribute;                  // 0x0160(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAddComponentSettings">();
	}
	static class UPCGAddComponentSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAddComponentSettings>();
	}
};
static_assert(alignof(UPCGAddComponentSettings) == 0x000008, "Wrong alignment on UPCGAddComponentSettings");
static_assert(sizeof(UPCGAddComponentSettings) == 0x0001A0, "Wrong size on UPCGAddComponentSettings");
static_assert(offsetof(UPCGAddComponentSettings, bUseClassAttribute) == 0x0000C0, "Member 'UPCGAddComponentSettings::bUseClassAttribute' has a wrong offset!");
static_assert(offsetof(UPCGAddComponentSettings, ClassAttribute) == 0x0000C8, "Member 'UPCGAddComponentSettings::ClassAttribute' has a wrong offset!");
static_assert(offsetof(UPCGAddComponentSettings, TemplateComponentClass) == 0x000108, "Member 'UPCGAddComponentSettings::TemplateComponentClass' has a wrong offset!");
static_assert(offsetof(UPCGAddComponentSettings, bAllowTemplateComponentEditing) == 0x000110, "Member 'UPCGAddComponentSettings::bAllowTemplateComponentEditing' has a wrong offset!");
static_assert(offsetof(UPCGAddComponentSettings, TemplateComponent) == 0x000118, "Member 'UPCGAddComponentSettings::TemplateComponent' has a wrong offset!");
static_assert(offsetof(UPCGAddComponentSettings, ActorReferenceAttribute) == 0x000120, "Member 'UPCGAddComponentSettings::ActorReferenceAttribute' has a wrong offset!");
static_assert(offsetof(UPCGAddComponentSettings, ComponentReferenceAttribute) == 0x000160, "Member 'UPCGAddComponentSettings::ComponentReferenceAttribute' has a wrong offset!");

// Class PCG.PCGAddTagSettings
// 0x0038 (0x00F8 - 0x00C0)
class UPCGAddTagSettings final : public UPCGSettings
{
public:
	class FString                                 TagsToAdd;                                         // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Prefix;                                            // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Suffix;                                            // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreTagValueParsing;                            // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTokenizeOnWhiteSpace;                             // 0x00F1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAddTagSettings">();
	}
	static class UPCGAddTagSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAddTagSettings>();
	}
};
static_assert(alignof(UPCGAddTagSettings) == 0x000008, "Wrong alignment on UPCGAddTagSettings");
static_assert(sizeof(UPCGAddTagSettings) == 0x0000F8, "Wrong size on UPCGAddTagSettings");
static_assert(offsetof(UPCGAddTagSettings, TagsToAdd) == 0x0000C0, "Member 'UPCGAddTagSettings::TagsToAdd' has a wrong offset!");
static_assert(offsetof(UPCGAddTagSettings, Prefix) == 0x0000D0, "Member 'UPCGAddTagSettings::Prefix' has a wrong offset!");
static_assert(offsetof(UPCGAddTagSettings, Suffix) == 0x0000E0, "Member 'UPCGAddTagSettings::Suffix' has a wrong offset!");
static_assert(offsetof(UPCGAddTagSettings, bIgnoreTagValueParsing) == 0x0000F0, "Member 'UPCGAddTagSettings::bIgnoreTagValueParsing' has a wrong offset!");
static_assert(offsetof(UPCGAddTagSettings, bTokenizeOnWhiteSpace) == 0x0000F1, "Member 'UPCGAddTagSettings::bTokenizeOnWhiteSpace' has a wrong offset!");

// Class PCG.PCGApplyHierarchySettings
// 0x0180 (0x0240 - 0x00C0)
class UPCGApplyHierarchySettings final : public UPCGSettings
{
public:
	TArray<struct FPCGAttributePropertyInputSelector> PointKeyAttributes;                            // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPCGAttributePropertyInputSelector> ParentKeyAttributes;                           // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FPCGAttributePropertyInputSelector     HierarchyDepthAttribute;                           // 0x00E0(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPCGAttributePropertyInputSelector     RelativeTransformAttribute;                        // 0x0120(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGApplyHierarchyOption                      ApplyParentRotation;                               // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     ApplyParentRotationAttribute;                      // 0x0168(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGApplyHierarchyOption                      ApplyParentScale;                                  // 0x01A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     ApplyParentScaleAttribute;                         // 0x01B0(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGApplyHierarchyOption                      ApplyHierarchy;                                    // 0x01F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     ApplyHierarchyAttribute;                           // 0x01F8(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWarnOnPointsWithInvalidParent;                    // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGApplyHierarchySettings">();
	}
	static class UPCGApplyHierarchySettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGApplyHierarchySettings>();
	}
};
static_assert(alignof(UPCGApplyHierarchySettings) == 0x000008, "Wrong alignment on UPCGApplyHierarchySettings");
static_assert(sizeof(UPCGApplyHierarchySettings) == 0x000240, "Wrong size on UPCGApplyHierarchySettings");
static_assert(offsetof(UPCGApplyHierarchySettings, PointKeyAttributes) == 0x0000C0, "Member 'UPCGApplyHierarchySettings::PointKeyAttributes' has a wrong offset!");
static_assert(offsetof(UPCGApplyHierarchySettings, ParentKeyAttributes) == 0x0000D0, "Member 'UPCGApplyHierarchySettings::ParentKeyAttributes' has a wrong offset!");
static_assert(offsetof(UPCGApplyHierarchySettings, HierarchyDepthAttribute) == 0x0000E0, "Member 'UPCGApplyHierarchySettings::HierarchyDepthAttribute' has a wrong offset!");
static_assert(offsetof(UPCGApplyHierarchySettings, RelativeTransformAttribute) == 0x000120, "Member 'UPCGApplyHierarchySettings::RelativeTransformAttribute' has a wrong offset!");
static_assert(offsetof(UPCGApplyHierarchySettings, ApplyParentRotation) == 0x000160, "Member 'UPCGApplyHierarchySettings::ApplyParentRotation' has a wrong offset!");
static_assert(offsetof(UPCGApplyHierarchySettings, ApplyParentRotationAttribute) == 0x000168, "Member 'UPCGApplyHierarchySettings::ApplyParentRotationAttribute' has a wrong offset!");
static_assert(offsetof(UPCGApplyHierarchySettings, ApplyParentScale) == 0x0001A8, "Member 'UPCGApplyHierarchySettings::ApplyParentScale' has a wrong offset!");
static_assert(offsetof(UPCGApplyHierarchySettings, ApplyParentScaleAttribute) == 0x0001B0, "Member 'UPCGApplyHierarchySettings::ApplyParentScaleAttribute' has a wrong offset!");
static_assert(offsetof(UPCGApplyHierarchySettings, ApplyHierarchy) == 0x0001F0, "Member 'UPCGApplyHierarchySettings::ApplyHierarchy' has a wrong offset!");
static_assert(offsetof(UPCGApplyHierarchySettings, ApplyHierarchyAttribute) == 0x0001F8, "Member 'UPCGApplyHierarchySettings::ApplyHierarchyAttribute' has a wrong offset!");
static_assert(offsetof(UPCGApplyHierarchySettings, bWarnOnPointsWithInvalidParent) == 0x000238, "Member 'UPCGApplyHierarchySettings::bWarnOnPointsWithInvalidParent' has a wrong offset!");

// Class PCG.PCGApplyOnActorSettings
// 0x0068 (0x0128 - 0x00C0)
class UPCGApplyOnActorSettings final : public UPCGSettings
{
public:
	struct FPCGAttributePropertyInputSelector     ObjectReferenceAttribute;                          // 0x00C0(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPCGObjectPropertyOverrideDescription> PropertyOverrideDescriptions;               // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           PostProcessFunctionNames;                          // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bSilenceErrorOnEmptyObjectPath;                    // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSynchronousLoad;                                  // 0x0121(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGApplyOnActorSettings">();
	}
	static class UPCGApplyOnActorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGApplyOnActorSettings>();
	}
};
static_assert(alignof(UPCGApplyOnActorSettings) == 0x000008, "Wrong alignment on UPCGApplyOnActorSettings");
static_assert(sizeof(UPCGApplyOnActorSettings) == 0x000128, "Wrong size on UPCGApplyOnActorSettings");
static_assert(offsetof(UPCGApplyOnActorSettings, ObjectReferenceAttribute) == 0x0000C0, "Member 'UPCGApplyOnActorSettings::ObjectReferenceAttribute' has a wrong offset!");
static_assert(offsetof(UPCGApplyOnActorSettings, PropertyOverrideDescriptions) == 0x000100, "Member 'UPCGApplyOnActorSettings::PropertyOverrideDescriptions' has a wrong offset!");
static_assert(offsetof(UPCGApplyOnActorSettings, PostProcessFunctionNames) == 0x000110, "Member 'UPCGApplyOnActorSettings::PostProcessFunctionNames' has a wrong offset!");
static_assert(offsetof(UPCGApplyOnActorSettings, bSilenceErrorOnEmptyObjectPath) == 0x000120, "Member 'UPCGApplyOnActorSettings::bSilenceErrorOnEmptyObjectPath' has a wrong offset!");
static_assert(offsetof(UPCGApplyOnActorSettings, bSynchronousLoad) == 0x000121, "Member 'UPCGApplyOnActorSettings::bSynchronousLoad' has a wrong offset!");

// Class PCG.PCGApplyScaleToBoundsSettings
// 0x0000 (0x00C0 - 0x00C0)
class UPCGApplyScaleToBoundsSettings final : public UPCGSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGApplyScaleToBoundsSettings">();
	}
	static class UPCGApplyScaleToBoundsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGApplyScaleToBoundsSettings>();
	}
};
static_assert(alignof(UPCGApplyScaleToBoundsSettings) == 0x000008, "Wrong alignment on UPCGApplyScaleToBoundsSettings");
static_assert(sizeof(UPCGApplyScaleToBoundsSettings) == 0x0000C0, "Wrong size on UPCGApplyScaleToBoundsSettings");

// Class PCG.PCGAssetExporter
// 0x0000 (0x0028 - 0x0028)
class UPCGAssetExporter : public UObject
{
public:
	bool BP_ExportToAsset(class UPCGDataAsset* Asset);

	TSubclassOf<class UPCGDataAsset> BP_GetAssetType() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAssetExporter">();
	}
	static class UPCGAssetExporter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAssetExporter>();
	}
};
static_assert(alignof(UPCGAssetExporter) == 0x000008, "Wrong alignment on UPCGAssetExporter");
static_assert(sizeof(UPCGAssetExporter) == 0x000028, "Wrong size on UPCGAssetExporter");

// Class PCG.PCGAssetExporterUtils
// 0x0000 (0x0028 - 0x0028)
class UPCGAssetExporterUtils final : public UBlueprintFunctionLibrary
{
public:
	static class UPackage* CreateAsset(class UPCGAssetExporter* Exporter, const struct FPCGAssetExporterParameters& Parameters);
	static void UpdateAssets(const TArray<struct FAssetData>& PCGAssets, const struct FPCGAssetExporterParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAssetExporterUtils">();
	}
	static class UPCGAssetExporterUtils* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAssetExporterUtils>();
	}
};
static_assert(alignof(UPCGAssetExporterUtils) == 0x000008, "Wrong alignment on UPCGAssetExporterUtils");
static_assert(sizeof(UPCGAssetExporterUtils) == 0x000028, "Wrong size on UPCGAssetExporterUtils");

// Class PCG.PCGAttractSettings
// 0x01C8 (0x0288 - 0x00C0)
class UPCGAttractSettings final : public UPCGSettings
{
public:
	EPCGAttractMode                               Mode;                                              // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     AttractorIndexAttribute;                           // 0x00C8(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Distance;                                          // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveUnattractedPoints;                          // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     TargetAttribute;                                   // 0x0118(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSourceWeight;                                  // 0x0158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     SourceWeightAttribute;                             // 0x0160(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseTargetWeight;                                  // 0x01A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     TargetWeightAttribute;                             // 0x01A8(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Weight;                                            // 0x01E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FPCGAttributePropertyInputSelector, struct FPCGAttributePropertyInputSelector> SourceAndTargetAttributeMapping; // 0x01F0(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bOutputAttractIndex;                               // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyOutputNoSourceSelector OutputAttractIndexAttribute;                  // 0x0248(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAttractSettings">();
	}
	static class UPCGAttractSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttractSettings>();
	}
};
static_assert(alignof(UPCGAttractSettings) == 0x000008, "Wrong alignment on UPCGAttractSettings");
static_assert(sizeof(UPCGAttractSettings) == 0x000288, "Wrong size on UPCGAttractSettings");
static_assert(offsetof(UPCGAttractSettings, Mode) == 0x0000C0, "Member 'UPCGAttractSettings::Mode' has a wrong offset!");
static_assert(offsetof(UPCGAttractSettings, AttractorIndexAttribute) == 0x0000C8, "Member 'UPCGAttractSettings::AttractorIndexAttribute' has a wrong offset!");
static_assert(offsetof(UPCGAttractSettings, Distance) == 0x000108, "Member 'UPCGAttractSettings::Distance' has a wrong offset!");
static_assert(offsetof(UPCGAttractSettings, bRemoveUnattractedPoints) == 0x000110, "Member 'UPCGAttractSettings::bRemoveUnattractedPoints' has a wrong offset!");
static_assert(offsetof(UPCGAttractSettings, TargetAttribute) == 0x000118, "Member 'UPCGAttractSettings::TargetAttribute' has a wrong offset!");
static_assert(offsetof(UPCGAttractSettings, bUseSourceWeight) == 0x000158, "Member 'UPCGAttractSettings::bUseSourceWeight' has a wrong offset!");
static_assert(offsetof(UPCGAttractSettings, SourceWeightAttribute) == 0x000160, "Member 'UPCGAttractSettings::SourceWeightAttribute' has a wrong offset!");
static_assert(offsetof(UPCGAttractSettings, bUseTargetWeight) == 0x0001A0, "Member 'UPCGAttractSettings::bUseTargetWeight' has a wrong offset!");
static_assert(offsetof(UPCGAttractSettings, TargetWeightAttribute) == 0x0001A8, "Member 'UPCGAttractSettings::TargetWeightAttribute' has a wrong offset!");
static_assert(offsetof(UPCGAttractSettings, Weight) == 0x0001E8, "Member 'UPCGAttractSettings::Weight' has a wrong offset!");
static_assert(offsetof(UPCGAttractSettings, SourceAndTargetAttributeMapping) == 0x0001F0, "Member 'UPCGAttractSettings::SourceAndTargetAttributeMapping' has a wrong offset!");
static_assert(offsetof(UPCGAttractSettings, bOutputAttractIndex) == 0x000240, "Member 'UPCGAttractSettings::bOutputAttractIndex' has a wrong offset!");
static_assert(offsetof(UPCGAttractSettings, OutputAttractIndexAttribute) == 0x000248, "Member 'UPCGAttractSettings::OutputAttractIndexAttribute' has a wrong offset!");

// Class PCG.PCGAttributeCastSettings
// 0x0088 (0x0148 - 0x00C0)
class UPCGAttributeCastSettings final : public UPCGSettings
{
public:
	struct FPCGAttributePropertyInputSelector     InputSource;                                       // 0x00C0(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGMetadataTypes                             OutputType;                                        // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyOutputSelector    OutputTarget;                                      // 0x0108(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAttributeCastSettings">();
	}
	static class UPCGAttributeCastSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeCastSettings>();
	}
};
static_assert(alignof(UPCGAttributeCastSettings) == 0x000008, "Wrong alignment on UPCGAttributeCastSettings");
static_assert(sizeof(UPCGAttributeCastSettings) == 0x000148, "Wrong size on UPCGAttributeCastSettings");
static_assert(offsetof(UPCGAttributeCastSettings, InputSource) == 0x0000C0, "Member 'UPCGAttributeCastSettings::InputSource' has a wrong offset!");
static_assert(offsetof(UPCGAttributeCastSettings, OutputType) == 0x000100, "Member 'UPCGAttributeCastSettings::OutputType' has a wrong offset!");
static_assert(offsetof(UPCGAttributeCastSettings, OutputTarget) == 0x000108, "Member 'UPCGAttributeCastSettings::OutputTarget' has a wrong offset!");

// Class PCG.PCGAttributeExtractorTestObject
// 0x0008 (0x0030 - 0x0028)
class UPCGAttributeExtractorTestObject final : public UObject
{
public:
	double                                        DoubleValue;                                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAttributeExtractorTestObject">();
	}
	static class UPCGAttributeExtractorTestObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeExtractorTestObject>();
	}
};
static_assert(alignof(UPCGAttributeExtractorTestObject) == 0x000008, "Wrong alignment on UPCGAttributeExtractorTestObject");
static_assert(sizeof(UPCGAttributeExtractorTestObject) == 0x000030, "Wrong size on UPCGAttributeExtractorTestObject");
static_assert(offsetof(UPCGAttributeExtractorTestObject, DoubleValue) == 0x000028, "Member 'UPCGAttributeExtractorTestObject::DoubleValue' has a wrong offset!");

// Class PCG.PCGAttributeFilteringSettings
// 0x0220 (0x02E0 - 0x00C0)
class UPCGAttributeFilteringSettings final : public UPCGSettings
{
public:
	EPCGAttributeFilterOperator                   Operator;                                          // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     TargetAttribute;                                   // 0x00C8(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseConstantThreshold;                             // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     ThresholdAttribute;                                // 0x0110(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSpatialQuery;                                  // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0xF];                                      // 0x0151(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGMetadataTypesConstantStruct        AttributeTypes;                                    // 0x0160(0x0170)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bWarnOnDataMissingAttribute;                       // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasSpatialToPointDeprecation;                     // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D2[0xE];                                      // 0x02D2(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAttributeFilteringSettings">();
	}
	static class UPCGAttributeFilteringSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeFilteringSettings>();
	}
};
static_assert(alignof(UPCGAttributeFilteringSettings) == 0x000008, "Wrong alignment on UPCGAttributeFilteringSettings");
static_assert(sizeof(UPCGAttributeFilteringSettings) == 0x0002E0, "Wrong size on UPCGAttributeFilteringSettings");
static_assert(offsetof(UPCGAttributeFilteringSettings, Operator) == 0x0000C0, "Member 'UPCGAttributeFilteringSettings::Operator' has a wrong offset!");
static_assert(offsetof(UPCGAttributeFilteringSettings, TargetAttribute) == 0x0000C8, "Member 'UPCGAttributeFilteringSettings::TargetAttribute' has a wrong offset!");
static_assert(offsetof(UPCGAttributeFilteringSettings, bUseConstantThreshold) == 0x000108, "Member 'UPCGAttributeFilteringSettings::bUseConstantThreshold' has a wrong offset!");
static_assert(offsetof(UPCGAttributeFilteringSettings, ThresholdAttribute) == 0x000110, "Member 'UPCGAttributeFilteringSettings::ThresholdAttribute' has a wrong offset!");
static_assert(offsetof(UPCGAttributeFilteringSettings, bUseSpatialQuery) == 0x000150, "Member 'UPCGAttributeFilteringSettings::bUseSpatialQuery' has a wrong offset!");
static_assert(offsetof(UPCGAttributeFilteringSettings, AttributeTypes) == 0x000160, "Member 'UPCGAttributeFilteringSettings::AttributeTypes' has a wrong offset!");
static_assert(offsetof(UPCGAttributeFilteringSettings, bWarnOnDataMissingAttribute) == 0x0002D0, "Member 'UPCGAttributeFilteringSettings::bWarnOnDataMissingAttribute' has a wrong offset!");
static_assert(offsetof(UPCGAttributeFilteringSettings, bHasSpatialToPointDeprecation) == 0x0002D1, "Member 'UPCGAttributeFilteringSettings::bHasSpatialToPointDeprecation' has a wrong offset!");

// Class PCG.PCGAttributeFilteringRangeSettings
// 0x03D0 (0x0490 - 0x00C0)
class UPCGAttributeFilteringRangeSettings final : public UPCGSettings
{
public:
	struct FPCGAttributePropertyInputSelector     TargetAttribute;                                   // 0x00C0(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPCGAttributeFilterThresholdSettings   MinThreshold;                                      // 0x0100(0x01C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FPCGAttributeFilterThresholdSettings   MaxThreshold;                                      // 0x02C0(0x01C0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bWarnOnDataMissingAttribute;                       // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasSpatialToPointDeprecation;                     // 0x0481(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_482[0xE];                                      // 0x0482(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAttributeFilteringRangeSettings">();
	}
	static class UPCGAttributeFilteringRangeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeFilteringRangeSettings>();
	}
};
static_assert(alignof(UPCGAttributeFilteringRangeSettings) == 0x000008, "Wrong alignment on UPCGAttributeFilteringRangeSettings");
static_assert(sizeof(UPCGAttributeFilteringRangeSettings) == 0x000490, "Wrong size on UPCGAttributeFilteringRangeSettings");
static_assert(offsetof(UPCGAttributeFilteringRangeSettings, TargetAttribute) == 0x0000C0, "Member 'UPCGAttributeFilteringRangeSettings::TargetAttribute' has a wrong offset!");
static_assert(offsetof(UPCGAttributeFilteringRangeSettings, MinThreshold) == 0x000100, "Member 'UPCGAttributeFilteringRangeSettings::MinThreshold' has a wrong offset!");
static_assert(offsetof(UPCGAttributeFilteringRangeSettings, MaxThreshold) == 0x0002C0, "Member 'UPCGAttributeFilteringRangeSettings::MaxThreshold' has a wrong offset!");
static_assert(offsetof(UPCGAttributeFilteringRangeSettings, bWarnOnDataMissingAttribute) == 0x000480, "Member 'UPCGAttributeFilteringRangeSettings::bWarnOnDataMissingAttribute' has a wrong offset!");
static_assert(offsetof(UPCGAttributeFilteringRangeSettings, bHasSpatialToPointDeprecation) == 0x000481, "Member 'UPCGAttributeFilteringRangeSettings::bHasSpatialToPointDeprecation' has a wrong offset!");

// Class PCG.PCGAttributePropertySelectorBlueprintHelpers
// 0x0000 (0x0028 - 0x0028)
class UPCGAttributePropertySelectorBlueprintHelpers final : public UBlueprintFunctionLibrary
{
public:
	static struct FPCGAttributePropertyInputSelector CopyAndFixLast(const struct FPCGAttributePropertyInputSelector& Selector, const class UPCGData* InData);
	static struct FPCGAttributePropertyOutputSelector CopyAndFixSource(const struct FPCGAttributePropertyOutputSelector& OutputSelector, const struct FPCGAttributePropertyInputSelector& InputSelector, const class UPCGData* InOptionalData);
	static class FName GetAttributeName(const struct FPCGAttributePropertySelector& Selector);
	static class FName GetDomainName(const struct FPCGAttributePropertySelector& Selector);
	static const TArray<class FString> GetExtraNames(const struct FPCGAttributePropertySelector& Selector);
	static EPCGExtraProperties GetExtraProperty(const struct FPCGAttributePropertySelector& Selector);
	static class FName GetName(const struct FPCGAttributePropertySelector& Selector);
	static EPCGPointProperties GetPointProperty(const struct FPCGAttributePropertySelector& Selector);
	static class FName GetPropertyName(const struct FPCGAttributePropertySelector& Selector);
	static EPCGAttributePropertySelection GetSelection(const struct FPCGAttributePropertySelector& Selector);
	static bool SetAttributeName(struct FPCGAttributePropertySelector& Selector, class FName InAttributeName, bool bResetExtraNames);
	static bool SetDomainName(struct FPCGAttributePropertySelector& Selector, class FName InDomainName, bool bResetExtraNames);
	static bool SetExtraProperty(struct FPCGAttributePropertySelector& Selector, EPCGExtraProperties InExtraProperty, bool bResetExtraNames);
	static bool SetPointProperty(struct FPCGAttributePropertySelector& Selector, EPCGPointProperties InPointProperty, bool bResetExtraNames);
	static bool SetPropertyName(struct FPCGAttributePropertySelector& Selector, class FName InPropertyName, bool bResetExtraNames);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAttributePropertySelectorBlueprintHelpers">();
	}
	static class UPCGAttributePropertySelectorBlueprintHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributePropertySelectorBlueprintHelpers>();
	}
};
static_assert(alignof(UPCGAttributePropertySelectorBlueprintHelpers) == 0x000008, "Wrong alignment on UPCGAttributePropertySelectorBlueprintHelpers");
static_assert(sizeof(UPCGAttributePropertySelectorBlueprintHelpers) == 0x000028, "Wrong size on UPCGAttributePropertySelectorBlueprintHelpers");

// Class PCG.PCGMetadataSettingsBase
// 0x00B0 (0x0170 - 0x00C0)
class UPCGMetadataSettingsBase : public UPCGSettings
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyOutputSelector    OutputTarget;                                      // 0x00C8(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutputDataFromPin;                                 // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPCGDefaultValueContainer              DefaultValues;                                     // 0x0110(0x0060)(NativeAccessSpecifierPrivate)

public:
	TArray<class FName> GetOutputDataFromPinOptions() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGMetadataSettingsBase">();
	}
	static class UPCGMetadataSettingsBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGMetadataSettingsBase>();
	}
};
static_assert(alignof(UPCGMetadataSettingsBase) == 0x000008, "Wrong alignment on UPCGMetadataSettingsBase");
static_assert(sizeof(UPCGMetadataSettingsBase) == 0x000170, "Wrong size on UPCGMetadataSettingsBase");
static_assert(offsetof(UPCGMetadataSettingsBase, OutputTarget) == 0x0000C8, "Member 'UPCGMetadataSettingsBase::OutputTarget' has a wrong offset!");
static_assert(offsetof(UPCGMetadataSettingsBase, OutputDataFromPin) == 0x000108, "Member 'UPCGMetadataSettingsBase::OutputDataFromPin' has a wrong offset!");
static_assert(offsetof(UPCGMetadataSettingsBase, DefaultValues) == 0x000110, "Member 'UPCGMetadataSettingsBase::DefaultValues' has a wrong offset!");

// Class PCG.PCGAttributeRemapSettings
// 0x0068 (0x01D8 - 0x0170)
class UPCGAttributeRemapSettings final : public UPCGMetadataSettingsBase
{
public:
	struct FPCGAttributePropertyInputSelector     InputSource;                                       // 0x0170(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InRangeMin;                                        // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InRangeMax;                                        // 0x01B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        OutRangeMin;                                       // 0x01C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        OutRangeMax;                                       // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClampToUnitRange;                                 // 0x01D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreValuesOutsideInputRange;                    // 0x01D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowInverseRange;                                // 0x01D2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D3[0x5];                                      // 0x01D3(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAttributeRemapSettings">();
	}
	static class UPCGAttributeRemapSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeRemapSettings>();
	}
};
static_assert(alignof(UPCGAttributeRemapSettings) == 0x000008, "Wrong alignment on UPCGAttributeRemapSettings");
static_assert(sizeof(UPCGAttributeRemapSettings) == 0x0001D8, "Wrong size on UPCGAttributeRemapSettings");
static_assert(offsetof(UPCGAttributeRemapSettings, InputSource) == 0x000170, "Member 'UPCGAttributeRemapSettings::InputSource' has a wrong offset!");
static_assert(offsetof(UPCGAttributeRemapSettings, InRangeMin) == 0x0001B0, "Member 'UPCGAttributeRemapSettings::InRangeMin' has a wrong offset!");
static_assert(offsetof(UPCGAttributeRemapSettings, InRangeMax) == 0x0001B8, "Member 'UPCGAttributeRemapSettings::InRangeMax' has a wrong offset!");
static_assert(offsetof(UPCGAttributeRemapSettings, OutRangeMin) == 0x0001C0, "Member 'UPCGAttributeRemapSettings::OutRangeMin' has a wrong offset!");
static_assert(offsetof(UPCGAttributeRemapSettings, OutRangeMax) == 0x0001C8, "Member 'UPCGAttributeRemapSettings::OutRangeMax' has a wrong offset!");
static_assert(offsetof(UPCGAttributeRemapSettings, bClampToUnitRange) == 0x0001D0, "Member 'UPCGAttributeRemapSettings::bClampToUnitRange' has a wrong offset!");
static_assert(offsetof(UPCGAttributeRemapSettings, bIgnoreValuesOutsideInputRange) == 0x0001D1, "Member 'UPCGAttributeRemapSettings::bIgnoreValuesOutsideInputRange' has a wrong offset!");
static_assert(offsetof(UPCGAttributeRemapSettings, bAllowInverseRange) == 0x0001D2, "Member 'UPCGAttributeRemapSettings::bAllowInverseRange' has a wrong offset!");

// Class PCG.PCGAttributeRemoveDuplicatesSettings
// 0x0020 (0x00E0 - 0x00C0)
class UPCGAttributeRemoveDuplicatesSettings final : public UPCGSettings
{
public:
	TArray<struct FPCGAttributePropertyInputSelector> AttributeSelectors;                            // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 AttributeNamesToRemoveDuplicates;                  // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAttributeRemoveDuplicatesSettings">();
	}
	static class UPCGAttributeRemoveDuplicatesSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeRemoveDuplicatesSettings>();
	}
};
static_assert(alignof(UPCGAttributeRemoveDuplicatesSettings) == 0x000008, "Wrong alignment on UPCGAttributeRemoveDuplicatesSettings");
static_assert(sizeof(UPCGAttributeRemoveDuplicatesSettings) == 0x0000E0, "Wrong size on UPCGAttributeRemoveDuplicatesSettings");
static_assert(offsetof(UPCGAttributeRemoveDuplicatesSettings, AttributeSelectors) == 0x0000C0, "Member 'UPCGAttributeRemoveDuplicatesSettings::AttributeSelectors' has a wrong offset!");
static_assert(offsetof(UPCGAttributeRemoveDuplicatesSettings, AttributeNamesToRemoveDuplicates) == 0x0000D0, "Member 'UPCGAttributeRemoveDuplicatesSettings::AttributeNamesToRemoveDuplicates' has a wrong offset!");

// Class PCG.PCGCopyAttributesSettings
// 0x00D8 (0x0198 - 0x00C0)
class UPCGCopyAttributesSettings : public UPCGSettings
{
public:
	EPCGCopyAttributesOperation                   Operation;                                         // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCopyAllAttributes;                                // 0x00C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCopyAllDomains;                                   // 0x00C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class FName>                MetadataDomainsMapping;                            // 0x00C8(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FPCGAttributePropertyInputSelector     InputSource;                                       // 0x0118(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPCGAttributePropertyOutputSelector    OutputTarget;                                      // 0x0158(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGCopyAttributesSettings">();
	}
	static class UPCGCopyAttributesSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGCopyAttributesSettings>();
	}
};
static_assert(alignof(UPCGCopyAttributesSettings) == 0x000008, "Wrong alignment on UPCGCopyAttributesSettings");
static_assert(sizeof(UPCGCopyAttributesSettings) == 0x000198, "Wrong size on UPCGCopyAttributesSettings");
static_assert(offsetof(UPCGCopyAttributesSettings, Operation) == 0x0000C0, "Member 'UPCGCopyAttributesSettings::Operation' has a wrong offset!");
static_assert(offsetof(UPCGCopyAttributesSettings, bCopyAllAttributes) == 0x0000C4, "Member 'UPCGCopyAttributesSettings::bCopyAllAttributes' has a wrong offset!");
static_assert(offsetof(UPCGCopyAttributesSettings, bCopyAllDomains) == 0x0000C5, "Member 'UPCGCopyAttributesSettings::bCopyAllDomains' has a wrong offset!");
static_assert(offsetof(UPCGCopyAttributesSettings, MetadataDomainsMapping) == 0x0000C8, "Member 'UPCGCopyAttributesSettings::MetadataDomainsMapping' has a wrong offset!");
static_assert(offsetof(UPCGCopyAttributesSettings, InputSource) == 0x000118, "Member 'UPCGCopyAttributesSettings::InputSource' has a wrong offset!");
static_assert(offsetof(UPCGCopyAttributesSettings, OutputTarget) == 0x000158, "Member 'UPCGCopyAttributesSettings::OutputTarget' has a wrong offset!");

// Class PCG.PCGAttributeTransferSettings
// 0x0000 (0x0198 - 0x0198)
class UPCGAttributeTransferSettings final : public UPCGCopyAttributesSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAttributeTransferSettings">();
	}
	static class UPCGAttributeTransferSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeTransferSettings>();
	}
};
static_assert(alignof(UPCGAttributeTransferSettings) == 0x000008, "Wrong alignment on UPCGAttributeTransferSettings");
static_assert(sizeof(UPCGAttributeTransferSettings) == 0x000198, "Wrong size on UPCGAttributeTransferSettings");

// Class PCG.PCGSpatialData
// 0x0050 (0x0098 - 0x0048)
class UPCGSpatialData : public UPCGData
{
public:
	TWeakObjectPtr<class AActor>                  TargetActor;                                       // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKeepZeroDensityPoints;                            // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasCachedLastSelector;                            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     CachedLastSelector;                                // 0x0058(0x0040)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UPCGMetadata* CreateEmptyMetadata();
	void InitializeFromData(const class UPCGSpatialData* InSource, const class UPCGMetadata* InMetadataParentOverride, bool bInheritMetadata, bool bInheritAttributes);
	void InitializeFromDataWithParams(const struct FPCGInitializeFromDataParams& InParams);

	struct FBox GetBounds() const;
	float GetDensityAtPosition(const struct FVector& InPosition) const;
	int32 GetDimension() const;
	struct FVector GetNormal() const;
	struct FBox GetStrictBounds() const;
	bool HasNonTrivialTransform() const;
	class UPCGIntersectionData* K2_IntersectWith(const class UPCGSpatialData* InOther) const;
	class UPCGSpatialData* K2_ProjectOn(const class UPCGSpatialData* InOther, const struct FPCGProjectionParams& InParams) const;
	bool K2_ProjectPoint(const struct FTransform& InTransform, const struct FBox& InBounds, const struct FPCGProjectionParams& InParams, struct FPCGPoint* OutPoint, class UPCGMetadata* OutMetadata) const;
	bool K2_SamplePoint(const struct FTransform& Transform, const struct FBox& Bounds, struct FPCGPoint* OutPoint, class UPCGMetadata* OutMetadata) const;
	class UPCGDifferenceData* K2_Subtract(const class UPCGSpatialData* InOther) const;
	class UPCGUnionData* K2_UnionWith(const class UPCGSpatialData* InOther) const;
	const class UPCGPointData* ToPointData() const;
	const class UPCGPointData* ToPointDataWithContext(struct FPCGContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGSpatialData">();
	}
	static class UPCGSpatialData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSpatialData>();
	}
};
static_assert(alignof(UPCGSpatialData) == 0x000008, "Wrong alignment on UPCGSpatialData");
static_assert(sizeof(UPCGSpatialData) == 0x000098, "Wrong size on UPCGSpatialData");
static_assert(offsetof(UPCGSpatialData, TargetActor) == 0x000048, "Member 'UPCGSpatialData::TargetActor' has a wrong offset!");
static_assert(offsetof(UPCGSpatialData, bKeepZeroDensityPoints) == 0x000050, "Member 'UPCGSpatialData::bKeepZeroDensityPoints' has a wrong offset!");
static_assert(offsetof(UPCGSpatialData, bHasCachedLastSelector) == 0x000051, "Member 'UPCGSpatialData::bHasCachedLastSelector' has a wrong offset!");
static_assert(offsetof(UPCGSpatialData, CachedLastSelector) == 0x000058, "Member 'UPCGSpatialData::CachedLastSelector' has a wrong offset!");

// Class PCG.PCGBasePointData
// 0x0118 (0x01B0 - 0x0098)
class UPCGBasePointData : public UPCGSpatialData
{
public:
	uint8                                         Pad_98[0x118];                                     // 0x0098(0x0118)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_SetPointsFrom(const class UPCGBasePointData* InData, const TArray<int32>& InDataIndices);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGBasePointData">();
	}
	static class UPCGBasePointData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGBasePointData>();
	}
};
static_assert(alignof(UPCGBasePointData) == 0x000008, "Wrong alignment on UPCGBasePointData");
static_assert(sizeof(UPCGBasePointData) == 0x0001B0, "Wrong size on UPCGBasePointData");

// Class PCG.PCGBlurSettings
// 0x00A0 (0x0160 - 0x00C0)
class UPCGBlurSettings final : public UPCGSettings
{
public:
	struct FPCGAttributePropertyInputSelector     InputSource;                                       // 0x00C0(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPCGAttributePropertyOutputSelector    OutputTarget;                                      // 0x0100(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumIterations;                                     // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SearchDistance;                                    // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
