#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PCGProvider

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "ProceduralGeneration_structs.hpp"
#include "PCGProvider_structs.hpp"


namespace SDK
{

// Class PCGProvider.PCGProviderObject
// 0x0018 (0x0040 - 0x0028)
class UPCGProviderObject : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGProviderObject">();
	}
	static class UPCGProviderObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGProviderObject>();
	}
};
static_assert(alignof(UPCGProviderObject) == 0x000008, "Wrong alignment on UPCGProviderObject");
static_assert(sizeof(UPCGProviderObject) == 0x000040, "Wrong size on UPCGProviderObject");

// Class PCGProvider.PCGModuleConfigsObject
// 0x0018 (0x0058 - 0x0040)
class UPCGModuleConfigsObject final : public UPCGProviderObject
{
public:
	TArray<struct FPBGModuleConfig>               ModuleConfigs;                                     // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FPBGModuleISMSetting                   ISMSetting;                                        // 0x0050(0x0001)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGModuleConfigsObject">();
	}
	static class UPCGModuleConfigsObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGModuleConfigsObject>();
	}
};
static_assert(alignof(UPCGModuleConfigsObject) == 0x000008, "Wrong alignment on UPCGModuleConfigsObject");
static_assert(sizeof(UPCGModuleConfigsObject) == 0x000058, "Wrong size on UPCGModuleConfigsObject");
static_assert(offsetof(UPCGModuleConfigsObject, ModuleConfigs) == 0x000040, "Member 'UPCGModuleConfigsObject::ModuleConfigs' has a wrong offset!");
static_assert(offsetof(UPCGModuleConfigsObject, ISMSetting) == 0x000050, "Member 'UPCGModuleConfigsObject::ISMSetting' has a wrong offset!");

// Class PCGProvider.PCGModuleGroupObject
// 0x0020 (0x0060 - 0x0040)
class UPCGModuleGroupObject final : public UPCGProviderObject
{
public:
	bool                                          bIsCornerModule;                                   // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLoop;                                           // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBGModuleMethod                              LoopMethod;                                        // 0x0042(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LoopWeight;                                        // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAutoScale;                                      // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBGModuleConfigs>              Modules;                                           // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGModuleGroupObject">();
	}
	static class UPCGModuleGroupObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGModuleGroupObject>();
	}
};
static_assert(alignof(UPCGModuleGroupObject) == 0x000008, "Wrong alignment on UPCGModuleGroupObject");
static_assert(sizeof(UPCGModuleGroupObject) == 0x000060, "Wrong size on UPCGModuleGroupObject");
static_assert(offsetof(UPCGModuleGroupObject, bIsCornerModule) == 0x000040, "Member 'UPCGModuleGroupObject::bIsCornerModule' has a wrong offset!");
static_assert(offsetof(UPCGModuleGroupObject, bIsLoop) == 0x000041, "Member 'UPCGModuleGroupObject::bIsLoop' has a wrong offset!");
static_assert(offsetof(UPCGModuleGroupObject, LoopMethod) == 0x000042, "Member 'UPCGModuleGroupObject::LoopMethod' has a wrong offset!");
static_assert(offsetof(UPCGModuleGroupObject, LoopWeight) == 0x000044, "Member 'UPCGModuleGroupObject::LoopWeight' has a wrong offset!");
static_assert(offsetof(UPCGModuleGroupObject, bIsAutoScale) == 0x000048, "Member 'UPCGModuleGroupObject::bIsAutoScale' has a wrong offset!");
static_assert(offsetof(UPCGModuleGroupObject, Modules) == 0x000050, "Member 'UPCGModuleGroupObject::Modules' has a wrong offset!");

// Class PCGProvider.PCGWallModuleObject
// 0x0020 (0x0060 - 0x0040)
class UPCGWallModuleObject final : public UPCGProviderObject
{
public:
	TArray<class UPCGModuleGroupObject*>          ModuleGroups;                                      // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FPCGModuleGroupConfig>          ModuleGroupConfig;                                 // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGWallModuleObject">();
	}
	static class UPCGWallModuleObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGWallModuleObject>();
	}
};
static_assert(alignof(UPCGWallModuleObject) == 0x000008, "Wrong alignment on UPCGWallModuleObject");
static_assert(sizeof(UPCGWallModuleObject) == 0x000060, "Wrong size on UPCGWallModuleObject");
static_assert(offsetof(UPCGWallModuleObject, ModuleGroups) == 0x000040, "Member 'UPCGWallModuleObject::ModuleGroups' has a wrong offset!");
static_assert(offsetof(UPCGWallModuleObject, ModuleGroupConfig) == 0x000050, "Member 'UPCGWallModuleObject::ModuleGroupConfig' has a wrong offset!");

// Class PCGProvider.PCGFloorModuleObject
// 0x0040 (0x0080 - 0x0040)
class UPCGFloorModuleObject final : public UPCGProviderObject
{
public:
	int32                                         FloorNum;                                          // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPCGWallModuleObject*>           WallModules;                                       // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UPCGModuleGroupObject*>          CornerModuleGroups;                                // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPBGMaterialModule>             OverrideMaterials;                                 // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          IsRoof;                                            // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGFloorModuleObject">();
	}
	static class UPCGFloorModuleObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGFloorModuleObject>();
	}
};
static_assert(alignof(UPCGFloorModuleObject) == 0x000008, "Wrong alignment on UPCGFloorModuleObject");
static_assert(sizeof(UPCGFloorModuleObject) == 0x000080, "Wrong size on UPCGFloorModuleObject");
static_assert(offsetof(UPCGFloorModuleObject, FloorNum) == 0x000040, "Member 'UPCGFloorModuleObject::FloorNum' has a wrong offset!");
static_assert(offsetof(UPCGFloorModuleObject, WallModules) == 0x000048, "Member 'UPCGFloorModuleObject::WallModules' has a wrong offset!");
static_assert(offsetof(UPCGFloorModuleObject, CornerModuleGroups) == 0x000058, "Member 'UPCGFloorModuleObject::CornerModuleGroups' has a wrong offset!");
static_assert(offsetof(UPCGFloorModuleObject, OverrideMaterials) == 0x000068, "Member 'UPCGFloorModuleObject::OverrideMaterials' has a wrong offset!");
static_assert(offsetof(UPCGFloorModuleObject, IsRoof) == 0x000078, "Member 'UPCGFloorModuleObject::IsRoof' has a wrong offset!");

// Class PCGProvider.PCGBuildModuleObject
// 0x0020 (0x0060 - 0x0040)
class UPCGBuildModuleObject final : public UPCGProviderObject
{
public:
	TArray<class UPCGFloorModuleObject*>          PBGFloorModuleObjects;                             // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPBGFloorModule>                PBGFloorModules;                                   // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGBuildModuleObject">();
	}
	static class UPCGBuildModuleObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGBuildModuleObject>();
	}
};
static_assert(alignof(UPCGBuildModuleObject) == 0x000008, "Wrong alignment on UPCGBuildModuleObject");
static_assert(sizeof(UPCGBuildModuleObject) == 0x000060, "Wrong size on UPCGBuildModuleObject");
static_assert(offsetof(UPCGBuildModuleObject, PBGFloorModuleObjects) == 0x000040, "Member 'UPCGBuildModuleObject::PBGFloorModuleObjects' has a wrong offset!");
static_assert(offsetof(UPCGBuildModuleObject, PBGFloorModules) == 0x000050, "Member 'UPCGBuildModuleObject::PBGFloorModules' has a wrong offset!");

}

