#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PCGProvider

#include "Basic.hpp"

#include "ProceduralGeneration_structs.hpp"


namespace SDK
{

// ScriptStruct PCGProvider.PCGModuleGroupConfig
// 0x0018 (0x0018 - 0x0000)
struct FPCGModuleGroupConfig final
{
public:
	class UPCGModuleGroupObject*                  ModuleGroupObject;                                 // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCornerModule;                                   // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLoop;                                           // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBGModuleMethod                              LoopMethod;                                        // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LoopWeight;                                        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAutoScale;                                      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPCGModuleGroupConfig) == 0x000008, "Wrong alignment on FPCGModuleGroupConfig");
static_assert(sizeof(FPCGModuleGroupConfig) == 0x000018, "Wrong size on FPCGModuleGroupConfig");
static_assert(offsetof(FPCGModuleGroupConfig, ModuleGroupObject) == 0x000000, "Member 'FPCGModuleGroupConfig::ModuleGroupObject' has a wrong offset!");
static_assert(offsetof(FPCGModuleGroupConfig, bIsCornerModule) == 0x000008, "Member 'FPCGModuleGroupConfig::bIsCornerModule' has a wrong offset!");
static_assert(offsetof(FPCGModuleGroupConfig, bIsLoop) == 0x000009, "Member 'FPCGModuleGroupConfig::bIsLoop' has a wrong offset!");
static_assert(offsetof(FPCGModuleGroupConfig, LoopMethod) == 0x00000A, "Member 'FPCGModuleGroupConfig::LoopMethod' has a wrong offset!");
static_assert(offsetof(FPCGModuleGroupConfig, LoopWeight) == 0x00000C, "Member 'FPCGModuleGroupConfig::LoopWeight' has a wrong offset!");
static_assert(offsetof(FPCGModuleGroupConfig, bIsAutoScale) == 0x000010, "Member 'FPCGModuleGroupConfig::bIsAutoScale' has a wrong offset!");

}

