#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PDRCDynamics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum PDRCDynamics.ESurfaceColliderType
// NumValues: 0x0004
enum class ESurfaceColliderType : uint8
{
	Off                                      = 0,
	PUSH                                     = 1,
	PULL                                     = 2,
	ESurfaceColliderType_MAX                 = 3,
};

// Enum PDRCDynamics.EInitialControlPointsShape
// NumValues: 0x0003
enum class EInitialControlPointsShape : uint8
{
	RefPose                                  = 0,
	FirstFrameOfArtAnim                      = 1,
	EInitialControlPointsShape_MAX           = 2,
};

// Enum PDRCDynamics.EPDRCStylizedMotionType
// NumValues: 0x0006
enum class EPDRCStylizedMotionType : uint8
{
	None                                     = 0,
	CartoonBounce                            = 1,
	ExaggeratedSwing                         = 2,
	SmoothFluid                              = 3,
	Custom                                   = 4,
	EPDRCStylizedMotionType_MAX              = 5,
};

// Enum PDRCDynamics.EPDRCIntegrationMethod
// NumValues: 0x0006
enum class EPDRCIntegrationMethod : uint8
{
	Verlet                                   = 0,
	SemiImplicitEuler                        = 1,
	RungeKutta2                              = 2,
	RungeKutta4                              = 3,
	KawaiiPhysics                            = 4,
	EPDRCIntegrationMethod_MAX               = 5,
};

// ScriptStruct PDRCDynamics.PDRCDynamicBody
// 0x00E0 (0x00E0 - 0x0000)
struct FPDRCDynamicBody final
{
public:
	struct FBoneReference                         TargetBone;                                        // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bPlane;                                            // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0xF];                                       // 0x0011(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0020(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0084(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Friction;                                          // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  Rotation;                                          // 0x00B0(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESurfaceColliderType                          SurfaceColliderType;                               // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0xF];                                       // 0x00D1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPDRCDynamicBody) == 0x000004, "Wrong alignment on FPDRCDynamicBody");
static_assert(sizeof(FPDRCDynamicBody) == 0x0000E0, "Wrong size on FPDRCDynamicBody");
static_assert(offsetof(FPDRCDynamicBody, TargetBone) == 0x000000, "Member 'FPDRCDynamicBody::TargetBone' has a wrong offset!");
static_assert(offsetof(FPDRCDynamicBody, bPlane) == 0x000010, "Member 'FPDRCDynamicBody::bPlane' has a wrong offset!");
static_assert(offsetof(FPDRCDynamicBody, Transform) == 0x000020, "Member 'FPDRCDynamicBody::Transform' has a wrong offset!");
static_assert(offsetof(FPDRCDynamicBody, Height) == 0x000080, "Member 'FPDRCDynamicBody::Height' has a wrong offset!");
static_assert(offsetof(FPDRCDynamicBody, Radius) == 0x000084, "Member 'FPDRCDynamicBody::Radius' has a wrong offset!");
static_assert(offsetof(FPDRCDynamicBody, Friction) == 0x000088, "Member 'FPDRCDynamicBody::Friction' has a wrong offset!");
static_assert(offsetof(FPDRCDynamicBody, Location) == 0x000090, "Member 'FPDRCDynamicBody::Location' has a wrong offset!");
static_assert(offsetof(FPDRCDynamicBody, Rotation) == 0x0000B0, "Member 'FPDRCDynamicBody::Rotation' has a wrong offset!");
static_assert(offsetof(FPDRCDynamicBody, SurfaceColliderType) == 0x0000D0, "Member 'FPDRCDynamicBody::SurfaceColliderType' has a wrong offset!");

// ScriptStruct PDRCDynamics.PDRCJointPair
// 0x0020 (0x0020 - 0x0000)
struct FPDRCJointPair final
{
public:
	struct FBoneReference                         RootBone;                                          // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         EndBone;                                           // 0x0010(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPDRCJointPair) == 0x000001, "Wrong alignment on FPDRCJointPair");
static_assert(sizeof(FPDRCJointPair) == 0x000020, "Wrong size on FPDRCJointPair");
static_assert(offsetof(FPDRCJointPair, RootBone) == 0x000000, "Member 'FPDRCJointPair::RootBone' has a wrong offset!");
static_assert(offsetof(FPDRCJointPair, EndBone) == 0x000010, "Member 'FPDRCJointPair::EndBone' has a wrong offset!");

// ScriptStruct PDRCDynamics.PDRCCurveZero
// 0x0010 (0x0010 - 0x0000)
struct FPDRCCurveZero final
{
public:
	class UCurveFloat*                            Curve;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Power;                                             // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPDRCCurveZero) == 0x000008, "Wrong alignment on FPDRCCurveZero");
static_assert(sizeof(FPDRCCurveZero) == 0x000010, "Wrong size on FPDRCCurveZero");
static_assert(offsetof(FPDRCCurveZero, Curve) == 0x000000, "Member 'FPDRCCurveZero::Curve' has a wrong offset!");
static_assert(offsetof(FPDRCCurveZero, Power) == 0x000008, "Member 'FPDRCCurveZero::Power' has a wrong offset!");

// ScriptStruct PDRCDynamics.PDRCCurve
// 0x0010 (0x0010 - 0x0000)
struct FPDRCCurve final
{
public:
	class UCurveFloat*                            Curve;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Power;                                             // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPDRCCurve) == 0x000008, "Wrong alignment on FPDRCCurve");
static_assert(sizeof(FPDRCCurve) == 0x000010, "Wrong size on FPDRCCurve");
static_assert(offsetof(FPDRCCurve, Curve) == 0x000000, "Member 'FPDRCCurve::Curve' has a wrong offset!");
static_assert(offsetof(FPDRCCurve, Power) == 0x000008, "Member 'FPDRCCurve::Power' has a wrong offset!");

// ScriptStruct PDRCDynamics.PDRCForcesInfo
// 0x00C8 (0x00C8 - 0x0000)
struct FPDRCForcesInfo final
{
public:
	bool                                          bUseLift;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPDRCCurveZero                         Hardness;                                          // 0x0008(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Damping;                                           // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPDRCCurve                             DampingCurve;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         LiftCoefficient;                                   // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPDRCCurve                             LiftCurve;                                         // 0x0038(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Gravity;                                           // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPDRCCurve                             GravityCurve;                                      // 0x0060(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseSceneWind;                                     // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SceneWindScale;                                    // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindForceSpeed;                                    // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                WindForce;                                         // 0x0080(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindRandFactorMin;                                 // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindRandFactorMax;                                 // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPDRCCurve                             WorldVeloInfluenceCurves;                          // 0x00A0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEnableClothSoftening;                             // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ClothSoftness;                                     // 0x00B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ParentDragInfluence;                               // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MotionAmplification;                               // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            ClothStiffnessCurve;                               // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPDRCForcesInfo) == 0x000008, "Wrong alignment on FPDRCForcesInfo");
static_assert(sizeof(FPDRCForcesInfo) == 0x0000C8, "Wrong size on FPDRCForcesInfo");
static_assert(offsetof(FPDRCForcesInfo, bUseLift) == 0x000000, "Member 'FPDRCForcesInfo::bUseLift' has a wrong offset!");
static_assert(offsetof(FPDRCForcesInfo, Hardness) == 0x000008, "Member 'FPDRCForcesInfo::Hardness' has a wrong offset!");
static_assert(offsetof(FPDRCForcesInfo, Damping) == 0x000018, "Member 'FPDRCForcesInfo::Damping' has a wrong offset!");
static_assert(offsetof(FPDRCForcesInfo, DampingCurve) == 0x000020, "Member 'FPDRCForcesInfo::DampingCurve' has a wrong offset!");
static_assert(offsetof(FPDRCForcesInfo, LiftCoefficient) == 0x000030, "Member 'FPDRCForcesInfo::LiftCoefficient' has a wrong offset!");
static_assert(offsetof(FPDRCForcesInfo, LiftCurve) == 0x000038, "Member 'FPDRCForcesInfo::LiftCurve' has a wrong offset!");
static_assert(offsetof(FPDRCForcesInfo, Gravity) == 0x000048, "Member 'FPDRCForcesInfo::Gravity' has a wrong offset!");
static_assert(offsetof(FPDRCForcesInfo, GravityCurve) == 0x000060, "Member 'FPDRCForcesInfo::GravityCurve' has a wrong offset!");
static_assert(offsetof(FPDRCForcesInfo, bUseSceneWind) == 0x000070, "Member 'FPDRCForcesInfo::bUseSceneWind' has a wrong offset!");
static_assert(offsetof(FPDRCForcesInfo, SceneWindScale) == 0x000074, "Member 'FPDRCForcesInfo::SceneWindScale' has a wrong offset!");
static_assert(offsetof(FPDRCForcesInfo, WindForceSpeed) == 0x000078, "Member 'FPDRCForcesInfo::WindForceSpeed' has a wrong offset!");
static_assert(offsetof(FPDRCForcesInfo, WindForce) == 0x000080, "Member 'FPDRCForcesInfo::WindForce' has a wrong offset!");
static_assert(offsetof(FPDRCForcesInfo, WindRandFactorMin) == 0x000098, "Member 'FPDRCForcesInfo::WindRandFactorMin' has a wrong offset!");
static_assert(offsetof(FPDRCForcesInfo, WindRandFactorMax) == 0x00009C, "Member 'FPDRCForcesInfo::WindRandFactorMax' has a wrong offset!");
static_assert(offsetof(FPDRCForcesInfo, WorldVeloInfluenceCurves) == 0x0000A0, "Member 'FPDRCForcesInfo::WorldVeloInfluenceCurves' has a wrong offset!");
static_assert(offsetof(FPDRCForcesInfo, bEnableClothSoftening) == 0x0000B0, "Member 'FPDRCForcesInfo::bEnableClothSoftening' has a wrong offset!");
static_assert(offsetof(FPDRCForcesInfo, ClothSoftness) == 0x0000B4, "Member 'FPDRCForcesInfo::ClothSoftness' has a wrong offset!");
static_assert(offsetof(FPDRCForcesInfo, ParentDragInfluence) == 0x0000B8, "Member 'FPDRCForcesInfo::ParentDragInfluence' has a wrong offset!");
static_assert(offsetof(FPDRCForcesInfo, MotionAmplification) == 0x0000BC, "Member 'FPDRCForcesInfo::MotionAmplification' has a wrong offset!");
static_assert(offsetof(FPDRCForcesInfo, ClothStiffnessCurve) == 0x0000C0, "Member 'FPDRCForcesInfo::ClothStiffnessCurve' has a wrong offset!");

// ScriptStruct PDRCDynamics.PDRCConstraintInfo
// 0x00C8 (0x00C8 - 0x0000)
struct FPDRCConstraintInfo final
{
public:
	bool                                          bStructural_Vertical;                              // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStructural_Vertical_Collision;                    // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPDRCCurve                             Structural_Vertical_Shrink;                        // 0x0008(0x0010)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FPDRCCurve                             Structural_Vertical_Stretch;                       // 0x0018(0x0010)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	bool                                          bStructural_Horizontal;                            // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStructural_Horizontal_Collision;                  // 0x0029(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPDRCCurve                             Structural_Horizontal_Shrink;                      // 0x0030(0x0010)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FPDRCCurve                             Structural_Horizontal_Stretch;                     // 0x0040(0x0010)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	bool                                          bShear;                                            // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShear_Collision;                                  // 0x0051(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPDRCCurve                             Shear_Shrink;                                      // 0x0058(0x0010)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FPDRCCurve                             Shear_Stretch;                                     // 0x0068(0x0010)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	bool                                          bBending_Vertical;                                 // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPDRCCurve                             Bending_Vertical_Shrink;                           // 0x0080(0x0010)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FPDRCCurve                             Bending_Vertical_Stretch;                          // 0x0090(0x0010)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	bool                                          bBending_Horizontal;                               // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPDRCCurve                             Bending_Horizontal_Shrink;                         // 0x00A8(0x0010)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FPDRCCurve                             Bending_Horizontal_Stretch;                        // 0x00B8(0x0010)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPDRCConstraintInfo) == 0x000001, "Wrong alignment on FPDRCConstraintInfo");
static_assert(sizeof(FPDRCConstraintInfo) == 0x0000C8, "Wrong size on FPDRCConstraintInfo");
static_assert(offsetof(FPDRCConstraintInfo, bStructural_Vertical) == 0x000000, "Member 'FPDRCConstraintInfo::bStructural_Vertical' has a wrong offset!");
static_assert(offsetof(FPDRCConstraintInfo, bStructural_Vertical_Collision) == 0x000001, "Member 'FPDRCConstraintInfo::bStructural_Vertical_Collision' has a wrong offset!");
static_assert(offsetof(FPDRCConstraintInfo, Structural_Vertical_Shrink) == 0x000008, "Member 'FPDRCConstraintInfo::Structural_Vertical_Shrink' has a wrong offset!");
static_assert(offsetof(FPDRCConstraintInfo, Structural_Vertical_Stretch) == 0x000018, "Member 'FPDRCConstraintInfo::Structural_Vertical_Stretch' has a wrong offset!");
static_assert(offsetof(FPDRCConstraintInfo, bStructural_Horizontal) == 0x000028, "Member 'FPDRCConstraintInfo::bStructural_Horizontal' has a wrong offset!");
static_assert(offsetof(FPDRCConstraintInfo, bStructural_Horizontal_Collision) == 0x000029, "Member 'FPDRCConstraintInfo::bStructural_Horizontal_Collision' has a wrong offset!");
static_assert(offsetof(FPDRCConstraintInfo, Structural_Horizontal_Shrink) == 0x000030, "Member 'FPDRCConstraintInfo::Structural_Horizontal_Shrink' has a wrong offset!");
static_assert(offsetof(FPDRCConstraintInfo, Structural_Horizontal_Stretch) == 0x000040, "Member 'FPDRCConstraintInfo::Structural_Horizontal_Stretch' has a wrong offset!");
static_assert(offsetof(FPDRCConstraintInfo, bShear) == 0x000050, "Member 'FPDRCConstraintInfo::bShear' has a wrong offset!");
static_assert(offsetof(FPDRCConstraintInfo, bShear_Collision) == 0x000051, "Member 'FPDRCConstraintInfo::bShear_Collision' has a wrong offset!");
static_assert(offsetof(FPDRCConstraintInfo, Shear_Shrink) == 0x000058, "Member 'FPDRCConstraintInfo::Shear_Shrink' has a wrong offset!");
static_assert(offsetof(FPDRCConstraintInfo, Shear_Stretch) == 0x000068, "Member 'FPDRCConstraintInfo::Shear_Stretch' has a wrong offset!");
static_assert(offsetof(FPDRCConstraintInfo, bBending_Vertical) == 0x000078, "Member 'FPDRCConstraintInfo::bBending_Vertical' has a wrong offset!");
static_assert(offsetof(FPDRCConstraintInfo, Bending_Vertical_Shrink) == 0x000080, "Member 'FPDRCConstraintInfo::Bending_Vertical_Shrink' has a wrong offset!");
static_assert(offsetof(FPDRCConstraintInfo, Bending_Vertical_Stretch) == 0x000090, "Member 'FPDRCConstraintInfo::Bending_Vertical_Stretch' has a wrong offset!");
static_assert(offsetof(FPDRCConstraintInfo, bBending_Horizontal) == 0x0000A0, "Member 'FPDRCConstraintInfo::bBending_Horizontal' has a wrong offset!");
static_assert(offsetof(FPDRCConstraintInfo, Bending_Horizontal_Shrink) == 0x0000A8, "Member 'FPDRCConstraintInfo::Bending_Horizontal_Shrink' has a wrong offset!");
static_assert(offsetof(FPDRCConstraintInfo, Bending_Horizontal_Stretch) == 0x0000B8, "Member 'FPDRCConstraintInfo::Bending_Horizontal_Stretch' has a wrong offset!");

// ScriptStruct PDRCDynamics.PDRCStylizedMotionConfig
// 0x0030 (0x0030 - 0x0000)
struct FPDRCStylizedMotionConfig final
{
public:
	EPDRCStylizedMotionType                       MotionType;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Elasticity;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Exaggeration;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Smoothness;                                        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Responsiveness;                                    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GravityInfluence;                                  // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableTrajectoryStylization;                      // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TrajectoryCurvature;                               // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TrajectoryWaveFrequency;                           // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableTimeWarping;                                // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            TimeWarpCurve;                                     // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPDRCStylizedMotionConfig) == 0x000008, "Wrong alignment on FPDRCStylizedMotionConfig");
static_assert(sizeof(FPDRCStylizedMotionConfig) == 0x000030, "Wrong size on FPDRCStylizedMotionConfig");
static_assert(offsetof(FPDRCStylizedMotionConfig, MotionType) == 0x000000, "Member 'FPDRCStylizedMotionConfig::MotionType' has a wrong offset!");
static_assert(offsetof(FPDRCStylizedMotionConfig, Elasticity) == 0x000004, "Member 'FPDRCStylizedMotionConfig::Elasticity' has a wrong offset!");
static_assert(offsetof(FPDRCStylizedMotionConfig, Exaggeration) == 0x000008, "Member 'FPDRCStylizedMotionConfig::Exaggeration' has a wrong offset!");
static_assert(offsetof(FPDRCStylizedMotionConfig, Smoothness) == 0x00000C, "Member 'FPDRCStylizedMotionConfig::Smoothness' has a wrong offset!");
static_assert(offsetof(FPDRCStylizedMotionConfig, Responsiveness) == 0x000010, "Member 'FPDRCStylizedMotionConfig::Responsiveness' has a wrong offset!");
static_assert(offsetof(FPDRCStylizedMotionConfig, GravityInfluence) == 0x000014, "Member 'FPDRCStylizedMotionConfig::GravityInfluence' has a wrong offset!");
static_assert(offsetof(FPDRCStylizedMotionConfig, bEnableTrajectoryStylization) == 0x000018, "Member 'FPDRCStylizedMotionConfig::bEnableTrajectoryStylization' has a wrong offset!");
static_assert(offsetof(FPDRCStylizedMotionConfig, TrajectoryCurvature) == 0x00001C, "Member 'FPDRCStylizedMotionConfig::TrajectoryCurvature' has a wrong offset!");
static_assert(offsetof(FPDRCStylizedMotionConfig, TrajectoryWaveFrequency) == 0x000020, "Member 'FPDRCStylizedMotionConfig::TrajectoryWaveFrequency' has a wrong offset!");
static_assert(offsetof(FPDRCStylizedMotionConfig, bEnableTimeWarping) == 0x000024, "Member 'FPDRCStylizedMotionConfig::bEnableTimeWarping' has a wrong offset!");
static_assert(offsetof(FPDRCStylizedMotionConfig, TimeWarpCurve) == 0x000028, "Member 'FPDRCStylizedMotionConfig::TimeWarpCurve' has a wrong offset!");

// ScriptStruct PDRCDynamics.AnimNode_PDRCDynamics
// 0x05B8 (0x0680 - 0x00C8)
struct FAnimNode_PDRCDynamics final : public FAnimNode_SkeletalControlBase
{
public:
	EPDRCIntegrationMethod                        IntegrationMethod;                                 // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPDRCJointPair>                 JointPairs;                                        // 0x00D0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bSimulateInWorldSpace;                             // 0x00E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableNonPhysicsOptimization;                     // 0x00E1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSmoothLerping;                                 // 0x00E2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E3[0x1];                                       // 0x00E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SmoothLerpingFactors;                              // 0x00E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceLengthLimit;                                 // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TeleportDistanceThreshold;                         // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LengthConstraintStiffness;                         // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKawaiiInWorldGravity;                             // 0x00F4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LengthConstraintTolerance;                         // 0x00F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WorldDampingLocation;                              // 0x00FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WorldDampingRotation;                              // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPDRCForcesInfo                        ForcesInfo;                                        // 0x0108(0x00C8)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bApplyWorldVelocityAsForces;                       // 0x01D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyWorldVelocityInfluenceCurves;                // 0x01D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D2[0x6];                                      // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPDRCCurveZero                         WorldVelocityInfluenceCurves;                      // 0x01D8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         WorldVelocityInfluence;                            // 0x01E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WorldVelocitySmoothRatio;                          // 0x01EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseDataAssets;                                    // 0x01F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPDRCForcesDataAsset*                   ForcesDataAsset;                                   // 0x01F8(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VirtualBoneLength;                                 // 0x0200(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FixedPointIndex;                                   // 0x0204(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Structural_Vertical_StepCount;                     // 0x0208(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bJointLoop;                                        // 0x020C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInitialControlPointsShape                    InitialControlPointsShape;                         // 0x020D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20E[0x2];                                      // 0x020E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPDRCConstraintInfo                    ConstraintsInfo;                                   // 0x0210(0x00C8)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseSurfaceCollision;                              // 0x02D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WriteID;                                           // 0x02DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 ReadID;                                            // 0x02E0(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	TArray<struct FPDRCDynamicBody>               Bodies;                                            // 0x02F0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         PointsCollisionRadius;                             // 0x0300(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPDRCDynamicsComponent*                 PDRCDynamicsComponent;                             // 0x0308(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLimitAngle;                                       // 0x0310(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AngleLimitInDegree;                                // 0x0314(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BoneIndicesToAffect;                               // 0x0318(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLimitFromRoot;                                    // 0x031C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxDisplacementLength;                             // 0x0320(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebugAngleLimits;                                 // 0x0324(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableStylizedMotion;                             // 0x0325(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_326[0x2];                                      // 0x0326(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPDRCStylizedMotionConfig              StylizedMotionConfig;                              // 0x0328(0x0030)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseBoneWeighting;                                 // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            StylizedWeightCurve;                               // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_368[0x218];                                    // 0x0368(0x0218)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableSceneCollision;                             // 0x0580(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreSelfComponent;                              // 0x0581(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_582[0x2];                                      // 0x0582(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCollisionProfileName                  SceneCollisionProfile;                             // 0x0584(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	ECollisionChannel                             SceneCollisionChannel;                             // 0x058C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58D[0x3];                                      // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBoneReference>                 SceneCollisionIgnoreBones;                         // 0x0590(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           SceneCollisionIgnoreBoneNamePrefix;                // 0x05A0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bEnableLOD;                                        // 0x05B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B1[0x3];                                      // 0x05B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ForcedLODLevel;                                    // 0x05B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyLODToConstraints;                            // 0x05B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B9[0xC7];                                     // 0x05B9(0x00C7)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_PDRCDynamics) == 0x000008, "Wrong alignment on FAnimNode_PDRCDynamics");
static_assert(sizeof(FAnimNode_PDRCDynamics) == 0x000680, "Wrong size on FAnimNode_PDRCDynamics");
static_assert(offsetof(FAnimNode_PDRCDynamics, IntegrationMethod) == 0x0000C8, "Member 'FAnimNode_PDRCDynamics::IntegrationMethod' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, JointPairs) == 0x0000D0, "Member 'FAnimNode_PDRCDynamics::JointPairs' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, bSimulateInWorldSpace) == 0x0000E0, "Member 'FAnimNode_PDRCDynamics::bSimulateInWorldSpace' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, bEnableNonPhysicsOptimization) == 0x0000E1, "Member 'FAnimNode_PDRCDynamics::bEnableNonPhysicsOptimization' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, bUseSmoothLerping) == 0x0000E2, "Member 'FAnimNode_PDRCDynamics::bUseSmoothLerping' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, SmoothLerpingFactors) == 0x0000E4, "Member 'FAnimNode_PDRCDynamics::SmoothLerpingFactors' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, bForceLengthLimit) == 0x0000E8, "Member 'FAnimNode_PDRCDynamics::bForceLengthLimit' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, TeleportDistanceThreshold) == 0x0000EC, "Member 'FAnimNode_PDRCDynamics::TeleportDistanceThreshold' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, LengthConstraintStiffness) == 0x0000F0, "Member 'FAnimNode_PDRCDynamics::LengthConstraintStiffness' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, bKawaiiInWorldGravity) == 0x0000F4, "Member 'FAnimNode_PDRCDynamics::bKawaiiInWorldGravity' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, LengthConstraintTolerance) == 0x0000F8, "Member 'FAnimNode_PDRCDynamics::LengthConstraintTolerance' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, WorldDampingLocation) == 0x0000FC, "Member 'FAnimNode_PDRCDynamics::WorldDampingLocation' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, WorldDampingRotation) == 0x000100, "Member 'FAnimNode_PDRCDynamics::WorldDampingRotation' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, ForcesInfo) == 0x000108, "Member 'FAnimNode_PDRCDynamics::ForcesInfo' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, bApplyWorldVelocityAsForces) == 0x0001D0, "Member 'FAnimNode_PDRCDynamics::bApplyWorldVelocityAsForces' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, bApplyWorldVelocityInfluenceCurves) == 0x0001D1, "Member 'FAnimNode_PDRCDynamics::bApplyWorldVelocityInfluenceCurves' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, WorldVelocityInfluenceCurves) == 0x0001D8, "Member 'FAnimNode_PDRCDynamics::WorldVelocityInfluenceCurves' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, WorldVelocityInfluence) == 0x0001E8, "Member 'FAnimNode_PDRCDynamics::WorldVelocityInfluence' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, WorldVelocitySmoothRatio) == 0x0001EC, "Member 'FAnimNode_PDRCDynamics::WorldVelocitySmoothRatio' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, bUseDataAssets) == 0x0001F0, "Member 'FAnimNode_PDRCDynamics::bUseDataAssets' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, ForcesDataAsset) == 0x0001F8, "Member 'FAnimNode_PDRCDynamics::ForcesDataAsset' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, VirtualBoneLength) == 0x000200, "Member 'FAnimNode_PDRCDynamics::VirtualBoneLength' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, FixedPointIndex) == 0x000204, "Member 'FAnimNode_PDRCDynamics::FixedPointIndex' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, Structural_Vertical_StepCount) == 0x000208, "Member 'FAnimNode_PDRCDynamics::Structural_Vertical_StepCount' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, bJointLoop) == 0x00020C, "Member 'FAnimNode_PDRCDynamics::bJointLoop' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, InitialControlPointsShape) == 0x00020D, "Member 'FAnimNode_PDRCDynamics::InitialControlPointsShape' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, ConstraintsInfo) == 0x000210, "Member 'FAnimNode_PDRCDynamics::ConstraintsInfo' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, bUseSurfaceCollision) == 0x0002D8, "Member 'FAnimNode_PDRCDynamics::bUseSurfaceCollision' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, WriteID) == 0x0002DC, "Member 'FAnimNode_PDRCDynamics::WriteID' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, ReadID) == 0x0002E0, "Member 'FAnimNode_PDRCDynamics::ReadID' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, Bodies) == 0x0002F0, "Member 'FAnimNode_PDRCDynamics::Bodies' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, PointsCollisionRadius) == 0x000300, "Member 'FAnimNode_PDRCDynamics::PointsCollisionRadius' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, PDRCDynamicsComponent) == 0x000308, "Member 'FAnimNode_PDRCDynamics::PDRCDynamicsComponent' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, bLimitAngle) == 0x000310, "Member 'FAnimNode_PDRCDynamics::bLimitAngle' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, AngleLimitInDegree) == 0x000314, "Member 'FAnimNode_PDRCDynamics::AngleLimitInDegree' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, BoneIndicesToAffect) == 0x000318, "Member 'FAnimNode_PDRCDynamics::BoneIndicesToAffect' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, bLimitFromRoot) == 0x00031C, "Member 'FAnimNode_PDRCDynamics::bLimitFromRoot' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, MaxDisplacementLength) == 0x000320, "Member 'FAnimNode_PDRCDynamics::MaxDisplacementLength' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, bDebugAngleLimits) == 0x000324, "Member 'FAnimNode_PDRCDynamics::bDebugAngleLimits' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, bEnableStylizedMotion) == 0x000325, "Member 'FAnimNode_PDRCDynamics::bEnableStylizedMotion' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, StylizedMotionConfig) == 0x000328, "Member 'FAnimNode_PDRCDynamics::StylizedMotionConfig' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, bUseBoneWeighting) == 0x000358, "Member 'FAnimNode_PDRCDynamics::bUseBoneWeighting' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, StylizedWeightCurve) == 0x000360, "Member 'FAnimNode_PDRCDynamics::StylizedWeightCurve' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, bEnableSceneCollision) == 0x000580, "Member 'FAnimNode_PDRCDynamics::bEnableSceneCollision' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, bIgnoreSelfComponent) == 0x000581, "Member 'FAnimNode_PDRCDynamics::bIgnoreSelfComponent' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, SceneCollisionProfile) == 0x000584, "Member 'FAnimNode_PDRCDynamics::SceneCollisionProfile' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, SceneCollisionChannel) == 0x00058C, "Member 'FAnimNode_PDRCDynamics::SceneCollisionChannel' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, SceneCollisionIgnoreBones) == 0x000590, "Member 'FAnimNode_PDRCDynamics::SceneCollisionIgnoreBones' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, SceneCollisionIgnoreBoneNamePrefix) == 0x0005A0, "Member 'FAnimNode_PDRCDynamics::SceneCollisionIgnoreBoneNamePrefix' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, bEnableLOD) == 0x0005B0, "Member 'FAnimNode_PDRCDynamics::bEnableLOD' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, ForcedLODLevel) == 0x0005B4, "Member 'FAnimNode_PDRCDynamics::ForcedLODLevel' has a wrong offset!");
static_assert(offsetof(FAnimNode_PDRCDynamics, bApplyLODToConstraints) == 0x0005B8, "Member 'FAnimNode_PDRCDynamics::bApplyLODToConstraints' has a wrong offset!");

// ScriptStruct PDRCDynamics.PDRCCollider
// 0x00F0 (0x00F0 - 0x0000)
struct FPDRCCollider final
{
public:
	uint8                                         Pad_0[0xF0];                                       // 0x0000(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPDRCCollider) == 0x000001, "Wrong alignment on FPDRCCollider");
static_assert(sizeof(FPDRCCollider) == 0x0000F0, "Wrong size on FPDRCCollider");

}

