#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PDRCDynamics

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "PDRCDynamics_structs.hpp"


namespace SDK
{

// Class PDRCDynamics.PDRCDynamicsComponent
// 0x0008 (0x00C8 - 0x00C0)
class UPDRCDynamicsComponent final : public UActorComponent
{
public:
	bool                                          IsReset;                                           // 0x00C0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PDRCDynamicsComponent">();
	}
	static class UPDRCDynamicsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPDRCDynamicsComponent>();
	}
};
static_assert(alignof(UPDRCDynamicsComponent) == 0x000008, "Wrong alignment on UPDRCDynamicsComponent");
static_assert(sizeof(UPDRCDynamicsComponent) == 0x0000C8, "Wrong size on UPDRCDynamicsComponent");
static_assert(offsetof(UPDRCDynamicsComponent, IsReset) == 0x0000C0, "Member 'UPDRCDynamicsComponent::IsReset' has a wrong offset!");

// Class PDRCDynamics.PDRCDynamicsMngComponent
// 0x0010 (0x00D0 - 0x00C0)
class UPDRCDynamicsMngComponent final : public UActorComponent
{
public:
	uint8                                         Pad_C0[0x10];                                      // 0x00C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnReset();
	void SetActors();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PDRCDynamicsMngComponent">();
	}
	static class UPDRCDynamicsMngComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPDRCDynamicsMngComponent>();
	}
};
static_assert(alignof(UPDRCDynamicsMngComponent) == 0x000008, "Wrong alignment on UPDRCDynamicsMngComponent");
static_assert(sizeof(UPDRCDynamicsMngComponent) == 0x0000D0, "Wrong size on UPDRCDynamicsMngComponent");

// Class PDRCDynamics.PDRCDynamicsRuntimeSettings
// 0x0000 (0x0028 - 0x0028)
class UPDRCDynamicsRuntimeSettings final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PDRCDynamicsRuntimeSettings">();
	}
	static class UPDRCDynamicsRuntimeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPDRCDynamicsRuntimeSettings>();
	}
};
static_assert(alignof(UPDRCDynamicsRuntimeSettings) == 0x000008, "Wrong alignment on UPDRCDynamicsRuntimeSettings");
static_assert(sizeof(UPDRCDynamicsRuntimeSettings) == 0x000028, "Wrong size on UPDRCDynamicsRuntimeSettings");

// Class PDRCDynamics.PDRCForcesDataAsset
// 0x00C8 (0x00F8 - 0x0030)
class UPDRCForcesDataAsset final : public UDataAsset
{
public:
	struct FPDRCForcesInfo                        ForcesInfo;                                        // 0x0030(0x00C8)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PDRCForcesDataAsset">();
	}
	static class UPDRCForcesDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPDRCForcesDataAsset>();
	}
};
static_assert(alignof(UPDRCForcesDataAsset) == 0x000008, "Wrong alignment on UPDRCForcesDataAsset");
static_assert(sizeof(UPDRCForcesDataAsset) == 0x0000F8, "Wrong size on UPDRCForcesDataAsset");
static_assert(offsetof(UPDRCForcesDataAsset, ForcesInfo) == 0x000030, "Member 'UPDRCForcesDataAsset::ForcesInfo' has a wrong offset!");

// Class PDRCDynamics.PDRCDynamicsStaticFunctions
// 0x0000 (0x0028 - 0x0028)
class UPDRCDynamicsStaticFunctions final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PDRCDynamicsStaticFunctions">();
	}
	static class UPDRCDynamicsStaticFunctions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPDRCDynamicsStaticFunctions>();
	}
};
static_assert(alignof(UPDRCDynamicsStaticFunctions) == 0x000008, "Wrong alignment on UPDRCDynamicsStaticFunctions");
static_assert(sizeof(UPDRCDynamicsStaticFunctions) == 0x000028, "Wrong size on UPDRCDynamicsStaticFunctions");

}

