#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PointCloud

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum PointCloud.EFilterMode
// NumValues: 0x0004
enum class EFilterMode : uint8
{
	FILTER_Or                                = 0,
	FILTER_And                               = 1,
	FILTER_Not                               = 2,
	FILTER_MAX                               = 3,
};

// Enum PointCloud.EPointCloudBoundsOption
// NumValues: 0x0003
enum class EPointCloudBoundsOption : uint8
{
	Compute                                  = 0,
	Manual                                   = 1,
	EPointCloudBoundsOption_MAX              = 2,
};

// Enum PointCloud.EPointCloudPivotType
// NumValues: 0x0005
enum class EPointCloudPivotType : uint8
{
	Default                                  = 0,
	WorldOrigin                              = 1,
	Center                                   = 2,
	CenterMinZ                               = 3,
	EPointCloudPivotType_MAX                 = 4,
};

// Enum PointCloud.EPointCloudReportLevel
// NumValues: 0x0004
enum class EPointCloudReportLevel : uint8
{
	Basic                                    = 0,
	Properties                               = 1,
	Values                                   = 2,
	EPointCloudReportLevel_MAX               = 3,
};

// Enum PointCloud.EPointCloudReloadBehavior
// NumValues: 0x0003
enum class EPointCloudReloadBehavior : uint8
{
	DontReload                               = 0,
	ReloadOnRun                              = 1,
	EPointCloudReloadBehavior_MAX            = 2,
};

// Enum PointCloud.EPointCloudReportMode
// NumValues: 0x0005
enum class EPointCloudReportMode : uint8
{
	Invalid                                  = 0,
	Report                                   = 1,
	Execute                                  = 2,
	ReportAndExecute                         = 3,
	EPointCloudReportMode_MAX                = 4,
};

// ScriptStruct PointCloud.PointCloudPoint
// 0x00B0 (0x00B0 - 0x0000)
struct FPointCloudPoint final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            Attributes;                                        // 0x0060(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPointCloudPoint) == 0x000008, "Wrong alignment on FPointCloudPoint");
static_assert(sizeof(FPointCloudPoint) == 0x0000B0, "Wrong size on FPointCloudPoint");
static_assert(offsetof(FPointCloudPoint, Transform) == 0x000000, "Member 'FPointCloudPoint::Transform' has a wrong offset!");
static_assert(offsetof(FPointCloudPoint, Attributes) == 0x000060, "Member 'FPointCloudPoint::Attributes' has a wrong offset!");

// ScriptStruct PointCloud.CustomOverrides
// 0x0028 (0x0028 - 0x0000)
struct FCustomOverrides final
{
public:
	class UScriptStruct*                          StructClass;                                       // 0x0000(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       StructInstance;                                    // 0x0010(0x0010)(Edit, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_20[0x8];                                       // 0x0020(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCustomOverrides) == 0x000008, "Wrong alignment on FCustomOverrides");
static_assert(sizeof(FCustomOverrides) == 0x000028, "Wrong size on FCustomOverrides");
static_assert(offsetof(FCustomOverrides, StructClass) == 0x000000, "Member 'FCustomOverrides::StructClass' has a wrong offset!");
static_assert(offsetof(FCustomOverrides, StructInstance) == 0x000010, "Member 'FCustomOverrides::StructInstance' has a wrong offset!");

// ScriptStruct PointCloud.SliceAndDiceManagedActorsHashInfo
// 0x0028 (0x0028 - 0x0000)
struct FSliceAndDiceManagedActorsHashInfo final
{
public:
	class FString                                 Hash;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ParentHash;                                        // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        ActorIndex;                                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        ActorCount;                                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSliceAndDiceManagedActorsHashInfo) == 0x000008, "Wrong alignment on FSliceAndDiceManagedActorsHashInfo");
static_assert(sizeof(FSliceAndDiceManagedActorsHashInfo) == 0x000028, "Wrong size on FSliceAndDiceManagedActorsHashInfo");
static_assert(offsetof(FSliceAndDiceManagedActorsHashInfo, Hash) == 0x000000, "Member 'FSliceAndDiceManagedActorsHashInfo::Hash' has a wrong offset!");
static_assert(offsetof(FSliceAndDiceManagedActorsHashInfo, ParentHash) == 0x000010, "Member 'FSliceAndDiceManagedActorsHashInfo::ParentHash' has a wrong offset!");
static_assert(offsetof(FSliceAndDiceManagedActorsHashInfo, ActorIndex) == 0x000020, "Member 'FSliceAndDiceManagedActorsHashInfo::ActorIndex' has a wrong offset!");
static_assert(offsetof(FSliceAndDiceManagedActorsHashInfo, ActorCount) == 0x000024, "Member 'FSliceAndDiceManagedActorsHashInfo::ActorCount' has a wrong offset!");

// ScriptStruct PointCloud.PointCloudRuleData
// 0x0068 (0x0068 - 0x0000)
struct FPointCloudRuleData final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 World;                                             // 0x0008(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x10];                                      // 0x0010(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomOverrides                       CustomOverrides;                                   // 0x0020(0x0028)(Edit, NativeAccessSpecifierPublic)
	TArray<class FName>                           OverrideableProperties;                            // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class FName>                           OverridenProperties;                               // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FPointCloudRuleData) == 0x000008, "Wrong alignment on FPointCloudRuleData");
static_assert(sizeof(FPointCloudRuleData) == 0x000068, "Wrong size on FPointCloudRuleData");
static_assert(offsetof(FPointCloudRuleData, World) == 0x000008, "Member 'FPointCloudRuleData::World' has a wrong offset!");
static_assert(offsetof(FPointCloudRuleData, CustomOverrides) == 0x000020, "Member 'FPointCloudRuleData::CustomOverrides' has a wrong offset!");
static_assert(offsetof(FPointCloudRuleData, OverrideableProperties) == 0x000048, "Member 'FPointCloudRuleData::OverrideableProperties' has a wrong offset!");
static_assert(offsetof(FPointCloudRuleData, OverridenProperties) == 0x000058, "Member 'FPointCloudRuleData::OverridenProperties' has a wrong offset!");

// ScriptStruct PointCloud.SliceAndDiceActorMapping
// 0x0030 (0x0030 - 0x0000)
struct FSliceAndDiceActorMapping final
{
public:
	TArray<TSoftObjectPtr<class AActor>>          Actors;                                            // 0x0000(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FActorInstanceHandle>           ActorHandles;                                      // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         Statements;                                        // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSliceAndDiceActorMapping) == 0x000008, "Wrong alignment on FSliceAndDiceActorMapping");
static_assert(sizeof(FSliceAndDiceActorMapping) == 0x000030, "Wrong size on FSliceAndDiceActorMapping");
static_assert(offsetof(FSliceAndDiceActorMapping, Actors) == 0x000000, "Member 'FSliceAndDiceActorMapping::Actors' has a wrong offset!");
static_assert(offsetof(FSliceAndDiceActorMapping, ActorHandles) == 0x000010, "Member 'FSliceAndDiceActorMapping::ActorHandles' has a wrong offset!");
static_assert(offsetof(FSliceAndDiceActorMapping, Statements) == 0x000020, "Member 'FSliceAndDiceActorMapping::Statements' has a wrong offset!");

// ScriptStruct PointCloud.SliceAndDiceManagedActorsEntry
// 0x0030 (0x0030 - 0x0000)
struct FSliceAndDiceManagedActorsEntry final
{
public:
	class FString                                 ParentHash;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Hash;                                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSliceAndDiceActorMapping>      ActorMappings;                                     // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSliceAndDiceManagedActorsEntry) == 0x000008, "Wrong alignment on FSliceAndDiceManagedActorsEntry");
static_assert(sizeof(FSliceAndDiceManagedActorsEntry) == 0x000030, "Wrong size on FSliceAndDiceManagedActorsEntry");
static_assert(offsetof(FSliceAndDiceManagedActorsEntry, ParentHash) == 0x000000, "Member 'FSliceAndDiceManagedActorsEntry::ParentHash' has a wrong offset!");
static_assert(offsetof(FSliceAndDiceManagedActorsEntry, Hash) == 0x000010, "Member 'FSliceAndDiceManagedActorsEntry::Hash' has a wrong offset!");
static_assert(offsetof(FSliceAndDiceManagedActorsEntry, ActorMappings) == 0x000020, "Member 'FSliceAndDiceManagedActorsEntry::ActorMappings' has a wrong offset!");

}

