#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PoseSearch

#include "Basic.hpp"

#include "PoseSearch_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PoseSearch.MotionMatchingAnimNodeLibrary.ConvertToMotionMatchingNode
// 0x0028 (0x0028 - 0x0000)
struct MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNode final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EAnimNodeReferenceConversionResult            result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMotionMatchingAnimNodeReference       ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNode) == 0x000001, "Wrong alignment on MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNode");
static_assert(sizeof(MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNode) == 0x000028, "Wrong size on MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNode");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNode, Node) == 0x000000, "Member 'MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNode::Node' has a wrong offset!");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNode, result) == 0x000010, "Member 'MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNode::result' has a wrong offset!");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNode, ReturnValue) == 0x000018, "Member 'MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNode::ReturnValue' has a wrong offset!");

// Function PoseSearch.MotionMatchingAnimNodeLibrary.ConvertToMotionMatchingNodePure
// 0x0028 (0x0028 - 0x0000)
struct MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNodePure final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMotionMatchingAnimNodeReference       MotionMatchingNode;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNodePure) == 0x000001, "Wrong alignment on MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNodePure");
static_assert(sizeof(MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNodePure) == 0x000028, "Wrong size on MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNodePure");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNodePure, Node) == 0x000000, "Member 'MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNodePure::Node' has a wrong offset!");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNodePure, MotionMatchingNode) == 0x000010, "Member 'MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNodePure::MotionMatchingNode' has a wrong offset!");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNodePure, result) == 0x000020, "Member 'MotionMatchingAnimNodeLibrary_ConvertToMotionMatchingNodePure::result' has a wrong offset!");

// Function PoseSearch.MotionMatchingAnimNodeLibrary.GetMotionMatchingBlendSettings
// 0x0030 (0x0030 - 0x0000)
struct MotionMatchingAnimNodeLibrary_GetMotionMatchingBlendSettings final
{
public:
	struct FMotionMatchingAnimNodeReference       MotionMatchingNode;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMotionMatchingBlueprintBlendSettings  BlendSettings;                                     // 0x0010(0x0018)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsResultValid;                                    // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MotionMatchingAnimNodeLibrary_GetMotionMatchingBlendSettings) == 0x000001, "Wrong alignment on MotionMatchingAnimNodeLibrary_GetMotionMatchingBlendSettings");
static_assert(sizeof(MotionMatchingAnimNodeLibrary_GetMotionMatchingBlendSettings) == 0x000030, "Wrong size on MotionMatchingAnimNodeLibrary_GetMotionMatchingBlendSettings");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_GetMotionMatchingBlendSettings, MotionMatchingNode) == 0x000000, "Member 'MotionMatchingAnimNodeLibrary_GetMotionMatchingBlendSettings::MotionMatchingNode' has a wrong offset!");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_GetMotionMatchingBlendSettings, BlendSettings) == 0x000010, "Member 'MotionMatchingAnimNodeLibrary_GetMotionMatchingBlendSettings::BlendSettings' has a wrong offset!");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_GetMotionMatchingBlendSettings, bIsResultValid) == 0x000028, "Member 'MotionMatchingAnimNodeLibrary_GetMotionMatchingBlendSettings::bIsResultValid' has a wrong offset!");

// Function PoseSearch.MotionMatchingAnimNodeLibrary.GetMotionMatchingSearchResult
// 0x0090 (0x0090 - 0x0000)
struct MotionMatchingAnimNodeLibrary_GetMotionMatchingSearchResult final
{
public:
	struct FMotionMatchingAnimNodeReference       MotionMatchingNode;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FPoseSearchBlueprintResult             result;                                            // 0x0010(0x0078)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bIsResultValid;                                    // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MotionMatchingAnimNodeLibrary_GetMotionMatchingSearchResult) == 0x000001, "Wrong alignment on MotionMatchingAnimNodeLibrary_GetMotionMatchingSearchResult");
static_assert(sizeof(MotionMatchingAnimNodeLibrary_GetMotionMatchingSearchResult) == 0x000090, "Wrong size on MotionMatchingAnimNodeLibrary_GetMotionMatchingSearchResult");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_GetMotionMatchingSearchResult, MotionMatchingNode) == 0x000000, "Member 'MotionMatchingAnimNodeLibrary_GetMotionMatchingSearchResult::MotionMatchingNode' has a wrong offset!");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_GetMotionMatchingSearchResult, result) == 0x000010, "Member 'MotionMatchingAnimNodeLibrary_GetMotionMatchingSearchResult::result' has a wrong offset!");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_GetMotionMatchingSearchResult, bIsResultValid) == 0x000088, "Member 'MotionMatchingAnimNodeLibrary_GetMotionMatchingSearchResult::bIsResultValid' has a wrong offset!");

// Function PoseSearch.MotionMatchingAnimNodeLibrary.OverrideMotionMatchingBlendSettings
// 0x0030 (0x0030 - 0x0000)
struct MotionMatchingAnimNodeLibrary_OverrideMotionMatchingBlendSettings final
{
public:
	struct FMotionMatchingAnimNodeReference       MotionMatchingNode;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMotionMatchingBlueprintBlendSettings  BlendSettings;                                     // 0x0010(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsResultValid;                                    // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MotionMatchingAnimNodeLibrary_OverrideMotionMatchingBlendSettings) == 0x000001, "Wrong alignment on MotionMatchingAnimNodeLibrary_OverrideMotionMatchingBlendSettings");
static_assert(sizeof(MotionMatchingAnimNodeLibrary_OverrideMotionMatchingBlendSettings) == 0x000030, "Wrong size on MotionMatchingAnimNodeLibrary_OverrideMotionMatchingBlendSettings");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_OverrideMotionMatchingBlendSettings, MotionMatchingNode) == 0x000000, "Member 'MotionMatchingAnimNodeLibrary_OverrideMotionMatchingBlendSettings::MotionMatchingNode' has a wrong offset!");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_OverrideMotionMatchingBlendSettings, BlendSettings) == 0x000010, "Member 'MotionMatchingAnimNodeLibrary_OverrideMotionMatchingBlendSettings::BlendSettings' has a wrong offset!");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_OverrideMotionMatchingBlendSettings, bIsResultValid) == 0x000028, "Member 'MotionMatchingAnimNodeLibrary_OverrideMotionMatchingBlendSettings::bIsResultValid' has a wrong offset!");

// Function PoseSearch.MotionMatchingAnimNodeLibrary.ResetDatabasesToSearch
// 0x0018 (0x0018 - 0x0000)
struct MotionMatchingAnimNodeLibrary_ResetDatabasesToSearch final
{
public:
	struct FMotionMatchingAnimNodeReference       MotionMatchingNode;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EPoseSearchInterruptMode                      InterruptMode;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MotionMatchingAnimNodeLibrary_ResetDatabasesToSearch) == 0x000001, "Wrong alignment on MotionMatchingAnimNodeLibrary_ResetDatabasesToSearch");
static_assert(sizeof(MotionMatchingAnimNodeLibrary_ResetDatabasesToSearch) == 0x000018, "Wrong size on MotionMatchingAnimNodeLibrary_ResetDatabasesToSearch");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_ResetDatabasesToSearch, MotionMatchingNode) == 0x000000, "Member 'MotionMatchingAnimNodeLibrary_ResetDatabasesToSearch::MotionMatchingNode' has a wrong offset!");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_ResetDatabasesToSearch, InterruptMode) == 0x000010, "Member 'MotionMatchingAnimNodeLibrary_ResetDatabasesToSearch::InterruptMode' has a wrong offset!");

// Function PoseSearch.MotionMatchingAnimNodeLibrary.SetDatabasesToSearch
// 0x0028 (0x0028 - 0x0000)
struct MotionMatchingAnimNodeLibrary_SetDatabasesToSearch final
{
public:
	struct FMotionMatchingAnimNodeReference       MotionMatchingNode;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class UPoseSearchDatabase*>            Databases;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	EPoseSearchInterruptMode                      InterruptMode;                                     // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MotionMatchingAnimNodeLibrary_SetDatabasesToSearch) == 0x000008, "Wrong alignment on MotionMatchingAnimNodeLibrary_SetDatabasesToSearch");
static_assert(sizeof(MotionMatchingAnimNodeLibrary_SetDatabasesToSearch) == 0x000028, "Wrong size on MotionMatchingAnimNodeLibrary_SetDatabasesToSearch");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_SetDatabasesToSearch, MotionMatchingNode) == 0x000000, "Member 'MotionMatchingAnimNodeLibrary_SetDatabasesToSearch::MotionMatchingNode' has a wrong offset!");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_SetDatabasesToSearch, Databases) == 0x000010, "Member 'MotionMatchingAnimNodeLibrary_SetDatabasesToSearch::Databases' has a wrong offset!");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_SetDatabasesToSearch, InterruptMode) == 0x000020, "Member 'MotionMatchingAnimNodeLibrary_SetDatabasesToSearch::InterruptMode' has a wrong offset!");

// Function PoseSearch.MotionMatchingAnimNodeLibrary.SetDatabaseToSearch
// 0x0020 (0x0020 - 0x0000)
struct MotionMatchingAnimNodeLibrary_SetDatabaseToSearch final
{
public:
	struct FMotionMatchingAnimNodeReference       MotionMatchingNode;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UPoseSearchDatabase*                    Database;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPoseSearchInterruptMode                      InterruptMode;                                     // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MotionMatchingAnimNodeLibrary_SetDatabaseToSearch) == 0x000008, "Wrong alignment on MotionMatchingAnimNodeLibrary_SetDatabaseToSearch");
static_assert(sizeof(MotionMatchingAnimNodeLibrary_SetDatabaseToSearch) == 0x000020, "Wrong size on MotionMatchingAnimNodeLibrary_SetDatabaseToSearch");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_SetDatabaseToSearch, MotionMatchingNode) == 0x000000, "Member 'MotionMatchingAnimNodeLibrary_SetDatabaseToSearch::MotionMatchingNode' has a wrong offset!");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_SetDatabaseToSearch, Database) == 0x000010, "Member 'MotionMatchingAnimNodeLibrary_SetDatabaseToSearch::Database' has a wrong offset!");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_SetDatabaseToSearch, InterruptMode) == 0x000018, "Member 'MotionMatchingAnimNodeLibrary_SetDatabaseToSearch::InterruptMode' has a wrong offset!");

// Function PoseSearch.MotionMatchingAnimNodeLibrary.SetInterruptMode
// 0x0018 (0x0018 - 0x0000)
struct MotionMatchingAnimNodeLibrary_SetInterruptMode final
{
public:
	struct FMotionMatchingAnimNodeReference       MotionMatchingNode;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EPoseSearchInterruptMode                      InterruptMode;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MotionMatchingAnimNodeLibrary_SetInterruptMode) == 0x000001, "Wrong alignment on MotionMatchingAnimNodeLibrary_SetInterruptMode");
static_assert(sizeof(MotionMatchingAnimNodeLibrary_SetInterruptMode) == 0x000018, "Wrong size on MotionMatchingAnimNodeLibrary_SetInterruptMode");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_SetInterruptMode, MotionMatchingNode) == 0x000000, "Member 'MotionMatchingAnimNodeLibrary_SetInterruptMode::MotionMatchingNode' has a wrong offset!");
static_assert(offsetof(MotionMatchingAnimNodeLibrary_SetInterruptMode, InterruptMode) == 0x000010, "Member 'MotionMatchingAnimNodeLibrary_SetInterruptMode::InterruptMode' has a wrong offset!");

// Function PoseSearch.MotionMatchingInteractionAnimNodeLibrary.ConvertToMotionMatchingInteractionNode
// 0x0028 (0x0028 - 0x0000)
struct MotionMatchingInteractionAnimNodeLibrary_ConvertToMotionMatchingInteractionNode final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EAnimNodeReferenceConversionResult            result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMotionMatchingInteractionAnimNodeReference ReturnValue;                                  // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionMatchingInteractionAnimNodeLibrary_ConvertToMotionMatchingInteractionNode) == 0x000001, "Wrong alignment on MotionMatchingInteractionAnimNodeLibrary_ConvertToMotionMatchingInteractionNode");
static_assert(sizeof(MotionMatchingInteractionAnimNodeLibrary_ConvertToMotionMatchingInteractionNode) == 0x000028, "Wrong size on MotionMatchingInteractionAnimNodeLibrary_ConvertToMotionMatchingInteractionNode");
static_assert(offsetof(MotionMatchingInteractionAnimNodeLibrary_ConvertToMotionMatchingInteractionNode, Node) == 0x000000, "Member 'MotionMatchingInteractionAnimNodeLibrary_ConvertToMotionMatchingInteractionNode::Node' has a wrong offset!");
static_assert(offsetof(MotionMatchingInteractionAnimNodeLibrary_ConvertToMotionMatchingInteractionNode, result) == 0x000010, "Member 'MotionMatchingInteractionAnimNodeLibrary_ConvertToMotionMatchingInteractionNode::result' has a wrong offset!");
static_assert(offsetof(MotionMatchingInteractionAnimNodeLibrary_ConvertToMotionMatchingInteractionNode, ReturnValue) == 0x000018, "Member 'MotionMatchingInteractionAnimNodeLibrary_ConvertToMotionMatchingInteractionNode::ReturnValue' has a wrong offset!");

// Function PoseSearch.MotionMatchingInteractionAnimNodeLibrary.ConvertToMotionMatchingInteractionNodePure
// 0x0028 (0x0028 - 0x0000)
struct MotionMatchingInteractionAnimNodeLibrary_ConvertToMotionMatchingInteractionNodePure final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMotionMatchingInteractionAnimNodeReference MotionMatchingInteractionNode;                // 0x0010(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MotionMatchingInteractionAnimNodeLibrary_ConvertToMotionMatchingInteractionNodePure) == 0x000001, "Wrong alignment on MotionMatchingInteractionAnimNodeLibrary_ConvertToMotionMatchingInteractionNodePure");
static_assert(sizeof(MotionMatchingInteractionAnimNodeLibrary_ConvertToMotionMatchingInteractionNodePure) == 0x000028, "Wrong size on MotionMatchingInteractionAnimNodeLibrary_ConvertToMotionMatchingInteractionNodePure");
static_assert(offsetof(MotionMatchingInteractionAnimNodeLibrary_ConvertToMotionMatchingInteractionNodePure, Node) == 0x000000, "Member 'MotionMatchingInteractionAnimNodeLibrary_ConvertToMotionMatchingInteractionNodePure::Node' has a wrong offset!");
static_assert(offsetof(MotionMatchingInteractionAnimNodeLibrary_ConvertToMotionMatchingInteractionNodePure, MotionMatchingInteractionNode) == 0x000010, "Member 'MotionMatchingInteractionAnimNodeLibrary_ConvertToMotionMatchingInteractionNodePure::MotionMatchingInteractionNode' has a wrong offset!");
static_assert(offsetof(MotionMatchingInteractionAnimNodeLibrary_ConvertToMotionMatchingInteractionNodePure, result) == 0x000020, "Member 'MotionMatchingInteractionAnimNodeLibrary_ConvertToMotionMatchingInteractionNodePure::result' has a wrong offset!");

// Function PoseSearch.MotionMatchingInteractionAnimNodeLibrary.IsInteracting
// 0x0018 (0x0018 - 0x0000)
struct MotionMatchingInteractionAnimNodeLibrary_IsInteracting final
{
public:
	struct FMotionMatchingInteractionAnimNodeReference MotionMatchingInteractionNode;                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MotionMatchingInteractionAnimNodeLibrary_IsInteracting) == 0x000001, "Wrong alignment on MotionMatchingInteractionAnimNodeLibrary_IsInteracting");
static_assert(sizeof(MotionMatchingInteractionAnimNodeLibrary_IsInteracting) == 0x000018, "Wrong size on MotionMatchingInteractionAnimNodeLibrary_IsInteracting");
static_assert(offsetof(MotionMatchingInteractionAnimNodeLibrary_IsInteracting, MotionMatchingInteractionNode) == 0x000000, "Member 'MotionMatchingInteractionAnimNodeLibrary_IsInteracting::MotionMatchingInteractionNode' has a wrong offset!");
static_assert(offsetof(MotionMatchingInteractionAnimNodeLibrary_IsInteracting, ReturnValue) == 0x000010, "Member 'MotionMatchingInteractionAnimNodeLibrary_IsInteracting::ReturnValue' has a wrong offset!");

// Function PoseSearch.MotionMatchingInteractionAnimNodeLibrary.SetAvailabilities
// 0x0020 (0x0020 - 0x0000)
struct MotionMatchingInteractionAnimNodeLibrary_SetAvailabilities final
{
public:
	struct FMotionMatchingInteractionAnimNodeReference MotionMatchingInteractionNode;                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FPoseSearchInteractionAvailability> Availabilities;                                // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MotionMatchingInteractionAnimNodeLibrary_SetAvailabilities) == 0x000008, "Wrong alignment on MotionMatchingInteractionAnimNodeLibrary_SetAvailabilities");
static_assert(sizeof(MotionMatchingInteractionAnimNodeLibrary_SetAvailabilities) == 0x000020, "Wrong size on MotionMatchingInteractionAnimNodeLibrary_SetAvailabilities");
static_assert(offsetof(MotionMatchingInteractionAnimNodeLibrary_SetAvailabilities, MotionMatchingInteractionNode) == 0x000000, "Member 'MotionMatchingInteractionAnimNodeLibrary_SetAvailabilities::MotionMatchingInteractionNode' has a wrong offset!");
static_assert(offsetof(MotionMatchingInteractionAnimNodeLibrary_SetAvailabilities, Availabilities) == 0x000010, "Member 'MotionMatchingInteractionAnimNodeLibrary_SetAvailabilities::Availabilities' has a wrong offset!");

// Function PoseSearch.MultiAnimAsset.BP_GetAnimationAsset
// 0x0010 (0x0010 - 0x0000)
struct MultiAnimAsset_BP_GetAnimationAsset final
{
public:
	class FName                                   Role;                                              // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimationAsset*                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MultiAnimAsset_BP_GetAnimationAsset) == 0x000008, "Wrong alignment on MultiAnimAsset_BP_GetAnimationAsset");
static_assert(sizeof(MultiAnimAsset_BP_GetAnimationAsset) == 0x000010, "Wrong size on MultiAnimAsset_BP_GetAnimationAsset");
static_assert(offsetof(MultiAnimAsset_BP_GetAnimationAsset, Role) == 0x000000, "Member 'MultiAnimAsset_BP_GetAnimationAsset::Role' has a wrong offset!");
static_assert(offsetof(MultiAnimAsset_BP_GetAnimationAsset, ReturnValue) == 0x000008, "Member 'MultiAnimAsset_BP_GetAnimationAsset::ReturnValue' has a wrong offset!");

// Function PoseSearch.MultiAnimAsset.BP_GetOrigin
// 0x0070 (0x0070 - 0x0000)
struct MultiAnimAsset_BP_GetOrigin final
{
public:
	class FName                                   Role;                                              // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MultiAnimAsset_BP_GetOrigin) == 0x000004, "Wrong alignment on MultiAnimAsset_BP_GetOrigin");
static_assert(sizeof(MultiAnimAsset_BP_GetOrigin) == 0x000070, "Wrong size on MultiAnimAsset_BP_GetOrigin");
static_assert(offsetof(MultiAnimAsset_BP_GetOrigin, Role) == 0x000000, "Member 'MultiAnimAsset_BP_GetOrigin::Role' has a wrong offset!");
static_assert(offsetof(MultiAnimAsset_BP_GetOrigin, ReturnValue) == 0x000010, "Member 'MultiAnimAsset_BP_GetOrigin::ReturnValue' has a wrong offset!");

// Function PoseSearch.PoseSearchAssetSamplerLibrary.Draw
// 0x00F0 (0x00F0 - 0x0000)
struct PoseSearchAssetSamplerLibrary_Draw final
{
public:
	const class UAnimInstance*                    AnimInstance;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseSearchAssetSamplerPose            AssetSamplerPose;                                  // 0x0010(0x00E0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PoseSearchAssetSamplerLibrary_Draw) == 0x000008, "Wrong alignment on PoseSearchAssetSamplerLibrary_Draw");
static_assert(sizeof(PoseSearchAssetSamplerLibrary_Draw) == 0x0000F0, "Wrong size on PoseSearchAssetSamplerLibrary_Draw");
static_assert(offsetof(PoseSearchAssetSamplerLibrary_Draw, AnimInstance) == 0x000000, "Member 'PoseSearchAssetSamplerLibrary_Draw::AnimInstance' has a wrong offset!");
static_assert(offsetof(PoseSearchAssetSamplerLibrary_Draw, AssetSamplerPose) == 0x000010, "Member 'PoseSearchAssetSamplerLibrary_Draw::AssetSamplerPose' has a wrong offset!");

// Function PoseSearch.PoseSearchAssetSamplerLibrary.GetTransformByName
// 0x0150 (0x0150 - 0x0000)
struct PoseSearchAssetSamplerLibrary_GetTransformByName final
{
public:
	struct FPoseSearchAssetSamplerPose            AssetSamplerPose;                                  // 0x0000(0x00E0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x00E0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPoseSearchAssetSamplerSpace                  Space;                                             // 0x00E8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x00F0(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PoseSearchAssetSamplerLibrary_GetTransformByName) == 0x000004, "Wrong alignment on PoseSearchAssetSamplerLibrary_GetTransformByName");
static_assert(sizeof(PoseSearchAssetSamplerLibrary_GetTransformByName) == 0x000150, "Wrong size on PoseSearchAssetSamplerLibrary_GetTransformByName");
static_assert(offsetof(PoseSearchAssetSamplerLibrary_GetTransformByName, AssetSamplerPose) == 0x000000, "Member 'PoseSearchAssetSamplerLibrary_GetTransformByName::AssetSamplerPose' has a wrong offset!");
static_assert(offsetof(PoseSearchAssetSamplerLibrary_GetTransformByName, BoneName) == 0x0000E0, "Member 'PoseSearchAssetSamplerLibrary_GetTransformByName::BoneName' has a wrong offset!");
static_assert(offsetof(PoseSearchAssetSamplerLibrary_GetTransformByName, Space) == 0x0000E8, "Member 'PoseSearchAssetSamplerLibrary_GetTransformByName::Space' has a wrong offset!");
static_assert(offsetof(PoseSearchAssetSamplerLibrary_GetTransformByName, ReturnValue) == 0x0000F0, "Member 'PoseSearchAssetSamplerLibrary_GetTransformByName::ReturnValue' has a wrong offset!");

// Function PoseSearch.PoseSearchAssetSamplerLibrary.SamplePose
// 0x0190 (0x0190 - 0x0000)
struct PoseSearchAssetSamplerLibrary_SamplePose final
{
public:
	const class UAnimInstance*                    AnimInstance;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseSearchAssetSamplerInput           Input;                                             // 0x0010(0x00A0)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FPoseSearchAssetSamplerPose            ReturnValue;                                       // 0x00B0(0x00E0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PoseSearchAssetSamplerLibrary_SamplePose) == 0x000008, "Wrong alignment on PoseSearchAssetSamplerLibrary_SamplePose");
static_assert(sizeof(PoseSearchAssetSamplerLibrary_SamplePose) == 0x000190, "Wrong size on PoseSearchAssetSamplerLibrary_SamplePose");
static_assert(offsetof(PoseSearchAssetSamplerLibrary_SamplePose, AnimInstance) == 0x000000, "Member 'PoseSearchAssetSamplerLibrary_SamplePose::AnimInstance' has a wrong offset!");
static_assert(offsetof(PoseSearchAssetSamplerLibrary_SamplePose, Input) == 0x000010, "Member 'PoseSearchAssetSamplerLibrary_SamplePose::Input' has a wrong offset!");
static_assert(offsetof(PoseSearchAssetSamplerLibrary_SamplePose, ReturnValue) == 0x0000B0, "Member 'PoseSearchAssetSamplerLibrary_SamplePose::ReturnValue' has a wrong offset!");

// Function PoseSearch.PoseSearchDatabase.GetAnimationAsset
// 0x0010 (0x0010 - 0x0000)
struct PoseSearchDatabase_GetAnimationAsset final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PoseSearchDatabase_GetAnimationAsset) == 0x000008, "Wrong alignment on PoseSearchDatabase_GetAnimationAsset");
static_assert(sizeof(PoseSearchDatabase_GetAnimationAsset) == 0x000010, "Wrong size on PoseSearchDatabase_GetAnimationAsset");
static_assert(offsetof(PoseSearchDatabase_GetAnimationAsset, Index_0) == 0x000000, "Member 'PoseSearchDatabase_GetAnimationAsset::Index_0' has a wrong offset!");
static_assert(offsetof(PoseSearchDatabase_GetAnimationAsset, ReturnValue) == 0x000008, "Member 'PoseSearchDatabase_GetAnimationAsset::ReturnValue' has a wrong offset!");

// Function PoseSearch.PoseSearchDatabase.GetNumAnimationAssets
// 0x0004 (0x0004 - 0x0000)
struct PoseSearchDatabase_GetNumAnimationAssets final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PoseSearchDatabase_GetNumAnimationAssets) == 0x000004, "Wrong alignment on PoseSearchDatabase_GetNumAnimationAssets");
static_assert(sizeof(PoseSearchDatabase_GetNumAnimationAssets) == 0x000004, "Wrong size on PoseSearchDatabase_GetNumAnimationAssets");
static_assert(offsetof(PoseSearchDatabase_GetNumAnimationAssets, ReturnValue) == 0x000000, "Member 'PoseSearchDatabase_GetNumAnimationAssets::ReturnValue' has a wrong offset!");

// Function PoseSearch.PoseSearchEventLibrary.UpdatePoseSearchEvent
// 0x0038 (0x0038 - 0x0000)
struct PoseSearchEventLibrary_UpdatePoseSearchEvent final
{
public:
	struct FPoseSearchEvent                       InNewEvent;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsNewEventValid;                                  // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeltaSeconds;                                      // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPoseSearchEvent                       InOutCurrentEvent;                                 // 0x0020(0x0018)(Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(PoseSearchEventLibrary_UpdatePoseSearchEvent) == 0x000004, "Wrong alignment on PoseSearchEventLibrary_UpdatePoseSearchEvent");
static_assert(sizeof(PoseSearchEventLibrary_UpdatePoseSearchEvent) == 0x000038, "Wrong size on PoseSearchEventLibrary_UpdatePoseSearchEvent");
static_assert(offsetof(PoseSearchEventLibrary_UpdatePoseSearchEvent, InNewEvent) == 0x000000, "Member 'PoseSearchEventLibrary_UpdatePoseSearchEvent::InNewEvent' has a wrong offset!");
static_assert(offsetof(PoseSearchEventLibrary_UpdatePoseSearchEvent, bIsNewEventValid) == 0x000018, "Member 'PoseSearchEventLibrary_UpdatePoseSearchEvent::bIsNewEventValid' has a wrong offset!");
static_assert(offsetof(PoseSearchEventLibrary_UpdatePoseSearchEvent, DeltaSeconds) == 0x00001C, "Member 'PoseSearchEventLibrary_UpdatePoseSearchEvent::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(PoseSearchEventLibrary_UpdatePoseSearchEvent, InOutCurrentEvent) == 0x000020, "Member 'PoseSearchEventLibrary_UpdatePoseSearchEvent::InOutCurrentEvent' has a wrong offset!");

// Function PoseSearch.PoseSearchFeatureChannel_Curve.BP_GetCurveValue
// 0x0010 (0x0010 - 0x0000)
struct PoseSearchFeatureChannel_Curve_BP_GetCurveValue final
{
public:
	const class UAnimInstance*                    AnimInstance;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PoseSearchFeatureChannel_Curve_BP_GetCurveValue) == 0x000008, "Wrong alignment on PoseSearchFeatureChannel_Curve_BP_GetCurveValue");
static_assert(sizeof(PoseSearchFeatureChannel_Curve_BP_GetCurveValue) == 0x000010, "Wrong size on PoseSearchFeatureChannel_Curve_BP_GetCurveValue");
static_assert(offsetof(PoseSearchFeatureChannel_Curve_BP_GetCurveValue, AnimInstance) == 0x000000, "Member 'PoseSearchFeatureChannel_Curve_BP_GetCurveValue::AnimInstance' has a wrong offset!");
static_assert(offsetof(PoseSearchFeatureChannel_Curve_BP_GetCurveValue, ReturnValue) == 0x000008, "Member 'PoseSearchFeatureChannel_Curve_BP_GetCurveValue::ReturnValue' has a wrong offset!");

// Function PoseSearch.PoseSearchFeatureChannel_Distance.BP_GetDistance
// 0x0010 (0x0010 - 0x0000)
struct PoseSearchFeatureChannel_Distance_BP_GetDistance final
{
public:
	const class UAnimInstance*                    AnimInstance;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PoseSearchFeatureChannel_Distance_BP_GetDistance) == 0x000008, "Wrong alignment on PoseSearchFeatureChannel_Distance_BP_GetDistance");
static_assert(sizeof(PoseSearchFeatureChannel_Distance_BP_GetDistance) == 0x000010, "Wrong size on PoseSearchFeatureChannel_Distance_BP_GetDistance");
static_assert(offsetof(PoseSearchFeatureChannel_Distance_BP_GetDistance, AnimInstance) == 0x000000, "Member 'PoseSearchFeatureChannel_Distance_BP_GetDistance::AnimInstance' has a wrong offset!");
static_assert(offsetof(PoseSearchFeatureChannel_Distance_BP_GetDistance, ReturnValue) == 0x000008, "Member 'PoseSearchFeatureChannel_Distance_BP_GetDistance::ReturnValue' has a wrong offset!");

// Function PoseSearch.PoseSearchFeatureChannel_Heading.BP_GetWorldRotation
// 0x0030 (0x0030 - 0x0000)
struct PoseSearchFeatureChannel_Heading_BP_GetWorldRotation final
{
public:
	const class UAnimInstance*                    AnimInstance;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PoseSearchFeatureChannel_Heading_BP_GetWorldRotation) == 0x000008, "Wrong alignment on PoseSearchFeatureChannel_Heading_BP_GetWorldRotation");
static_assert(sizeof(PoseSearchFeatureChannel_Heading_BP_GetWorldRotation) == 0x000030, "Wrong size on PoseSearchFeatureChannel_Heading_BP_GetWorldRotation");
static_assert(offsetof(PoseSearchFeatureChannel_Heading_BP_GetWorldRotation, AnimInstance) == 0x000000, "Member 'PoseSearchFeatureChannel_Heading_BP_GetWorldRotation::AnimInstance' has a wrong offset!");
static_assert(offsetof(PoseSearchFeatureChannel_Heading_BP_GetWorldRotation, ReturnValue) == 0x000010, "Member 'PoseSearchFeatureChannel_Heading_BP_GetWorldRotation::ReturnValue' has a wrong offset!");

// Function PoseSearch.PoseSearchFeatureChannel_Position.BP_GetWorldPosition
// 0x0020 (0x0020 - 0x0000)
struct PoseSearchFeatureChannel_Position_BP_GetWorldPosition final
{
public:
	const class UAnimInstance*                    AnimInstance;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PoseSearchFeatureChannel_Position_BP_GetWorldPosition) == 0x000008, "Wrong alignment on PoseSearchFeatureChannel_Position_BP_GetWorldPosition");
static_assert(sizeof(PoseSearchFeatureChannel_Position_BP_GetWorldPosition) == 0x000020, "Wrong size on PoseSearchFeatureChannel_Position_BP_GetWorldPosition");
static_assert(offsetof(PoseSearchFeatureChannel_Position_BP_GetWorldPosition, AnimInstance) == 0x000000, "Member 'PoseSearchFeatureChannel_Position_BP_GetWorldPosition::AnimInstance' has a wrong offset!");
static_assert(offsetof(PoseSearchFeatureChannel_Position_BP_GetWorldPosition, ReturnValue) == 0x000008, "Member 'PoseSearchFeatureChannel_Position_BP_GetWorldPosition::ReturnValue' has a wrong offset!");

// Function PoseSearch.PoseSearchFeatureChannel_TimeToEvent.BP_GetTimeToEvent
// 0x0010 (0x0010 - 0x0000)
struct PoseSearchFeatureChannel_TimeToEvent_BP_GetTimeToEvent final
{
public:
	const class UAnimInstance*                    AnimInstance;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PoseSearchFeatureChannel_TimeToEvent_BP_GetTimeToEvent) == 0x000008, "Wrong alignment on PoseSearchFeatureChannel_TimeToEvent_BP_GetTimeToEvent");
static_assert(sizeof(PoseSearchFeatureChannel_TimeToEvent_BP_GetTimeToEvent) == 0x000010, "Wrong size on PoseSearchFeatureChannel_TimeToEvent_BP_GetTimeToEvent");
static_assert(offsetof(PoseSearchFeatureChannel_TimeToEvent_BP_GetTimeToEvent, AnimInstance) == 0x000000, "Member 'PoseSearchFeatureChannel_TimeToEvent_BP_GetTimeToEvent::AnimInstance' has a wrong offset!");
static_assert(offsetof(PoseSearchFeatureChannel_TimeToEvent_BP_GetTimeToEvent, ReturnValue) == 0x000008, "Member 'PoseSearchFeatureChannel_TimeToEvent_BP_GetTimeToEvent::ReturnValue' has a wrong offset!");

// Function PoseSearch.PoseSearchFeatureChannel_Velocity.BP_GetWorldVelocity
// 0x0020 (0x0020 - 0x0000)
struct PoseSearchFeatureChannel_Velocity_BP_GetWorldVelocity final
{
public:
	const class UAnimInstance*                    AnimInstance;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PoseSearchFeatureChannel_Velocity_BP_GetWorldVelocity) == 0x000008, "Wrong alignment on PoseSearchFeatureChannel_Velocity_BP_GetWorldVelocity");
static_assert(sizeof(PoseSearchFeatureChannel_Velocity_BP_GetWorldVelocity) == 0x000020, "Wrong size on PoseSearchFeatureChannel_Velocity_BP_GetWorldVelocity");
static_assert(offsetof(PoseSearchFeatureChannel_Velocity_BP_GetWorldVelocity, AnimInstance) == 0x000000, "Member 'PoseSearchFeatureChannel_Velocity_BP_GetWorldVelocity::AnimInstance' has a wrong offset!");
static_assert(offsetof(PoseSearchFeatureChannel_Velocity_BP_GetWorldVelocity, ReturnValue) == 0x000008, "Member 'PoseSearchFeatureChannel_Velocity_BP_GetWorldVelocity::ReturnValue' has a wrong offset!");

// Function PoseSearch.PoseSearchHistoryCollectorAnimNodeLibrary.ConvertToPoseHistoryNode
// 0x0028 (0x0028 - 0x0000)
struct PoseSearchHistoryCollectorAnimNodeLibrary_ConvertToPoseHistoryNode final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EAnimNodeReferenceConversionResult            result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseSearchHistoryCollectorAnimNodeReference ReturnValue;                                 // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(PoseSearchHistoryCollectorAnimNodeLibrary_ConvertToPoseHistoryNode) == 0x000001, "Wrong alignment on PoseSearchHistoryCollectorAnimNodeLibrary_ConvertToPoseHistoryNode");
static_assert(sizeof(PoseSearchHistoryCollectorAnimNodeLibrary_ConvertToPoseHistoryNode) == 0x000028, "Wrong size on PoseSearchHistoryCollectorAnimNodeLibrary_ConvertToPoseHistoryNode");
static_assert(offsetof(PoseSearchHistoryCollectorAnimNodeLibrary_ConvertToPoseHistoryNode, Node) == 0x000000, "Member 'PoseSearchHistoryCollectorAnimNodeLibrary_ConvertToPoseHistoryNode::Node' has a wrong offset!");
static_assert(offsetof(PoseSearchHistoryCollectorAnimNodeLibrary_ConvertToPoseHistoryNode, result) == 0x000010, "Member 'PoseSearchHistoryCollectorAnimNodeLibrary_ConvertToPoseHistoryNode::result' has a wrong offset!");
static_assert(offsetof(PoseSearchHistoryCollectorAnimNodeLibrary_ConvertToPoseHistoryNode, ReturnValue) == 0x000018, "Member 'PoseSearchHistoryCollectorAnimNodeLibrary_ConvertToPoseHistoryNode::ReturnValue' has a wrong offset!");

// Function PoseSearch.PoseSearchHistoryCollectorAnimNodeLibrary.ConvertToPoseHistoryNodePure
// 0x0028 (0x0028 - 0x0000)
struct PoseSearchHistoryCollectorAnimNodeLibrary_ConvertToPoseHistoryNodePure final
{
public:
	struct FAnimNodeReference                     Node;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FPoseSearchHistoryCollectorAnimNodeReference PoseSearchHistoryCollectorNode;              // 0x0010(0x0010)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PoseSearchHistoryCollectorAnimNodeLibrary_ConvertToPoseHistoryNodePure) == 0x000001, "Wrong alignment on PoseSearchHistoryCollectorAnimNodeLibrary_ConvertToPoseHistoryNodePure");
static_assert(sizeof(PoseSearchHistoryCollectorAnimNodeLibrary_ConvertToPoseHistoryNodePure) == 0x000028, "Wrong size on PoseSearchHistoryCollectorAnimNodeLibrary_ConvertToPoseHistoryNodePure");
static_assert(offsetof(PoseSearchHistoryCollectorAnimNodeLibrary_ConvertToPoseHistoryNodePure, Node) == 0x000000, "Member 'PoseSearchHistoryCollectorAnimNodeLibrary_ConvertToPoseHistoryNodePure::Node' has a wrong offset!");
static_assert(offsetof(PoseSearchHistoryCollectorAnimNodeLibrary_ConvertToPoseHistoryNodePure, PoseSearchHistoryCollectorNode) == 0x000010, "Member 'PoseSearchHistoryCollectorAnimNodeLibrary_ConvertToPoseHistoryNodePure::PoseSearchHistoryCollectorNode' has a wrong offset!");
static_assert(offsetof(PoseSearchHistoryCollectorAnimNodeLibrary_ConvertToPoseHistoryNodePure, result) == 0x000020, "Member 'PoseSearchHistoryCollectorAnimNodeLibrary_ConvertToPoseHistoryNodePure::result' has a wrong offset!");

// Function PoseSearch.PoseSearchHistoryCollectorAnimNodeLibrary.GetPoseHistoryNodeTransformTrajectory
// 0x0020 (0x0020 - 0x0000)
struct PoseSearchHistoryCollectorAnimNodeLibrary_GetPoseHistoryNodeTransformTrajectory final
{
public:
	struct FPoseSearchHistoryCollectorAnimNodeReference PoseSearchHistoryCollectorNode;              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransformTrajectory                   Trajectory;                                        // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PoseSearchHistoryCollectorAnimNodeLibrary_GetPoseHistoryNodeTransformTrajectory) == 0x000001, "Wrong alignment on PoseSearchHistoryCollectorAnimNodeLibrary_GetPoseHistoryNodeTransformTrajectory");
static_assert(sizeof(PoseSearchHistoryCollectorAnimNodeLibrary_GetPoseHistoryNodeTransformTrajectory) == 0x000020, "Wrong size on PoseSearchHistoryCollectorAnimNodeLibrary_GetPoseHistoryNodeTransformTrajectory");
static_assert(offsetof(PoseSearchHistoryCollectorAnimNodeLibrary_GetPoseHistoryNodeTransformTrajectory, PoseSearchHistoryCollectorNode) == 0x000000, "Member 'PoseSearchHistoryCollectorAnimNodeLibrary_GetPoseHistoryNodeTransformTrajectory::PoseSearchHistoryCollectorNode' has a wrong offset!");
static_assert(offsetof(PoseSearchHistoryCollectorAnimNodeLibrary_GetPoseHistoryNodeTransformTrajectory, Trajectory) == 0x000010, "Member 'PoseSearchHistoryCollectorAnimNodeLibrary_GetPoseHistoryNodeTransformTrajectory::Trajectory' has a wrong offset!");

// Function PoseSearch.PoseSearchHistoryCollectorAnimNodeLibrary.SetPoseHistoryNodeTransformTrajectory
// 0x0020 (0x0020 - 0x0000)
struct PoseSearchHistoryCollectorAnimNodeLibrary_SetPoseHistoryNodeTransformTrajectory final
{
public:
	struct FPoseSearchHistoryCollectorAnimNodeReference PoseSearchHistoryCollectorNode;              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransformTrajectory                   Trajectory;                                        // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PoseSearchHistoryCollectorAnimNodeLibrary_SetPoseHistoryNodeTransformTrajectory) == 0x000001, "Wrong alignment on PoseSearchHistoryCollectorAnimNodeLibrary_SetPoseHistoryNodeTransformTrajectory");
static_assert(sizeof(PoseSearchHistoryCollectorAnimNodeLibrary_SetPoseHistoryNodeTransformTrajectory) == 0x000020, "Wrong size on PoseSearchHistoryCollectorAnimNodeLibrary_SetPoseHistoryNodeTransformTrajectory");
static_assert(offsetof(PoseSearchHistoryCollectorAnimNodeLibrary_SetPoseHistoryNodeTransformTrajectory, PoseSearchHistoryCollectorNode) == 0x000000, "Member 'PoseSearchHistoryCollectorAnimNodeLibrary_SetPoseHistoryNodeTransformTrajectory::PoseSearchHistoryCollectorNode' has a wrong offset!");
static_assert(offsetof(PoseSearchHistoryCollectorAnimNodeLibrary_SetPoseHistoryNodeTransformTrajectory, Trajectory) == 0x000010, "Member 'PoseSearchHistoryCollectorAnimNodeLibrary_SetPoseHistoryNodeTransformTrajectory::Trajectory' has a wrong offset!");

// Function PoseSearch.PoseSearchInteractionLibrary.GetMontageContinuingProperties
// 0x0038 (0x0038 - 0x0000)
struct PoseSearchInteractionLibrary_GetMontageContinuingProperties final
{
public:
	class UAnimInstance*                          AnimInstance;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPoseSearchContinuingProperties        ReturnValue;                                       // 0x0008(0x0030)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(PoseSearchInteractionLibrary_GetMontageContinuingProperties) == 0x000008, "Wrong alignment on PoseSearchInteractionLibrary_GetMontageContinuingProperties");
static_assert(sizeof(PoseSearchInteractionLibrary_GetMontageContinuingProperties) == 0x000038, "Wrong size on PoseSearchInteractionLibrary_GetMontageContinuingProperties");
static_assert(offsetof(PoseSearchInteractionLibrary_GetMontageContinuingProperties, AnimInstance) == 0x000000, "Member 'PoseSearchInteractionLibrary_GetMontageContinuingProperties::AnimInstance' has a wrong offset!");
static_assert(offsetof(PoseSearchInteractionLibrary_GetMontageContinuingProperties, ReturnValue) == 0x000008, "Member 'PoseSearchInteractionLibrary_GetMontageContinuingProperties::ReturnValue' has a wrong offset!");

// Function PoseSearch.PoseSearchInteractionLibrary.MotionMatchInteraction
// 0x00A0 (0x00A0 - 0x0000)
struct PoseSearchInteractionLibrary_MotionMatchInteraction final
{
public:
	TArray<struct FPoseSearchInteractionAvailability> Availabilities;                                // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	const class UObject*                          AnimContext;                                       // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PoseHistoryName;                                   // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValidateResultAgainstAvailabilities;              // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseSearchBlueprintResult             ReturnValue;                                       // 0x0028(0x0078)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PoseSearchInteractionLibrary_MotionMatchInteraction) == 0x000008, "Wrong alignment on PoseSearchInteractionLibrary_MotionMatchInteraction");
static_assert(sizeof(PoseSearchInteractionLibrary_MotionMatchInteraction) == 0x0000A0, "Wrong size on PoseSearchInteractionLibrary_MotionMatchInteraction");
static_assert(offsetof(PoseSearchInteractionLibrary_MotionMatchInteraction, Availabilities) == 0x000000, "Member 'PoseSearchInteractionLibrary_MotionMatchInteraction::Availabilities' has a wrong offset!");
static_assert(offsetof(PoseSearchInteractionLibrary_MotionMatchInteraction, AnimContext) == 0x000010, "Member 'PoseSearchInteractionLibrary_MotionMatchInteraction::AnimContext' has a wrong offset!");
static_assert(offsetof(PoseSearchInteractionLibrary_MotionMatchInteraction, PoseHistoryName) == 0x000018, "Member 'PoseSearchInteractionLibrary_MotionMatchInteraction::PoseHistoryName' has a wrong offset!");
static_assert(offsetof(PoseSearchInteractionLibrary_MotionMatchInteraction, bValidateResultAgainstAvailabilities) == 0x000020, "Member 'PoseSearchInteractionLibrary_MotionMatchInteraction::bValidateResultAgainstAvailabilities' has a wrong offset!");
static_assert(offsetof(PoseSearchInteractionLibrary_MotionMatchInteraction, ReturnValue) == 0x000028, "Member 'PoseSearchInteractionLibrary_MotionMatchInteraction::ReturnValue' has a wrong offset!");

// Function PoseSearch.PoseSearchInteractionLibrary.MotionMatchInteraction_Pure
// 0x00A0 (0x00A0 - 0x0000)
struct PoseSearchInteractionLibrary_MotionMatchInteraction_Pure final
{
public:
	TArray<struct FPoseSearchInteractionAvailability> Availabilities;                                // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	const class UObject*                          AnimContext;                                       // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PoseHistoryName;                                   // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValidateResultAgainstAvailabilities;              // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseSearchBlueprintResult             ReturnValue;                                       // 0x0028(0x0078)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(PoseSearchInteractionLibrary_MotionMatchInteraction_Pure) == 0x000008, "Wrong alignment on PoseSearchInteractionLibrary_MotionMatchInteraction_Pure");
static_assert(sizeof(PoseSearchInteractionLibrary_MotionMatchInteraction_Pure) == 0x0000A0, "Wrong size on PoseSearchInteractionLibrary_MotionMatchInteraction_Pure");
static_assert(offsetof(PoseSearchInteractionLibrary_MotionMatchInteraction_Pure, Availabilities) == 0x000000, "Member 'PoseSearchInteractionLibrary_MotionMatchInteraction_Pure::Availabilities' has a wrong offset!");
static_assert(offsetof(PoseSearchInteractionLibrary_MotionMatchInteraction_Pure, AnimContext) == 0x000010, "Member 'PoseSearchInteractionLibrary_MotionMatchInteraction_Pure::AnimContext' has a wrong offset!");
static_assert(offsetof(PoseSearchInteractionLibrary_MotionMatchInteraction_Pure, PoseHistoryName) == 0x000018, "Member 'PoseSearchInteractionLibrary_MotionMatchInteraction_Pure::PoseHistoryName' has a wrong offset!");
static_assert(offsetof(PoseSearchInteractionLibrary_MotionMatchInteraction_Pure, bValidateResultAgainstAvailabilities) == 0x000020, "Member 'PoseSearchInteractionLibrary_MotionMatchInteraction_Pure::bValidateResultAgainstAvailabilities' has a wrong offset!");
static_assert(offsetof(PoseSearchInteractionLibrary_MotionMatchInteraction_Pure, ReturnValue) == 0x000028, "Member 'PoseSearchInteractionLibrary_MotionMatchInteraction_Pure::ReturnValue' has a wrong offset!");

// Function PoseSearch.PoseSearchTrajectoryLibrary.DrawTransformTrajectory
// 0x0020 (0x0020 - 0x0000)
struct PoseSearchTrajectoryLibrary_DrawTransformTrajectory final
{
public:
