#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PoseSearch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PoseSearch_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class PoseSearch.MotionMatchingAnimNodeLibrary
// 0x0000 (0x0028 - 0x0028)
class UMotionMatchingAnimNodeLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FMotionMatchingAnimNodeReference ConvertToMotionMatchingNode(const struct FAnimNodeReference& Node, EAnimNodeReferenceConversionResult* result);
	static void ConvertToMotionMatchingNodePure(const struct FAnimNodeReference& Node, struct FMotionMatchingAnimNodeReference* MotionMatchingNode, bool* result);
	static void GetMotionMatchingBlendSettings(const struct FMotionMatchingAnimNodeReference& MotionMatchingNode, struct FMotionMatchingBlueprintBlendSettings* BlendSettings, bool* bIsResultValid);
	static void GetMotionMatchingSearchResult(const struct FMotionMatchingAnimNodeReference& MotionMatchingNode, struct FPoseSearchBlueprintResult* result, bool* bIsResultValid);
	static void OverrideMotionMatchingBlendSettings(const struct FMotionMatchingAnimNodeReference& MotionMatchingNode, const struct FMotionMatchingBlueprintBlendSettings& BlendSettings, bool* bIsResultValid);
	static void ResetDatabasesToSearch(const struct FMotionMatchingAnimNodeReference& MotionMatchingNode, EPoseSearchInterruptMode InterruptMode);
	static void SetDatabasesToSearch(const struct FMotionMatchingAnimNodeReference& MotionMatchingNode, const TArray<class UPoseSearchDatabase*>& Databases, EPoseSearchInterruptMode InterruptMode);
	static void SetDatabaseToSearch(const struct FMotionMatchingAnimNodeReference& MotionMatchingNode, class UPoseSearchDatabase* Database, EPoseSearchInterruptMode InterruptMode);
	static void SetInterruptMode(const struct FMotionMatchingAnimNodeReference& MotionMatchingNode, EPoseSearchInterruptMode InterruptMode);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MotionMatchingAnimNodeLibrary">();
	}
	static class UMotionMatchingAnimNodeLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionMatchingAnimNodeLibrary>();
	}
};
static_assert(alignof(UMotionMatchingAnimNodeLibrary) == 0x000008, "Wrong alignment on UMotionMatchingAnimNodeLibrary");
static_assert(sizeof(UMotionMatchingAnimNodeLibrary) == 0x000028, "Wrong size on UMotionMatchingAnimNodeLibrary");

// Class PoseSearch.MotionMatchingInteractionAnimNodeLibrary
// 0x0000 (0x0028 - 0x0028)
class UMotionMatchingInteractionAnimNodeLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FMotionMatchingInteractionAnimNodeReference ConvertToMotionMatchingInteractionNode(const struct FAnimNodeReference& Node, EAnimNodeReferenceConversionResult* result);
	static void ConvertToMotionMatchingInteractionNodePure(const struct FAnimNodeReference& Node, struct FMotionMatchingInteractionAnimNodeReference* MotionMatchingInteractionNode, bool* result);
	static bool IsInteracting(const struct FMotionMatchingInteractionAnimNodeReference& MotionMatchingInteractionNode);
	static void SetAvailabilities(const struct FMotionMatchingInteractionAnimNodeReference& MotionMatchingInteractionNode, const TArray<struct FPoseSearchInteractionAvailability>& Availabilities);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MotionMatchingInteractionAnimNodeLibrary">();
	}
	static class UMotionMatchingInteractionAnimNodeLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMotionMatchingInteractionAnimNodeLibrary>();
	}
};
static_assert(alignof(UMotionMatchingInteractionAnimNodeLibrary) == 0x000008, "Wrong alignment on UMotionMatchingInteractionAnimNodeLibrary");
static_assert(sizeof(UMotionMatchingInteractionAnimNodeLibrary) == 0x000028, "Wrong size on UMotionMatchingInteractionAnimNodeLibrary");

// Class PoseSearch.MultiAnimAsset
// 0x0000 (0x0028 - 0x0028)
class UMultiAnimAsset : public UObject
{
public:
	class UAnimationAsset* BP_GetAnimationAsset(const class FName& Role) const;
	struct FTransform BP_GetOrigin(const class FName& Role) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MultiAnimAsset">();
	}
	static class UMultiAnimAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiAnimAsset>();
	}
};
static_assert(alignof(UMultiAnimAsset) == 0x000008, "Wrong alignment on UMultiAnimAsset");
static_assert(sizeof(UMultiAnimAsset) == 0x000028, "Wrong size on UMultiAnimAsset");

// Class PoseSearch.PoseSearchAssetSamplerLibrary
// 0x0000 (0x0028 - 0x0028)
class UPoseSearchAssetSamplerLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void Draw(const class UAnimInstance* AnimInstance, struct FPoseSearchAssetSamplerPose& AssetSamplerPose);
	static struct FTransform GetTransformByName(struct FPoseSearchAssetSamplerPose& AssetSamplerPose, class FName BoneName, EPoseSearchAssetSamplerSpace Space);
	static struct FPoseSearchAssetSamplerPose SamplePose(const class UAnimInstance* AnimInstance, const struct FPoseSearchAssetSamplerInput& Input);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchAssetSamplerLibrary">();
	}
	static class UPoseSearchAssetSamplerLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchAssetSamplerLibrary>();
	}
};
static_assert(alignof(UPoseSearchAssetSamplerLibrary) == 0x000008, "Wrong alignment on UPoseSearchAssetSamplerLibrary");
static_assert(sizeof(UPoseSearchAssetSamplerLibrary) == 0x000028, "Wrong size on UPoseSearchAssetSamplerLibrary");

// Class PoseSearch.PoseSearchDatabase
// 0x01B0 (0x01E0 - 0x0030)
class UPoseSearchDatabase final : public UDataAsset
{
public:
	class UPoseSearchSchema*                      Schema;                                            // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ContinuingPoseCostBias;                            // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseCostBias;                                      // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LoopingCostBias;                                   // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ContinuingInteractionCostBias;                     // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FInstancedStruct>               AnimationAssets;                                   // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UChooserTable*                          Chooser;                                           // 0x0058(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FName>                           Tags;                                              // 0x0060(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	EPoseSearchMode                               PoseSearchMode;                                    // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KDTreeQueryNumNeighbors;                           // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         KDTreeQueryNumNeighborsWithDuplicates;             // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x164];                                     // 0x007C(0x0164)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UObject* GetAnimationAsset(int32 Index_0) const;
	int32 GetNumAnimationAssets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchDatabase">();
	}
	static class UPoseSearchDatabase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchDatabase>();
	}
};
static_assert(alignof(UPoseSearchDatabase) == 0x000008, "Wrong alignment on UPoseSearchDatabase");
static_assert(sizeof(UPoseSearchDatabase) == 0x0001E0, "Wrong size on UPoseSearchDatabase");
static_assert(offsetof(UPoseSearchDatabase, Schema) == 0x000030, "Member 'UPoseSearchDatabase::Schema' has a wrong offset!");
static_assert(offsetof(UPoseSearchDatabase, ContinuingPoseCostBias) == 0x000038, "Member 'UPoseSearchDatabase::ContinuingPoseCostBias' has a wrong offset!");
static_assert(offsetof(UPoseSearchDatabase, BaseCostBias) == 0x00003C, "Member 'UPoseSearchDatabase::BaseCostBias' has a wrong offset!");
static_assert(offsetof(UPoseSearchDatabase, LoopingCostBias) == 0x000040, "Member 'UPoseSearchDatabase::LoopingCostBias' has a wrong offset!");
static_assert(offsetof(UPoseSearchDatabase, ContinuingInteractionCostBias) == 0x000044, "Member 'UPoseSearchDatabase::ContinuingInteractionCostBias' has a wrong offset!");
static_assert(offsetof(UPoseSearchDatabase, AnimationAssets) == 0x000048, "Member 'UPoseSearchDatabase::AnimationAssets' has a wrong offset!");
static_assert(offsetof(UPoseSearchDatabase, Chooser) == 0x000058, "Member 'UPoseSearchDatabase::Chooser' has a wrong offset!");
static_assert(offsetof(UPoseSearchDatabase, Tags) == 0x000060, "Member 'UPoseSearchDatabase::Tags' has a wrong offset!");
static_assert(offsetof(UPoseSearchDatabase, PoseSearchMode) == 0x000070, "Member 'UPoseSearchDatabase::PoseSearchMode' has a wrong offset!");
static_assert(offsetof(UPoseSearchDatabase, KDTreeQueryNumNeighbors) == 0x000074, "Member 'UPoseSearchDatabase::KDTreeQueryNumNeighbors' has a wrong offset!");
static_assert(offsetof(UPoseSearchDatabase, KDTreeQueryNumNeighborsWithDuplicates) == 0x000078, "Member 'UPoseSearchDatabase::KDTreeQueryNumNeighborsWithDuplicates' has a wrong offset!");

// Class PoseSearch.PoseSearchEventLibrary
// 0x0000 (0x0028 - 0x0028)
class UPoseSearchEventLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void UpdatePoseSearchEvent(const struct FPoseSearchEvent& InNewEvent, bool bIsNewEventValid, float DeltaSeconds, struct FPoseSearchEvent& InOutCurrentEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchEventLibrary">();
	}
	static class UPoseSearchEventLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchEventLibrary>();
	}
};
static_assert(alignof(UPoseSearchEventLibrary) == 0x000008, "Wrong alignment on UPoseSearchEventLibrary");
static_assert(sizeof(UPoseSearchEventLibrary) == 0x000028, "Wrong size on UPoseSearchEventLibrary");

// Class PoseSearch.PoseSearchFeatureChannel
// 0x0018 (0x0040 - 0x0028)
class UPoseSearchFeatureChannel : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ChannelDataOffset;                                 // 0x0038(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ChannelCardinality;                                // 0x003C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel">();
	}
	static class UPoseSearchFeatureChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel>();
	}
};
static_assert(alignof(UPoseSearchFeatureChannel) == 0x000008, "Wrong alignment on UPoseSearchFeatureChannel");
static_assert(sizeof(UPoseSearchFeatureChannel) == 0x000040, "Wrong size on UPoseSearchFeatureChannel");
static_assert(offsetof(UPoseSearchFeatureChannel, ChannelDataOffset) == 0x000038, "Member 'UPoseSearchFeatureChannel::ChannelDataOffset' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel, ChannelCardinality) == 0x00003C, "Member 'UPoseSearchFeatureChannel::ChannelCardinality' has a wrong offset!");

// Class PoseSearch.PoseSearchFeatureChannel_Curve
// 0x0020 (0x0060 - 0x0040)
class UPoseSearchFeatureChannel_Curve final : public UPoseSearchFeatureChannel
{
public:
	class FName                                   CurveName;                                         // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SampleRole;                                        // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          CurveIdx;                                          // 0x0050(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SampleTimeOffset;                                  // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputQueryPose                               InputQueryPose;                                    // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float BP_GetCurveValue(const class UAnimInstance* AnimInstance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_Curve">();
	}
	static class UPoseSearchFeatureChannel_Curve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Curve>();
	}
};
static_assert(alignof(UPoseSearchFeatureChannel_Curve) == 0x000008, "Wrong alignment on UPoseSearchFeatureChannel_Curve");
static_assert(sizeof(UPoseSearchFeatureChannel_Curve) == 0x000060, "Wrong size on UPoseSearchFeatureChannel_Curve");
static_assert(offsetof(UPoseSearchFeatureChannel_Curve, CurveName) == 0x000040, "Member 'UPoseSearchFeatureChannel_Curve::CurveName' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Curve, SampleRole) == 0x000048, "Member 'UPoseSearchFeatureChannel_Curve::SampleRole' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Curve, CurveIdx) == 0x000050, "Member 'UPoseSearchFeatureChannel_Curve::CurveIdx' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Curve, SampleTimeOffset) == 0x000054, "Member 'UPoseSearchFeatureChannel_Curve::SampleTimeOffset' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Curve, InputQueryPose) == 0x000058, "Member 'UPoseSearchFeatureChannel_Curve::InputQueryPose' has a wrong offset!");

// Class PoseSearch.PoseSearchFeatureChannel_Distance
// 0x0050 (0x0090 - 0x0040)
class UPoseSearchFeatureChannel_Distance final : public UPoseSearchFeatureChannel
{
public:
	bool                                          bDefaultWithRootBone;                              // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         bone;                                              // 0x0044(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   SampleRole;                                        // 0x0054(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneReference                         OriginBone;                                        // 0x005C(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   OriginRole;                                        // 0x006C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistance;                                       // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SamplingAttributeId;                               // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SampleTimeOffset;                                  // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OriginTimeOffset;                                  // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaBoneIdx;                                     // 0x0084(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaOriginBoneIdx;                               // 0x0085(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputQueryPose                               InputQueryPose;                                    // 0x0086(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPermutationTimeType                          PermutationTimeType;                               // 0x0087(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float BP_GetDistance(const class UAnimInstance* AnimInstance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_Distance">();
	}
	static class UPoseSearchFeatureChannel_Distance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Distance>();
	}
};
static_assert(alignof(UPoseSearchFeatureChannel_Distance) == 0x000008, "Wrong alignment on UPoseSearchFeatureChannel_Distance");
static_assert(sizeof(UPoseSearchFeatureChannel_Distance) == 0x000090, "Wrong size on UPoseSearchFeatureChannel_Distance");
static_assert(offsetof(UPoseSearchFeatureChannel_Distance, bDefaultWithRootBone) == 0x000040, "Member 'UPoseSearchFeatureChannel_Distance::bDefaultWithRootBone' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Distance, bone) == 0x000044, "Member 'UPoseSearchFeatureChannel_Distance::bone' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Distance, SampleRole) == 0x000054, "Member 'UPoseSearchFeatureChannel_Distance::SampleRole' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Distance, OriginBone) == 0x00005C, "Member 'UPoseSearchFeatureChannel_Distance::OriginBone' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Distance, OriginRole) == 0x00006C, "Member 'UPoseSearchFeatureChannel_Distance::OriginRole' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Distance, MaxDistance) == 0x000074, "Member 'UPoseSearchFeatureChannel_Distance::MaxDistance' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Distance, SamplingAttributeId) == 0x000078, "Member 'UPoseSearchFeatureChannel_Distance::SamplingAttributeId' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Distance, SampleTimeOffset) == 0x00007C, "Member 'UPoseSearchFeatureChannel_Distance::SampleTimeOffset' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Distance, OriginTimeOffset) == 0x000080, "Member 'UPoseSearchFeatureChannel_Distance::OriginTimeOffset' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Distance, SchemaBoneIdx) == 0x000084, "Member 'UPoseSearchFeatureChannel_Distance::SchemaBoneIdx' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Distance, SchemaOriginBoneIdx) == 0x000085, "Member 'UPoseSearchFeatureChannel_Distance::SchemaOriginBoneIdx' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Distance, InputQueryPose) == 0x000086, "Member 'UPoseSearchFeatureChannel_Distance::InputQueryPose' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Distance, PermutationTimeType) == 0x000087, "Member 'UPoseSearchFeatureChannel_Distance::PermutationTimeType' has a wrong offset!");

// Class PoseSearch.PoseSearchFeatureChannel_FilterCrashingLegs
// 0x0058 (0x0098 - 0x0040)
class UPoseSearchFeatureChannel_FilterCrashingLegs final : public UPoseSearchFeatureChannel
{
public:
	struct FBoneReference                         LeftThigh;                                         // 0x0040(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         RightThigh;                                        // 0x0050(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         LeftFoot;                                          // 0x0060(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                         RightFoot;                                         // 0x0070(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   SampleRole;                                        // 0x0080(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          LeftThighIdx;                                      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          RightThighIdx;                                     // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          LeftFootIdx;                                       // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          RightFootIdx;                                      // 0x008F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputQueryPose                               InputQueryPose;                                    // 0x0090(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AllowedTolerance;                                  // 0x0094(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_FilterCrashingLegs">();
	}
	static class UPoseSearchFeatureChannel_FilterCrashingLegs* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_FilterCrashingLegs>();
	}
};
static_assert(alignof(UPoseSearchFeatureChannel_FilterCrashingLegs) == 0x000008, "Wrong alignment on UPoseSearchFeatureChannel_FilterCrashingLegs");
static_assert(sizeof(UPoseSearchFeatureChannel_FilterCrashingLegs) == 0x000098, "Wrong size on UPoseSearchFeatureChannel_FilterCrashingLegs");
static_assert(offsetof(UPoseSearchFeatureChannel_FilterCrashingLegs, LeftThigh) == 0x000040, "Member 'UPoseSearchFeatureChannel_FilterCrashingLegs::LeftThigh' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_FilterCrashingLegs, RightThigh) == 0x000050, "Member 'UPoseSearchFeatureChannel_FilterCrashingLegs::RightThigh' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_FilterCrashingLegs, LeftFoot) == 0x000060, "Member 'UPoseSearchFeatureChannel_FilterCrashingLegs::LeftFoot' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_FilterCrashingLegs, RightFoot) == 0x000070, "Member 'UPoseSearchFeatureChannel_FilterCrashingLegs::RightFoot' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_FilterCrashingLegs, SampleRole) == 0x000080, "Member 'UPoseSearchFeatureChannel_FilterCrashingLegs::SampleRole' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_FilterCrashingLegs, Weight) == 0x000088, "Member 'UPoseSearchFeatureChannel_FilterCrashingLegs::Weight' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_FilterCrashingLegs, LeftThighIdx) == 0x00008C, "Member 'UPoseSearchFeatureChannel_FilterCrashingLegs::LeftThighIdx' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_FilterCrashingLegs, RightThighIdx) == 0x00008D, "Member 'UPoseSearchFeatureChannel_FilterCrashingLegs::RightThighIdx' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_FilterCrashingLegs, LeftFootIdx) == 0x00008E, "Member 'UPoseSearchFeatureChannel_FilterCrashingLegs::LeftFootIdx' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_FilterCrashingLegs, RightFootIdx) == 0x00008F, "Member 'UPoseSearchFeatureChannel_FilterCrashingLegs::RightFootIdx' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_FilterCrashingLegs, InputQueryPose) == 0x000090, "Member 'UPoseSearchFeatureChannel_FilterCrashingLegs::InputQueryPose' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_FilterCrashingLegs, AllowedTolerance) == 0x000094, "Member 'UPoseSearchFeatureChannel_FilterCrashingLegs::AllowedTolerance' has a wrong offset!");

// Class PoseSearch.PoseSearchFeatureChannel_GroupBase
// 0x0010 (0x0050 - 0x0040)
class UPoseSearchFeatureChannel_GroupBase : public UPoseSearchFeatureChannel
{
public:
	class FName                                   SampleRole;                                        // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DebugWeightGroupID;                                // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_GroupBase">();
	}
	static class UPoseSearchFeatureChannel_GroupBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_GroupBase>();
	}
};
static_assert(alignof(UPoseSearchFeatureChannel_GroupBase) == 0x000008, "Wrong alignment on UPoseSearchFeatureChannel_GroupBase");
static_assert(sizeof(UPoseSearchFeatureChannel_GroupBase) == 0x000050, "Wrong size on UPoseSearchFeatureChannel_GroupBase");
static_assert(offsetof(UPoseSearchFeatureChannel_GroupBase, SampleRole) == 0x000040, "Member 'UPoseSearchFeatureChannel_GroupBase::SampleRole' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_GroupBase, DebugWeightGroupID) == 0x000048, "Member 'UPoseSearchFeatureChannel_GroupBase::DebugWeightGroupID' has a wrong offset!");

// Class PoseSearch.PoseSearchFeatureChannel_Group
// 0x0010 (0x0060 - 0x0050)
class UPoseSearchFeatureChannel_Group final : public UPoseSearchFeatureChannel_GroupBase
{
public:
	TArray<class UPoseSearchFeatureChannel*>      SubChannels;                                       // 0x0050(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_Group">();
	}
	static class UPoseSearchFeatureChannel_Group* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Group>();
	}
};
static_assert(alignof(UPoseSearchFeatureChannel_Group) == 0x000008, "Wrong alignment on UPoseSearchFeatureChannel_Group");
static_assert(sizeof(UPoseSearchFeatureChannel_Group) == 0x000060, "Wrong size on UPoseSearchFeatureChannel_Group");
static_assert(offsetof(UPoseSearchFeatureChannel_Group, SubChannels) == 0x000050, "Member 'UPoseSearchFeatureChannel_Group::SubChannels' has a wrong offset!");

// Class PoseSearch.PoseSearchFeatureChannel_Heading
// 0x0048 (0x0088 - 0x0040)
class UPoseSearchFeatureChannel_Heading final : public UPoseSearchFeatureChannel
{
public:
	bool                                          bDefaultWithRootBone;                              // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         bone;                                              // 0x0044(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   SampleRole;                                        // 0x0054(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneReference                         OriginBone;                                        // 0x005C(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   OriginRole;                                        // 0x006C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SamplingAttributeId;                               // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SampleTimeOffset;                                  // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OriginTimeOffset;                                  // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHeadingAxis                                  HeadingAxis;                                       // 0x0080(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaBoneIdx;                                     // 0x0081(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaOriginBoneIdx;                               // 0x0082(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputQueryPose                               InputQueryPose;                                    // 0x0083(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EComponentStrippingVector                     ComponentStripping;                                // 0x0084(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPermutationTimeType                          PermutationTimeType;                               // 0x0085(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FQuat BP_GetWorldRotation(const class UAnimInstance* AnimInstance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_Heading">();
	}
	static class UPoseSearchFeatureChannel_Heading* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Heading>();
	}
};
static_assert(alignof(UPoseSearchFeatureChannel_Heading) == 0x000008, "Wrong alignment on UPoseSearchFeatureChannel_Heading");
static_assert(sizeof(UPoseSearchFeatureChannel_Heading) == 0x000088, "Wrong size on UPoseSearchFeatureChannel_Heading");
static_assert(offsetof(UPoseSearchFeatureChannel_Heading, bDefaultWithRootBone) == 0x000040, "Member 'UPoseSearchFeatureChannel_Heading::bDefaultWithRootBone' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Heading, bone) == 0x000044, "Member 'UPoseSearchFeatureChannel_Heading::bone' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Heading, SampleRole) == 0x000054, "Member 'UPoseSearchFeatureChannel_Heading::SampleRole' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Heading, OriginBone) == 0x00005C, "Member 'UPoseSearchFeatureChannel_Heading::OriginBone' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Heading, OriginRole) == 0x00006C, "Member 'UPoseSearchFeatureChannel_Heading::OriginRole' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Heading, SamplingAttributeId) == 0x000074, "Member 'UPoseSearchFeatureChannel_Heading::SamplingAttributeId' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Heading, SampleTimeOffset) == 0x000078, "Member 'UPoseSearchFeatureChannel_Heading::SampleTimeOffset' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Heading, OriginTimeOffset) == 0x00007C, "Member 'UPoseSearchFeatureChannel_Heading::OriginTimeOffset' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Heading, HeadingAxis) == 0x000080, "Member 'UPoseSearchFeatureChannel_Heading::HeadingAxis' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Heading, SchemaBoneIdx) == 0x000081, "Member 'UPoseSearchFeatureChannel_Heading::SchemaBoneIdx' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Heading, SchemaOriginBoneIdx) == 0x000082, "Member 'UPoseSearchFeatureChannel_Heading::SchemaOriginBoneIdx' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Heading, InputQueryPose) == 0x000083, "Member 'UPoseSearchFeatureChannel_Heading::InputQueryPose' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Heading, ComponentStripping) == 0x000084, "Member 'UPoseSearchFeatureChannel_Heading::ComponentStripping' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Heading, PermutationTimeType) == 0x000085, "Member 'UPoseSearchFeatureChannel_Heading::PermutationTimeType' has a wrong offset!");

// Class PoseSearch.PoseSearchFeatureChannel_Padding
// 0x0008 (0x0048 - 0x0040)
class UPoseSearchFeatureChannel_Padding final : public UPoseSearchFeatureChannel
{
public:
	int32                                         PaddingSize;                                       // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_Padding">();
	}
	static class UPoseSearchFeatureChannel_Padding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Padding>();
	}
};
static_assert(alignof(UPoseSearchFeatureChannel_Padding) == 0x000008, "Wrong alignment on UPoseSearchFeatureChannel_Padding");
static_assert(sizeof(UPoseSearchFeatureChannel_Padding) == 0x000048, "Wrong size on UPoseSearchFeatureChannel_Padding");
static_assert(offsetof(UPoseSearchFeatureChannel_Padding, PaddingSize) == 0x000040, "Member 'UPoseSearchFeatureChannel_Padding::PaddingSize' has a wrong offset!");

// Class PoseSearch.PoseSearchFeatureChannel_PermutationTime
// 0x0000 (0x0040 - 0x0040)
class UPoseSearchFeatureChannel_PermutationTime final : public UPoseSearchFeatureChannel
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_PermutationTime">();
	}
	static class UPoseSearchFeatureChannel_PermutationTime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_PermutationTime>();
	}
};
static_assert(alignof(UPoseSearchFeatureChannel_PermutationTime) == 0x000008, "Wrong alignment on UPoseSearchFeatureChannel_PermutationTime");
static_assert(sizeof(UPoseSearchFeatureChannel_PermutationTime) == 0x000040, "Wrong size on UPoseSearchFeatureChannel_PermutationTime");

// Class PoseSearch.PoseSearchFeatureChannel_Phase
// 0x0020 (0x0060 - 0x0040)
class UPoseSearchFeatureChannel_Phase final : public UPoseSearchFeatureChannel
{
public:
	struct FBoneReference                         bone;                                              // 0x0040(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   SampleRole;                                        // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaBoneIdx;                                     // 0x0058(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputQueryPose                               InputQueryPose;                                    // 0x0059(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_Phase">();
	}
	static class UPoseSearchFeatureChannel_Phase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Phase>();
	}
};
static_assert(alignof(UPoseSearchFeatureChannel_Phase) == 0x000008, "Wrong alignment on UPoseSearchFeatureChannel_Phase");
static_assert(sizeof(UPoseSearchFeatureChannel_Phase) == 0x000060, "Wrong size on UPoseSearchFeatureChannel_Phase");
static_assert(offsetof(UPoseSearchFeatureChannel_Phase, bone) == 0x000040, "Member 'UPoseSearchFeatureChannel_Phase::bone' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Phase, SampleRole) == 0x000050, "Member 'UPoseSearchFeatureChannel_Phase::SampleRole' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Phase, SchemaBoneIdx) == 0x000058, "Member 'UPoseSearchFeatureChannel_Phase::SchemaBoneIdx' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Phase, InputQueryPose) == 0x000059, "Member 'UPoseSearchFeatureChannel_Phase::InputQueryPose' has a wrong offset!");

// Class PoseSearch.PoseSearchFeatureChannel_Pose
// 0x0038 (0x0088 - 0x0050)
class UPoseSearchFeatureChannel_Pose final : public UPoseSearchFeatureChannel_GroupBase
{
public:
	TArray<struct FPoseSearchBone>                SampledBones;                                      // 0x0050(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int8>                                  SchemaBoneIdx;                                     // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	EInputQueryPose                               InputQueryPose;                                    // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCharacterSpaceVelocities;                      // 0x0071(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPermutationTimeType                          PermutationTimeType;                               // 0x0072(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPoseSearchFeatureChannel*>      SubChannels;                                       // 0x0078(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_Pose">();
	}
	static class UPoseSearchFeatureChannel_Pose* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Pose>();
	}
};
static_assert(alignof(UPoseSearchFeatureChannel_Pose) == 0x000008, "Wrong alignment on UPoseSearchFeatureChannel_Pose");
static_assert(sizeof(UPoseSearchFeatureChannel_Pose) == 0x000088, "Wrong size on UPoseSearchFeatureChannel_Pose");
static_assert(offsetof(UPoseSearchFeatureChannel_Pose, SampledBones) == 0x000050, "Member 'UPoseSearchFeatureChannel_Pose::SampledBones' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Pose, SchemaBoneIdx) == 0x000060, "Member 'UPoseSearchFeatureChannel_Pose::SchemaBoneIdx' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Pose, InputQueryPose) == 0x000070, "Member 'UPoseSearchFeatureChannel_Pose::InputQueryPose' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Pose, bUseCharacterSpaceVelocities) == 0x000071, "Member 'UPoseSearchFeatureChannel_Pose::bUseCharacterSpaceVelocities' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Pose, PermutationTimeType) == 0x000072, "Member 'UPoseSearchFeatureChannel_Pose::PermutationTimeType' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Pose, SubChannels) == 0x000078, "Member 'UPoseSearchFeatureChannel_Pose::SubChannels' has a wrong offset!");

// Class PoseSearch.PoseSearchFeatureChannel_Position
// 0x0050 (0x0090 - 0x0040)
class UPoseSearchFeatureChannel_Position final : public UPoseSearchFeatureChannel
{
public:
	bool                                          bDefaultWithRootBone;                              // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         bone;                                              // 0x0044(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   SampleRole;                                        // 0x0054(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneReference                         OriginBone;                                        // 0x005C(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   OriginRole;                                        // 0x006C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SamplingAttributeId;                               // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SampleTimeOffset;                                  // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OriginTimeOffset;                                  // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaBoneIdx;                                     // 0x0080(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaOriginBoneIdx;                               // 0x0081(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputQueryPose                               InputQueryPose;                                    // 0x0082(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EComponentStrippingVector                     ComponentStripping;                                // 0x0083(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPermutationTimeType                          PermutationTimeType;                               // 0x0084(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxPositionDistanceSquared;                        // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNormalizeDisplacement;                            // 0x008C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector BP_GetWorldPosition(const class UAnimInstance* AnimInstance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_Position">();
	}
	static class UPoseSearchFeatureChannel_Position* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Position>();
	}
};
static_assert(alignof(UPoseSearchFeatureChannel_Position) == 0x000008, "Wrong alignment on UPoseSearchFeatureChannel_Position");
static_assert(sizeof(UPoseSearchFeatureChannel_Position) == 0x000090, "Wrong size on UPoseSearchFeatureChannel_Position");
static_assert(offsetof(UPoseSearchFeatureChannel_Position, bDefaultWithRootBone) == 0x000040, "Member 'UPoseSearchFeatureChannel_Position::bDefaultWithRootBone' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Position, bone) == 0x000044, "Member 'UPoseSearchFeatureChannel_Position::bone' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Position, SampleRole) == 0x000054, "Member 'UPoseSearchFeatureChannel_Position::SampleRole' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Position, OriginBone) == 0x00005C, "Member 'UPoseSearchFeatureChannel_Position::OriginBone' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Position, OriginRole) == 0x00006C, "Member 'UPoseSearchFeatureChannel_Position::OriginRole' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Position, SamplingAttributeId) == 0x000074, "Member 'UPoseSearchFeatureChannel_Position::SamplingAttributeId' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Position, SampleTimeOffset) == 0x000078, "Member 'UPoseSearchFeatureChannel_Position::SampleTimeOffset' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Position, OriginTimeOffset) == 0x00007C, "Member 'UPoseSearchFeatureChannel_Position::OriginTimeOffset' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Position, SchemaBoneIdx) == 0x000080, "Member 'UPoseSearchFeatureChannel_Position::SchemaBoneIdx' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Position, SchemaOriginBoneIdx) == 0x000081, "Member 'UPoseSearchFeatureChannel_Position::SchemaOriginBoneIdx' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Position, InputQueryPose) == 0x000082, "Member 'UPoseSearchFeatureChannel_Position::InputQueryPose' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Position, ComponentStripping) == 0x000083, "Member 'UPoseSearchFeatureChannel_Position::ComponentStripping' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Position, PermutationTimeType) == 0x000084, "Member 'UPoseSearchFeatureChannel_Position::PermutationTimeType' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Position, MaxPositionDistanceSquared) == 0x000088, "Member 'UPoseSearchFeatureChannel_Position::MaxPositionDistanceSquared' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Position, bNormalizeDisplacement) == 0x00008C, "Member 'UPoseSearchFeatureChannel_Position::bNormalizeDisplacement' has a wrong offset!");

// Class PoseSearch.PoseSearchFeatureChannel_SamplingTime
// 0x0008 (0x0048 - 0x0040)
class UPoseSearchFeatureChannel_SamplingTime final : public UPoseSearchFeatureChannel
{
public:
	float                                         Weight;                                            // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeToMatch;                                       // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_SamplingTime">();
	}
	static class UPoseSearchFeatureChannel_SamplingTime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_SamplingTime>();
	}
};
static_assert(alignof(UPoseSearchFeatureChannel_SamplingTime) == 0x000008, "Wrong alignment on UPoseSearchFeatureChannel_SamplingTime");
static_assert(sizeof(UPoseSearchFeatureChannel_SamplingTime) == 0x000048, "Wrong size on UPoseSearchFeatureChannel_SamplingTime");
static_assert(offsetof(UPoseSearchFeatureChannel_SamplingTime, Weight) == 0x000040, "Member 'UPoseSearchFeatureChannel_SamplingTime::Weight' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_SamplingTime, TimeToMatch) == 0x000044, "Member 'UPoseSearchFeatureChannel_SamplingTime::TimeToMatch' has a wrong offset!");

// Class PoseSearch.PoseSearchFeatureChannel_TimeToEvent
// 0x0010 (0x0050 - 0x0040)
class UPoseSearchFeatureChannel_TimeToEvent final : public UPoseSearchFeatureChannel
{
public:
	float                                         Weight;                                            // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SamplingAttributeId;                               // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float BP_GetTimeToEvent(const class UAnimInstance* AnimInstance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_TimeToEvent">();
	}
	static class UPoseSearchFeatureChannel_TimeToEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_TimeToEvent>();
	}
};
static_assert(alignof(UPoseSearchFeatureChannel_TimeToEvent) == 0x000008, "Wrong alignment on UPoseSearchFeatureChannel_TimeToEvent");
static_assert(sizeof(UPoseSearchFeatureChannel_TimeToEvent) == 0x000050, "Wrong size on UPoseSearchFeatureChannel_TimeToEvent");
static_assert(offsetof(UPoseSearchFeatureChannel_TimeToEvent, Weight) == 0x000040, "Member 'UPoseSearchFeatureChannel_TimeToEvent::Weight' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_TimeToEvent, SamplingAttributeId) == 0x000044, "Member 'UPoseSearchFeatureChannel_TimeToEvent::SamplingAttributeId' has a wrong offset!");

// Class PoseSearch.PoseSearchFeatureChannel_Trajectory
// 0x0020 (0x0070 - 0x0050)
class UPoseSearchFeatureChannel_Trajectory final : public UPoseSearchFeatureChannel_GroupBase
{
public:
	TArray<struct FPoseSearchTrajectorySample>    Samples;                                           // 0x0050(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UPoseSearchFeatureChannel*>      SubChannels;                                       // 0x0060(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_Trajectory">();
	}
	static class UPoseSearchFeatureChannel_Trajectory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Trajectory>();
	}
};
static_assert(alignof(UPoseSearchFeatureChannel_Trajectory) == 0x000008, "Wrong alignment on UPoseSearchFeatureChannel_Trajectory");
static_assert(sizeof(UPoseSearchFeatureChannel_Trajectory) == 0x000070, "Wrong size on UPoseSearchFeatureChannel_Trajectory");
static_assert(offsetof(UPoseSearchFeatureChannel_Trajectory, Samples) == 0x000050, "Member 'UPoseSearchFeatureChannel_Trajectory::Samples' has a wrong offset!");
static_assert(offsetof(UPoseSearchFeatureChannel_Trajectory, SubChannels) == 0x000060, "Member 'UPoseSearchFeatureChannel_Trajectory::SubChannels' has a wrong offset!");

// Class PoseSearch.PoseSearchFeatureChannel_Velocity
// 0x0048 (0x0088 - 0x0040)
class UPoseSearchFeatureChannel_Velocity final : public UPoseSearchFeatureChannel
{
public:
	bool                                          bDefaultWithRootBone;                              // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoneReference                         bone;                                              // 0x0044(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   SampleRole;                                        // 0x0054(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBoneReference                         OriginBone;                                        // 0x005C(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   OriginRole;                                        // 0x006C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SamplingAttributeId;                               // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SampleTimeOffset;                                  // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OriginTimeOffset;                                  // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaBoneIdx;                                     // 0x0080(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          SchemaOriginBoneIdx;                               // 0x0081(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputQueryPose                               InputQueryPose;                                    // 0x0082(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCharacterSpaceVelocities;                      // 0x0083(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNormalize;                                        // 0x0084(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EComponentStrippingVector                     ComponentStripping;                                // 0x0085(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPermutationTimeType                          PermutationTimeType;                               // 0x0086(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_87[0x1];                                       // 0x0087(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector BP_GetWorldVelocity(const class UAnimInstance* AnimInstance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PoseSearchFeatureChannel_Velocity">();
	}
	static class UPoseSearchFeatureChannel_Velocity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPoseSearchFeatureChannel_Velocity>();
	}
};
static_assert(alignof(UPoseSearchFeatureChannel_Velocity) == 0x000008, "Wrong alignment on UPoseSearchFeatureChannel_Velocity");
static_assert(sizeof(UPoseSearchFeatureChannel_Velocity) == 0x000088, "Wrong size on UPoseSearchFeatureChannel_Velocity");
