#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProceduralGeneration

#include "Basic.hpp"

#include "ProceduralGeneration_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ProceduralGeneration.PBG_DynamicStaticMeshComponent.CreateDynamicMeshToStaticMesh
// 0x0010 (0x0010 - 0x0000)
struct PBG_DynamicStaticMeshComponent_CreateDynamicMeshToStaticMesh final
{
public:
	TArray<struct FVector2D>                      PolygonVertices;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(PBG_DynamicStaticMeshComponent_CreateDynamicMeshToStaticMesh) == 0x000008, "Wrong alignment on PBG_DynamicStaticMeshComponent_CreateDynamicMeshToStaticMesh");
static_assert(sizeof(PBG_DynamicStaticMeshComponent_CreateDynamicMeshToStaticMesh) == 0x000010, "Wrong size on PBG_DynamicStaticMeshComponent_CreateDynamicMeshToStaticMesh");
static_assert(offsetof(PBG_DynamicStaticMeshComponent_CreateDynamicMeshToStaticMesh, PolygonVertices) == 0x000000, "Member 'PBG_DynamicStaticMeshComponent_CreateDynamicMeshToStaticMesh::PolygonVertices' has a wrong offset!");

// Function ProceduralGeneration.PBG_DynamicStaticMeshComponent.UpdateDynamicMeshToStaticMesh
// 0x0018 (0x0018 - 0x0000)
struct PBG_DynamicStaticMeshComponent_UpdateDynamicMeshToStaticMesh final
{
public:
	class USplineComponent*                       Spline;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TangentOffset;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SamplingOffset;                                    // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         distanceoffset;                                    // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBGDynamicMethod                             method;                                            // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PBG_DynamicStaticMeshComponent_UpdateDynamicMeshToStaticMesh) == 0x000008, "Wrong alignment on PBG_DynamicStaticMeshComponent_UpdateDynamicMeshToStaticMesh");
static_assert(sizeof(PBG_DynamicStaticMeshComponent_UpdateDynamicMeshToStaticMesh) == 0x000018, "Wrong size on PBG_DynamicStaticMeshComponent_UpdateDynamicMeshToStaticMesh");
static_assert(offsetof(PBG_DynamicStaticMeshComponent_UpdateDynamicMeshToStaticMesh, Spline) == 0x000000, "Member 'PBG_DynamicStaticMeshComponent_UpdateDynamicMeshToStaticMesh::Spline' has a wrong offset!");
static_assert(offsetof(PBG_DynamicStaticMeshComponent_UpdateDynamicMeshToStaticMesh, TangentOffset) == 0x000008, "Member 'PBG_DynamicStaticMeshComponent_UpdateDynamicMeshToStaticMesh::TangentOffset' has a wrong offset!");
static_assert(offsetof(PBG_DynamicStaticMeshComponent_UpdateDynamicMeshToStaticMesh, SamplingOffset) == 0x00000C, "Member 'PBG_DynamicStaticMeshComponent_UpdateDynamicMeshToStaticMesh::SamplingOffset' has a wrong offset!");
static_assert(offsetof(PBG_DynamicStaticMeshComponent_UpdateDynamicMeshToStaticMesh, distanceoffset) == 0x000010, "Member 'PBG_DynamicStaticMeshComponent_UpdateDynamicMeshToStaticMesh::distanceoffset' has a wrong offset!");
static_assert(offsetof(PBG_DynamicStaticMeshComponent_UpdateDynamicMeshToStaticMesh, method) == 0x000014, "Member 'PBG_DynamicStaticMeshComponent_UpdateDynamicMeshToStaticMesh::method' has a wrong offset!");

// Function ProceduralGeneration.ProceduralBuildGenerationActor.ChangePCGMeshToMergeMesh
// 0x0008 (0x0008 - 0x0000)
struct ProceduralBuildGenerationActor_ChangePCGMeshToMergeMesh final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProceduralBuildGenerationActor_ChangePCGMeshToMergeMesh) == 0x000008, "Wrong alignment on ProceduralBuildGenerationActor_ChangePCGMeshToMergeMesh");
static_assert(sizeof(ProceduralBuildGenerationActor_ChangePCGMeshToMergeMesh) == 0x000008, "Wrong size on ProceduralBuildGenerationActor_ChangePCGMeshToMergeMesh");
static_assert(offsetof(ProceduralBuildGenerationActor_ChangePCGMeshToMergeMesh, Actor) == 0x000000, "Member 'ProceduralBuildGenerationActor_ChangePCGMeshToMergeMesh::Actor' has a wrong offset!");

// Function ProceduralGeneration.ProceduralBuildGenerationActor.CleanupInvalidCollision
// 0x0010 (0x0010 - 0x0000)
struct ProceduralBuildGenerationActor_CleanupInvalidCollision final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ProceduralBuildGenerationActor_CleanupInvalidCollision) == 0x000008, "Wrong alignment on ProceduralBuildGenerationActor_CleanupInvalidCollision");
static_assert(sizeof(ProceduralBuildGenerationActor_CleanupInvalidCollision) == 0x000010, "Wrong size on ProceduralBuildGenerationActor_CleanupInvalidCollision");
static_assert(offsetof(ProceduralBuildGenerationActor_CleanupInvalidCollision, StaticMesh) == 0x000000, "Member 'ProceduralBuildGenerationActor_CleanupInvalidCollision::StaticMesh' has a wrong offset!");
static_assert(offsetof(ProceduralBuildGenerationActor_CleanupInvalidCollision, ReturnValue) == 0x000008, "Member 'ProceduralBuildGenerationActor_CleanupInvalidCollision::ReturnValue' has a wrong offset!");

// Function ProceduralGeneration.ProceduralBuildGenerationActor.ConvertDynamicMeshToStaticMesh
// 0x0020 (0x0020 - 0x0000)
struct ProceduralBuildGenerationActor_ConvertDynamicMeshToStaticMesh final
{
public:
	class FString                                 AssetPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AssetName;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProceduralBuildGenerationActor_ConvertDynamicMeshToStaticMesh) == 0x000008, "Wrong alignment on ProceduralBuildGenerationActor_ConvertDynamicMeshToStaticMesh");
static_assert(sizeof(ProceduralBuildGenerationActor_ConvertDynamicMeshToStaticMesh) == 0x000020, "Wrong size on ProceduralBuildGenerationActor_ConvertDynamicMeshToStaticMesh");
static_assert(offsetof(ProceduralBuildGenerationActor_ConvertDynamicMeshToStaticMesh, AssetPath) == 0x000000, "Member 'ProceduralBuildGenerationActor_ConvertDynamicMeshToStaticMesh::AssetPath' has a wrong offset!");
static_assert(offsetof(ProceduralBuildGenerationActor_ConvertDynamicMeshToStaticMesh, AssetName) == 0x000010, "Member 'ProceduralBuildGenerationActor_ConvertDynamicMeshToStaticMesh::AssetName' has a wrong offset!");

// Function ProceduralGeneration.ProceduralBuildGenerationActor.CreateNavigationLowMesh
// 0x0010 (0x0010 - 0x0000)
struct ProceduralBuildGenerationActor_CreateNavigationLowMesh final
{
public:
	class UDynamicMesh*                           TargetMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProceduralBuildGenerationActor_CreateNavigationLowMesh) == 0x000008, "Wrong alignment on ProceduralBuildGenerationActor_CreateNavigationLowMesh");
static_assert(sizeof(ProceduralBuildGenerationActor_CreateNavigationLowMesh) == 0x000010, "Wrong size on ProceduralBuildGenerationActor_CreateNavigationLowMesh");
static_assert(offsetof(ProceduralBuildGenerationActor_CreateNavigationLowMesh, TargetMesh) == 0x000000, "Member 'ProceduralBuildGenerationActor_CreateNavigationLowMesh::TargetMesh' has a wrong offset!");
static_assert(offsetof(ProceduralBuildGenerationActor_CreateNavigationLowMesh, ReturnValue) == 0x000008, "Member 'ProceduralBuildGenerationActor_CreateNavigationLowMesh::ReturnValue' has a wrong offset!");

// Function ProceduralGeneration.ProceduralBuildGenerationActor.SetMobileSetting
// 0x0010 (0x0010 - 0x0000)
struct ProceduralBuildGenerationActor_SetMobileSetting final
{
public:
	TArray<class UStaticMesh*>                    Meshs;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProceduralBuildGenerationActor_SetMobileSetting) == 0x000008, "Wrong alignment on ProceduralBuildGenerationActor_SetMobileSetting");
static_assert(sizeof(ProceduralBuildGenerationActor_SetMobileSetting) == 0x000010, "Wrong size on ProceduralBuildGenerationActor_SetMobileSetting");
static_assert(offsetof(ProceduralBuildGenerationActor_SetMobileSetting, Meshs) == 0x000000, "Member 'ProceduralBuildGenerationActor_SetMobileSetting::Meshs' has a wrong offset!");

// Function ProceduralGeneration.ProceduralBuildGenerationActor.UpdateLodMaterials
// 0x0050 (0x0050 - 0x0000)
struct ProceduralBuildGenerationActor_UpdateLodMaterials final
{
public:
	TMap<class UMaterialInterface*, class UMaterialInterface*> LodMaterials;                         // 0x0000(0x0050)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ProceduralBuildGenerationActor_UpdateLodMaterials) == 0x000008, "Wrong alignment on ProceduralBuildGenerationActor_UpdateLodMaterials");
static_assert(sizeof(ProceduralBuildGenerationActor_UpdateLodMaterials) == 0x000050, "Wrong size on ProceduralBuildGenerationActor_UpdateLodMaterials");
static_assert(offsetof(ProceduralBuildGenerationActor_UpdateLodMaterials, LodMaterials) == 0x000000, "Member 'ProceduralBuildGenerationActor_UpdateLodMaterials::LodMaterials' has a wrong offset!");

}

