#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProceduralGeneration

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum ProceduralGeneration.EPBGDynamicMethod
// NumValues: 0x0003
enum class EPBGDynamicMethod : uint8
{
	Slope                                    = 0,
	Distance                                 = 1,
	EPBGDynamicMethod_MAX                    = 2,
};

// Enum ProceduralGeneration.EPBGModuleMethod
// NumValues: 0x0003
enum class EPBGModuleMethod : uint8
{
	Random                                   = 0,
	Sequential                               = 1,
	EPBGModuleMethod_MAX                     = 2,
};

// Enum ProceduralGeneration.EPBGModuleTag
// NumValues: 0x000A
enum class EPBGModuleTag : uint8
{
	None                                     = 0,
	Corner                                   = 1,
	Wall                                     = 2,
	Window                                   = 3,
	Door                                     = 4,
	Eave                                     = 5,
	EaveCorner                               = 6,
	Any                                      = 7,
	Max_Module                               = 8,
	EPBGModuleTag_MAX                        = 9,
};

// ScriptStruct ProceduralGeneration.PBGModuleConfig
// 0x0058 (0x0058 - 0x0000)
struct FPBGModuleConfig final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                StaticMeshOffset;                                  // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               StaticMeshRotation;                                // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                StaticMeshScale;                                   // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsMirror;                                          // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPBGModuleConfig) == 0x000008, "Wrong alignment on FPBGModuleConfig");
static_assert(sizeof(FPBGModuleConfig) == 0x000058, "Wrong size on FPBGModuleConfig");
static_assert(offsetof(FPBGModuleConfig, StaticMesh) == 0x000000, "Member 'FPBGModuleConfig::StaticMesh' has a wrong offset!");
static_assert(offsetof(FPBGModuleConfig, StaticMeshOffset) == 0x000008, "Member 'FPBGModuleConfig::StaticMeshOffset' has a wrong offset!");
static_assert(offsetof(FPBGModuleConfig, StaticMeshRotation) == 0x000020, "Member 'FPBGModuleConfig::StaticMeshRotation' has a wrong offset!");
static_assert(offsetof(FPBGModuleConfig, StaticMeshScale) == 0x000038, "Member 'FPBGModuleConfig::StaticMeshScale' has a wrong offset!");
static_assert(offsetof(FPBGModuleConfig, IsMirror) == 0x000050, "Member 'FPBGModuleConfig::IsMirror' has a wrong offset!");

// ScriptStruct ProceduralGeneration.PBGModuleISMSetting
// 0x0001 (0x0001 - 0x0000)
struct FPBGModuleISMSetting final
{
public:
	EPBGModuleTag                                 MethodTag;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPBGModuleISMSetting) == 0x000001, "Wrong alignment on FPBGModuleISMSetting");
static_assert(sizeof(FPBGModuleISMSetting) == 0x000001, "Wrong size on FPBGModuleISMSetting");
static_assert(offsetof(FPBGModuleISMSetting, MethodTag) == 0x000000, "Member 'FPBGModuleISMSetting::MethodTag' has a wrong offset!");

// ScriptStruct ProceduralGeneration.PBGModuleConfigs
// 0x0018 (0x0018 - 0x0000)
struct FPBGModuleConfigs final
{
public:
	TArray<struct FPBGModuleConfig>               ModuleConfigs;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FPBGModuleISMSetting                   ISMSetting;                                        // 0x0010(0x0001)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPBGModuleConfigs) == 0x000008, "Wrong alignment on FPBGModuleConfigs");
static_assert(sizeof(FPBGModuleConfigs) == 0x000018, "Wrong size on FPBGModuleConfigs");
static_assert(offsetof(FPBGModuleConfigs, ModuleConfigs) == 0x000000, "Member 'FPBGModuleConfigs::ModuleConfigs' has a wrong offset!");
static_assert(offsetof(FPBGModuleConfigs, ISMSetting) == 0x000010, "Member 'FPBGModuleConfigs::ISMSetting' has a wrong offset!");

// ScriptStruct ProceduralGeneration.PBGModuleGroup
// 0x0020 (0x0020 - 0x0000)
struct FPBGModuleGroup final
{
public:
	bool                                          bIsCornerModule;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAcross;                                         // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLoop;                                           // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBGModuleMethod                              LoopMethod;                                        // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LoopWeight;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAutoScale;                                      // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBGModuleConfigs>              Modules;                                           // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPBGModuleGroup) == 0x000008, "Wrong alignment on FPBGModuleGroup");
static_assert(sizeof(FPBGModuleGroup) == 0x000020, "Wrong size on FPBGModuleGroup");
static_assert(offsetof(FPBGModuleGroup, bIsCornerModule) == 0x000000, "Member 'FPBGModuleGroup::bIsCornerModule' has a wrong offset!");
static_assert(offsetof(FPBGModuleGroup, bIsAcross) == 0x000001, "Member 'FPBGModuleGroup::bIsAcross' has a wrong offset!");
static_assert(offsetof(FPBGModuleGroup, bIsLoop) == 0x000002, "Member 'FPBGModuleGroup::bIsLoop' has a wrong offset!");
static_assert(offsetof(FPBGModuleGroup, LoopMethod) == 0x000003, "Member 'FPBGModuleGroup::LoopMethod' has a wrong offset!");
static_assert(offsetof(FPBGModuleGroup, LoopWeight) == 0x000004, "Member 'FPBGModuleGroup::LoopWeight' has a wrong offset!");
static_assert(offsetof(FPBGModuleGroup, bIsAutoScale) == 0x000008, "Member 'FPBGModuleGroup::bIsAutoScale' has a wrong offset!");
static_assert(offsetof(FPBGModuleGroup, Modules) == 0x000010, "Member 'FPBGModuleGroup::Modules' has a wrong offset!");

// ScriptStruct ProceduralGeneration.PBGWallData
// 0x0038 (0x0038 - 0x0000)
struct FPBGWallData final
{
public:
	struct FPBGModuleGroup                        WallModuleGroup;                                   // 0x0000(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         WallModuleGroupLength;                             // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WallModuleGroupScale;                              // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPBGWallData) == 0x000004, "Wrong alignment on FPBGWallData");
static_assert(sizeof(FPBGWallData) == 0x000038, "Wrong size on FPBGWallData");
static_assert(offsetof(FPBGWallData, WallModuleGroup) == 0x000000, "Member 'FPBGWallData::WallModuleGroup' has a wrong offset!");
static_assert(offsetof(FPBGWallData, WallModuleGroupLength) == 0x000020, "Member 'FPBGWallData::WallModuleGroupLength' has a wrong offset!");
static_assert(offsetof(FPBGWallData, WallModuleGroupScale) == 0x000024, "Member 'FPBGWallData::WallModuleGroupScale' has a wrong offset!");

// ScriptStruct ProceduralGeneration.PBGMaterial
// 0x0010 (0x0010 - 0x0000)
struct FPBGMaterial final
{
public:
	class FName                                   MaterialName;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Material;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPBGMaterial) == 0x000008, "Wrong alignment on FPBGMaterial");
static_assert(sizeof(FPBGMaterial) == 0x000010, "Wrong size on FPBGMaterial");
static_assert(offsetof(FPBGMaterial, MaterialName) == 0x000000, "Member 'FPBGMaterial::MaterialName' has a wrong offset!");
static_assert(offsetof(FPBGMaterial, Material) == 0x000008, "Member 'FPBGMaterial::Material' has a wrong offset!");

// ScriptStruct ProceduralGeneration.PBGMaterialModule
// 0x0018 (0x0018 - 0x0000)
struct FPBGMaterialModule final
{
public:
	class FName                                   MaterialName;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             Materials;                                         // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPBGMaterialModule) == 0x000008, "Wrong alignment on FPBGMaterialModule");
static_assert(sizeof(FPBGMaterialModule) == 0x000018, "Wrong size on FPBGMaterialModule");
static_assert(offsetof(FPBGMaterialModule, MaterialName) == 0x000000, "Member 'FPBGMaterialModule::MaterialName' has a wrong offset!");
static_assert(offsetof(FPBGMaterialModule, Materials) == 0x000008, "Member 'FPBGMaterialModule::Materials' has a wrong offset!");

// ScriptStruct ProceduralGeneration.PBGWallModule
// 0x0010 (0x0010 - 0x0000)
struct FPBGWallModule final
{
public:
	TArray<struct FPBGModuleGroup>                ModuleGroups;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPBGWallModule) == 0x000008, "Wrong alignment on FPBGWallModule");
static_assert(sizeof(FPBGWallModule) == 0x000010, "Wrong size on FPBGWallModule");
static_assert(offsetof(FPBGWallModule, ModuleGroups) == 0x000000, "Member 'FPBGWallModule::ModuleGroups' has a wrong offset!");

// ScriptStruct ProceduralGeneration.PBGFloorModule
// 0x0040 (0x0040 - 0x0000)
struct FPBGFloorModule final
{
public:
	int32                                         FloorNum;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBGWallModule>                 WallModules;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPBGModuleGroup>                CornerModuleGroups;                                // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPBGMaterialModule>             OverrideMaterials;                                 // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          IsRoof;                                            // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPBGFloorModule) == 0x000008, "Wrong alignment on FPBGFloorModule");
static_assert(sizeof(FPBGFloorModule) == 0x000040, "Wrong size on FPBGFloorModule");
static_assert(offsetof(FPBGFloorModule, FloorNum) == 0x000000, "Member 'FPBGFloorModule::FloorNum' has a wrong offset!");
static_assert(offsetof(FPBGFloorModule, WallModules) == 0x000008, "Member 'FPBGFloorModule::WallModules' has a wrong offset!");
static_assert(offsetof(FPBGFloorModule, CornerModuleGroups) == 0x000018, "Member 'FPBGFloorModule::CornerModuleGroups' has a wrong offset!");
static_assert(offsetof(FPBGFloorModule, OverrideMaterials) == 0x000028, "Member 'FPBGFloorModule::OverrideMaterials' has a wrong offset!");
static_assert(offsetof(FPBGFloorModule, IsRoof) == 0x000038, "Member 'FPBGFloorModule::IsRoof' has a wrong offset!");

// ScriptStruct ProceduralGeneration.PBGBuildModule
// 0x0010 (0x0010 - 0x0000)
struct FPBGBuildModule final
{
public:
	TArray<struct FPBGFloorModule>                FloorModules;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPBGBuildModule) == 0x000008, "Wrong alignment on FPBGBuildModule");
static_assert(sizeof(FPBGBuildModule) == 0x000010, "Wrong size on FPBGBuildModule");
static_assert(offsetof(FPBGBuildModule, FloorModules) == 0x000000, "Member 'FPBGBuildModule::FloorModules' has a wrong offset!");

// ScriptStruct ProceduralGeneration.PBGFloorSetting
// 0x0020 (0x0020 - 0x0000)
struct FPBGFloorSetting final
{
public:
	int32                                         FloorLevels;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaterialSeed;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FloorSeed;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 WallSeeds;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPBGFloorSetting) == 0x000008, "Wrong alignment on FPBGFloorSetting");
static_assert(sizeof(FPBGFloorSetting) == 0x000020, "Wrong size on FPBGFloorSetting");
static_assert(offsetof(FPBGFloorSetting, FloorLevels) == 0x000000, "Member 'FPBGFloorSetting::FloorLevels' has a wrong offset!");
static_assert(offsetof(FPBGFloorSetting, MaterialSeed) == 0x000004, "Member 'FPBGFloorSetting::MaterialSeed' has a wrong offset!");
static_assert(offsetof(FPBGFloorSetting, FloorSeed) == 0x000008, "Member 'FPBGFloorSetting::FloorSeed' has a wrong offset!");
static_assert(offsetof(FPBGFloorSetting, WallSeeds) == 0x000010, "Member 'FPBGFloorSetting::WallSeeds' has a wrong offset!");

// ScriptStruct ProceduralGeneration.PBGTransforms
// 0x0010 (0x0010 - 0x0000)
struct FPBGTransforms final
{
public:
	TArray<struct FTransform>                     ISMTransforms;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPBGTransforms) == 0x000008, "Wrong alignment on FPBGTransforms");
static_assert(sizeof(FPBGTransforms) == 0x000010, "Wrong size on FPBGTransforms");
static_assert(offsetof(FPBGTransforms, ISMTransforms) == 0x000000, "Member 'FPBGTransforms::ISMTransforms' has a wrong offset!");

// ScriptStruct ProceduralGeneration.PBGISMCSetting
// 0x0030 (0x0030 - 0x0000)
struct FPBGISMCSetting final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPBGModuleISMSetting                   ModuleISMSetting;                                  // 0x0008(0x0001)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBGMaterial>                   Materials;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FPBGTransforms                         ISMTransforms;                                     // 0x0020(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPBGISMCSetting) == 0x000008, "Wrong alignment on FPBGISMCSetting");
static_assert(sizeof(FPBGISMCSetting) == 0x000030, "Wrong size on FPBGISMCSetting");
static_assert(offsetof(FPBGISMCSetting, StaticMesh) == 0x000000, "Member 'FPBGISMCSetting::StaticMesh' has a wrong offset!");
static_assert(offsetof(FPBGISMCSetting, ModuleISMSetting) == 0x000008, "Member 'FPBGISMCSetting::ModuleISMSetting' has a wrong offset!");
static_assert(offsetof(FPBGISMCSetting, Materials) == 0x000010, "Member 'FPBGISMCSetting::Materials' has a wrong offset!");
static_assert(offsetof(FPBGISMCSetting, ISMTransforms) == 0x000020, "Member 'FPBGISMCSetting::ISMTransforms' has a wrong offset!");

// ScriptStruct ProceduralGeneration.ProceduralGenerationData
// 0x0030 (0x0030 - 0x0000)
struct FProceduralGenerationData final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TypeName;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPBGMaterial>                   Materials;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     Transforms;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FProceduralGenerationData) == 0x000008, "Wrong alignment on FProceduralGenerationData");
static_assert(sizeof(FProceduralGenerationData) == 0x000030, "Wrong size on FProceduralGenerationData");
static_assert(offsetof(FProceduralGenerationData, StaticMesh) == 0x000000, "Member 'FProceduralGenerationData::StaticMesh' has a wrong offset!");
static_assert(offsetof(FProceduralGenerationData, TypeName) == 0x000008, "Member 'FProceduralGenerationData::TypeName' has a wrong offset!");
static_assert(offsetof(FProceduralGenerationData, Materials) == 0x000010, "Member 'FProceduralGenerationData::Materials' has a wrong offset!");
static_assert(offsetof(FProceduralGenerationData, Transforms) == 0x000020, "Member 'FProceduralGenerationData::Transforms' has a wrong offset!");

// ScriptStruct ProceduralGeneration.PBGHouseWallM
// 0x0030 (0x0038 - 0x0008)
struct FPBGHouseWallM final : public FTableRowBase
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BaseColor;                                         // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RoughnessMax;                                      // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RoughnessMin;                                      // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Metallic;                                          // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPBGHouseWallM) == 0x000008, "Wrong alignment on FPBGHouseWallM");
static_assert(sizeof(FPBGHouseWallM) == 0x000038, "Wrong size on FPBGHouseWallM");
static_assert(offsetof(FPBGHouseWallM, Material) == 0x000008, "Member 'FPBGHouseWallM::Material' has a wrong offset!");
static_assert(offsetof(FPBGHouseWallM, BaseColor) == 0x000010, "Member 'FPBGHouseWallM::BaseColor' has a wrong offset!");
static_assert(offsetof(FPBGHouseWallM, RoughnessMax) == 0x000028, "Member 'FPBGHouseWallM::RoughnessMax' has a wrong offset!");
static_assert(offsetof(FPBGHouseWallM, RoughnessMin) == 0x00002C, "Member 'FPBGHouseWallM::RoughnessMin' has a wrong offset!");
static_assert(offsetof(FPBGHouseWallM, Metallic) == 0x000030, "Member 'FPBGHouseWallM::Metallic' has a wrong offset!");

// ScriptStruct ProceduralGeneration.CollisionStaticMeshDataTable
// 0x0020 (0x0028 - 0x0008)
struct FCollisionStaticMeshDataTable final : public FTableRowBase
{
public:
	class UStaticMesh*                            SourceStaticMesh;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ImportVersion;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            OnlyCollisionStaticMesh;                           // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            NoCollisionStaticMesh;                             // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCollisionStaticMeshDataTable) == 0x000008, "Wrong alignment on FCollisionStaticMeshDataTable");
static_assert(sizeof(FCollisionStaticMeshDataTable) == 0x000028, "Wrong size on FCollisionStaticMeshDataTable");
static_assert(offsetof(FCollisionStaticMeshDataTable, SourceStaticMesh) == 0x000008, "Member 'FCollisionStaticMeshDataTable::SourceStaticMesh' has a wrong offset!");
static_assert(offsetof(FCollisionStaticMeshDataTable, ImportVersion) == 0x000010, "Member 'FCollisionStaticMeshDataTable::ImportVersion' has a wrong offset!");
static_assert(offsetof(FCollisionStaticMeshDataTable, OnlyCollisionStaticMesh) == 0x000018, "Member 'FCollisionStaticMeshDataTable::OnlyCollisionStaticMesh' has a wrong offset!");
static_assert(offsetof(FCollisionStaticMeshDataTable, NoCollisionStaticMesh) == 0x000020, "Member 'FCollisionStaticMeshDataTable::NoCollisionStaticMesh' has a wrong offset!");

}

