#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProceduralGeneration

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "HTWorldPartition_classes.hpp"
#include "ProceduralGeneration_structs.hpp"
#include "GeometryFramework_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class ProceduralGeneration.OnlyCollisionStaticMeshActor
// 0x0018 (0x02E0 - 0x02C8)
class AOnlyCollisionStaticMeshActor final : public AActor
{
public:
	class USceneComponent*                        TheRootComponent;                                  // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UStaticMeshComponent*>           Components;                                        // 0x02D0(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlyCollisionStaticMeshActor">();
	}
	static class AOnlyCollisionStaticMeshActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOnlyCollisionStaticMeshActor>();
	}
};
static_assert(alignof(AOnlyCollisionStaticMeshActor) == 0x000008, "Wrong alignment on AOnlyCollisionStaticMeshActor");
static_assert(sizeof(AOnlyCollisionStaticMeshActor) == 0x0002E0, "Wrong size on AOnlyCollisionStaticMeshActor");
static_assert(offsetof(AOnlyCollisionStaticMeshActor, TheRootComponent) == 0x0002C8, "Member 'AOnlyCollisionStaticMeshActor::TheRootComponent' has a wrong offset!");
static_assert(offsetof(AOnlyCollisionStaticMeshActor, Components) == 0x0002D0, "Member 'AOnlyCollisionStaticMeshActor::Components' has a wrong offset!");

// Class ProceduralGeneration.PBGBuildModuleAsset
// 0x0010 (0x0038 - 0x0028)
class UPBGBuildModuleAsset final : public UObject
{
public:
	struct FPBGBuildModule                        PBGBuildModule;                                    // 0x0028(0x0010)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PBGBuildModuleAsset">();
	}
	static class UPBGBuildModuleAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPBGBuildModuleAsset>();
	}
};
static_assert(alignof(UPBGBuildModuleAsset) == 0x000008, "Wrong alignment on UPBGBuildModuleAsset");
static_assert(sizeof(UPBGBuildModuleAsset) == 0x000038, "Wrong size on UPBGBuildModuleAsset");
static_assert(offsetof(UPBGBuildModuleAsset, PBGBuildModule) == 0x000028, "Member 'UPBGBuildModuleAsset::PBGBuildModule' has a wrong offset!");

// Class ProceduralGeneration.PBGFloorComponent
// 0x00F8 (0x06F0 - 0x05F8)
class UPBGFloorComponent final : public USplineComponent
{
public:
	struct FPBGFloorModule                        FloorModule;                                       // 0x05F8(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FPBGISMCSetting>                ISMConfigMap;                                      // 0x0638(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         PBGSeed;                                           // 0x0648(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PBGFloorLevels;                                    // 0x064C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PBGMaterialSeed;                                   // 0x0650(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_654[0x4];                                      // 0x0654(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 PBGWallSeeds;                                      // 0x0658(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         PBGFloorHeight;                                    // 0x0668(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_66C[0x4];                                      // 0x066C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInstancedStaticMeshComponent*>  InstancedStaticMeshComponents;                     // 0x0670(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bDebug;                                            // 0x0680(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanControl;                                       // 0x0681(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_682[0xE];                                      // 0x0682(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             DefaultTran;                                       // 0x0690(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PBGFloorComponent">();
	}
	static class UPBGFloorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPBGFloorComponent>();
	}
};
static_assert(alignof(UPBGFloorComponent) == 0x000008, "Wrong alignment on UPBGFloorComponent");
static_assert(sizeof(UPBGFloorComponent) == 0x0006F0, "Wrong size on UPBGFloorComponent");
static_assert(offsetof(UPBGFloorComponent, FloorModule) == 0x0005F8, "Member 'UPBGFloorComponent::FloorModule' has a wrong offset!");
static_assert(offsetof(UPBGFloorComponent, ISMConfigMap) == 0x000638, "Member 'UPBGFloorComponent::ISMConfigMap' has a wrong offset!");
static_assert(offsetof(UPBGFloorComponent, PBGSeed) == 0x000648, "Member 'UPBGFloorComponent::PBGSeed' has a wrong offset!");
static_assert(offsetof(UPBGFloorComponent, PBGFloorLevels) == 0x00064C, "Member 'UPBGFloorComponent::PBGFloorLevels' has a wrong offset!");
static_assert(offsetof(UPBGFloorComponent, PBGMaterialSeed) == 0x000650, "Member 'UPBGFloorComponent::PBGMaterialSeed' has a wrong offset!");
static_assert(offsetof(UPBGFloorComponent, PBGWallSeeds) == 0x000658, "Member 'UPBGFloorComponent::PBGWallSeeds' has a wrong offset!");
static_assert(offsetof(UPBGFloorComponent, PBGFloorHeight) == 0x000668, "Member 'UPBGFloorComponent::PBGFloorHeight' has a wrong offset!");
static_assert(offsetof(UPBGFloorComponent, InstancedStaticMeshComponents) == 0x000670, "Member 'UPBGFloorComponent::InstancedStaticMeshComponents' has a wrong offset!");
static_assert(offsetof(UPBGFloorComponent, bDebug) == 0x000680, "Member 'UPBGFloorComponent::bDebug' has a wrong offset!");
static_assert(offsetof(UPBGFloorComponent, bCanControl) == 0x000681, "Member 'UPBGFloorComponent::bCanControl' has a wrong offset!");
static_assert(offsetof(UPBGFloorComponent, DefaultTran) == 0x000690, "Member 'UPBGFloorComponent::DefaultTran' has a wrong offset!");

// Class ProceduralGeneration.PBGModuleGroupAsset
// 0x0030 (0x0058 - 0x0028)
class UPBGModuleGroupAsset final : public UObject
{
public:
	struct FPBGModuleGroup                        PBGModuleGroup;                                    // 0x0028(0x0020)(Edit, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        AssetObjects;                                      // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PBGModuleGroupAsset">();
	}
	static class UPBGModuleGroupAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPBGModuleGroupAsset>();
	}
};
static_assert(alignof(UPBGModuleGroupAsset) == 0x000008, "Wrong alignment on UPBGModuleGroupAsset");
static_assert(sizeof(UPBGModuleGroupAsset) == 0x000058, "Wrong size on UPBGModuleGroupAsset");
static_assert(offsetof(UPBGModuleGroupAsset, PBGModuleGroup) == 0x000028, "Member 'UPBGModuleGroupAsset::PBGModuleGroup' has a wrong offset!");
static_assert(offsetof(UPBGModuleGroupAsset, AssetObjects) == 0x000048, "Member 'UPBGModuleGroupAsset::AssetObjects' has a wrong offset!");

// Class ProceduralGeneration.PBG_DynamicMeshComponent
// 0x0030 (0x0960 - 0x0930)
class UPBG_DynamicMeshComponent final : public UDynamicMeshComponent
{
public:
	class USplineComponent*                       SplineComponent;                                   // 0x0930(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_938[0x18];                                     // 0x0938(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material;                                          // 0x0950(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_958[0x8];                                      // 0x0958(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateDynamicMesh();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PBG_DynamicMeshComponent">();
	}
	static class UPBG_DynamicMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPBG_DynamicMeshComponent>();
	}
};
static_assert(alignof(UPBG_DynamicMeshComponent) == 0x000008, "Wrong alignment on UPBG_DynamicMeshComponent");
static_assert(sizeof(UPBG_DynamicMeshComponent) == 0x000960, "Wrong size on UPBG_DynamicMeshComponent");
static_assert(offsetof(UPBG_DynamicMeshComponent, SplineComponent) == 0x000930, "Member 'UPBG_DynamicMeshComponent::SplineComponent' has a wrong offset!");
static_assert(offsetof(UPBG_DynamicMeshComponent, Material) == 0x000950, "Member 'UPBG_DynamicMeshComponent::Material' has a wrong offset!");

// Class ProceduralGeneration.PBG_DynamicStaticMeshComponent
// 0x0008 (0x0640 - 0x0638)
class UPBG_DynamicStaticMeshComponent final : public UStaticMeshComponent
{
public:
	uint8                                         Pad_638[0x8];                                      // 0x0638(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CreateDynamicMeshToStaticMesh(const TArray<struct FVector2D>& PolygonVertices);
	void UpdateDynamicMeshToStaticMesh(class USplineComponent* Spline, float TangentOffset, float SamplingOffset, float distanceoffset, EPBGDynamicMethod method);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PBG_DynamicStaticMeshComponent">();
	}
	static class UPBG_DynamicStaticMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPBG_DynamicStaticMeshComponent>();
	}
};
static_assert(alignof(UPBG_DynamicStaticMeshComponent) == 0x000008, "Wrong alignment on UPBG_DynamicStaticMeshComponent");
static_assert(sizeof(UPBG_DynamicStaticMeshComponent) == 0x000640, "Wrong size on UPBG_DynamicStaticMeshComponent");

// Class ProceduralGeneration.PCGStaticMesh_AssetUserData
// 0x0000 (0x0028 - 0x0028)
class UPCGStaticMesh_AssetUserData final : public UAssetUserData
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGStaticMesh_AssetUserData">();
	}
	static class UPCGStaticMesh_AssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGStaticMesh_AssetUserData>();
	}
};
static_assert(alignof(UPCGStaticMesh_AssetUserData) == 0x000008, "Wrong alignment on UPCGStaticMesh_AssetUserData");
static_assert(sizeof(UPCGStaticMesh_AssetUserData) == 0x000028, "Wrong size on UPCGStaticMesh_AssetUserData");

// Class ProceduralGeneration.ProceduralGenerationActor
// 0x0020 (0x02E8 - 0x02C8)
class AProceduralGenerationActor : public AActor
{
public:
	uint8                                         Pad_2C8[0x10];                                     // 0x02C8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInstancedStaticMeshComponent*>  UsedComponentPool;                                 // 0x02D8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProceduralGenerationActor">();
	}
	static class AProceduralGenerationActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProceduralGenerationActor>();
	}
};
static_assert(alignof(AProceduralGenerationActor) == 0x000008, "Wrong alignment on AProceduralGenerationActor");
static_assert(sizeof(AProceduralGenerationActor) == 0x0002E8, "Wrong size on AProceduralGenerationActor");
static_assert(offsetof(AProceduralGenerationActor, UsedComponentPool) == 0x0002D8, "Member 'AProceduralGenerationActor::UsedComponentPool' has a wrong offset!");

// Class ProceduralGeneration.ProceduralBuildGenerationActor
// 0x0010 (0x02F8 - 0x02E8)
class AProceduralBuildGenerationActor final : public AProceduralGenerationActor
{
public:
	class UStaticMeshComponent*                   ProxyMeshComponent;                                // 0x02E8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   RoofMeshComp;                                      // 0x02F0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void BuildPBGBuild();
	void BuildPBGBuildCreate();
	void ChangePCGMeshToMergeMesh(class AActor* Actor);
	bool CleanupInvalidCollision(class UStaticMesh* StaticMesh);
	void ConvertDynamicMeshToStaticMesh(const class FString& AssetPath, const class FString& AssetName);
	class UDynamicMesh* CreateNavigationLowMesh(class UDynamicMesh* TargetMesh);
	void CreateSocketMesh();
	void PCGPostGenerateFunction();
	void SetMobileSetting(const TArray<class UStaticMesh*>& Meshs);
	void ToCreateNavigationLowMesh();
	void UpdateLodMaterials(const TMap<class UMaterialInterface*, class UMaterialInterface*>& LodMaterials);
	void UpDatePBGBuild();
	void UpDatePBGBuildCreate();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProceduralBuildGenerationActor">();
	}
	static class AProceduralBuildGenerationActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProceduralBuildGenerationActor>();
	}
};
static_assert(alignof(AProceduralBuildGenerationActor) == 0x000008, "Wrong alignment on AProceduralBuildGenerationActor");
static_assert(sizeof(AProceduralBuildGenerationActor) == 0x0002F8, "Wrong size on AProceduralBuildGenerationActor");
static_assert(offsetof(AProceduralBuildGenerationActor, ProxyMeshComponent) == 0x0002E8, "Member 'AProceduralBuildGenerationActor::ProxyMeshComponent' has a wrong offset!");
static_assert(offsetof(AProceduralBuildGenerationActor, RoofMeshComp) == 0x0002F0, "Member 'AProceduralBuildGenerationActor::RoofMeshComp' has a wrong offset!");

// Class ProceduralGeneration.ProceduralGenerationStruct
// 0x0000 (0x0108 - 0x0108)
class UProceduralGenerationStruct final : public UUserDefinedStruct
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProceduralGenerationStruct">();
	}
	static class UProceduralGenerationStruct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralGenerationStruct>();
	}
};
static_assert(alignof(UProceduralGenerationStruct) == 0x000008, "Wrong alignment on UProceduralGenerationStruct");
static_assert(sizeof(UProceduralGenerationStruct) == 0x000108, "Wrong size on UProceduralGenerationStruct");

// Class ProceduralGeneration.OnlyCollisionWorldPartitionActor
// 0x0020 (0x02E8 - 0x02C8)
class AOnlyCollisionWorldPartitionActor final : public APartitionActor
{
public:
	uint8                                         Pad_2C8[0x10];                                     // 0x02C8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint32>                                ComponentHashes;                                   // 0x02D8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlyCollisionWorldPartitionActor">();
	}
	static class AOnlyCollisionWorldPartitionActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOnlyCollisionWorldPartitionActor>();
	}
};
static_assert(alignof(AOnlyCollisionWorldPartitionActor) == 0x000008, "Wrong alignment on AOnlyCollisionWorldPartitionActor");
static_assert(sizeof(AOnlyCollisionWorldPartitionActor) == 0x0002E8, "Wrong size on AOnlyCollisionWorldPartitionActor");
static_assert(offsetof(AOnlyCollisionWorldPartitionActor, ComponentHashes) == 0x0002D8, "Member 'AOnlyCollisionWorldPartitionActor::ComponentHashes' has a wrong offset!");

// Class ProceduralGeneration.ProceduralGenerationWorldPartitionActor
// 0x0098 (0x0368 - 0x02D0)
class AProceduralGenerationWorldPartitionActor final : public AHTPartitionActor
{
public:
	TArray<class UStaticMeshComponent*>           StaticMeshComponents;                              // 0x02D0(0x0010)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E0[0x10];                                     // 0x02E0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AProceduralGenerationActor*>     ProceduralGenerationActors;                        // 0x02F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FProceduralGenerationData>      ProceduralGenerationDatas;                         // 0x0300(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UPBG_DynamicMeshComponent*>      PBG_DynamicMeshComponents;                         // 0x0310(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<uint32>                                ComponentHashes;                                   // 0x0320(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                   ProxyMeshComponent;                                // 0x0330(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UStaticMeshComponent*>           OptimizedSMComps;                                  // 0x0338(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_348[0x10];                                     // 0x0348(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInstancedStaticMeshComponent*>  UsedComponentPool;                                 // 0x0358(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProceduralGenerationWorldPartitionActor">();
	}
	static class AProceduralGenerationWorldPartitionActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProceduralGenerationWorldPartitionActor>();
	}
};
static_assert(alignof(AProceduralGenerationWorldPartitionActor) == 0x000008, "Wrong alignment on AProceduralGenerationWorldPartitionActor");
static_assert(sizeof(AProceduralGenerationWorldPartitionActor) == 0x000368, "Wrong size on AProceduralGenerationWorldPartitionActor");
static_assert(offsetof(AProceduralGenerationWorldPartitionActor, StaticMeshComponents) == 0x0002D0, "Member 'AProceduralGenerationWorldPartitionActor::StaticMeshComponents' has a wrong offset!");
static_assert(offsetof(AProceduralGenerationWorldPartitionActor, ProceduralGenerationActors) == 0x0002F0, "Member 'AProceduralGenerationWorldPartitionActor::ProceduralGenerationActors' has a wrong offset!");
static_assert(offsetof(AProceduralGenerationWorldPartitionActor, ProceduralGenerationDatas) == 0x000300, "Member 'AProceduralGenerationWorldPartitionActor::ProceduralGenerationDatas' has a wrong offset!");
static_assert(offsetof(AProceduralGenerationWorldPartitionActor, PBG_DynamicMeshComponents) == 0x000310, "Member 'AProceduralGenerationWorldPartitionActor::PBG_DynamicMeshComponents' has a wrong offset!");
static_assert(offsetof(AProceduralGenerationWorldPartitionActor, ComponentHashes) == 0x000320, "Member 'AProceduralGenerationWorldPartitionActor::ComponentHashes' has a wrong offset!");
static_assert(offsetof(AProceduralGenerationWorldPartitionActor, ProxyMeshComponent) == 0x000330, "Member 'AProceduralGenerationWorldPartitionActor::ProxyMeshComponent' has a wrong offset!");
static_assert(offsetof(AProceduralGenerationWorldPartitionActor, OptimizedSMComps) == 0x000338, "Member 'AProceduralGenerationWorldPartitionActor::OptimizedSMComps' has a wrong offset!");
static_assert(offsetof(AProceduralGenerationWorldPartitionActor, UsedComponentPool) == 0x000358, "Member 'AProceduralGenerationWorldPartitionActor::UsedComponentPool' has a wrong offset!");

}

