#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PropertyBindingUtils

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum PropertyBindingUtils.EPropertyBindingAccessType
// NumValues: 0x0008
enum class EPropertyBindingAccessType : uint8
{
	Offset                                   = 0,
	Object                                   = 1,
	WeakObject                               = 2,
	SoftObject                               = 3,
	ObjectInstance                           = 4,
	StructInstance                           = 5,
	IndexArray                               = 6,
	EPropertyBindingAccessType_MAX           = 7,
};

// Enum PropertyBindingUtils.EPropertyBindingPropertyAccessType
// NumValues: 0x000B
enum class EPropertyBindingPropertyAccessType : uint8
{
	Offset                                   = 0,
	Object                                   = 1,
	WeakObject                               = 2,
	SoftObject                               = 3,
	ObjectInstance                           = 4,
	StructInstance                           = 5,
	IndexArray                               = 6,
	SharedStruct                             = 7,
	StructInstanceContainer                  = 8,
	Unset                                    = 9,
	EPropertyBindingPropertyAccessType_MAX   = 10,
};

// Enum PropertyBindingUtils.EPropertyCopyType
// NumValues: 0x0021
enum class EPropertyCopyType : uint8
{
	None                                     = 0,
	CopyPlain                                = 1,
	CopyComplex                              = 2,
	CopyBool                                 = 3,
	CopyStruct                               = 4,
	CopyObject                               = 5,
	CopyName                                 = 6,
	CopyFixedArray                           = 7,
	StructReference                          = 8,
	PromoteBoolToByte                        = 9,
	PromoteBoolToInt32                       = 10,
	PromoteBoolToUInt32                      = 11,
	PromoteBoolToInt64                       = 12,
	PromoteBoolToFloat                       = 13,
	PromoteBoolToDouble                      = 14,
	PromoteByteToInt32                       = 15,
	PromoteByteToUInt32                      = 16,
	PromoteByteToInt64                       = 17,
	PromoteByteToFloat                       = 18,
	PromoteByteToDouble                      = 19,
	PromoteInt32ToInt64                      = 20,
	PromoteInt32ToFloat                      = 21,
	PromoteInt32ToDouble                     = 22,
	PromoteUInt32ToInt64                     = 23,
	PromoteUInt32ToFloat                     = 24,
	PromoteUInt32ToDouble                    = 25,
	PromoteFloatToInt32                      = 26,
	PromoteFloatToInt64                      = 27,
	PromoteFloatToDouble                     = 28,
	DemoteDoubleToInt32                      = 29,
	DemoteDoubleToInt64                      = 30,
	DemoteDoubleToFloat                      = 31,
	EPropertyCopyType_MAX                    = 32,
};

// ScriptStruct PropertyBindingUtils.PropertyBindingBindableStructDescriptor
// 0x0018 (0x0018 - 0x0000)
struct FPropertyBindingBindableStructDescriptor
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UStruct*                                Struct;                                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPropertyBindingBindableStructDescriptor) == 0x000008, "Wrong alignment on FPropertyBindingBindableStructDescriptor");
static_assert(sizeof(FPropertyBindingBindableStructDescriptor) == 0x000018, "Wrong size on FPropertyBindingBindableStructDescriptor");
static_assert(offsetof(FPropertyBindingBindableStructDescriptor, Struct) == 0x000008, "Member 'FPropertyBindingBindableStructDescriptor::Struct' has a wrong offset!");
static_assert(offsetof(FPropertyBindingBindableStructDescriptor, Name) == 0x000010, "Member 'FPropertyBindingBindableStructDescriptor::Name' has a wrong offset!");

// ScriptStruct PropertyBindingUtils.PropertyBindingPathSegment
// 0x0020 (0x0020 - 0x0000)
struct FPropertyBindingPathSegment final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         ArrayIndex;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStruct*                                InstanceStruct;                                    // 0x0010(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EPropertyBindingPropertyAccessType            InstancedStructAccessType;                         // 0x0018(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPropertyBindingPathSegment) == 0x000008, "Wrong alignment on FPropertyBindingPathSegment");
static_assert(sizeof(FPropertyBindingPathSegment) == 0x000020, "Wrong size on FPropertyBindingPathSegment");
static_assert(offsetof(FPropertyBindingPathSegment, Name) == 0x000000, "Member 'FPropertyBindingPathSegment::Name' has a wrong offset!");
static_assert(offsetof(FPropertyBindingPathSegment, ArrayIndex) == 0x000008, "Member 'FPropertyBindingPathSegment::ArrayIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBindingPathSegment, InstanceStruct) == 0x000010, "Member 'FPropertyBindingPathSegment::InstanceStruct' has a wrong offset!");
static_assert(offsetof(FPropertyBindingPathSegment, InstancedStructAccessType) == 0x000018, "Member 'FPropertyBindingPathSegment::InstancedStructAccessType' has a wrong offset!");

// ScriptStruct PropertyBindingUtils.PropertyBindingPath
// 0x0010 (0x0010 - 0x0000)
struct FPropertyBindingPath final
{
public:
	TArray<struct FPropertyBindingPathSegment>    Segments;                                          // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FPropertyBindingPath) == 0x000008, "Wrong alignment on FPropertyBindingPath");
static_assert(sizeof(FPropertyBindingPath) == 0x000010, "Wrong size on FPropertyBindingPath");
static_assert(offsetof(FPropertyBindingPath, Segments) == 0x000000, "Member 'FPropertyBindingPath::Segments' has a wrong offset!");

// ScriptStruct PropertyBindingUtils.PropertyBindingBinding
// 0x0028 (0x0028 - 0x0000)
struct FPropertyBindingBinding
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPropertyBindingPath                   SourcePropertyPath;                                // 0x0008(0x0010)(Edit, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FPropertyBindingPath                   TargetPropertyPath;                                // 0x0018(0x0010)(Edit, EditConst, Protected, NativeAccessSpecifierProtected)
};
static_assert(alignof(FPropertyBindingBinding) == 0x000001, "Wrong alignment on FPropertyBindingBinding");
static_assert(sizeof(FPropertyBindingBinding) == 0x000028, "Wrong size on FPropertyBindingBinding");
static_assert(offsetof(FPropertyBindingBinding, SourcePropertyPath) == 0x000008, "Member 'FPropertyBindingBinding::SourcePropertyPath' has a wrong offset!");
static_assert(offsetof(FPropertyBindingBinding, TargetPropertyPath) == 0x000018, "Member 'FPropertyBindingBinding::TargetPropertyPath' has a wrong offset!");

// ScriptStruct PropertyBindingUtils.PropertyBindingIndex16
// 0x0002 (0x0002 - 0x0000)
struct FPropertyBindingIndex16 final
{
public:
	uint16                                        Value;                                             // 0x0000(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
static_assert(alignof(FPropertyBindingIndex16) == 0x000002, "Wrong alignment on FPropertyBindingIndex16");
static_assert(sizeof(FPropertyBindingIndex16) == 0x000002, "Wrong size on FPropertyBindingIndex16");
static_assert(offsetof(FPropertyBindingIndex16, Value) == 0x000000, "Member 'FPropertyBindingIndex16::Value' has a wrong offset!");

// ScriptStruct PropertyBindingUtils.PropertyBindingCopyInfoBatch
// 0x0018 (0x0018 - 0x0000)
struct FPropertyBindingCopyInfoBatch final
{
public:
	struct FInstancedStruct                       TargetStruct;                                      // 0x0000(0x0010)(NativeAccessSpecifierPublic)
	struct FPropertyBindingIndex16                BindingsBegin;                                     // 0x0010(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPropertyBindingIndex16                BindingsEnd;                                       // 0x0012(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPropertyBindingIndex16                PropertyFunctionsBegin;                            // 0x0014(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPropertyBindingIndex16                PropertyFunctionsEnd;                              // 0x0016(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPropertyBindingCopyInfoBatch) == 0x000001, "Wrong alignment on FPropertyBindingCopyInfoBatch");
static_assert(sizeof(FPropertyBindingCopyInfoBatch) == 0x000018, "Wrong size on FPropertyBindingCopyInfoBatch");
static_assert(offsetof(FPropertyBindingCopyInfoBatch, TargetStruct) == 0x000000, "Member 'FPropertyBindingCopyInfoBatch::TargetStruct' has a wrong offset!");
static_assert(offsetof(FPropertyBindingCopyInfoBatch, BindingsBegin) == 0x000010, "Member 'FPropertyBindingCopyInfoBatch::BindingsBegin' has a wrong offset!");
static_assert(offsetof(FPropertyBindingCopyInfoBatch, BindingsEnd) == 0x000012, "Member 'FPropertyBindingCopyInfoBatch::BindingsEnd' has a wrong offset!");
static_assert(offsetof(FPropertyBindingCopyInfoBatch, PropertyFunctionsBegin) == 0x000014, "Member 'FPropertyBindingCopyInfoBatch::PropertyFunctionsBegin' has a wrong offset!");
static_assert(offsetof(FPropertyBindingCopyInfoBatch, PropertyFunctionsEnd) == 0x000016, "Member 'FPropertyBindingCopyInfoBatch::PropertyFunctionsEnd' has a wrong offset!");

// ScriptStruct PropertyBindingUtils.PropertyBindingPropertyIndirection
// 0x0018 (0x0018 - 0x0000)
struct FPropertyBindingPropertyIndirection final
{
public:
	struct FPropertyBindingIndex16                ArrayIndex;                                        // 0x0000(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        Offset;                                            // 0x0002(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPropertyBindingIndex16                NextIndex;                                         // 0x0004(0x0002)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPropertyBindingPropertyAccessType            Type;                                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UStruct*                                InstanceStruct;                                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPropertyBindingPropertyIndirection) == 0x000008, "Wrong alignment on FPropertyBindingPropertyIndirection");
static_assert(sizeof(FPropertyBindingPropertyIndirection) == 0x000018, "Wrong size on FPropertyBindingPropertyIndirection");
static_assert(offsetof(FPropertyBindingPropertyIndirection, ArrayIndex) == 0x000000, "Member 'FPropertyBindingPropertyIndirection::ArrayIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBindingPropertyIndirection, Offset) == 0x000002, "Member 'FPropertyBindingPropertyIndirection::Offset' has a wrong offset!");
static_assert(offsetof(FPropertyBindingPropertyIndirection, NextIndex) == 0x000004, "Member 'FPropertyBindingPropertyIndirection::NextIndex' has a wrong offset!");
static_assert(offsetof(FPropertyBindingPropertyIndirection, Type) == 0x000006, "Member 'FPropertyBindingPropertyIndirection::Type' has a wrong offset!");
static_assert(offsetof(FPropertyBindingPropertyIndirection, InstanceStruct) == 0x000008, "Member 'FPropertyBindingPropertyIndirection::InstanceStruct' has a wrong offset!");

// ScriptStruct PropertyBindingUtils.PropertyBindingCopyInfo
// 0x0068 (0x0068 - 0x0000)
struct FPropertyBindingCopyInfo final
{
public:
	struct FPropertyBindingPropertyIndirection    SourceIndirection;                                 // 0x0000(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPropertyBindingPropertyIndirection    TargetIndirection;                                 // 0x0018(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UStruct*                                SourceStructType;                                  // 0x0040(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CopySize;                                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInstancedStruct                       SourceDataHandle;                                  // 0x0050(0x0010)(NativeAccessSpecifierPublic)
	EPropertyCopyType                             Type;                                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPropertyBindingCopyInfo) == 0x000008, "Wrong alignment on FPropertyBindingCopyInfo");
static_assert(sizeof(FPropertyBindingCopyInfo) == 0x000068, "Wrong size on FPropertyBindingCopyInfo");
static_assert(offsetof(FPropertyBindingCopyInfo, SourceIndirection) == 0x000000, "Member 'FPropertyBindingCopyInfo::SourceIndirection' has a wrong offset!");
static_assert(offsetof(FPropertyBindingCopyInfo, TargetIndirection) == 0x000018, "Member 'FPropertyBindingCopyInfo::TargetIndirection' has a wrong offset!");
static_assert(offsetof(FPropertyBindingCopyInfo, SourceStructType) == 0x000040, "Member 'FPropertyBindingCopyInfo::SourceStructType' has a wrong offset!");
static_assert(offsetof(FPropertyBindingCopyInfo, CopySize) == 0x000048, "Member 'FPropertyBindingCopyInfo::CopySize' has a wrong offset!");
static_assert(offsetof(FPropertyBindingCopyInfo, SourceDataHandle) == 0x000050, "Member 'FPropertyBindingCopyInfo::SourceDataHandle' has a wrong offset!");
static_assert(offsetof(FPropertyBindingCopyInfo, Type) == 0x000060, "Member 'FPropertyBindingCopyInfo::Type' has a wrong offset!");

// ScriptStruct PropertyBindingUtils.PropertyBindingBindingCollection
// 0x00C0 (0x00C0 - 0x0000)
struct FPropertyBindingBindingCollection
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPropertyBindingCopyInfoBatch>  CopyBatches;                                       // 0x0010(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FPropertyBindingCopyInfo>       PropertyCopies;                                    // 0x0020(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<struct FPropertyBindingPropertyIndirection> PropertyIndirections;                         // 0x0030(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPropertyBindingBindingCollectionOwner> BindingsOwner;                    // 0x0048(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_58[0x68];                                      // 0x0058(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPropertyBindingBindingCollection) == 0x000008, "Wrong alignment on FPropertyBindingBindingCollection");
static_assert(sizeof(FPropertyBindingBindingCollection) == 0x0000C0, "Wrong size on FPropertyBindingBindingCollection");
static_assert(offsetof(FPropertyBindingBindingCollection, CopyBatches) == 0x000010, "Member 'FPropertyBindingBindingCollection::CopyBatches' has a wrong offset!");
static_assert(offsetof(FPropertyBindingBindingCollection, PropertyCopies) == 0x000020, "Member 'FPropertyBindingBindingCollection::PropertyCopies' has a wrong offset!");
static_assert(offsetof(FPropertyBindingBindingCollection, PropertyIndirections) == 0x000030, "Member 'FPropertyBindingBindingCollection::PropertyIndirections' has a wrong offset!");
static_assert(offsetof(FPropertyBindingBindingCollection, BindingsOwner) == 0x000048, "Member 'FPropertyBindingBindingCollection::BindingsOwner' has a wrong offset!");

}

