#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProxyTable

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Chooser_structs.hpp"
#include "ProxyTable_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ProxyTable.ChooserParameterProxyTable
// 0x0000 (0x0000 - 0x0000)
class IChooserParameterProxyTable final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChooserParameterProxyTable">();
	}
	static class IChooserParameterProxyTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<IChooserParameterProxyTable>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IChooserParameterProxyTable) == 0x000001, "Wrong alignment on IChooserParameterProxyTable");
static_assert(sizeof(IChooserParameterProxyTable) == 0x000001, "Wrong size on IChooserParameterProxyTable");

// Class ProxyTable.ProxyAsset
// 0x0050 (0x0078 - 0x0028)
class UProxyAsset final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    Type;                                              // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EObjectChooserResultType                      ResultType;                                        // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInstancedStruct>               ContextData;                                       // 0x0058(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProxyAsset">();
	}
	static class UProxyAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProxyAsset>();
	}
};
static_assert(alignof(UProxyAsset) == 0x000008, "Wrong alignment on UProxyAsset");
static_assert(sizeof(UProxyAsset) == 0x000078, "Wrong size on UProxyAsset");
static_assert(offsetof(UProxyAsset, Type) == 0x000048, "Member 'UProxyAsset::Type' has a wrong offset!");
static_assert(offsetof(UProxyAsset, ResultType) == 0x000050, "Member 'UProxyAsset::ResultType' has a wrong offset!");
static_assert(offsetof(UProxyAsset, ContextData) == 0x000058, "Member 'UProxyAsset::ContextData' has a wrong offset!");
static_assert(offsetof(UProxyAsset, Guid) == 0x000068, "Member 'UProxyAsset::Guid' has a wrong offset!");

// Class ProxyTable.ProxyTable
// 0x0020 (0x0048 - 0x0028)
class UProxyTable final : public UObject
{
public:
	TArray<struct FGuid>                          Keys;                                              // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRuntimeProxyValue>             RuntimeValues;                                     // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProxyTable">();
	}
	static class UProxyTable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProxyTable>();
	}
};
static_assert(alignof(UProxyTable) == 0x000008, "Wrong alignment on UProxyTable");
static_assert(sizeof(UProxyTable) == 0x000048, "Wrong size on UProxyTable");
static_assert(offsetof(UProxyTable, Keys) == 0x000028, "Member 'UProxyTable::Keys' has a wrong offset!");
static_assert(offsetof(UProxyTable, RuntimeValues) == 0x000038, "Member 'UProxyTable::RuntimeValues' has a wrong offset!");

// Class ProxyTable.ProxyTableFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UProxyTableFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UObject* EvaluateProxyAsset(const class UObject* ContextObject, const class UProxyAsset* Proxy, TSubclassOf<class UObject> ObjectClass);
	static class UObject* EvaluateProxyTable(const class UObject* ContextObject, const class UProxyTable* ProxyTable, class FName Key);
	static struct FInstancedStruct MakeLookupProxy(class UProxyAsset* Proxy);
	static struct FInstancedStruct MakeLookupProxyWithOverrideTable(class UProxyAsset* Proxy, class UProxyTable* ProxyTable);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProxyTableFunctionLibrary">();
	}
	static class UProxyTableFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProxyTableFunctionLibrary>();
	}
};
static_assert(alignof(UProxyTableFunctionLibrary) == 0x000008, "Wrong alignment on UProxyTableFunctionLibrary");
static_assert(sizeof(UProxyTableFunctionLibrary) == 0x000028, "Wrong size on UProxyTableFunctionLibrary");

}

