#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PWCrash

#include "Basic.hpp"


namespace SDK::Params
{

// Function PWCrash.PWCrashBlueprintLibrary.HasPSOCrashed
// 0x0001 (0x0001 - 0x0000)
struct PWCrashBlueprintLibrary_HasPSOCrashed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PWCrashBlueprintLibrary_HasPSOCrashed) == 0x000001, "Wrong alignment on PWCrashBlueprintLibrary_HasPSOCrashed");
static_assert(sizeof(PWCrashBlueprintLibrary_HasPSOCrashed) == 0x000001, "Wrong size on PWCrashBlueprintLibrary_HasPSOCrashed");
static_assert(offsetof(PWCrashBlueprintLibrary_HasPSOCrashed, ReturnValue) == 0x000000, "Member 'PWCrashBlueprintLibrary_HasPSOCrashed::ReturnValue' has a wrong offset!");

// Function PWCrash.PWCrashBlueprintLibrary.InitPWCrashSDK
// 0x0028 (0x0028 - 0x0000)
struct PWCrashBlueprintLibrary_InitPWCrashSDK final
{
public:
	TDelegate<void(const class FString& ResultCode, const class FString& ErrMsg)> OnBInitCompleteDelegate; // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Domain;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PWCrashBlueprintLibrary_InitPWCrashSDK) == 0x000008, "Wrong alignment on PWCrashBlueprintLibrary_InitPWCrashSDK");
static_assert(sizeof(PWCrashBlueprintLibrary_InitPWCrashSDK) == 0x000028, "Wrong size on PWCrashBlueprintLibrary_InitPWCrashSDK");
static_assert(offsetof(PWCrashBlueprintLibrary_InitPWCrashSDK, OnBInitCompleteDelegate) == 0x000000, "Member 'PWCrashBlueprintLibrary_InitPWCrashSDK::OnBInitCompleteDelegate' has a wrong offset!");
static_assert(offsetof(PWCrashBlueprintLibrary_InitPWCrashSDK, Domain) == 0x000010, "Member 'PWCrashBlueprintLibrary_InitPWCrashSDK::Domain' has a wrong offset!");
static_assert(offsetof(PWCrashBlueprintLibrary_InitPWCrashSDK, ReturnValue) == 0x000020, "Member 'PWCrashBlueprintLibrary_InitPWCrashSDK::ReturnValue' has a wrong offset!");

// Function PWCrash.PWCrashBlueprintLibrary.ReportExtraFile
// 0x0010 (0x0010 - 0x0000)
struct PWCrashBlueprintLibrary_ReportExtraFile final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PWCrashBlueprintLibrary_ReportExtraFile) == 0x000008, "Wrong alignment on PWCrashBlueprintLibrary_ReportExtraFile");
static_assert(sizeof(PWCrashBlueprintLibrary_ReportExtraFile) == 0x000010, "Wrong size on PWCrashBlueprintLibrary_ReportExtraFile");
static_assert(offsetof(PWCrashBlueprintLibrary_ReportExtraFile, ReturnValue) == 0x000000, "Member 'PWCrashBlueprintLibrary_ReportExtraFile::ReturnValue' has a wrong offset!");

// Function PWCrash.PWCrashBlueprintLibrary.ReportExtraInfo
// 0x0010 (0x0010 - 0x0000)
struct PWCrashBlueprintLibrary_ReportExtraInfo final
{
public:
	class FString                                 ExtraInfo;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PWCrashBlueprintLibrary_ReportExtraInfo) == 0x000008, "Wrong alignment on PWCrashBlueprintLibrary_ReportExtraInfo");
static_assert(sizeof(PWCrashBlueprintLibrary_ReportExtraInfo) == 0x000010, "Wrong size on PWCrashBlueprintLibrary_ReportExtraInfo");
static_assert(offsetof(PWCrashBlueprintLibrary_ReportExtraInfo, ExtraInfo) == 0x000000, "Member 'PWCrashBlueprintLibrary_ReportExtraInfo::ExtraInfo' has a wrong offset!");

// Function PWCrash.PWCrashBlueprintLibrary.ReportExtraInfoKV
// 0x0018 (0x0018 - 0x0000)
struct PWCrashBlueprintLibrary_ReportExtraInfoKV final
{
public:
	class FString                                 ExtraInfoKV;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(PWCrashBlueprintLibrary_ReportExtraInfoKV) == 0x000008, "Wrong alignment on PWCrashBlueprintLibrary_ReportExtraInfoKV");
static_assert(sizeof(PWCrashBlueprintLibrary_ReportExtraInfoKV) == 0x000018, "Wrong size on PWCrashBlueprintLibrary_ReportExtraInfoKV");
static_assert(offsetof(PWCrashBlueprintLibrary_ReportExtraInfoKV, ExtraInfoKV) == 0x000000, "Member 'PWCrashBlueprintLibrary_ReportExtraInfoKV::ExtraInfoKV' has a wrong offset!");
static_assert(offsetof(PWCrashBlueprintLibrary_ReportExtraInfoKV, ReturnValue) == 0x000010, "Member 'PWCrashBlueprintLibrary_ReportExtraInfoKV::ReturnValue' has a wrong offset!");

// Function PWCrash.PWCrashBlueprintLibrary.ResetPSOCrashFlag
// 0x0001 (0x0001 - 0x0000)
struct PWCrashBlueprintLibrary_ResetPSOCrashFlag final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PWCrashBlueprintLibrary_ResetPSOCrashFlag) == 0x000001, "Wrong alignment on PWCrashBlueprintLibrary_ResetPSOCrashFlag");
static_assert(sizeof(PWCrashBlueprintLibrary_ResetPSOCrashFlag) == 0x000001, "Wrong size on PWCrashBlueprintLibrary_ResetPSOCrashFlag");
static_assert(offsetof(PWCrashBlueprintLibrary_ResetPSOCrashFlag, ReturnValue) == 0x000000, "Member 'PWCrashBlueprintLibrary_ResetPSOCrashFlag::ReturnValue' has a wrong offset!");

// Function PWCrash.PWCrashBlueprintLibrary.TestSetHotfixVersion
// 0x0010 (0x0010 - 0x0000)
struct PWCrashBlueprintLibrary_TestSetHotfixVersion final
{
public:
	class FString                                 HotfixVersion;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PWCrashBlueprintLibrary_TestSetHotfixVersion) == 0x000008, "Wrong alignment on PWCrashBlueprintLibrary_TestSetHotfixVersion");
static_assert(sizeof(PWCrashBlueprintLibrary_TestSetHotfixVersion) == 0x000010, "Wrong size on PWCrashBlueprintLibrary_TestSetHotfixVersion");
static_assert(offsetof(PWCrashBlueprintLibrary_TestSetHotfixVersion, HotfixVersion) == 0x000000, "Member 'PWCrashBlueprintLibrary_TestSetHotfixVersion::HotfixVersion' has a wrong offset!");

// Function PWCrash.PWCrashBlueprintLibrary.TestSetRoleID
// 0x0010 (0x0010 - 0x0000)
struct PWCrashBlueprintLibrary_TestSetRoleID final
{
public:
	class FString                                 RoleId;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PWCrashBlueprintLibrary_TestSetRoleID) == 0x000008, "Wrong alignment on PWCrashBlueprintLibrary_TestSetRoleID");
static_assert(sizeof(PWCrashBlueprintLibrary_TestSetRoleID) == 0x000010, "Wrong size on PWCrashBlueprintLibrary_TestSetRoleID");
static_assert(offsetof(PWCrashBlueprintLibrary_TestSetRoleID, RoleId) == 0x000000, "Member 'PWCrashBlueprintLibrary_TestSetRoleID::RoleId' has a wrong offset!");

// Function PWCrash.PWCrashBlueprintLibrary.TestSetTagVersion
// 0x0010 (0x0010 - 0x0000)
struct PWCrashBlueprintLibrary_TestSetTagVersion final
{
public:
	class FString                                 TagVersion;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PWCrashBlueprintLibrary_TestSetTagVersion) == 0x000008, "Wrong alignment on PWCrashBlueprintLibrary_TestSetTagVersion");
static_assert(sizeof(PWCrashBlueprintLibrary_TestSetTagVersion) == 0x000010, "Wrong size on PWCrashBlueprintLibrary_TestSetTagVersion");
static_assert(offsetof(PWCrashBlueprintLibrary_TestSetTagVersion, TagVersion) == 0x000000, "Member 'PWCrashBlueprintLibrary_TestSetTagVersion::TagVersion' has a wrong offset!");

// Function PWCrash.PWCrashBlueprintLibrary.TestSetUserID
// 0x0010 (0x0010 - 0x0000)
struct PWCrashBlueprintLibrary_TestSetUserID final
{
public:
	class FString                                 UserId;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(PWCrashBlueprintLibrary_TestSetUserID) == 0x000008, "Wrong alignment on PWCrashBlueprintLibrary_TestSetUserID");
static_assert(sizeof(PWCrashBlueprintLibrary_TestSetUserID) == 0x000010, "Wrong size on PWCrashBlueprintLibrary_TestSetUserID");
static_assert(offsetof(PWCrashBlueprintLibrary_TestSetUserID, UserId) == 0x000000, "Member 'PWCrashBlueprintLibrary_TestSetUserID::UserId' has a wrong offset!");

}

