#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Random_Weather_Variation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Random_Weather_Variation.Random_Weather_Variation_C
// 0x39BD9740 (0x39BD9800 - 0x00C0)
class alignas(0x39BD9800) URandom_Weather_Variation_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AUltra_Dynamic_Weather_C*               UDW;                                               // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUDS_Weather_Settings_C*                Target_Random_Weather_Type;                        // 0x00D0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class UUDS_Weather_Settings_C*, double>  Weather_Type_Probabilities__Summer_;               // 0x00D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UUDS_Weather_Settings_C*, double>  Weather_Type_Probabilities__Autumn_;               // 0x0128(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UUDS_Weather_Settings_C*, double>  Weather_Type_Probabilities__Winter_;               // 0x0178(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UUDS_Weather_Settings_C*, double>  Weather_Type_Probabilities__Spring_;               // 0x01C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        Current_Lerp_Alpha;                                // 0x0218(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Current_Timer_Length;                              // 0x0220(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeather_Override_Volume_C*             Volume;                                            // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Total_Changes;                                     // 0x0230(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Changing_Weather;                                  // 0x0234(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUDS_Weather_Settings_C*                Last_Random_Weather_Type;                          // 0x0238(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUDS_Weather_Settings_C*                Current_Random_Weather_State;                      // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Change_Timer;                                      // 0x0248(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Running_Timer;                                     // 0x0250(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Apply_State(const struct FRandomWeatherVariation_State& Random_Weather_State);
	void Create_Composite_Probability_Map(TMap<class UUDS_Weather_Settings_C*, double>* Out);
	void ExecuteUbergraph_Random_Weather_Variation(int32 EntryPoint);
	void Get_State_for_Saving(struct FRandomWeatherVariation_State* State, class AWeather_Override_Volume_C** Volume_0);
	void Increment_Change_Timer();
	void Increment_Random_Weather();
	void Initialize(class AUltra_Dynamic_Weather_C* UDW_0, const TMap<class UUDS_Weather_Settings_C*, double>& Summer_Probabilities, const TMap<class UUDS_Weather_Settings_C*, double>& Autumn_Probabilities, const TMap<class UUDS_Weather_Settings_C*, double>& Winter_Probabilities, const TMap<class UUDS_Weather_Settings_C*, double>& Spring_Probabilities, bool Start_with_Random_Type);
	void ReceiveTick(float DeltaSeconds);
	void Reset_Timer();
	void Select_New_Random_Weather_Type(bool Filter_Probability_List);
	void Start_Timer_to_Select_New_Weather();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Random_Weather_Variation_C">();
	}
	static class URandom_Weather_Variation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URandom_Weather_Variation_C>();
	}
};
static_assert(alignof(URandom_Weather_Variation_C) == 0x39BD9800, "Wrong alignment on URandom_Weather_Variation_C");
static_assert(sizeof(URandom_Weather_Variation_C) == 0x39BD9800, "Wrong size on URandom_Weather_Variation_C");
static_assert(offsetof(URandom_Weather_Variation_C, UberGraphFrame) == 0x0000C0, "Member 'URandom_Weather_Variation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URandom_Weather_Variation_C, UDW) == 0x0000C8, "Member 'URandom_Weather_Variation_C::UDW' has a wrong offset!");
static_assert(offsetof(URandom_Weather_Variation_C, Target_Random_Weather_Type) == 0x0000D0, "Member 'URandom_Weather_Variation_C::Target_Random_Weather_Type' has a wrong offset!");
static_assert(offsetof(URandom_Weather_Variation_C, Weather_Type_Probabilities__Summer_) == 0x0000D8, "Member 'URandom_Weather_Variation_C::Weather_Type_Probabilities__Summer_' has a wrong offset!");
static_assert(offsetof(URandom_Weather_Variation_C, Weather_Type_Probabilities__Autumn_) == 0x000128, "Member 'URandom_Weather_Variation_C::Weather_Type_Probabilities__Autumn_' has a wrong offset!");
static_assert(offsetof(URandom_Weather_Variation_C, Weather_Type_Probabilities__Winter_) == 0x000178, "Member 'URandom_Weather_Variation_C::Weather_Type_Probabilities__Winter_' has a wrong offset!");
static_assert(offsetof(URandom_Weather_Variation_C, Weather_Type_Probabilities__Spring_) == 0x0001C8, "Member 'URandom_Weather_Variation_C::Weather_Type_Probabilities__Spring_' has a wrong offset!");
static_assert(offsetof(URandom_Weather_Variation_C, Current_Lerp_Alpha) == 0x000218, "Member 'URandom_Weather_Variation_C::Current_Lerp_Alpha' has a wrong offset!");
static_assert(offsetof(URandom_Weather_Variation_C, Current_Timer_Length) == 0x000220, "Member 'URandom_Weather_Variation_C::Current_Timer_Length' has a wrong offset!");
static_assert(offsetof(URandom_Weather_Variation_C, Volume) == 0x000228, "Member 'URandom_Weather_Variation_C::Volume' has a wrong offset!");
static_assert(offsetof(URandom_Weather_Variation_C, Total_Changes) == 0x000230, "Member 'URandom_Weather_Variation_C::Total_Changes' has a wrong offset!");
static_assert(offsetof(URandom_Weather_Variation_C, Changing_Weather) == 0x000234, "Member 'URandom_Weather_Variation_C::Changing_Weather' has a wrong offset!");
static_assert(offsetof(URandom_Weather_Variation_C, Last_Random_Weather_Type) == 0x000238, "Member 'URandom_Weather_Variation_C::Last_Random_Weather_Type' has a wrong offset!");
static_assert(offsetof(URandom_Weather_Variation_C, Current_Random_Weather_State) == 0x000240, "Member 'URandom_Weather_Variation_C::Current_Random_Weather_State' has a wrong offset!");
static_assert(offsetof(URandom_Weather_Variation_C, Change_Timer) == 0x000248, "Member 'URandom_Weather_Variation_C::Change_Timer' has a wrong offset!");
static_assert(offsetof(URandom_Weather_Variation_C, Running_Timer) == 0x000250, "Member 'URandom_Weather_Variation_C::Running_Timer' has a wrong offset!");

}

