#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Renderer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Renderer_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class Renderer.MaterialCacheStackProvider
// 0x0000 (0x0028 - 0x0028)
class UMaterialCacheStackProvider final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialCacheStackProvider">();
	}
	static class UMaterialCacheStackProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialCacheStackProvider>();
	}
};
static_assert(alignof(UMaterialCacheStackProvider) == 0x000008, "Wrong alignment on UMaterialCacheStackProvider");
static_assert(sizeof(UMaterialCacheStackProvider) == 0x000028, "Wrong size on UMaterialCacheStackProvider");

// Class Renderer.MaterialCacheVirtualTexture
// 0x0020 (0x0178 - 0x0158)
class UMaterialCacheVirtualTexture final : public UTexture
{
public:
	TWeakObjectPtr<class UPrimitiveComponent>     OwningComponent;                                   // 0x0158(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UMaterialCacheStackProvider> MaterialStackProvider;                         // 0x0160(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              TileCount;                                         // 0x0168(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_170[0x8];                                      // 0x0170(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialCacheVirtualTexture">();
	}
	static class UMaterialCacheVirtualTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialCacheVirtualTexture>();
	}
};
static_assert(alignof(UMaterialCacheVirtualTexture) == 0x000008, "Wrong alignment on UMaterialCacheVirtualTexture");
static_assert(sizeof(UMaterialCacheVirtualTexture) == 0x000178, "Wrong size on UMaterialCacheVirtualTexture");
static_assert(offsetof(UMaterialCacheVirtualTexture, OwningComponent) == 0x000158, "Member 'UMaterialCacheVirtualTexture::OwningComponent' has a wrong offset!");
static_assert(offsetof(UMaterialCacheVirtualTexture, MaterialStackProvider) == 0x000160, "Member 'UMaterialCacheVirtualTexture::MaterialStackProvider' has a wrong offset!");
static_assert(offsetof(UMaterialCacheVirtualTexture, TileCount) == 0x000168, "Member 'UMaterialCacheVirtualTexture::TileCount' has a wrong offset!");

// Class Renderer.SparseVolumeTextureViewerComponent
// 0x0038 (0x0580 - 0x0548)
class USparseVolumeTextureViewerComponent final : public UPrimitiveComponent
{
public:
	class USparseVolumeTexture*                   SparseVolumeTexturePreview;                        // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Frame;                                             // 0x0550(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FrameRate;                                         // 0x0554(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bPlaying : 1;                                      // 0x0558(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bLooping : 1;                                      // 0x0558(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bReversePlayback : 1;                              // 0x0558(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bBlockingStreamingRequests : 1;                    // 0x0558(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bApplyPerFrameTransforms : 1;                      // 0x0558(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bPivotAtCentroid : 1;                              // 0x0558(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_559[0x3];                                      // 0x0559(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VoxelSize;                                         // 0x055C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESparseVolumeTexturePreviewAttribute          PreviewAttribute;                                  // 0x0560(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_561[0x3];                                      // 0x0561(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MipLevel;                                          // 0x0564(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Extinction;                                        // 0x0568(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_56C[0x14];                                     // 0x056C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparseVolumeTextureViewerComponent">();
	}
	static class USparseVolumeTextureViewerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USparseVolumeTextureViewerComponent>();
	}
};
static_assert(alignof(USparseVolumeTextureViewerComponent) == 0x000008, "Wrong alignment on USparseVolumeTextureViewerComponent");
static_assert(sizeof(USparseVolumeTextureViewerComponent) == 0x000580, "Wrong size on USparseVolumeTextureViewerComponent");
static_assert(offsetof(USparseVolumeTextureViewerComponent, SparseVolumeTexturePreview) == 0x000548, "Member 'USparseVolumeTextureViewerComponent::SparseVolumeTexturePreview' has a wrong offset!");
static_assert(offsetof(USparseVolumeTextureViewerComponent, Frame) == 0x000550, "Member 'USparseVolumeTextureViewerComponent::Frame' has a wrong offset!");
static_assert(offsetof(USparseVolumeTextureViewerComponent, FrameRate) == 0x000554, "Member 'USparseVolumeTextureViewerComponent::FrameRate' has a wrong offset!");
static_assert(offsetof(USparseVolumeTextureViewerComponent, VoxelSize) == 0x00055C, "Member 'USparseVolumeTextureViewerComponent::VoxelSize' has a wrong offset!");
static_assert(offsetof(USparseVolumeTextureViewerComponent, PreviewAttribute) == 0x000560, "Member 'USparseVolumeTextureViewerComponent::PreviewAttribute' has a wrong offset!");
static_assert(offsetof(USparseVolumeTextureViewerComponent, MipLevel) == 0x000564, "Member 'USparseVolumeTextureViewerComponent::MipLevel' has a wrong offset!");
static_assert(offsetof(USparseVolumeTextureViewerComponent, Extinction) == 0x000568, "Member 'USparseVolumeTextureViewerComponent::Extinction' has a wrong offset!");

// Class Renderer.SparseVolumeTextureViewer
// 0x0008 (0x02D0 - 0x02C8)
class ASparseVolumeTextureViewer final : public AInfo
{
public:
	class USparseVolumeTextureViewerComponent*    SparseVolumeTextureViewerComponent;                // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SparseVolumeTextureViewer">();
	}
	static class ASparseVolumeTextureViewer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASparseVolumeTextureViewer>();
	}
};
static_assert(alignof(ASparseVolumeTextureViewer) == 0x000008, "Wrong alignment on ASparseVolumeTextureViewer");
static_assert(sizeof(ASparseVolumeTextureViewer) == 0x0002D0, "Wrong size on ASparseVolumeTextureViewer");
static_assert(offsetof(ASparseVolumeTextureViewer, SparseVolumeTextureViewerComponent) == 0x0002C8, "Member 'ASparseVolumeTextureViewer::SparseVolumeTextureViewerComponent' has a wrong offset!");

}

