#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SnappyRoad

#include "Basic.hpp"

#include "ZoneGraph_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum SnappyRoad.EMethod
// NumValues: 0x0004
enum class EMethod : uint8
{
	Random                                   = 0,
	Sequential                               = 1,
	FirstAndLast                             = 2,
	EMethod_MAX                              = 3,
};

// Enum SnappyRoad.EMeshType
// NumValues: 0x0004
enum class EMeshType : uint8
{
	StaticMesh                               = 0,
	SplineMesh                               = 1,
	Actor                                    = 2,
	EMeshType_MAX                            = 3,
};

// Enum SnappyRoad.EZoneShapeType
// NumValues: 0x0026
enum class EZoneShapeType : uint8
{
	Vehicle                                  = 0,
	StartVehicleIntersection                 = 1,
	EndVehicleIntersection                   = 2,
	LeftSideWalk                             = 3,
	RightSideWalk                            = 4,
	StartSideWalkIntersection0               = 5,
	StartSideWalkIntersection1               = 6,
	StartSideWalkIntersection2               = 7,
	StartSideWalkIntersection3               = 8,
	StartCrossWalk0                          = 9,
	StartCrossWalk1                          = 10,
	StartCrossWalk2                          = 11,
	StartCrossWalk3                          = 12,
	StartCrossWalk4                          = 13,
	StartCrossWalk5                          = 14,
	StartCrossWalk6                          = 15,
	StartCrossWalk7                          = 16,
	EndSideWalkIntersection0                 = 17,
	EndSideWalkIntersection1                 = 18,
	EndSideWalkIntersection2                 = 19,
	EndSideWalkIntersection3                 = 20,
	EndCrossWalk0                            = 21,
	EndCrossWalk1                            = 22,
	EndCrossWalk2                            = 23,
	EndCrossWalk3                            = 24,
	EndCrossWalk4                            = 25,
	EndCrossWalk5                            = 26,
	EndCrossWalk6                            = 27,
	EndCrossWalk7                            = 28,
	StartCrosswalkMiddleIntersection0        = 29,
	StartCrosswalkMiddleIntersection1        = 30,
	StartCrosswalkMiddleIntersection2        = 31,
	StartCrosswalkMiddleIntersection3        = 32,
	EndCrosswalkMiddleIntersection0          = 33,
	EndCrosswalkMiddleIntersection1          = 34,
	EndCrosswalkMiddleIntersection2          = 35,
	EndCrosswalkMiddleIntersection3          = 36,
	EZoneShapeType_MAX                       = 37,
};

// Enum SnappyRoad.ERoadType
// NumValues: 0x0005
enum class ERoadType : uint8
{
	Vehicle                                  = 0,
	Sidewalk                                 = 1,
	Train                                    = 2,
	Elevated                                 = 3,
	ERoadType_MAX                            = 4,
};

// Enum SnappyRoad.EZoneShapeTagType
// NumValues: 0x0007
enum class EZoneShapeTagType : uint8
{
	VehicleStraight                          = 0,
	SidewalkStraight                         = 1,
	Crosswalk                                = 2,
	VehicleIntersection                      = 3,
	SidewalkIntersection                     = 4,
	ElevatedIntersection                     = 5,
	EZoneShapeTagType_MAX                    = 6,
};

// Enum SnappyRoad.ERoadIntersectionDirection
// NumValues: 0x0005
enum class ERoadIntersectionDirection : uint8
{
	Up                                       = 0,
	Right                                    = 1,
	Button                                   = 2,
	Left                                     = 3,
	ERoadIntersectionDirection_MAX           = 4,
};

// Enum SnappyRoad.ERoadStraightDirection
// NumValues: 0x0003
enum class ERoadStraightDirection : uint8
{
	Forward                                  = 0,
	Backward                                 = 1,
	ERoadStraightDirection_MAX               = 2,
};

// Enum SnappyRoad.EExtraMeshPlacement
// NumValues: 0x0004
enum class EExtraMeshPlacement : uint8
{
	Full                                     = 0,
	StartOnly                                = 1,
	EndOnly                                  = 2,
	EExtraMeshPlacement_MAX                  = 3,
};

// ScriptStruct SnappyRoad.PedestrianCrossingSideIntersection
// 0x0070 (0x0070 - 0x0000)
struct FPedestrianCrossingSideIntersection final
{
public:
	ERoadType                                     TrunkRoadType;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpGenerate;                                       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneLaneProfileRef                    UpProfileRef;                                      // 0x0004(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bRightGenerate;                                    // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneLaneProfileRef                    RightProfileRef;                                   // 0x0020(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bButtonGenerate;                                   // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneLaneProfileRef                    ButtonProfileRef;                                  // 0x003C(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bLeftGenerate;                                     // 0x0054(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneLaneProfileRef                    LeftProfileRef;                                    // 0x0058(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPedestrianCrossingSideIntersection) == 0x000001, "Wrong alignment on FPedestrianCrossingSideIntersection");
static_assert(sizeof(FPedestrianCrossingSideIntersection) == 0x000070, "Wrong size on FPedestrianCrossingSideIntersection");
static_assert(offsetof(FPedestrianCrossingSideIntersection, TrunkRoadType) == 0x000000, "Member 'FPedestrianCrossingSideIntersection::TrunkRoadType' has a wrong offset!");
static_assert(offsetof(FPedestrianCrossingSideIntersection, bUpGenerate) == 0x000001, "Member 'FPedestrianCrossingSideIntersection::bUpGenerate' has a wrong offset!");
static_assert(offsetof(FPedestrianCrossingSideIntersection, UpProfileRef) == 0x000004, "Member 'FPedestrianCrossingSideIntersection::UpProfileRef' has a wrong offset!");
static_assert(offsetof(FPedestrianCrossingSideIntersection, bRightGenerate) == 0x00001C, "Member 'FPedestrianCrossingSideIntersection::bRightGenerate' has a wrong offset!");
static_assert(offsetof(FPedestrianCrossingSideIntersection, RightProfileRef) == 0x000020, "Member 'FPedestrianCrossingSideIntersection::RightProfileRef' has a wrong offset!");
static_assert(offsetof(FPedestrianCrossingSideIntersection, bButtonGenerate) == 0x000038, "Member 'FPedestrianCrossingSideIntersection::bButtonGenerate' has a wrong offset!");
static_assert(offsetof(FPedestrianCrossingSideIntersection, ButtonProfileRef) == 0x00003C, "Member 'FPedestrianCrossingSideIntersection::ButtonProfileRef' has a wrong offset!");
static_assert(offsetof(FPedestrianCrossingSideIntersection, bLeftGenerate) == 0x000054, "Member 'FPedestrianCrossingSideIntersection::bLeftGenerate' has a wrong offset!");
static_assert(offsetof(FPedestrianCrossingSideIntersection, LeftProfileRef) == 0x000058, "Member 'FPedestrianCrossingSideIntersection::LeftProfileRef' has a wrong offset!");

// ScriptStruct SnappyRoad.PedestrianCrossingTrunkStaright
// 0x001C (0x001C - 0x0000)
struct FPedestrianCrossingTrunkStaright final
{
public:
	ERoadType                                     TrunkRoadType;                                     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerate;                                         // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneLaneProfileRef                    ProfileRef;                                        // 0x0004(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPedestrianCrossingTrunkStaright) == 0x000001, "Wrong alignment on FPedestrianCrossingTrunkStaright");
static_assert(sizeof(FPedestrianCrossingTrunkStaright) == 0x00001C, "Wrong size on FPedestrianCrossingTrunkStaright");
static_assert(offsetof(FPedestrianCrossingTrunkStaright, TrunkRoadType) == 0x000000, "Member 'FPedestrianCrossingTrunkStaright::TrunkRoadType' has a wrong offset!");
static_assert(offsetof(FPedestrianCrossingTrunkStaright, bGenerate) == 0x000001, "Member 'FPedestrianCrossingTrunkStaright::bGenerate' has a wrong offset!");
static_assert(offsetof(FPedestrianCrossingTrunkStaright, ProfileRef) == 0x000004, "Member 'FPedestrianCrossingTrunkStaright::ProfileRef' has a wrong offset!");

// ScriptStruct SnappyRoad.MeshExtra
// 0x0048 (0x0048 - 0x0000)
struct FMeshExtra final
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Spacing;                                           // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Offset;                                            // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoScapcing;                                      // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoScale;                                         // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AngularOffset;                                     // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartOffset;                                       // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndOffset;                                         // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ZVertical;                                         // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxDrawDistance;                                   // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMeshExtra) == 0x000008, "Wrong alignment on FMeshExtra");
static_assert(sizeof(FMeshExtra) == 0x000048, "Wrong size on FMeshExtra");
static_assert(offsetof(FMeshExtra, Mesh) == 0x000000, "Member 'FMeshExtra::Mesh' has a wrong offset!");
static_assert(offsetof(FMeshExtra, ActorClass) == 0x000008, "Member 'FMeshExtra::ActorClass' has a wrong offset!");
static_assert(offsetof(FMeshExtra, Spacing) == 0x000010, "Member 'FMeshExtra::Spacing' has a wrong offset!");
static_assert(offsetof(FMeshExtra, Offset) == 0x000018, "Member 'FMeshExtra::Offset' has a wrong offset!");
static_assert(offsetof(FMeshExtra, AutoScapcing) == 0x000030, "Member 'FMeshExtra::AutoScapcing' has a wrong offset!");
static_assert(offsetof(FMeshExtra, AutoScale) == 0x000031, "Member 'FMeshExtra::AutoScale' has a wrong offset!");
static_assert(offsetof(FMeshExtra, AngularOffset) == 0x000034, "Member 'FMeshExtra::AngularOffset' has a wrong offset!");
static_assert(offsetof(FMeshExtra, StartOffset) == 0x000038, "Member 'FMeshExtra::StartOffset' has a wrong offset!");
static_assert(offsetof(FMeshExtra, EndOffset) == 0x00003C, "Member 'FMeshExtra::EndOffset' has a wrong offset!");
static_assert(offsetof(FMeshExtra, ZVertical) == 0x000040, "Member 'FMeshExtra::ZVertical' has a wrong offset!");
static_assert(offsetof(FMeshExtra, MaxDrawDistance) == 0x000044, "Member 'FMeshExtra::MaxDrawDistance' has a wrong offset!");

// ScriptStruct SnappyRoad.SMeshAndTransform
// 0x0070 (0x0070 - 0x0000)
struct FSMeshAndTransform final
{
public:
	class UStaticMesh*                            StaticMesh;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             MeshTransform;                                     // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMeshAndTransform) == 0x000008, "Wrong alignment on FSMeshAndTransform");
static_assert(sizeof(FSMeshAndTransform) == 0x000070, "Wrong size on FSMeshAndTransform");
static_assert(offsetof(FSMeshAndTransform, StaticMesh) == 0x000000, "Member 'FSMeshAndTransform::StaticMesh' has a wrong offset!");
static_assert(offsetof(FSMeshAndTransform, ActorClass) == 0x000008, "Member 'FSMeshAndTransform::ActorClass' has a wrong offset!");
static_assert(offsetof(FSMeshAndTransform, MeshTransform) == 0x000010, "Member 'FSMeshAndTransform::MeshTransform' has a wrong offset!");

// ScriptStruct SnappyRoad.RoadFanceStruct
// 0x0260 (0x0260 - 0x0000)
struct FRoadFanceStruct final
{
public:
	struct FVector                                Offset;                                            // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseAllSplineRange;                                 // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Range;                                             // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Spacing;                                           // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseRepetitiveGeneration;                           // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RepetitiveGenerationSpacing;                       // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseAutoSpacing;                                    // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMethod                                       method;                                            // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMeshType                                     MeshType;                                          // 0x004A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSMeshAndTransform>             Meshs;                                             // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          InvertY;                                           // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ZVertical;                                         // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Seed;                                              // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RandomOffsetMin;                                   // 0x0068(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RandomOffsetMax;                                   // 0x0080(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RandomRotationMin;                                 // 0x0098(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RandomRotationMax;                                 // 0x00B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RandomScaleMin;                                    // 0x00C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RandomScaleMax;                                    // 0x00E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSplineCurves                          SplineCurves;                                      // 0x00F8(0x0068)(NativeAccessSpecifierPublic)
	struct FTransform                             SplineTransform;                                   // 0x0160(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DefaultUpVector;                                   // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReparamStepsPerSegment;                            // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClosedLoop;                                       // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoxSphereBounds                       LocalBounds;                                       // 0x01E0(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoxSphereBounds                       Bounds;                                            // 0x0218(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bStationaryEndpoints;                              // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoopPositionOverride;                             // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_252[0x2];                                      // 0x0252(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LoopPosition;                                      // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_258[0x8];                                      // 0x0258(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRoadFanceStruct) == 0x000008, "Wrong alignment on FRoadFanceStruct");
static_assert(sizeof(FRoadFanceStruct) == 0x000260, "Wrong size on FRoadFanceStruct");
static_assert(offsetof(FRoadFanceStruct, Offset) == 0x000000, "Member 'FRoadFanceStruct::Offset' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, UseAllSplineRange) == 0x000018, "Member 'FRoadFanceStruct::UseAllSplineRange' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, Range) == 0x000020, "Member 'FRoadFanceStruct::Range' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, Spacing) == 0x000030, "Member 'FRoadFanceStruct::Spacing' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, UseRepetitiveGeneration) == 0x000038, "Member 'FRoadFanceStruct::UseRepetitiveGeneration' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, RepetitiveGenerationSpacing) == 0x000040, "Member 'FRoadFanceStruct::RepetitiveGenerationSpacing' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, UseAutoSpacing) == 0x000048, "Member 'FRoadFanceStruct::UseAutoSpacing' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, method) == 0x000049, "Member 'FRoadFanceStruct::method' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, MeshType) == 0x00004A, "Member 'FRoadFanceStruct::MeshType' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, Meshs) == 0x000050, "Member 'FRoadFanceStruct::Meshs' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, InvertY) == 0x000060, "Member 'FRoadFanceStruct::InvertY' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, ZVertical) == 0x000061, "Member 'FRoadFanceStruct::ZVertical' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, Seed) == 0x000064, "Member 'FRoadFanceStruct::Seed' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, RandomOffsetMin) == 0x000068, "Member 'FRoadFanceStruct::RandomOffsetMin' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, RandomOffsetMax) == 0x000080, "Member 'FRoadFanceStruct::RandomOffsetMax' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, RandomRotationMin) == 0x000098, "Member 'FRoadFanceStruct::RandomRotationMin' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, RandomRotationMax) == 0x0000B0, "Member 'FRoadFanceStruct::RandomRotationMax' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, RandomScaleMin) == 0x0000C8, "Member 'FRoadFanceStruct::RandomScaleMin' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, RandomScaleMax) == 0x0000E0, "Member 'FRoadFanceStruct::RandomScaleMax' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, SplineCurves) == 0x0000F8, "Member 'FRoadFanceStruct::SplineCurves' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, SplineTransform) == 0x000160, "Member 'FRoadFanceStruct::SplineTransform' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, DefaultUpVector) == 0x0001C0, "Member 'FRoadFanceStruct::DefaultUpVector' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, ReparamStepsPerSegment) == 0x0001D8, "Member 'FRoadFanceStruct::ReparamStepsPerSegment' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, bClosedLoop) == 0x0001DC, "Member 'FRoadFanceStruct::bClosedLoop' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, LocalBounds) == 0x0001E0, "Member 'FRoadFanceStruct::LocalBounds' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, Bounds) == 0x000218, "Member 'FRoadFanceStruct::Bounds' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, bStationaryEndpoints) == 0x000250, "Member 'FRoadFanceStruct::bStationaryEndpoints' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, bLoopPositionOverride) == 0x000251, "Member 'FRoadFanceStruct::bLoopPositionOverride' has a wrong offset!");
static_assert(offsetof(FRoadFanceStruct, LoopPosition) == 0x000254, "Member 'FRoadFanceStruct::LoopPosition' has a wrong offset!");

// ScriptStruct SnappyRoad.NetworkPoint
// 0x0080 (0x0080 - 0x0000)
struct FNetworkPoint final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FZoneLaneProfileRef                    ProfileRef;                                        // 0x0060(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         TurnRadius;                                        // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNetworkPoint) == 0x000004, "Wrong alignment on FNetworkPoint");
static_assert(sizeof(FNetworkPoint) == 0x000080, "Wrong size on FNetworkPoint");
static_assert(offsetof(FNetworkPoint, Transform) == 0x000000, "Member 'FNetworkPoint::Transform' has a wrong offset!");
static_assert(offsetof(FNetworkPoint, ProfileRef) == 0x000060, "Member 'FNetworkPoint::ProfileRef' has a wrong offset!");
static_assert(offsetof(FNetworkPoint, TurnRadius) == 0x000078, "Member 'FNetworkPoint::TurnRadius' has a wrong offset!");

// ScriptStruct SnappyRoad.NetworkIntersection
// 0x0018 (0x0018 - 0x0000)
struct FNetworkIntersection final
{
public:
	TArray<struct FNetworkPoint>                  NetworkPoint;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FZoneGraphTag                          Tag;                                               // 0x0010(0x0001)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNetworkIntersection) == 0x000008, "Wrong alignment on FNetworkIntersection");
static_assert(sizeof(FNetworkIntersection) == 0x000018, "Wrong size on FNetworkIntersection");
static_assert(offsetof(FNetworkIntersection, NetworkPoint) == 0x000000, "Member 'FNetworkIntersection::NetworkPoint' has a wrong offset!");
static_assert(offsetof(FNetworkIntersection, Tag) == 0x000010, "Member 'FNetworkIntersection::Tag' has a wrong offset!");

// ScriptStruct SnappyRoad.RoadConfig
// 0x0040 (0x0040 - 0x0000)
struct FRoadConfig final
{
public:
	struct FZoneLaneProfileRef                    LaneProfileRef;                                    // 0x0000(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FZoneGraphTagMask                      Tag;                                               // 0x0018(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SideRoadOffsetAlongTrunkLane;                      // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CrosswalkLinkOffset;                               // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLaneGenerate;                                     // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRoadConfig) == 0x000004, "Wrong alignment on FRoadConfig");
static_assert(sizeof(FRoadConfig) == 0x000040, "Wrong size on FRoadConfig");
static_assert(offsetof(FRoadConfig, LaneProfileRef) == 0x000000, "Member 'FRoadConfig::LaneProfileRef' has a wrong offset!");
static_assert(offsetof(FRoadConfig, Tag) == 0x000018, "Member 'FRoadConfig::Tag' has a wrong offset!");
static_assert(offsetof(FRoadConfig, SideRoadOffsetAlongTrunkLane) == 0x000020, "Member 'FRoadConfig::SideRoadOffsetAlongTrunkLane' has a wrong offset!");
static_assert(offsetof(FRoadConfig, CrosswalkLinkOffset) == 0x000038, "Member 'FRoadConfig::CrosswalkLinkOffset' has a wrong offset!");
static_assert(offsetof(FRoadConfig, bLaneGenerate) == 0x00003C, "Member 'FRoadConfig::bLaneGenerate' has a wrong offset!");

// ScriptStruct SnappyRoad.SideRoadConfig
// 0x0058 (0x0058 - 0x0000)
struct FSideRoadConfig final
{
public:
	struct FZoneLaneProfileRef                    SideRoadProfileRef;                                // 0x0000(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FZoneGraphTagMask                      Tag;                                               // 0x0018(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SideRoadOffsetAlongTrunkLane;                      // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CrosswalkLinkOffset;                               // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpLaneGenerate;                                   // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRightLaneGenerate;                                // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bButtonLaneGenerate;                               // 0x0052(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLeftLaneGenerate;                                 // 0x0053(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSideRoadConfig) == 0x000001, "Wrong alignment on FSideRoadConfig");
static_assert(sizeof(FSideRoadConfig) == 0x000058, "Wrong size on FSideRoadConfig");
static_assert(offsetof(FSideRoadConfig, SideRoadProfileRef) == 0x000000, "Member 'FSideRoadConfig::SideRoadProfileRef' has a wrong offset!");
static_assert(offsetof(FSideRoadConfig, Tag) == 0x000018, "Member 'FSideRoadConfig::Tag' has a wrong offset!");
static_assert(offsetof(FSideRoadConfig, SideRoadOffsetAlongTrunkLane) == 0x000020, "Member 'FSideRoadConfig::SideRoadOffsetAlongTrunkLane' has a wrong offset!");
static_assert(offsetof(FSideRoadConfig, CrosswalkLinkOffset) == 0x000038, "Member 'FSideRoadConfig::CrosswalkLinkOffset' has a wrong offset!");
static_assert(offsetof(FSideRoadConfig, bUpLaneGenerate) == 0x000050, "Member 'FSideRoadConfig::bUpLaneGenerate' has a wrong offset!");
static_assert(offsetof(FSideRoadConfig, bRightLaneGenerate) == 0x000051, "Member 'FSideRoadConfig::bRightLaneGenerate' has a wrong offset!");
static_assert(offsetof(FSideRoadConfig, bButtonLaneGenerate) == 0x000052, "Member 'FSideRoadConfig::bButtonLaneGenerate' has a wrong offset!");
static_assert(offsetof(FSideRoadConfig, bLeftLaneGenerate) == 0x000053, "Member 'FSideRoadConfig::bLeftLaneGenerate' has a wrong offset!");

// ScriptStruct SnappyRoad.SocketPoint
// 0x0090 (0x0090 - 0x0000)
struct FSocketPoint final
{
public:
	ERoadIntersectionDirection                    IntersectionDirection;                             // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneLaneProfileRef                    LaneProfileRef;                                    // 0x0004(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0020(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLaneGenerate;                                     // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0xF];                                       // 0x0081(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSocketPoint) == 0x000001, "Wrong alignment on FSocketPoint");
static_assert(sizeof(FSocketPoint) == 0x000090, "Wrong size on FSocketPoint");
static_assert(offsetof(FSocketPoint, IntersectionDirection) == 0x000000, "Member 'FSocketPoint::IntersectionDirection' has a wrong offset!");
static_assert(offsetof(FSocketPoint, LaneProfileRef) == 0x000004, "Member 'FSocketPoint::LaneProfileRef' has a wrong offset!");
static_assert(offsetof(FSocketPoint, Transform) == 0x000020, "Member 'FSocketPoint::Transform' has a wrong offset!");
static_assert(offsetof(FSocketPoint, bLaneGenerate) == 0x000080, "Member 'FSocketPoint::bLaneGenerate' has a wrong offset!");

// ScriptStruct SnappyRoad.ZoneShapePointInfo
// 0x00A0 (0x00A0 - 0x0000)
struct FZoneShapePointInfo final
{
public:
	ERoadIntersectionDirection                    IntersectionDirection;                             // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneLaneProfileRef                    LaneProfileRef;                                    // 0x0004(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneShapePoint                        ShapePoint;                                        // 0x0020(0x0078)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bGenerate;                                         // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FZoneShapePointInfo) == 0x000001, "Wrong alignment on FZoneShapePointInfo");
static_assert(sizeof(FZoneShapePointInfo) == 0x0000A0, "Wrong size on FZoneShapePointInfo");
static_assert(offsetof(FZoneShapePointInfo, IntersectionDirection) == 0x000000, "Member 'FZoneShapePointInfo::IntersectionDirection' has a wrong offset!");
static_assert(offsetof(FZoneShapePointInfo, LaneProfileRef) == 0x000004, "Member 'FZoneShapePointInfo::LaneProfileRef' has a wrong offset!");
static_assert(offsetof(FZoneShapePointInfo, ShapePoint) == 0x000020, "Member 'FZoneShapePointInfo::ShapePoint' has a wrong offset!");
static_assert(offsetof(FZoneShapePointInfo, bGenerate) == 0x000098, "Member 'FZoneShapePointInfo::bGenerate' has a wrong offset!");

// ScriptStruct SnappyRoad.ZoneGraphPointsData
// 0x0018 (0x0018 - 0x0000)
struct FZoneGraphPointsData final
{
public:
	TArray<struct FZoneShapePointInfo>            PointsInfo;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	EZoneShapeTagType                             TagType;                                           // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FZoneGraphPointsData) == 0x000008, "Wrong alignment on FZoneGraphPointsData");
static_assert(sizeof(FZoneGraphPointsData) == 0x000018, "Wrong size on FZoneGraphPointsData");
static_assert(offsetof(FZoneGraphPointsData, PointsInfo) == 0x000000, "Member 'FZoneGraphPointsData::PointsInfo' has a wrong offset!");
static_assert(offsetof(FZoneGraphPointsData, TagType) == 0x000010, "Member 'FZoneGraphPointsData::TagType' has a wrong offset!");

// ScriptStruct SnappyRoad.StraightConfig
// 0x00D0 (0x00D0 - 0x0000)
struct FStraightConfig final
{
public:
	ERoadStraightDirection                        Direction;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SokectTransform;                                   // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FZoneLaneProfileRef                    TrunkLaneProfileRef;                               // 0x0070(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bTrunkLaneGenerate;                                // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERoadType                                     TrunkRoadType;                                     // 0x0089(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneLaneProfileRef                    LeftSideLaneProfileRef;                            // 0x008C(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bLeftSideLaneGenerate;                             // 0x00A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneLaneProfileRef                    RightSideLaneProfileRef;                           // 0x00A8(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bRightSideLaneGenerate;                            // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERoadType                                     SideRaneType;                                      // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C2[0xE];                                       // 0x00C2(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FStraightConfig) == 0x000001, "Wrong alignment on FStraightConfig");
static_assert(sizeof(FStraightConfig) == 0x0000D0, "Wrong size on FStraightConfig");
static_assert(offsetof(FStraightConfig, Direction) == 0x000000, "Member 'FStraightConfig::Direction' has a wrong offset!");
static_assert(offsetof(FStraightConfig, SokectTransform) == 0x000010, "Member 'FStraightConfig::SokectTransform' has a wrong offset!");
static_assert(offsetof(FStraightConfig, TrunkLaneProfileRef) == 0x000070, "Member 'FStraightConfig::TrunkLaneProfileRef' has a wrong offset!");
static_assert(offsetof(FStraightConfig, bTrunkLaneGenerate) == 0x000088, "Member 'FStraightConfig::bTrunkLaneGenerate' has a wrong offset!");
static_assert(offsetof(FStraightConfig, TrunkRoadType) == 0x000089, "Member 'FStraightConfig::TrunkRoadType' has a wrong offset!");
static_assert(offsetof(FStraightConfig, LeftSideLaneProfileRef) == 0x00008C, "Member 'FStraightConfig::LeftSideLaneProfileRef' has a wrong offset!");
static_assert(offsetof(FStraightConfig, bLeftSideLaneGenerate) == 0x0000A4, "Member 'FStraightConfig::bLeftSideLaneGenerate' has a wrong offset!");
static_assert(offsetof(FStraightConfig, RightSideLaneProfileRef) == 0x0000A8, "Member 'FStraightConfig::RightSideLaneProfileRef' has a wrong offset!");
static_assert(offsetof(FStraightConfig, bRightSideLaneGenerate) == 0x0000C0, "Member 'FStraightConfig::bRightSideLaneGenerate' has a wrong offset!");
static_assert(offsetof(FStraightConfig, SideRaneType) == 0x0000C1, "Member 'FStraightConfig::SideRaneType' has a wrong offset!");

// ScriptStruct SnappyRoad.TrafficLightInfo
// 0x00F0 (0x00F0 - 0x0000)
struct FTrafficLightInfo final
{
public:
	ERoadIntersectionDirection                    Direction;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TraffigLightTransform;                             // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ControlledLaneTransform;                           // 0x0070(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            Mesh;                                              // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TypeName;                                          // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTrafficlightGenerate;                             // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0xF];                                       // 0x00E1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTrafficLightInfo) == 0x000008, "Wrong alignment on FTrafficLightInfo");
static_assert(sizeof(FTrafficLightInfo) == 0x0000F0, "Wrong size on FTrafficLightInfo");
static_assert(offsetof(FTrafficLightInfo, Direction) == 0x000000, "Member 'FTrafficLightInfo::Direction' has a wrong offset!");
static_assert(offsetof(FTrafficLightInfo, TraffigLightTransform) == 0x000010, "Member 'FTrafficLightInfo::TraffigLightTransform' has a wrong offset!");
static_assert(offsetof(FTrafficLightInfo, ControlledLaneTransform) == 0x000070, "Member 'FTrafficLightInfo::ControlledLaneTransform' has a wrong offset!");
static_assert(offsetof(FTrafficLightInfo, Mesh) == 0x0000D0, "Member 'FTrafficLightInfo::Mesh' has a wrong offset!");
static_assert(offsetof(FTrafficLightInfo, TypeName) == 0x0000D8, "Member 'FTrafficLightInfo::TypeName' has a wrong offset!");
static_assert(offsetof(FTrafficLightInfo, bTrafficlightGenerate) == 0x0000E0, "Member 'FTrafficLightInfo::bTrafficlightGenerate' has a wrong offset!");

// ScriptStruct SnappyRoad.IntersectionConfig
// 0x00E0 (0x00E0 - 0x0000)
struct FIntersectionConfig final
{
public:
	ERoadIntersectionDirection                    IntersectionDirection;                             // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             PointTransform;                                    // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FZoneLaneProfileRef                    TrunkLaneProfileRef;                               // 0x0070(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bTrunkLaneReverseProfile;                          // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TrunkConnectionRestrictions;                       // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERoadType                                     TrunkLaneType;                                     // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTrunkLaneGenerate;                                // 0x0091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneLaneProfileRef                    SideLaneProfileRef;                                // 0x0094(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	ERoadType                                     SideLaneType;                                      // 0x00AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCrosswalkUpGenerate;                              // 0x00AD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCrosswalkRightGenerate;                           // 0x00AE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCrosswalkButtonGenerate;                          // 0x00AF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCrosswalkLeftGenerate;                            // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneLaneProfileRef                    CrosswalkMiddleIntersectionProfileRef;             // 0x00B4(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bCrosswalkMiddleIntersectionGenerate;              // 0x00CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTrafficlightGenerate;                             // 0x00CD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TrafficlightTypeName;                              // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FIntersectionConfig) == 0x000004, "Wrong alignment on FIntersectionConfig");
static_assert(sizeof(FIntersectionConfig) == 0x0000E0, "Wrong size on FIntersectionConfig");
static_assert(offsetof(FIntersectionConfig, IntersectionDirection) == 0x000000, "Member 'FIntersectionConfig::IntersectionDirection' has a wrong offset!");
static_assert(offsetof(FIntersectionConfig, PointTransform) == 0x000010, "Member 'FIntersectionConfig::PointTransform' has a wrong offset!");
static_assert(offsetof(FIntersectionConfig, TrunkLaneProfileRef) == 0x000070, "Member 'FIntersectionConfig::TrunkLaneProfileRef' has a wrong offset!");
static_assert(offsetof(FIntersectionConfig, bTrunkLaneReverseProfile) == 0x000088, "Member 'FIntersectionConfig::bTrunkLaneReverseProfile' has a wrong offset!");
static_assert(offsetof(FIntersectionConfig, TrunkConnectionRestrictions) == 0x00008C, "Member 'FIntersectionConfig::TrunkConnectionRestrictions' has a wrong offset!");
static_assert(offsetof(FIntersectionConfig, TrunkLaneType) == 0x000090, "Member 'FIntersectionConfig::TrunkLaneType' has a wrong offset!");
static_assert(offsetof(FIntersectionConfig, bTrunkLaneGenerate) == 0x000091, "Member 'FIntersectionConfig::bTrunkLaneGenerate' has a wrong offset!");
static_assert(offsetof(FIntersectionConfig, SideLaneProfileRef) == 0x000094, "Member 'FIntersectionConfig::SideLaneProfileRef' has a wrong offset!");
static_assert(offsetof(FIntersectionConfig, SideLaneType) == 0x0000AC, "Member 'FIntersectionConfig::SideLaneType' has a wrong offset!");
static_assert(offsetof(FIntersectionConfig, bCrosswalkUpGenerate) == 0x0000AD, "Member 'FIntersectionConfig::bCrosswalkUpGenerate' has a wrong offset!");
static_assert(offsetof(FIntersectionConfig, bCrosswalkRightGenerate) == 0x0000AE, "Member 'FIntersectionConfig::bCrosswalkRightGenerate' has a wrong offset!");
static_assert(offsetof(FIntersectionConfig, bCrosswalkButtonGenerate) == 0x0000AF, "Member 'FIntersectionConfig::bCrosswalkButtonGenerate' has a wrong offset!");
static_assert(offsetof(FIntersectionConfig, bCrosswalkLeftGenerate) == 0x0000B0, "Member 'FIntersectionConfig::bCrosswalkLeftGenerate' has a wrong offset!");
static_assert(offsetof(FIntersectionConfig, CrosswalkMiddleIntersectionProfileRef) == 0x0000B4, "Member 'FIntersectionConfig::CrosswalkMiddleIntersectionProfileRef' has a wrong offset!");
static_assert(offsetof(FIntersectionConfig, bCrosswalkMiddleIntersectionGenerate) == 0x0000CC, "Member 'FIntersectionConfig::bCrosswalkMiddleIntersectionGenerate' has a wrong offset!");
static_assert(offsetof(FIntersectionConfig, bTrafficlightGenerate) == 0x0000CD, "Member 'FIntersectionConfig::bTrafficlightGenerate' has a wrong offset!");
static_assert(offsetof(FIntersectionConfig, TrafficlightTypeName) == 0x0000D0, "Member 'FIntersectionConfig::TrafficlightTypeName' has a wrong offset!");

// ScriptStruct SnappyRoad.SplineCurvesWithOffset
// 0x0080 (0x0080 - 0x0000)
struct FSplineCurvesWithOffset final
{
public:
	struct FInterpCurveVector                     position;                                          // 0x0000(0x0018)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpCurveQuat                       Rotation;                                          // 0x0018(0x0018)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpCurveVector                     Scale;                                             // 0x0030(0x0018)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInterpCurveFloat                      ReparamTable;                                      // 0x0048(0x0018)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DefaultUpVector;                                   // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffsetPointAlongRightVector;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSplineCurvesWithOffset) == 0x000004, "Wrong alignment on FSplineCurvesWithOffset");
static_assert(sizeof(FSplineCurvesWithOffset) == 0x000080, "Wrong size on FSplineCurvesWithOffset");
static_assert(offsetof(FSplineCurvesWithOffset, position) == 0x000000, "Member 'FSplineCurvesWithOffset::position' has a wrong offset!");
static_assert(offsetof(FSplineCurvesWithOffset, Rotation) == 0x000018, "Member 'FSplineCurvesWithOffset::Rotation' has a wrong offset!");
static_assert(offsetof(FSplineCurvesWithOffset, Scale) == 0x000030, "Member 'FSplineCurvesWithOffset::Scale' has a wrong offset!");
static_assert(offsetof(FSplineCurvesWithOffset, ReparamTable) == 0x000048, "Member 'FSplineCurvesWithOffset::ReparamTable' has a wrong offset!");
static_assert(offsetof(FSplineCurvesWithOffset, DefaultUpVector) == 0x000060, "Member 'FSplineCurvesWithOffset::DefaultUpVector' has a wrong offset!");
static_assert(offsetof(FSplineCurvesWithOffset, OffsetPointAlongRightVector) == 0x000078, "Member 'FSplineCurvesWithOffset::OffsetPointAlongRightVector' has a wrong offset!");

// ScriptStruct SnappyRoad.PCGGraphStruct
// 0x0018 (0x0018 - 0x0000)
struct FPCGGraphStruct final
{
public:
