#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpinePlugin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SpinePlugin.SpineBoneDriverComponent.BeforeUpdateWorldTransform
// 0x0008 (0x0008 - 0x0000)
struct SpineBoneDriverComponent_BeforeUpdateWorldTransform final
{
public:
	class USpineSkeletonComponent*                Skeleton;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineBoneDriverComponent_BeforeUpdateWorldTransform) == 0x000008, "Wrong alignment on SpineBoneDriverComponent_BeforeUpdateWorldTransform");
static_assert(sizeof(SpineBoneDriverComponent_BeforeUpdateWorldTransform) == 0x000008, "Wrong size on SpineBoneDriverComponent_BeforeUpdateWorldTransform");
static_assert(offsetof(SpineBoneDriverComponent_BeforeUpdateWorldTransform, Skeleton) == 0x000000, "Member 'SpineBoneDriverComponent_BeforeUpdateWorldTransform::Skeleton' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetAlpha
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetAlpha final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetAlpha) == 0x000004, "Wrong alignment on TrackEntry_GetAlpha");
static_assert(sizeof(TrackEntry_GetAlpha) == 0x000004, "Wrong size on TrackEntry_GetAlpha");
static_assert(offsetof(TrackEntry_GetAlpha, ReturnValue) == 0x000000, "Member 'TrackEntry_GetAlpha::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetAlphaAttachmentThreshold
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetAlphaAttachmentThreshold final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetAlphaAttachmentThreshold) == 0x000004, "Wrong alignment on TrackEntry_GetAlphaAttachmentThreshold");
static_assert(sizeof(TrackEntry_GetAlphaAttachmentThreshold) == 0x000004, "Wrong size on TrackEntry_GetAlphaAttachmentThreshold");
static_assert(offsetof(TrackEntry_GetAlphaAttachmentThreshold, ReturnValue) == 0x000000, "Member 'TrackEntry_GetAlphaAttachmentThreshold::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.getAnimationDuration
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_getAnimationDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_getAnimationDuration) == 0x000004, "Wrong alignment on TrackEntry_getAnimationDuration");
static_assert(sizeof(TrackEntry_getAnimationDuration) == 0x000004, "Wrong size on TrackEntry_getAnimationDuration");
static_assert(offsetof(TrackEntry_getAnimationDuration, ReturnValue) == 0x000000, "Member 'TrackEntry_getAnimationDuration::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetAnimationEnd
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetAnimationEnd final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetAnimationEnd) == 0x000004, "Wrong alignment on TrackEntry_GetAnimationEnd");
static_assert(sizeof(TrackEntry_GetAnimationEnd) == 0x000004, "Wrong size on TrackEntry_GetAnimationEnd");
static_assert(offsetof(TrackEntry_GetAnimationEnd, ReturnValue) == 0x000000, "Member 'TrackEntry_GetAnimationEnd::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetAnimationLast
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetAnimationLast final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetAnimationLast) == 0x000004, "Wrong alignment on TrackEntry_GetAnimationLast");
static_assert(sizeof(TrackEntry_GetAnimationLast) == 0x000004, "Wrong size on TrackEntry_GetAnimationLast");
static_assert(offsetof(TrackEntry_GetAnimationLast, ReturnValue) == 0x000000, "Member 'TrackEntry_GetAnimationLast::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.getAnimationName
// 0x0010 (0x0010 - 0x0000)
struct TrackEntry_getAnimationName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_getAnimationName) == 0x000008, "Wrong alignment on TrackEntry_getAnimationName");
static_assert(sizeof(TrackEntry_getAnimationName) == 0x000010, "Wrong size on TrackEntry_getAnimationName");
static_assert(offsetof(TrackEntry_getAnimationName, ReturnValue) == 0x000000, "Member 'TrackEntry_getAnimationName::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetAnimationStart
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetAnimationStart final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetAnimationStart) == 0x000004, "Wrong alignment on TrackEntry_GetAnimationStart");
static_assert(sizeof(TrackEntry_GetAnimationStart) == 0x000004, "Wrong size on TrackEntry_GetAnimationStart");
static_assert(offsetof(TrackEntry_GetAnimationStart, ReturnValue) == 0x000000, "Member 'TrackEntry_GetAnimationStart::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetDelay
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetDelay final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetDelay) == 0x000004, "Wrong alignment on TrackEntry_GetDelay");
static_assert(sizeof(TrackEntry_GetDelay) == 0x000004, "Wrong size on TrackEntry_GetDelay");
static_assert(offsetof(TrackEntry_GetDelay, ReturnValue) == 0x000000, "Member 'TrackEntry_GetDelay::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetEventThreshold
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetEventThreshold final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetEventThreshold) == 0x000004, "Wrong alignment on TrackEntry_GetEventThreshold");
static_assert(sizeof(TrackEntry_GetEventThreshold) == 0x000004, "Wrong size on TrackEntry_GetEventThreshold");
static_assert(offsetof(TrackEntry_GetEventThreshold, ReturnValue) == 0x000000, "Member 'TrackEntry_GetEventThreshold::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetLoop
// 0x0001 (0x0001 - 0x0000)
struct TrackEntry_GetLoop final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetLoop) == 0x000001, "Wrong alignment on TrackEntry_GetLoop");
static_assert(sizeof(TrackEntry_GetLoop) == 0x000001, "Wrong size on TrackEntry_GetLoop");
static_assert(offsetof(TrackEntry_GetLoop, ReturnValue) == 0x000000, "Member 'TrackEntry_GetLoop::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetMixAttachmentThreshold
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetMixAttachmentThreshold final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetMixAttachmentThreshold) == 0x000004, "Wrong alignment on TrackEntry_GetMixAttachmentThreshold");
static_assert(sizeof(TrackEntry_GetMixAttachmentThreshold) == 0x000004, "Wrong size on TrackEntry_GetMixAttachmentThreshold");
static_assert(offsetof(TrackEntry_GetMixAttachmentThreshold, ReturnValue) == 0x000000, "Member 'TrackEntry_GetMixAttachmentThreshold::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetMixDrawOrderThreshold
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetMixDrawOrderThreshold final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetMixDrawOrderThreshold) == 0x000004, "Wrong alignment on TrackEntry_GetMixDrawOrderThreshold");
static_assert(sizeof(TrackEntry_GetMixDrawOrderThreshold) == 0x000004, "Wrong size on TrackEntry_GetMixDrawOrderThreshold");
static_assert(offsetof(TrackEntry_GetMixDrawOrderThreshold, ReturnValue) == 0x000000, "Member 'TrackEntry_GetMixDrawOrderThreshold::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetMixDuration
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetMixDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetMixDuration) == 0x000004, "Wrong alignment on TrackEntry_GetMixDuration");
static_assert(sizeof(TrackEntry_GetMixDuration) == 0x000004, "Wrong size on TrackEntry_GetMixDuration");
static_assert(offsetof(TrackEntry_GetMixDuration, ReturnValue) == 0x000000, "Member 'TrackEntry_GetMixDuration::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetMixTime
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetMixTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetMixTime) == 0x000004, "Wrong alignment on TrackEntry_GetMixTime");
static_assert(sizeof(TrackEntry_GetMixTime) == 0x000004, "Wrong size on TrackEntry_GetMixTime");
static_assert(offsetof(TrackEntry_GetMixTime, ReturnValue) == 0x000000, "Member 'TrackEntry_GetMixTime::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetTimeScale
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetTimeScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetTimeScale) == 0x000004, "Wrong alignment on TrackEntry_GetTimeScale");
static_assert(sizeof(TrackEntry_GetTimeScale) == 0x000004, "Wrong size on TrackEntry_GetTimeScale");
static_assert(offsetof(TrackEntry_GetTimeScale, ReturnValue) == 0x000000, "Member 'TrackEntry_GetTimeScale::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetTrackEnd
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetTrackEnd final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetTrackEnd) == 0x000004, "Wrong alignment on TrackEntry_GetTrackEnd");
static_assert(sizeof(TrackEntry_GetTrackEnd) == 0x000004, "Wrong size on TrackEntry_GetTrackEnd");
static_assert(offsetof(TrackEntry_GetTrackEnd, ReturnValue) == 0x000000, "Member 'TrackEntry_GetTrackEnd::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetTrackIndex
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetTrackIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetTrackIndex) == 0x000004, "Wrong alignment on TrackEntry_GetTrackIndex");
static_assert(sizeof(TrackEntry_GetTrackIndex) == 0x000004, "Wrong size on TrackEntry_GetTrackIndex");
static_assert(offsetof(TrackEntry_GetTrackIndex, ReturnValue) == 0x000000, "Member 'TrackEntry_GetTrackIndex::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.GetTrackTime
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_GetTrackTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_GetTrackTime) == 0x000004, "Wrong alignment on TrackEntry_GetTrackTime");
static_assert(sizeof(TrackEntry_GetTrackTime) == 0x000004, "Wrong size on TrackEntry_GetTrackTime");
static_assert(offsetof(TrackEntry_GetTrackTime, ReturnValue) == 0x000000, "Member 'TrackEntry_GetTrackTime::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.isValidAnimation
// 0x0001 (0x0001 - 0x0000)
struct TrackEntry_isValidAnimation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_isValidAnimation) == 0x000001, "Wrong alignment on TrackEntry_isValidAnimation");
static_assert(sizeof(TrackEntry_isValidAnimation) == 0x000001, "Wrong size on TrackEntry_isValidAnimation");
static_assert(offsetof(TrackEntry_isValidAnimation, ReturnValue) == 0x000000, "Member 'TrackEntry_isValidAnimation::ReturnValue' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetAlpha
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetAlpha final
{
public:
	float                                         Alpha;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetAlpha) == 0x000004, "Wrong alignment on TrackEntry_SetAlpha");
static_assert(sizeof(TrackEntry_SetAlpha) == 0x000004, "Wrong size on TrackEntry_SetAlpha");
static_assert(offsetof(TrackEntry_SetAlpha, Alpha) == 0x000000, "Member 'TrackEntry_SetAlpha::Alpha' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetAlphaAttachmentThreshold
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetAlphaAttachmentThreshold final
{
public:
	float                                         attachmentThreshold;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetAlphaAttachmentThreshold) == 0x000004, "Wrong alignment on TrackEntry_SetAlphaAttachmentThreshold");
static_assert(sizeof(TrackEntry_SetAlphaAttachmentThreshold) == 0x000004, "Wrong size on TrackEntry_SetAlphaAttachmentThreshold");
static_assert(offsetof(TrackEntry_SetAlphaAttachmentThreshold, attachmentThreshold) == 0x000000, "Member 'TrackEntry_SetAlphaAttachmentThreshold::attachmentThreshold' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetAnimationEnd
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetAnimationEnd final
{
public:
	float                                         animationEnd_0;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetAnimationEnd) == 0x000004, "Wrong alignment on TrackEntry_SetAnimationEnd");
static_assert(sizeof(TrackEntry_SetAnimationEnd) == 0x000004, "Wrong size on TrackEntry_SetAnimationEnd");
static_assert(offsetof(TrackEntry_SetAnimationEnd, animationEnd_0) == 0x000000, "Member 'TrackEntry_SetAnimationEnd::animationEnd_0' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetAnimationLast
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetAnimationLast final
{
public:
	float                                         animationLast;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetAnimationLast) == 0x000004, "Wrong alignment on TrackEntry_SetAnimationLast");
static_assert(sizeof(TrackEntry_SetAnimationLast) == 0x000004, "Wrong size on TrackEntry_SetAnimationLast");
static_assert(offsetof(TrackEntry_SetAnimationLast, animationLast) == 0x000000, "Member 'TrackEntry_SetAnimationLast::animationLast' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetAnimationStart
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetAnimationStart final
{
public:
	float                                         animationStart_0;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetAnimationStart) == 0x000004, "Wrong alignment on TrackEntry_SetAnimationStart");
static_assert(sizeof(TrackEntry_SetAnimationStart) == 0x000004, "Wrong size on TrackEntry_SetAnimationStart");
static_assert(offsetof(TrackEntry_SetAnimationStart, animationStart_0) == 0x000000, "Member 'TrackEntry_SetAnimationStart::animationStart_0' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetDelay
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetDelay final
{
public:
	float                                         Delay;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetDelay) == 0x000004, "Wrong alignment on TrackEntry_SetDelay");
static_assert(sizeof(TrackEntry_SetDelay) == 0x000004, "Wrong size on TrackEntry_SetDelay");
static_assert(offsetof(TrackEntry_SetDelay, Delay) == 0x000000, "Member 'TrackEntry_SetDelay::Delay' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetEventThreshold
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetEventThreshold final
{
public:
	float                                         eventThreshold;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetEventThreshold) == 0x000004, "Wrong alignment on TrackEntry_SetEventThreshold");
static_assert(sizeof(TrackEntry_SetEventThreshold) == 0x000004, "Wrong size on TrackEntry_SetEventThreshold");
static_assert(offsetof(TrackEntry_SetEventThreshold, eventThreshold) == 0x000000, "Member 'TrackEntry_SetEventThreshold::eventThreshold' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetLoop
// 0x0001 (0x0001 - 0x0000)
struct TrackEntry_SetLoop final
{
public:
	bool                                          Loop;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetLoop) == 0x000001, "Wrong alignment on TrackEntry_SetLoop");
static_assert(sizeof(TrackEntry_SetLoop) == 0x000001, "Wrong size on TrackEntry_SetLoop");
static_assert(offsetof(TrackEntry_SetLoop, Loop) == 0x000000, "Member 'TrackEntry_SetLoop::Loop' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetMixAttachmentThreshold
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetMixAttachmentThreshold final
{
public:
	float                                         drawOrderThreshold;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetMixAttachmentThreshold) == 0x000004, "Wrong alignment on TrackEntry_SetMixAttachmentThreshold");
static_assert(sizeof(TrackEntry_SetMixAttachmentThreshold) == 0x000004, "Wrong size on TrackEntry_SetMixAttachmentThreshold");
static_assert(offsetof(TrackEntry_SetMixAttachmentThreshold, drawOrderThreshold) == 0x000000, "Member 'TrackEntry_SetMixAttachmentThreshold::drawOrderThreshold' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetMixDrawOrderThreshold
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetMixDrawOrderThreshold final
{
public:
	float                                         drawOrderThreshold;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetMixDrawOrderThreshold) == 0x000004, "Wrong alignment on TrackEntry_SetMixDrawOrderThreshold");
static_assert(sizeof(TrackEntry_SetMixDrawOrderThreshold) == 0x000004, "Wrong size on TrackEntry_SetMixDrawOrderThreshold");
static_assert(offsetof(TrackEntry_SetMixDrawOrderThreshold, drawOrderThreshold) == 0x000000, "Member 'TrackEntry_SetMixDrawOrderThreshold::drawOrderThreshold' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetMixDuration
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetMixDuration final
{
public:
	float                                         mixDuration;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetMixDuration) == 0x000004, "Wrong alignment on TrackEntry_SetMixDuration");
static_assert(sizeof(TrackEntry_SetMixDuration) == 0x000004, "Wrong size on TrackEntry_SetMixDuration");
static_assert(offsetof(TrackEntry_SetMixDuration, mixDuration) == 0x000000, "Member 'TrackEntry_SetMixDuration::mixDuration' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetMixTime
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetMixTime final
{
public:
	float                                         mixTime;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetMixTime) == 0x000004, "Wrong alignment on TrackEntry_SetMixTime");
static_assert(sizeof(TrackEntry_SetMixTime) == 0x000004, "Wrong size on TrackEntry_SetMixTime");
static_assert(offsetof(TrackEntry_SetMixTime, mixTime) == 0x000000, "Member 'TrackEntry_SetMixTime::mixTime' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetTimeScale
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetTimeScale final
{
public:
	float                                         timescale;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetTimeScale) == 0x000004, "Wrong alignment on TrackEntry_SetTimeScale");
static_assert(sizeof(TrackEntry_SetTimeScale) == 0x000004, "Wrong size on TrackEntry_SetTimeScale");
static_assert(offsetof(TrackEntry_SetTimeScale, timescale) == 0x000000, "Member 'TrackEntry_SetTimeScale::timescale' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetTrackEnd
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetTrackEnd final
{
public:
	float                                         trackEnd;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetTrackEnd) == 0x000004, "Wrong alignment on TrackEntry_SetTrackEnd");
static_assert(sizeof(TrackEntry_SetTrackEnd) == 0x000004, "Wrong size on TrackEntry_SetTrackEnd");
static_assert(offsetof(TrackEntry_SetTrackEnd, trackEnd) == 0x000000, "Member 'TrackEntry_SetTrackEnd::trackEnd' has a wrong offset!");

// Function SpinePlugin.TrackEntry.SetTrackTime
// 0x0004 (0x0004 - 0x0000)
struct TrackEntry_SetTrackTime final
{
public:
	float                                         trackTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TrackEntry_SetTrackTime) == 0x000004, "Wrong alignment on TrackEntry_SetTrackTime");
static_assert(sizeof(TrackEntry_SetTrackTime) == 0x000004, "Wrong size on TrackEntry_SetTrackTime");
static_assert(offsetof(TrackEntry_SetTrackTime, trackTime) == 0x000000, "Member 'TrackEntry_SetTrackTime::trackTime' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.getAnimationDuration
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_getAnimationDuration final
{
public:
	class FString                                 AnimationName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SpineSkeletonComponent_getAnimationDuration) == 0x000008, "Wrong alignment on SpineSkeletonComponent_getAnimationDuration");
static_assert(sizeof(SpineSkeletonComponent_getAnimationDuration) == 0x000018, "Wrong size on SpineSkeletonComponent_getAnimationDuration");
static_assert(offsetof(SpineSkeletonComponent_getAnimationDuration, AnimationName) == 0x000000, "Member 'SpineSkeletonComponent_getAnimationDuration::AnimationName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_getAnimationDuration, ReturnValue) == 0x000010, "Member 'SpineSkeletonComponent_getAnimationDuration::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.GetAnimations
// 0x0010 (0x0010 - 0x0000)
struct SpineSkeletonComponent_GetAnimations final
{
public:
	TArray<class FString>                         Animations;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonComponent_GetAnimations) == 0x000008, "Wrong alignment on SpineSkeletonComponent_GetAnimations");
static_assert(sizeof(SpineSkeletonComponent_GetAnimations) == 0x000010, "Wrong size on SpineSkeletonComponent_GetAnimations");
static_assert(offsetof(SpineSkeletonComponent_GetAnimations, Animations) == 0x000000, "Member 'SpineSkeletonComponent_GetAnimations::Animations' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.GetBones
// 0x0010 (0x0010 - 0x0000)
struct SpineSkeletonComponent_GetBones final
{
public:
	TArray<class FString>                         Bones;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonComponent_GetBones) == 0x000008, "Wrong alignment on SpineSkeletonComponent_GetBones");
static_assert(sizeof(SpineSkeletonComponent_GetBones) == 0x000010, "Wrong size on SpineSkeletonComponent_GetBones");
static_assert(offsetof(SpineSkeletonComponent_GetBones, Bones) == 0x000000, "Member 'SpineSkeletonComponent_GetBones::Bones' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.GetBoneWorldTransform
// 0x0070 (0x0070 - 0x0000)
struct SpineSkeletonComponent_GetBoneWorldTransform final
{
public:
	class FString                                 BoneName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonComponent_GetBoneWorldTransform) == 0x000008, "Wrong alignment on SpineSkeletonComponent_GetBoneWorldTransform");
static_assert(sizeof(SpineSkeletonComponent_GetBoneWorldTransform) == 0x000070, "Wrong size on SpineSkeletonComponent_GetBoneWorldTransform");
static_assert(offsetof(SpineSkeletonComponent_GetBoneWorldTransform, BoneName) == 0x000000, "Member 'SpineSkeletonComponent_GetBoneWorldTransform::BoneName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_GetBoneWorldTransform, ReturnValue) == 0x000010, "Member 'SpineSkeletonComponent_GetBoneWorldTransform::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.GetScaleX
// 0x0004 (0x0004 - 0x0000)
struct SpineSkeletonComponent_GetScaleX final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonComponent_GetScaleX) == 0x000004, "Wrong alignment on SpineSkeletonComponent_GetScaleX");
static_assert(sizeof(SpineSkeletonComponent_GetScaleX) == 0x000004, "Wrong size on SpineSkeletonComponent_GetScaleX");
static_assert(offsetof(SpineSkeletonComponent_GetScaleX, ReturnValue) == 0x000000, "Member 'SpineSkeletonComponent_GetScaleX::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.GetScaleY
// 0x0004 (0x0004 - 0x0000)
struct SpineSkeletonComponent_GetScaleY final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonComponent_GetScaleY) == 0x000004, "Wrong alignment on SpineSkeletonComponent_GetScaleY");
static_assert(sizeof(SpineSkeletonComponent_GetScaleY) == 0x000004, "Wrong size on SpineSkeletonComponent_GetScaleY");
static_assert(offsetof(SpineSkeletonComponent_GetScaleY, ReturnValue) == 0x000000, "Member 'SpineSkeletonComponent_GetScaleY::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.GetSkins
// 0x0010 (0x0010 - 0x0000)
struct SpineSkeletonComponent_GetSkins final
{
public:
	TArray<class FString>                         Skins;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonComponent_GetSkins) == 0x000008, "Wrong alignment on SpineSkeletonComponent_GetSkins");
static_assert(sizeof(SpineSkeletonComponent_GetSkins) == 0x000010, "Wrong size on SpineSkeletonComponent_GetSkins");
static_assert(offsetof(SpineSkeletonComponent_GetSkins, Skins) == 0x000000, "Member 'SpineSkeletonComponent_GetSkins::Skins' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.GetSlots
// 0x0010 (0x0010 - 0x0000)
struct SpineSkeletonComponent_GetSlots final
{
public:
	TArray<class FString>                         Slots;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonComponent_GetSlots) == 0x000008, "Wrong alignment on SpineSkeletonComponent_GetSlots");
static_assert(sizeof(SpineSkeletonComponent_GetSlots) == 0x000010, "Wrong size on SpineSkeletonComponent_GetSlots");
static_assert(offsetof(SpineSkeletonComponent_GetSlots, Slots) == 0x000000, "Member 'SpineSkeletonComponent_GetSlots::Slots' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.HasAnimation
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_HasAnimation final
{
public:
	class FString                                 AnimationName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SpineSkeletonComponent_HasAnimation) == 0x000008, "Wrong alignment on SpineSkeletonComponent_HasAnimation");
static_assert(sizeof(SpineSkeletonComponent_HasAnimation) == 0x000018, "Wrong size on SpineSkeletonComponent_HasAnimation");
static_assert(offsetof(SpineSkeletonComponent_HasAnimation, AnimationName) == 0x000000, "Member 'SpineSkeletonComponent_HasAnimation::AnimationName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_HasAnimation, ReturnValue) == 0x000010, "Member 'SpineSkeletonComponent_HasAnimation::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.HasBone
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_HasBone final
{
public:
	class FString                                 BoneName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SpineSkeletonComponent_HasBone) == 0x000008, "Wrong alignment on SpineSkeletonComponent_HasBone");
static_assert(sizeof(SpineSkeletonComponent_HasBone) == 0x000018, "Wrong size on SpineSkeletonComponent_HasBone");
static_assert(offsetof(SpineSkeletonComponent_HasBone, BoneName) == 0x000000, "Member 'SpineSkeletonComponent_HasBone::BoneName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_HasBone, ReturnValue) == 0x000010, "Member 'SpineSkeletonComponent_HasBone::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.HasSkin
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_HasSkin final
{
public:
	class FString                                 SkinName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SpineSkeletonComponent_HasSkin) == 0x000008, "Wrong alignment on SpineSkeletonComponent_HasSkin");
static_assert(sizeof(SpineSkeletonComponent_HasSkin) == 0x000018, "Wrong size on SpineSkeletonComponent_HasSkin");
static_assert(offsetof(SpineSkeletonComponent_HasSkin, SkinName) == 0x000000, "Member 'SpineSkeletonComponent_HasSkin::SkinName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_HasSkin, ReturnValue) == 0x000010, "Member 'SpineSkeletonComponent_HasSkin::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.HasSlot
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_HasSlot final
{
public:
	class FString                                 SlotName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SpineSkeletonComponent_HasSlot) == 0x000008, "Wrong alignment on SpineSkeletonComponent_HasSlot");
static_assert(sizeof(SpineSkeletonComponent_HasSlot) == 0x000018, "Wrong size on SpineSkeletonComponent_HasSlot");
static_assert(offsetof(SpineSkeletonComponent_HasSlot, SlotName) == 0x000000, "Member 'SpineSkeletonComponent_HasSlot::SlotName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_HasSlot, ReturnValue) == 0x000010, "Member 'SpineSkeletonComponent_HasSlot::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.PhysicsRotate
// 0x000C (0x000C - 0x0000)
struct SpineSkeletonComponent_PhysicsRotate final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Degrees;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonComponent_PhysicsRotate) == 0x000004, "Wrong alignment on SpineSkeletonComponent_PhysicsRotate");
static_assert(sizeof(SpineSkeletonComponent_PhysicsRotate) == 0x00000C, "Wrong size on SpineSkeletonComponent_PhysicsRotate");
static_assert(offsetof(SpineSkeletonComponent_PhysicsRotate, X) == 0x000000, "Member 'SpineSkeletonComponent_PhysicsRotate::X' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_PhysicsRotate, Y) == 0x000004, "Member 'SpineSkeletonComponent_PhysicsRotate::Y' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_PhysicsRotate, Degrees) == 0x000008, "Member 'SpineSkeletonComponent_PhysicsRotate::Degrees' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.PhysicsTranslate
// 0x0008 (0x0008 - 0x0000)
struct SpineSkeletonComponent_PhysicsTranslate final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonComponent_PhysicsTranslate) == 0x000004, "Wrong alignment on SpineSkeletonComponent_PhysicsTranslate");
static_assert(sizeof(SpineSkeletonComponent_PhysicsTranslate) == 0x000008, "Wrong size on SpineSkeletonComponent_PhysicsTranslate");
static_assert(offsetof(SpineSkeletonComponent_PhysicsTranslate, X) == 0x000000, "Member 'SpineSkeletonComponent_PhysicsTranslate::X' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_PhysicsTranslate, Y) == 0x000004, "Member 'SpineSkeletonComponent_PhysicsTranslate::Y' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.SetAttachment
// 0x0028 (0x0028 - 0x0000)
struct SpineSkeletonComponent_SetAttachment final
{
public:
	class FString                                 SlotName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AttachmentName;                                    // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SpineSkeletonComponent_SetAttachment) == 0x000008, "Wrong alignment on SpineSkeletonComponent_SetAttachment");
static_assert(sizeof(SpineSkeletonComponent_SetAttachment) == 0x000028, "Wrong size on SpineSkeletonComponent_SetAttachment");
static_assert(offsetof(SpineSkeletonComponent_SetAttachment, SlotName) == 0x000000, "Member 'SpineSkeletonComponent_SetAttachment::SlotName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_SetAttachment, AttachmentName) == 0x000010, "Member 'SpineSkeletonComponent_SetAttachment::AttachmentName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_SetAttachment, ReturnValue) == 0x000020, "Member 'SpineSkeletonComponent_SetAttachment::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.SetBoneWorldPosition
// 0x0028 (0x0028 - 0x0000)
struct SpineSkeletonComponent_SetBoneWorldPosition final
{
public:
	class FString                                 BoneName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                position;                                          // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonComponent_SetBoneWorldPosition) == 0x000008, "Wrong alignment on SpineSkeletonComponent_SetBoneWorldPosition");
static_assert(sizeof(SpineSkeletonComponent_SetBoneWorldPosition) == 0x000028, "Wrong size on SpineSkeletonComponent_SetBoneWorldPosition");
static_assert(offsetof(SpineSkeletonComponent_SetBoneWorldPosition, BoneName) == 0x000000, "Member 'SpineSkeletonComponent_SetBoneWorldPosition::BoneName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_SetBoneWorldPosition, position) == 0x000010, "Member 'SpineSkeletonComponent_SetBoneWorldPosition::position' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.SetScaleX
// 0x0004 (0x0004 - 0x0000)
struct SpineSkeletonComponent_SetScaleX final
{
public:
	float                                         ScaleX;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonComponent_SetScaleX) == 0x000004, "Wrong alignment on SpineSkeletonComponent_SetScaleX");
static_assert(sizeof(SpineSkeletonComponent_SetScaleX) == 0x000004, "Wrong size on SpineSkeletonComponent_SetScaleX");
static_assert(offsetof(SpineSkeletonComponent_SetScaleX, ScaleX) == 0x000000, "Member 'SpineSkeletonComponent_SetScaleX::ScaleX' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.SetScaleY
// 0x0004 (0x0004 - 0x0000)
struct SpineSkeletonComponent_SetScaleY final
{
public:
	float                                         ScaleY;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonComponent_SetScaleY) == 0x000004, "Wrong alignment on SpineSkeletonComponent_SetScaleY");
static_assert(sizeof(SpineSkeletonComponent_SetScaleY) == 0x000004, "Wrong size on SpineSkeletonComponent_SetScaleY");
static_assert(offsetof(SpineSkeletonComponent_SetScaleY, ScaleY) == 0x000000, "Member 'SpineSkeletonComponent_SetScaleY::ScaleY' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.SetSkin
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_SetSkin final
{
public:
	class FString                                 SkinName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SpineSkeletonComponent_SetSkin) == 0x000008, "Wrong alignment on SpineSkeletonComponent_SetSkin");
static_assert(sizeof(SpineSkeletonComponent_SetSkin) == 0x000018, "Wrong size on SpineSkeletonComponent_SetSkin");
static_assert(offsetof(SpineSkeletonComponent_SetSkin, SkinName) == 0x000000, "Member 'SpineSkeletonComponent_SetSkin::SkinName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_SetSkin, ReturnValue) == 0x000010, "Member 'SpineSkeletonComponent_SetSkin::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.SetSkins
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_SetSkins final
{
public:
	TArray<class FString>                         SkinNames;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SpineSkeletonComponent_SetSkins) == 0x000008, "Wrong alignment on SpineSkeletonComponent_SetSkins");
static_assert(sizeof(SpineSkeletonComponent_SetSkins) == 0x000018, "Wrong size on SpineSkeletonComponent_SetSkins");
static_assert(offsetof(SpineSkeletonComponent_SetSkins, SkinNames) == 0x000000, "Member 'SpineSkeletonComponent_SetSkins::SkinNames' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_SetSkins, ReturnValue) == 0x000010, "Member 'SpineSkeletonComponent_SetSkins::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonComponent.SetSlotColor
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonComponent_SetSlotColor final
{
public:
	class FString                                 SlotName;                                          // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 Color;                                             // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SpineSkeletonComponent_SetSlotColor) == 0x000008, "Wrong alignment on SpineSkeletonComponent_SetSlotColor");
static_assert(sizeof(SpineSkeletonComponent_SetSlotColor) == 0x000018, "Wrong size on SpineSkeletonComponent_SetSlotColor");
static_assert(offsetof(SpineSkeletonComponent_SetSlotColor, SlotName) == 0x000000, "Member 'SpineSkeletonComponent_SetSlotColor::SlotName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonComponent_SetSlotColor, Color) == 0x000010, "Member 'SpineSkeletonComponent_SetSlotColor::Color' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonAnimationComponent.AddAnimation
// 0x0028 (0x0028 - 0x0000)
struct SpineSkeletonAnimationComponent_AddAnimation final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AnimationName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Loop;                                              // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Delay;                                             // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTrackEntry*                            ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonAnimationComponent_AddAnimation) == 0x000008, "Wrong alignment on SpineSkeletonAnimationComponent_AddAnimation");
static_assert(sizeof(SpineSkeletonAnimationComponent_AddAnimation) == 0x000028, "Wrong size on SpineSkeletonAnimationComponent_AddAnimation");
static_assert(offsetof(SpineSkeletonAnimationComponent_AddAnimation, TrackIndex) == 0x000000, "Member 'SpineSkeletonAnimationComponent_AddAnimation::TrackIndex' has a wrong offset!");
static_assert(offsetof(SpineSkeletonAnimationComponent_AddAnimation, AnimationName) == 0x000008, "Member 'SpineSkeletonAnimationComponent_AddAnimation::AnimationName' has a wrong offset!");
static_assert(offsetof(SpineSkeletonAnimationComponent_AddAnimation, Loop) == 0x000018, "Member 'SpineSkeletonAnimationComponent_AddAnimation::Loop' has a wrong offset!");
static_assert(offsetof(SpineSkeletonAnimationComponent_AddAnimation, Delay) == 0x00001C, "Member 'SpineSkeletonAnimationComponent_AddAnimation::Delay' has a wrong offset!");
static_assert(offsetof(SpineSkeletonAnimationComponent_AddAnimation, ReturnValue) == 0x000020, "Member 'SpineSkeletonAnimationComponent_AddAnimation::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonAnimationComponent.AddEmptyAnimation
// 0x0018 (0x0018 - 0x0000)
struct SpineSkeletonAnimationComponent_AddEmptyAnimation final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         mixDuration;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTrackEntry*                            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonAnimationComponent_AddEmptyAnimation) == 0x000008, "Wrong alignment on SpineSkeletonAnimationComponent_AddEmptyAnimation");
static_assert(sizeof(SpineSkeletonAnimationComponent_AddEmptyAnimation) == 0x000018, "Wrong size on SpineSkeletonAnimationComponent_AddEmptyAnimation");
static_assert(offsetof(SpineSkeletonAnimationComponent_AddEmptyAnimation, TrackIndex) == 0x000000, "Member 'SpineSkeletonAnimationComponent_AddEmptyAnimation::TrackIndex' has a wrong offset!");
static_assert(offsetof(SpineSkeletonAnimationComponent_AddEmptyAnimation, mixDuration) == 0x000004, "Member 'SpineSkeletonAnimationComponent_AddEmptyAnimation::mixDuration' has a wrong offset!");
static_assert(offsetof(SpineSkeletonAnimationComponent_AddEmptyAnimation, Delay) == 0x000008, "Member 'SpineSkeletonAnimationComponent_AddEmptyAnimation::Delay' has a wrong offset!");
static_assert(offsetof(SpineSkeletonAnimationComponent_AddEmptyAnimation, ReturnValue) == 0x000010, "Member 'SpineSkeletonAnimationComponent_AddEmptyAnimation::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonAnimationComponent.ClearTrack
// 0x0004 (0x0004 - 0x0000)
struct SpineSkeletonAnimationComponent_ClearTrack final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonAnimationComponent_ClearTrack) == 0x000004, "Wrong alignment on SpineSkeletonAnimationComponent_ClearTrack");
static_assert(sizeof(SpineSkeletonAnimationComponent_ClearTrack) == 0x000004, "Wrong size on SpineSkeletonAnimationComponent_ClearTrack");
static_assert(offsetof(SpineSkeletonAnimationComponent_ClearTrack, TrackIndex) == 0x000000, "Member 'SpineSkeletonAnimationComponent_ClearTrack::TrackIndex' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonAnimationComponent.GetCurrent
// 0x0010 (0x0010 - 0x0000)
struct SpineSkeletonAnimationComponent_GetCurrent final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTrackEntry*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonAnimationComponent_GetCurrent) == 0x000008, "Wrong alignment on SpineSkeletonAnimationComponent_GetCurrent");
static_assert(sizeof(SpineSkeletonAnimationComponent_GetCurrent) == 0x000010, "Wrong size on SpineSkeletonAnimationComponent_GetCurrent");
static_assert(offsetof(SpineSkeletonAnimationComponent_GetCurrent, TrackIndex) == 0x000000, "Member 'SpineSkeletonAnimationComponent_GetCurrent::TrackIndex' has a wrong offset!");
static_assert(offsetof(SpineSkeletonAnimationComponent_GetCurrent, ReturnValue) == 0x000008, "Member 'SpineSkeletonAnimationComponent_GetCurrent::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonAnimationComponent.GetPhysicsTimeScale
// 0x0004 (0x0004 - 0x0000)
struct SpineSkeletonAnimationComponent_GetPhysicsTimeScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonAnimationComponent_GetPhysicsTimeScale) == 0x000004, "Wrong alignment on SpineSkeletonAnimationComponent_GetPhysicsTimeScale");
static_assert(sizeof(SpineSkeletonAnimationComponent_GetPhysicsTimeScale) == 0x000004, "Wrong size on SpineSkeletonAnimationComponent_GetPhysicsTimeScale");
static_assert(offsetof(SpineSkeletonAnimationComponent_GetPhysicsTimeScale, ReturnValue) == 0x000000, "Member 'SpineSkeletonAnimationComponent_GetPhysicsTimeScale::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonAnimationComponent.GetTimeScale
// 0x0004 (0x0004 - 0x0000)
struct SpineSkeletonAnimationComponent_GetTimeScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SpineSkeletonAnimationComponent_GetTimeScale) == 0x000004, "Wrong alignment on SpineSkeletonAnimationComponent_GetTimeScale");
static_assert(sizeof(SpineSkeletonAnimationComponent_GetTimeScale) == 0x000004, "Wrong size on SpineSkeletonAnimationComponent_GetTimeScale");
static_assert(offsetof(SpineSkeletonAnimationComponent_GetTimeScale, ReturnValue) == 0x000000, "Member 'SpineSkeletonAnimationComponent_GetTimeScale::ReturnValue' has a wrong offset!");

// Function SpinePlugin.SpineSkeletonAnimationComponent.SetAnimation
// 0x0028 (0x0028 - 0x0000)
struct SpineSkeletonAnimationComponent_SetAnimation final
{
public:
	int32                                         TrackIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AnimationName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Loop;                                              // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
