#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SplineMeshEditor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SplineMeshEditor_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class SplineMeshEditor.SME_Segment
// 0x00D8 (0x0100 - 0x0028)
class USME_Segment final : public UObject
{
public:
	class UStaticMeshComponent*                   NewStaticMeshComponent;                            // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineMeshComponent*                   NewSplineMeshComponent;                            // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0xC8];                                      // 0x0038(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SME_Segment">();
	}
	static class USME_Segment* GetDefaultObj()
	{
		return GetDefaultObjImpl<USME_Segment>();
	}
};
static_assert(alignof(USME_Segment) == 0x000008, "Wrong alignment on USME_Segment");
static_assert(sizeof(USME_Segment) == 0x000100, "Wrong size on USME_Segment");
static_assert(offsetof(USME_Segment, NewStaticMeshComponent) == 0x000028, "Member 'USME_Segment::NewStaticMeshComponent' has a wrong offset!");
static_assert(offsetof(USME_Segment, NewSplineMeshComponent) == 0x000030, "Member 'USME_Segment::NewSplineMeshComponent' has a wrong offset!");

// Class SplineMeshEditor.SME_SplineLayer
// 0x0240 (0x0268 - 0x0028)
class USME_SplineLayer final : public UObject
{
public:
	class USplineComponent*                       SplineComponent;                                   // 0x0028(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x1F8];                                     // 0x0030(0x01F8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USME_Segment*>                   SplineSegments;                                    // 0x0228(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_238[0x30];                                     // 0x0238(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SME_SplineLayer">();
	}
	static class USME_SplineLayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USME_SplineLayer>();
	}
};
static_assert(alignof(USME_SplineLayer) == 0x000008, "Wrong alignment on USME_SplineLayer");
static_assert(sizeof(USME_SplineLayer) == 0x000268, "Wrong size on USME_SplineLayer");
static_assert(offsetof(USME_SplineLayer, SplineComponent) == 0x000028, "Member 'USME_SplineLayer::SplineComponent' has a wrong offset!");
static_assert(offsetof(USME_SplineLayer, SplineSegments) == 0x000228, "Member 'USME_SplineLayer::SplineSegments' has a wrong offset!");

// Class SplineMeshEditor.SME_SplineMeshActor
// 0x0130 (0x03F8 - 0x02C8)
class ASME_SplineMeshActor final : public AActor
{
public:
	TArray<struct FSMEBranchData>                 Branches;                                          // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class USplineComponent*                       SplineComponent;                                   // 0x02D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumSplinePoints;                                   // 0x02E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSMELayerData>                  SplineLayersData;                                  // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          DuplicateSegmentsPercentages;                      // 0x02F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F9[0x17];                                     // 0x02F9(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USME_SplineLayer*>               SplineLayersRuntime;                               // 0x0310(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	EComponentMobility                            Mobility;                                          // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ClosedLoop;                                        // 0x0321(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESMESplinePointType                           SplinePointMode;                                   // 0x0322(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_323[0x5];                                      // 0x0323(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMEArcSettings                        ArcSettings;                                       // 0x0328(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	class AActor*                                 ExternalSplineActor;                               // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASME_SplineMeshActor*                   LinkedExternalSplineMeshActor;                     // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSMEPhysicData                         PhysicData;                                        // 0x0360(0x002C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            DefaultAnchorMesh;                                 // 0x0390(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     DefaultAnchorMaterial;                             // 0x0398(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ExternalEndAnchorActor;                            // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HideDefaultAnchorInGame;                           // 0x03A8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BreackablePhysicsConstraints;                      // 0x03A9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3AA[0x16];                                     // 0x03AA(0x0016)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPhysicsConstraintComponent*>    PhysicsConstraints;                                // 0x03C0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                         PreviousBranches;                                  // 0x03D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FTransform>                     PreviousBranchesInitialTransform;                  // 0x03E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3F0[0x8];                                      // 0x03F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void MakeSplineArc(class USplineComponent* SplineComp, int32 NumPoints, const struct FVector2D& Radius, float RotationOffset, float Degrees, bool Closed, ESMESplinePointType PointMode);

	int32 FindBranch(class AActor* ActorToFind);
	float GetSplineUtilization();
	void OnHit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void SetSplineUtilization(float Value);
	void UpdateConstruction();
	void UpdateSplineAtRuntime();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SME_SplineMeshActor">();
	}
	static class ASME_SplineMeshActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASME_SplineMeshActor>();
	}
};
static_assert(alignof(ASME_SplineMeshActor) == 0x000008, "Wrong alignment on ASME_SplineMeshActor");
static_assert(sizeof(ASME_SplineMeshActor) == 0x0003F8, "Wrong size on ASME_SplineMeshActor");
static_assert(offsetof(ASME_SplineMeshActor, Branches) == 0x0002C8, "Member 'ASME_SplineMeshActor::Branches' has a wrong offset!");
static_assert(offsetof(ASME_SplineMeshActor, SplineComponent) == 0x0002D8, "Member 'ASME_SplineMeshActor::SplineComponent' has a wrong offset!");
static_assert(offsetof(ASME_SplineMeshActor, NumSplinePoints) == 0x0002E0, "Member 'ASME_SplineMeshActor::NumSplinePoints' has a wrong offset!");
static_assert(offsetof(ASME_SplineMeshActor, SplineLayersData) == 0x0002E8, "Member 'ASME_SplineMeshActor::SplineLayersData' has a wrong offset!");
static_assert(offsetof(ASME_SplineMeshActor, DuplicateSegmentsPercentages) == 0x0002F8, "Member 'ASME_SplineMeshActor::DuplicateSegmentsPercentages' has a wrong offset!");
static_assert(offsetof(ASME_SplineMeshActor, SplineLayersRuntime) == 0x000310, "Member 'ASME_SplineMeshActor::SplineLayersRuntime' has a wrong offset!");
static_assert(offsetof(ASME_SplineMeshActor, Mobility) == 0x000320, "Member 'ASME_SplineMeshActor::Mobility' has a wrong offset!");
static_assert(offsetof(ASME_SplineMeshActor, ClosedLoop) == 0x000321, "Member 'ASME_SplineMeshActor::ClosedLoop' has a wrong offset!");
static_assert(offsetof(ASME_SplineMeshActor, SplinePointMode) == 0x000322, "Member 'ASME_SplineMeshActor::SplinePointMode' has a wrong offset!");
static_assert(offsetof(ASME_SplineMeshActor, ArcSettings) == 0x000328, "Member 'ASME_SplineMeshActor::ArcSettings' has a wrong offset!");
static_assert(offsetof(ASME_SplineMeshActor, ExternalSplineActor) == 0x000350, "Member 'ASME_SplineMeshActor::ExternalSplineActor' has a wrong offset!");
static_assert(offsetof(ASME_SplineMeshActor, LinkedExternalSplineMeshActor) == 0x000358, "Member 'ASME_SplineMeshActor::LinkedExternalSplineMeshActor' has a wrong offset!");
static_assert(offsetof(ASME_SplineMeshActor, PhysicData) == 0x000360, "Member 'ASME_SplineMeshActor::PhysicData' has a wrong offset!");
static_assert(offsetof(ASME_SplineMeshActor, DefaultAnchorMesh) == 0x000390, "Member 'ASME_SplineMeshActor::DefaultAnchorMesh' has a wrong offset!");
static_assert(offsetof(ASME_SplineMeshActor, DefaultAnchorMaterial) == 0x000398, "Member 'ASME_SplineMeshActor::DefaultAnchorMaterial' has a wrong offset!");
static_assert(offsetof(ASME_SplineMeshActor, ExternalEndAnchorActor) == 0x0003A0, "Member 'ASME_SplineMeshActor::ExternalEndAnchorActor' has a wrong offset!");
static_assert(offsetof(ASME_SplineMeshActor, HideDefaultAnchorInGame) == 0x0003A8, "Member 'ASME_SplineMeshActor::HideDefaultAnchorInGame' has a wrong offset!");
static_assert(offsetof(ASME_SplineMeshActor, BreackablePhysicsConstraints) == 0x0003A9, "Member 'ASME_SplineMeshActor::BreackablePhysicsConstraints' has a wrong offset!");
static_assert(offsetof(ASME_SplineMeshActor, PhysicsConstraints) == 0x0003C0, "Member 'ASME_SplineMeshActor::PhysicsConstraints' has a wrong offset!");
static_assert(offsetof(ASME_SplineMeshActor, PreviousBranches) == 0x0003D0, "Member 'ASME_SplineMeshActor::PreviousBranches' has a wrong offset!");
static_assert(offsetof(ASME_SplineMeshActor, PreviousBranchesInitialTransform) == 0x0003E0, "Member 'ASME_SplineMeshActor::PreviousBranchesInitialTransform' has a wrong offset!");

}

