#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SplineMeshEditor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// Enum SplineMeshEditor.ESMECenteredPivotMode
// NumValues: 0x0004
enum class ESMECenteredPivotMode : uint8
{
	Up                                       = 0,
	Center                                   = 1,
	Down                                     = 2,
	ESMECenteredPivotMode_MAX                = 3,
};

// Enum SplineMeshEditor.ESMEStretchMode
// NumValues: 0x0005
enum class ESMEStretchMode : uint8
{
	FixedSegmentLength                       = 0,
	FixedSegmentCount                        = 1,
	SegmentsPerSplinePoint                   = 2,
	SemiFixedSegmentLength                   = 3,
	ESMEStretchMode_MAX                      = 4,
};

// Enum SplineMeshEditor.ESMESegmentOverrideMode
// NumValues: 0x0004
enum class ESMESegmentOverrideMode : uint8
{
	Arbitrary                                = 0,
	Interval                                 = 1,
	Last                                     = 2,
	ESMESegmentOverrideMode_MAX              = 3,
};

// Enum SplineMeshEditor.ESMESplinePointType
// NumValues: 0x0004
enum class ESMESplinePointType : uint8
{
	UserDefined                              = 0,
	Curved                                   = 1,
	Linear                                   = 2,
	ESMESplinePointType_MAX                  = 3,
};

// ScriptStruct SplineMeshEditor.SMEMeshDistribution
// 0x0024 (0x0024 - 0x0000)
struct FSMEMeshDistribution final
{
public:
	float                                         GapLength;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseDefaultMeshSize;                                // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESMEStretchMode                               DistributionMode;                                  // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SegmentsLength;                                    // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumSegments;                                       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumSegmentsPerSplinePoint;                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetSegmentLength;                               // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SplineUtilization;                                 // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SegmentStartPercentage;                            // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OnlyUseRemainingLength;                            // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMEMeshDistribution) == 0x000004, "Wrong alignment on FSMEMeshDistribution");
static_assert(sizeof(FSMEMeshDistribution) == 0x000024, "Wrong size on FSMEMeshDistribution");
static_assert(offsetof(FSMEMeshDistribution, GapLength) == 0x000000, "Member 'FSMEMeshDistribution::GapLength' has a wrong offset!");
static_assert(offsetof(FSMEMeshDistribution, UseDefaultMeshSize) == 0x000004, "Member 'FSMEMeshDistribution::UseDefaultMeshSize' has a wrong offset!");
static_assert(offsetof(FSMEMeshDistribution, DistributionMode) == 0x000005, "Member 'FSMEMeshDistribution::DistributionMode' has a wrong offset!");
static_assert(offsetof(FSMEMeshDistribution, SegmentsLength) == 0x000008, "Member 'FSMEMeshDistribution::SegmentsLength' has a wrong offset!");
static_assert(offsetof(FSMEMeshDistribution, NumSegments) == 0x00000C, "Member 'FSMEMeshDistribution::NumSegments' has a wrong offset!");
static_assert(offsetof(FSMEMeshDistribution, NumSegmentsPerSplinePoint) == 0x000010, "Member 'FSMEMeshDistribution::NumSegmentsPerSplinePoint' has a wrong offset!");
static_assert(offsetof(FSMEMeshDistribution, TargetSegmentLength) == 0x000014, "Member 'FSMEMeshDistribution::TargetSegmentLength' has a wrong offset!");
static_assert(offsetof(FSMEMeshDistribution, SplineUtilization) == 0x000018, "Member 'FSMEMeshDistribution::SplineUtilization' has a wrong offset!");
static_assert(offsetof(FSMEMeshDistribution, SegmentStartPercentage) == 0x00001C, "Member 'FSMEMeshDistribution::SegmentStartPercentage' has a wrong offset!");
static_assert(offsetof(FSMEMeshDistribution, OnlyUseRemainingLength) == 0x000020, "Member 'FSMEMeshDistribution::OnlyUseRemainingLength' has a wrong offset!");

// ScriptStruct SplineMeshEditor.SMEScaleOffset
// 0x0020 (0x0020 - 0x0000)
struct FSMEScaleOffset final
{
public:
	class UCurveFloat*                            ScaleCurve;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinScaleWidth;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxScaleWidth;                                     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinScaleHeight;                                    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxScaleHeight;                                    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtraLength;                                       // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMEScaleOffset) == 0x000008, "Wrong alignment on FSMEScaleOffset");
static_assert(sizeof(FSMEScaleOffset) == 0x000020, "Wrong size on FSMEScaleOffset");
static_assert(offsetof(FSMEScaleOffset, ScaleCurve) == 0x000000, "Member 'FSMEScaleOffset::ScaleCurve' has a wrong offset!");
static_assert(offsetof(FSMEScaleOffset, MinScaleWidth) == 0x000008, "Member 'FSMEScaleOffset::MinScaleWidth' has a wrong offset!");
static_assert(offsetof(FSMEScaleOffset, MaxScaleWidth) == 0x00000C, "Member 'FSMEScaleOffset::MaxScaleWidth' has a wrong offset!");
static_assert(offsetof(FSMEScaleOffset, MinScaleHeight) == 0x000010, "Member 'FSMEScaleOffset::MinScaleHeight' has a wrong offset!");
static_assert(offsetof(FSMEScaleOffset, MaxScaleHeight) == 0x000014, "Member 'FSMEScaleOffset::MaxScaleHeight' has a wrong offset!");
static_assert(offsetof(FSMEScaleOffset, ExtraLength) == 0x000018, "Member 'FSMEScaleOffset::ExtraLength' has a wrong offset!");

// ScriptStruct SplineMeshEditor.SMEScaleOverride
// 0x0014 (0x0014 - 0x0000)
struct FSMEScaleOverride final
{
public:
	bool                                          MatchLayerScale;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ScaleWidthStart;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleHeightStart;                                  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleWidthEnd;                                     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScaleHeightEnd;                                    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMEScaleOverride) == 0x000004, "Wrong alignment on FSMEScaleOverride");
static_assert(sizeof(FSMEScaleOverride) == 0x000014, "Wrong size on FSMEScaleOverride");
static_assert(offsetof(FSMEScaleOverride, MatchLayerScale) == 0x000000, "Member 'FSMEScaleOverride::MatchLayerScale' has a wrong offset!");
static_assert(offsetof(FSMEScaleOverride, ScaleWidthStart) == 0x000004, "Member 'FSMEScaleOverride::ScaleWidthStart' has a wrong offset!");
static_assert(offsetof(FSMEScaleOverride, ScaleHeightStart) == 0x000008, "Member 'FSMEScaleOverride::ScaleHeightStart' has a wrong offset!");
static_assert(offsetof(FSMEScaleOverride, ScaleWidthEnd) == 0x00000C, "Member 'FSMEScaleOverride::ScaleWidthEnd' has a wrong offset!");
static_assert(offsetof(FSMEScaleOverride, ScaleHeightEnd) == 0x000010, "Member 'FSMEScaleOverride::ScaleHeightEnd' has a wrong offset!");

// ScriptStruct SplineMeshEditor.SMELocalOffsets
// 0x0070 (0x0070 - 0x0000)
struct FSMELocalOffsets final
{
public:
	struct FVector                                LocalLocationOffset;                               // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldLocationOffset;                               // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotationOffset;                                    // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          AllowWorldOffsetRotation;                          // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CumulativeSegmentRotationX;                        // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CumulativeSegmentRotationY;                        // 0x004A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CumulativeSegmentRotationZ;                        // 0x004B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMEScaleOffset                        ScaleData;                                         // 0x0050(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMELocalOffsets) == 0x000001, "Wrong alignment on FSMELocalOffsets");
static_assert(sizeof(FSMELocalOffsets) == 0x000070, "Wrong size on FSMELocalOffsets");
static_assert(offsetof(FSMELocalOffsets, LocalLocationOffset) == 0x000000, "Member 'FSMELocalOffsets::LocalLocationOffset' has a wrong offset!");
static_assert(offsetof(FSMELocalOffsets, WorldLocationOffset) == 0x000018, "Member 'FSMELocalOffsets::WorldLocationOffset' has a wrong offset!");
static_assert(offsetof(FSMELocalOffsets, RotationOffset) == 0x000030, "Member 'FSMELocalOffsets::RotationOffset' has a wrong offset!");
static_assert(offsetof(FSMELocalOffsets, AllowWorldOffsetRotation) == 0x000048, "Member 'FSMELocalOffsets::AllowWorldOffsetRotation' has a wrong offset!");
static_assert(offsetof(FSMELocalOffsets, CumulativeSegmentRotationX) == 0x000049, "Member 'FSMELocalOffsets::CumulativeSegmentRotationX' has a wrong offset!");
static_assert(offsetof(FSMELocalOffsets, CumulativeSegmentRotationY) == 0x00004A, "Member 'FSMELocalOffsets::CumulativeSegmentRotationY' has a wrong offset!");
static_assert(offsetof(FSMELocalOffsets, CumulativeSegmentRotationZ) == 0x00004B, "Member 'FSMELocalOffsets::CumulativeSegmentRotationZ' has a wrong offset!");
static_assert(offsetof(FSMELocalOffsets, ScaleData) == 0x000050, "Member 'FSMELocalOffsets::ScaleData' has a wrong offset!");

// ScriptStruct SplineMeshEditor.SMESplineTwistData
// 0x0010 (0x0010 - 0x0000)
struct FSMESplineTwistData final
{
public:
	class UCurveFloat*                            TwistCurve;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SplineTwistDegrees;                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SeamlessTwist;                                     // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SplineRollTwist;                                   // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CumualativeSegmentTwist;                           // 0x000E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMESplineTwistData) == 0x000008, "Wrong alignment on FSMESplineTwistData");
static_assert(sizeof(FSMESplineTwistData) == 0x000010, "Wrong size on FSMESplineTwistData");
static_assert(offsetof(FSMESplineTwistData, TwistCurve) == 0x000000, "Member 'FSMESplineTwistData::TwistCurve' has a wrong offset!");
static_assert(offsetof(FSMESplineTwistData, SplineTwistDegrees) == 0x000008, "Member 'FSMESplineTwistData::SplineTwistDegrees' has a wrong offset!");
static_assert(offsetof(FSMESplineTwistData, SeamlessTwist) == 0x00000C, "Member 'FSMESplineTwistData::SeamlessTwist' has a wrong offset!");
static_assert(offsetof(FSMESplineTwistData, SplineRollTwist) == 0x00000D, "Member 'FSMESplineTwistData::SplineRollTwist' has a wrong offset!");
static_assert(offsetof(FSMESplineTwistData, CumualativeSegmentTwist) == 0x00000E, "Member 'FSMESplineTwistData::CumualativeSegmentTwist' has a wrong offset!");

// ScriptStruct SplineMeshEditor.SMEMeshesData
// 0x00C0 (0x00C0 - 0x0000)
struct FSMEMeshesData final
{
public:
	int32                                         MeshRandomizationSeed;                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseStaticMeshes;                                   // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DeformSegments;                                    // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSMEMeshDistribution                   MeshDistribution;                                  // 0x0010(0x0024)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMELocalOffsets                       Offsets;                                           // 0x0038(0x0070)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSMESplineTwistData                    SplineTwistData;                                   // 0x00A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	ESMECenteredPivotMode                         CenteredPivotCorrection;                           // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ApplyPitchFromSpline;                              // 0x00B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ApplyYawFromSpline;                                // 0x00BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ApplyRollFromSpline;                               // 0x00BB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMEMeshesData) == 0x000008, "Wrong alignment on FSMEMeshesData");
static_assert(sizeof(FSMEMeshesData) == 0x0000C0, "Wrong size on FSMEMeshesData");
static_assert(offsetof(FSMEMeshesData, MeshRandomizationSeed) == 0x000000, "Member 'FSMEMeshesData::MeshRandomizationSeed' has a wrong offset!");
static_assert(offsetof(FSMEMeshesData, UseStaticMeshes) == 0x000004, "Member 'FSMEMeshesData::UseStaticMeshes' has a wrong offset!");
static_assert(offsetof(FSMEMeshesData, DeformSegments) == 0x000005, "Member 'FSMEMeshesData::DeformSegments' has a wrong offset!");
static_assert(offsetof(FSMEMeshesData, Material) == 0x000008, "Member 'FSMEMeshesData::Material' has a wrong offset!");
static_assert(offsetof(FSMEMeshesData, MeshDistribution) == 0x000010, "Member 'FSMEMeshesData::MeshDistribution' has a wrong offset!");
static_assert(offsetof(FSMEMeshesData, Offsets) == 0x000038, "Member 'FSMEMeshesData::Offsets' has a wrong offset!");
static_assert(offsetof(FSMEMeshesData, SplineTwistData) == 0x0000A8, "Member 'FSMEMeshesData::SplineTwistData' has a wrong offset!");
static_assert(offsetof(FSMEMeshesData, CenteredPivotCorrection) == 0x0000B8, "Member 'FSMEMeshesData::CenteredPivotCorrection' has a wrong offset!");
static_assert(offsetof(FSMEMeshesData, ApplyPitchFromSpline) == 0x0000B9, "Member 'FSMEMeshesData::ApplyPitchFromSpline' has a wrong offset!");
static_assert(offsetof(FSMEMeshesData, ApplyYawFromSpline) == 0x0000BA, "Member 'FSMEMeshesData::ApplyYawFromSpline' has a wrong offset!");
static_assert(offsetof(FSMEMeshesData, ApplyRollFromSpline) == 0x0000BB, "Member 'FSMEMeshesData::ApplyRollFromSpline' has a wrong offset!");

// ScriptStruct SplineMeshEditor.SMESegmentOverrides
// 0x0080 (0x0080 - 0x0000)
struct FSMESegmentOverrides final
{
public:
	ESplineMeshAxis                               ForwardAxis;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Mesh;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseDefaultMesh;                                    // 0x0010(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsStaticMesh;                                      // 0x0011(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Deform;                                            // 0x0012(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SegmentLength;                                     // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseDefaultLength;                                  // 0x0018(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESMESegmentOverrideMode                       SegmentOverrideMode;                               // 0x0019(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SegmentIndex;                                      // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StartIntervalIndex;                                // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Interval;                                          // 0x0024(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartOffset;                                       // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndOffset;                                         // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LocationOffset;                                    // 0x0030(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               RotationOffset;                                    // 0x0048(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          AllowSplineRoll;                                   // 0x0060(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMEScaleOverride                      ScaleData;                                         // 0x0064(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          UseCurveScale;                                     // 0x0078(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMESegmentOverrides) == 0x000008, "Wrong alignment on FSMESegmentOverrides");
static_assert(sizeof(FSMESegmentOverrides) == 0x000080, "Wrong size on FSMESegmentOverrides");
static_assert(offsetof(FSMESegmentOverrides, ForwardAxis) == 0x000000, "Member 'FSMESegmentOverrides::ForwardAxis' has a wrong offset!");
static_assert(offsetof(FSMESegmentOverrides, Mesh) == 0x000008, "Member 'FSMESegmentOverrides::Mesh' has a wrong offset!");
static_assert(offsetof(FSMESegmentOverrides, UseDefaultMesh) == 0x000010, "Member 'FSMESegmentOverrides::UseDefaultMesh' has a wrong offset!");
static_assert(offsetof(FSMESegmentOverrides, IsStaticMesh) == 0x000011, "Member 'FSMESegmentOverrides::IsStaticMesh' has a wrong offset!");
static_assert(offsetof(FSMESegmentOverrides, Deform) == 0x000012, "Member 'FSMESegmentOverrides::Deform' has a wrong offset!");
static_assert(offsetof(FSMESegmentOverrides, SegmentLength) == 0x000014, "Member 'FSMESegmentOverrides::SegmentLength' has a wrong offset!");
static_assert(offsetof(FSMESegmentOverrides, UseDefaultLength) == 0x000018, "Member 'FSMESegmentOverrides::UseDefaultLength' has a wrong offset!");
static_assert(offsetof(FSMESegmentOverrides, SegmentOverrideMode) == 0x000019, "Member 'FSMESegmentOverrides::SegmentOverrideMode' has a wrong offset!");
static_assert(offsetof(FSMESegmentOverrides, SegmentIndex) == 0x00001C, "Member 'FSMESegmentOverrides::SegmentIndex' has a wrong offset!");
static_assert(offsetof(FSMESegmentOverrides, StartIntervalIndex) == 0x000020, "Member 'FSMESegmentOverrides::StartIntervalIndex' has a wrong offset!");
static_assert(offsetof(FSMESegmentOverrides, Interval) == 0x000024, "Member 'FSMESegmentOverrides::Interval' has a wrong offset!");
static_assert(offsetof(FSMESegmentOverrides, StartOffset) == 0x000028, "Member 'FSMESegmentOverrides::StartOffset' has a wrong offset!");
static_assert(offsetof(FSMESegmentOverrides, EndOffset) == 0x00002C, "Member 'FSMESegmentOverrides::EndOffset' has a wrong offset!");
static_assert(offsetof(FSMESegmentOverrides, LocationOffset) == 0x000030, "Member 'FSMESegmentOverrides::LocationOffset' has a wrong offset!");
static_assert(offsetof(FSMESegmentOverrides, RotationOffset) == 0x000048, "Member 'FSMESegmentOverrides::RotationOffset' has a wrong offset!");
static_assert(offsetof(FSMESegmentOverrides, AllowSplineRoll) == 0x000060, "Member 'FSMESegmentOverrides::AllowSplineRoll' has a wrong offset!");
static_assert(offsetof(FSMESegmentOverrides, ScaleData) == 0x000064, "Member 'FSMESegmentOverrides::ScaleData' has a wrong offset!");
static_assert(offsetof(FSMESegmentOverrides, UseCurveScale) == 0x000078, "Member 'FSMESegmentOverrides::UseCurveScale' has a wrong offset!");

// ScriptStruct SplineMeshEditor.SMEImperfectGapData
// 0x0010 (0x0010 - 0x0000)
struct FSMEImperfectGapData final
{
public:
	bool                                          EnableGapImperfection;                             // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GapLengthRange;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GapLengthSeed;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AllowNegativeGapLength;                            // 0x000C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMEImperfectGapData) == 0x000004, "Wrong alignment on FSMEImperfectGapData");
static_assert(sizeof(FSMEImperfectGapData) == 0x000010, "Wrong size on FSMEImperfectGapData");
static_assert(offsetof(FSMEImperfectGapData, EnableGapImperfection) == 0x000000, "Member 'FSMEImperfectGapData::EnableGapImperfection' has a wrong offset!");
static_assert(offsetof(FSMEImperfectGapData, GapLengthRange) == 0x000004, "Member 'FSMEImperfectGapData::GapLengthRange' has a wrong offset!");
static_assert(offsetof(FSMEImperfectGapData, GapLengthSeed) == 0x000008, "Member 'FSMEImperfectGapData::GapLengthSeed' has a wrong offset!");
static_assert(offsetof(FSMEImperfectGapData, AllowNegativeGapLength) == 0x00000C, "Member 'FSMEImperfectGapData::AllowNegativeGapLength' has a wrong offset!");

// ScriptStruct SplineMeshEditor.SMEImperfections
// 0x0090 (0x0090 - 0x0000)
struct FSMEImperfections final
{
public:
	bool                                          EnableImperfections;                               // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocationRange;                                     // 0x0008(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             LocationSeeds;                                     // 0x0020(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               RotationRange;                                     // 0x0030(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FIntVector                             RotationSeeds;                                     // 0x0048(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ScaleRange;                                        // 0x0058(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             ScaleSeeds;                                        // 0x0070(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UniformScale;                                      // 0x007C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMEImperfectGapData                   GapImperfectionData;                               // 0x0080(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMEImperfections) == 0x000001, "Wrong alignment on FSMEImperfections");
static_assert(sizeof(FSMEImperfections) == 0x000090, "Wrong size on FSMEImperfections");
static_assert(offsetof(FSMEImperfections, EnableImperfections) == 0x000000, "Member 'FSMEImperfections::EnableImperfections' has a wrong offset!");
static_assert(offsetof(FSMEImperfections, LocationRange) == 0x000008, "Member 'FSMEImperfections::LocationRange' has a wrong offset!");
static_assert(offsetof(FSMEImperfections, LocationSeeds) == 0x000020, "Member 'FSMEImperfections::LocationSeeds' has a wrong offset!");
static_assert(offsetof(FSMEImperfections, RotationRange) == 0x000030, "Member 'FSMEImperfections::RotationRange' has a wrong offset!");
static_assert(offsetof(FSMEImperfections, RotationSeeds) == 0x000048, "Member 'FSMEImperfections::RotationSeeds' has a wrong offset!");
static_assert(offsetof(FSMEImperfections, ScaleRange) == 0x000058, "Member 'FSMEImperfections::ScaleRange' has a wrong offset!");
static_assert(offsetof(FSMEImperfections, ScaleSeeds) == 0x000070, "Member 'FSMEImperfections::ScaleSeeds' has a wrong offset!");
static_assert(offsetof(FSMEImperfections, UniformScale) == 0x00007C, "Member 'FSMEImperfections::UniformScale' has a wrong offset!");
static_assert(offsetof(FSMEImperfections, GapImperfectionData) == 0x000080, "Member 'FSMEImperfections::GapImperfectionData' has a wrong offset!");

// ScriptStruct SplineMeshEditor.SMELayerData
// 0x0180 (0x0180 - 0x0000)
struct FSMELayerData final
{
public:
	TArray<class UStaticMesh*>                    Meshes;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          Visible;                                           // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HiddenInGame;                                      // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESplineMeshAxis                               ForwardAxis;                                       // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMEMeshesData                         MeshesData;                                        // 0x0018(0x00C0)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FSMESegmentOverrides>           SegmentOverrides;                                  // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FSMEImperfections                      Imperfections;                                     // 0x00E8(0x0090)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          CastShadow;                                        // 0x0178(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMELayerData) == 0x000008, "Wrong alignment on FSMELayerData");
static_assert(sizeof(FSMELayerData) == 0x000180, "Wrong size on FSMELayerData");
static_assert(offsetof(FSMELayerData, Meshes) == 0x000000, "Member 'FSMELayerData::Meshes' has a wrong offset!");
static_assert(offsetof(FSMELayerData, Visible) == 0x000010, "Member 'FSMELayerData::Visible' has a wrong offset!");
static_assert(offsetof(FSMELayerData, HiddenInGame) == 0x000011, "Member 'FSMELayerData::HiddenInGame' has a wrong offset!");
static_assert(offsetof(FSMELayerData, ForwardAxis) == 0x000012, "Member 'FSMELayerData::ForwardAxis' has a wrong offset!");
static_assert(offsetof(FSMELayerData, MeshesData) == 0x000018, "Member 'FSMELayerData::MeshesData' has a wrong offset!");
static_assert(offsetof(FSMELayerData, SegmentOverrides) == 0x0000D8, "Member 'FSMELayerData::SegmentOverrides' has a wrong offset!");
static_assert(offsetof(FSMELayerData, Imperfections) == 0x0000E8, "Member 'FSMELayerData::Imperfections' has a wrong offset!");
static_assert(offsetof(FSMELayerData, CastShadow) == 0x000178, "Member 'FSMELayerData::CastShadow' has a wrong offset!");

// ScriptStruct SplineMeshEditor.SMEBranchData
// 0x0040 (0x0040 - 0x0000)
struct FSMEBranchData final
{
public:
	class AActor*                                 Branch;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PositionOnSpline;                                  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Offset;                                            // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMEBranchData) == 0x000008, "Wrong alignment on FSMEBranchData");
static_assert(sizeof(FSMEBranchData) == 0x000040, "Wrong size on FSMEBranchData");
static_assert(offsetof(FSMEBranchData, Branch) == 0x000000, "Member 'FSMEBranchData::Branch' has a wrong offset!");
static_assert(offsetof(FSMEBranchData, PositionOnSpline) == 0x000008, "Member 'FSMEBranchData::PositionOnSpline' has a wrong offset!");
static_assert(offsetof(FSMEBranchData, Offset) == 0x000010, "Member 'FSMEBranchData::Offset' has a wrong offset!");
static_assert(offsetof(FSMEBranchData, Rotation) == 0x000028, "Member 'FSMEBranchData::Rotation' has a wrong offset!");

// ScriptStruct SplineMeshEditor.SMEArcSettings
// 0x0028 (0x0028 - 0x0000)
struct FSMEArcSettings final
{
public:
	bool                                          MakeArc;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumArcPoints;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              CircularRadius;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SyncRadius;                                        // 0x0018(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PointRotationOffset;                               // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DegreesOfArc;                                      // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSMEArcSettings) == 0x000004, "Wrong alignment on FSMEArcSettings");
static_assert(sizeof(FSMEArcSettings) == 0x000028, "Wrong size on FSMEArcSettings");
static_assert(offsetof(FSMEArcSettings, MakeArc) == 0x000000, "Member 'FSMEArcSettings::MakeArc' has a wrong offset!");
static_assert(offsetof(FSMEArcSettings, NumArcPoints) == 0x000004, "Member 'FSMEArcSettings::NumArcPoints' has a wrong offset!");
static_assert(offsetof(FSMEArcSettings, CircularRadius) == 0x000008, "Member 'FSMEArcSettings::CircularRadius' has a wrong offset!");
static_assert(offsetof(FSMEArcSettings, SyncRadius) == 0x000018, "Member 'FSMEArcSettings::SyncRadius' has a wrong offset!");
static_assert(offsetof(FSMEArcSettings, PointRotationOffset) == 0x00001C, "Member 'FSMEArcSettings::PointRotationOffset' has a wrong offset!");
static_assert(offsetof(FSMEArcSettings, DegreesOfArc) == 0x000020, "Member 'FSMEArcSettings::DegreesOfArc' has a wrong offset!");

// ScriptStruct SplineMeshEditor.SMEAngularLimits
// 0x0020 (0x0020 - 0x0000)
struct FSMEAngularLimits final
{
public:
	EAngularConstraintMotion                      Swing1LimitMode;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Swing1LimitAmount;                                 // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAngularConstraintMotion                      Swing2LimitMode;                                   // 0x0008(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Swing2LimitAmount;                                 // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAngularConstraintMotion                      TwistLimitMode;                                    // 0x0010(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TwistLimitAmount;                                  // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularDamping;                                    // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Mass;                                              // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMEAngularLimits) == 0x000004, "Wrong alignment on FSMEAngularLimits");
static_assert(sizeof(FSMEAngularLimits) == 0x000020, "Wrong size on FSMEAngularLimits");
static_assert(offsetof(FSMEAngularLimits, Swing1LimitMode) == 0x000000, "Member 'FSMEAngularLimits::Swing1LimitMode' has a wrong offset!");
static_assert(offsetof(FSMEAngularLimits, Swing1LimitAmount) == 0x000004, "Member 'FSMEAngularLimits::Swing1LimitAmount' has a wrong offset!");
static_assert(offsetof(FSMEAngularLimits, Swing2LimitMode) == 0x000008, "Member 'FSMEAngularLimits::Swing2LimitMode' has a wrong offset!");
static_assert(offsetof(FSMEAngularLimits, Swing2LimitAmount) == 0x00000C, "Member 'FSMEAngularLimits::Swing2LimitAmount' has a wrong offset!");
static_assert(offsetof(FSMEAngularLimits, TwistLimitMode) == 0x000010, "Member 'FSMEAngularLimits::TwistLimitMode' has a wrong offset!");
static_assert(offsetof(FSMEAngularLimits, TwistLimitAmount) == 0x000014, "Member 'FSMEAngularLimits::TwistLimitAmount' has a wrong offset!");
static_assert(offsetof(FSMEAngularLimits, AngularDamping) == 0x000018, "Member 'FSMEAngularLimits::AngularDamping' has a wrong offset!");
static_assert(offsetof(FSMEAngularLimits, Mass) == 0x00001C, "Member 'FSMEAngularLimits::Mass' has a wrong offset!");

// ScriptStruct SplineMeshEditor.SMELinearLimits
// 0x0008 (0x0008 - 0x0000)
struct FSMELinearLimits final
{
public:
	ELinearConstraintMotion                       XMotion;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELinearConstraintMotion                       YMotion;                                           // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELinearConstraintMotion                       ZMotion;                                           // 0x0002(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LimitAmount;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMELinearLimits) == 0x000004, "Wrong alignment on FSMELinearLimits");
static_assert(sizeof(FSMELinearLimits) == 0x000008, "Wrong size on FSMELinearLimits");
static_assert(offsetof(FSMELinearLimits, XMotion) == 0x000000, "Member 'FSMELinearLimits::XMotion' has a wrong offset!");
static_assert(offsetof(FSMELinearLimits, YMotion) == 0x000001, "Member 'FSMELinearLimits::YMotion' has a wrong offset!");
static_assert(offsetof(FSMELinearLimits, ZMotion) == 0x000002, "Member 'FSMELinearLimits::ZMotion' has a wrong offset!");
static_assert(offsetof(FSMELinearLimits, LimitAmount) == 0x000004, "Member 'FSMELinearLimits::LimitAmount' has a wrong offset!");

// ScriptStruct SplineMeshEditor.SMEPhysicData
// 0x002C (0x002C - 0x0000)
struct FSMEPhysicData final
{
public:
	bool                                          SetupPhysicsConnections;                           // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AttachEnd;                                         // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMEAngularLimits                      AngularLimits;                                     // 0x0004(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FSMELinearLimits                       LinearLimits;                                      // 0x0024(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSMEPhysicData) == 0x000001, "Wrong alignment on FSMEPhysicData");
static_assert(sizeof(FSMEPhysicData) == 0x00002C, "Wrong size on FSMEPhysicData");
static_assert(offsetof(FSMEPhysicData, SetupPhysicsConnections) == 0x000000, "Member 'FSMEPhysicData::SetupPhysicsConnections' has a wrong offset!");
static_assert(offsetof(FSMEPhysicData, AttachEnd) == 0x000001, "Member 'FSMEPhysicData::AttachEnd' has a wrong offset!");
static_assert(offsetof(FSMEPhysicData, AngularLimits) == 0x000004, "Member 'FSMEPhysicData::AngularLimits' has a wrong offset!");
static_assert(offsetof(FSMEPhysicData, LinearLimits) == 0x000024, "Member 'FSMEPhysicData::LinearLimits' has a wrong offset!");

}

