#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SprayFog

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct SprayFog.SprayFogLayerData
// 0x0020 (0x0020 - 0x0000)
struct FSprayFogLayerData final
{
public:
	class FName                                   LayerName;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsVisible;                                        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             PersistentTexture;                                 // 0x0010(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSprayFogLayerData) == 0x000008, "Wrong alignment on FSprayFogLayerData");
static_assert(sizeof(FSprayFogLayerData) == 0x000020, "Wrong size on FSprayFogLayerData");
static_assert(offsetof(FSprayFogLayerData, LayerName) == 0x000000, "Member 'FSprayFogLayerData::LayerName' has a wrong offset!");
static_assert(offsetof(FSprayFogLayerData, bIsVisible) == 0x000008, "Member 'FSprayFogLayerData::bIsVisible' has a wrong offset!");
static_assert(offsetof(FSprayFogLayerData, PersistentTexture) == 0x000010, "Member 'FSprayFogLayerData::PersistentTexture' has a wrong offset!");
static_assert(offsetof(FSprayFogLayerData, RenderTarget) == 0x000018, "Member 'FSprayFogLayerData::RenderTarget' has a wrong offset!");

}

