#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StandinActor

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "StandinActor_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class StandinActor.StandInMeshActor
// 0x0008 (0x02D0 - 0x02C8)
class AStandInMeshActor final : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x02C8(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StandInMeshActor">();
	}
	static class AStandInMeshActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AStandInMeshActor>();
	}
};
static_assert(alignof(AStandInMeshActor) == 0x000008, "Wrong alignment on AStandInMeshActor");
static_assert(sizeof(AStandInMeshActor) == 0x0002D0, "Wrong size on AStandInMeshActor");
static_assert(offsetof(AStandInMeshActor, StaticMeshComponent) == 0x0002C8, "Member 'AStandInMeshActor::StaticMeshComponent' has a wrong offset!");

// Class StandinActor.StandinProxyContainer
// 0x0010 (0x0038 - 0x0028)
class UStandinProxyContainer final : public UObject
{
public:
	TArray<struct FStandinProxyEntry>             Standins;                                          // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StandinProxyContainer">();
	}
	static class UStandinProxyContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStandinProxyContainer>();
	}
};
static_assert(alignof(UStandinProxyContainer) == 0x000008, "Wrong alignment on UStandinProxyContainer");
static_assert(sizeof(UStandinProxyContainer) == 0x000038, "Wrong size on UStandinProxyContainer");
static_assert(offsetof(UStandinProxyContainer, Standins) == 0x000028, "Member 'UStandinProxyContainer::Standins' has a wrong offset!");

}

