#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StreamlineRHI

#include "Basic.hpp"

#include "StreamlineRHI_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class StreamlineRHI.StreamlineOverrideSettings
// 0x0008 (0x0030 - 0x0028)
class UStreamlineOverrideSettings final : public UObject
{
public:
	EStreamlineSettingOverride                    LoadDebugOverlayOverride;                          // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStreamlineSettingOverride                    AllowOTAUpdateOverride;                            // 0x0029(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStreamlineSettingOverride                    EnableDLSSFGInPlayInEditorViewportsOverride;       // 0x002A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStreamlineSettingOverride                    UseSlSetTagOverride;                               // 0x002B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StreamlineOverrideSettings">();
	}
	static class UStreamlineOverrideSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStreamlineOverrideSettings>();
	}
};
static_assert(alignof(UStreamlineOverrideSettings) == 0x000008, "Wrong alignment on UStreamlineOverrideSettings");
static_assert(sizeof(UStreamlineOverrideSettings) == 0x000030, "Wrong size on UStreamlineOverrideSettings");
static_assert(offsetof(UStreamlineOverrideSettings, LoadDebugOverlayOverride) == 0x000028, "Member 'UStreamlineOverrideSettings::LoadDebugOverlayOverride' has a wrong offset!");
static_assert(offsetof(UStreamlineOverrideSettings, AllowOTAUpdateOverride) == 0x000029, "Member 'UStreamlineOverrideSettings::AllowOTAUpdateOverride' has a wrong offset!");
static_assert(offsetof(UStreamlineOverrideSettings, EnableDLSSFGInPlayInEditorViewportsOverride) == 0x00002A, "Member 'UStreamlineOverrideSettings::EnableDLSSFGInPlayInEditorViewportsOverride' has a wrong offset!");
static_assert(offsetof(UStreamlineOverrideSettings, UseSlSetTagOverride) == 0x00002B, "Member 'UStreamlineOverrideSettings::UseSlSetTagOverride' has a wrong offset!");

// Class StreamlineRHI.StreamlineSettings
// 0x0010 (0x0038 - 0x0028)
class UStreamlineSettings final : public UObject
{
public:
	bool                                          bLoadDebugOverlay;                                 // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowOTAUpdate;                                   // 0x0029(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NVIDIANGXApplicationId;                            // 0x002C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableStreamlineD3D12;                            // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableStreamlineD3D11;                            // 0x0031(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableDLSSFGInPlayInEditorViewports;              // 0x0032(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSlSetTag;                                      // 0x0033(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StreamlineSettings">();
	}
	static class UStreamlineSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStreamlineSettings>();
	}
};
static_assert(alignof(UStreamlineSettings) == 0x000008, "Wrong alignment on UStreamlineSettings");
static_assert(sizeof(UStreamlineSettings) == 0x000038, "Wrong size on UStreamlineSettings");
static_assert(offsetof(UStreamlineSettings, bLoadDebugOverlay) == 0x000028, "Member 'UStreamlineSettings::bLoadDebugOverlay' has a wrong offset!");
static_assert(offsetof(UStreamlineSettings, bAllowOTAUpdate) == 0x000029, "Member 'UStreamlineSettings::bAllowOTAUpdate' has a wrong offset!");
static_assert(offsetof(UStreamlineSettings, NVIDIANGXApplicationId) == 0x00002C, "Member 'UStreamlineSettings::NVIDIANGXApplicationId' has a wrong offset!");
static_assert(offsetof(UStreamlineSettings, bEnableStreamlineD3D12) == 0x000030, "Member 'UStreamlineSettings::bEnableStreamlineD3D12' has a wrong offset!");
static_assert(offsetof(UStreamlineSettings, bEnableStreamlineD3D11) == 0x000031, "Member 'UStreamlineSettings::bEnableStreamlineD3D11' has a wrong offset!");
static_assert(offsetof(UStreamlineSettings, bEnableDLSSFGInPlayInEditorViewports) == 0x000032, "Member 'UStreamlineSettings::bEnableDLSSFGInPlayInEditorViewports' has a wrong offset!");
static_assert(offsetof(UStreamlineSettings, bUseSlSetTag) == 0x000033, "Member 'UStreamlineSettings::bUseSlSetTag' has a wrong offset!");

}

