#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_Occlusion_Volume

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UDS_OcclusionShape_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UDS_Occlusion_Volume.UDS_Occlusion_Volume_C
// 0x39BD9538 (0x39BD9800 - 0x02C8)
class alignas(0x39BD9800) AUDS_Occlusion_Volume_C final : public AActor
{
public:
	class UBillboardComponent*                    Billboard;                                         // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EUDS_OcclusionShape                           Collision_Shape;                                   // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Box_Extent;                                        // 0x02D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Sphere_Radius;                                     // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Affect_Occlusion_on_Ultra_Dynamic_Sky;             // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Affect_Occlusion_on_Ultra_Dynamic_Weather;         // 0x02F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Block_Weather_Particles;                           // 0x02FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2FB[0x5];                                      // 0x02FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    Collision_Component;                               // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Capsule_Half_Height;                               // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Get_Occlusion_Result(bool Weather, bool* Occluded);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UDS_Occlusion_Volume_C">();
	}
	static class AUDS_Occlusion_Volume_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUDS_Occlusion_Volume_C>();
	}
};
static_assert(alignof(AUDS_Occlusion_Volume_C) == 0x39BD9800, "Wrong alignment on AUDS_Occlusion_Volume_C");
static_assert(sizeof(AUDS_Occlusion_Volume_C) == 0x39BD9800, "Wrong size on AUDS_Occlusion_Volume_C");
static_assert(offsetof(AUDS_Occlusion_Volume_C, Billboard) == 0x0002C8, "Member 'AUDS_Occlusion_Volume_C::Billboard' has a wrong offset!");
static_assert(offsetof(AUDS_Occlusion_Volume_C, Collision_Shape) == 0x0002D0, "Member 'AUDS_Occlusion_Volume_C::Collision_Shape' has a wrong offset!");
static_assert(offsetof(AUDS_Occlusion_Volume_C, Box_Extent) == 0x0002D8, "Member 'AUDS_Occlusion_Volume_C::Box_Extent' has a wrong offset!");
static_assert(offsetof(AUDS_Occlusion_Volume_C, Sphere_Radius) == 0x0002F0, "Member 'AUDS_Occlusion_Volume_C::Sphere_Radius' has a wrong offset!");
static_assert(offsetof(AUDS_Occlusion_Volume_C, Affect_Occlusion_on_Ultra_Dynamic_Sky) == 0x0002F8, "Member 'AUDS_Occlusion_Volume_C::Affect_Occlusion_on_Ultra_Dynamic_Sky' has a wrong offset!");
static_assert(offsetof(AUDS_Occlusion_Volume_C, Affect_Occlusion_on_Ultra_Dynamic_Weather) == 0x0002F9, "Member 'AUDS_Occlusion_Volume_C::Affect_Occlusion_on_Ultra_Dynamic_Weather' has a wrong offset!");
static_assert(offsetof(AUDS_Occlusion_Volume_C, Block_Weather_Particles) == 0x0002FA, "Member 'AUDS_Occlusion_Volume_C::Block_Weather_Particles' has a wrong offset!");
static_assert(offsetof(AUDS_Occlusion_Volume_C, Collision_Component) == 0x000300, "Member 'AUDS_Occlusion_Volume_C::Collision_Component' has a wrong offset!");
static_assert(offsetof(AUDS_Occlusion_Volume_C, Capsule_Half_Height) == 0x000308, "Member 'AUDS_Occlusion_Volume_C::Capsule_Half_Height' has a wrong offset!");

}

