#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Common_Popup

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UI_Common_Popup.UI_Common_Popup_C.BP_CloseAnim
// 0x0010 (0x0010 - 0x0000)
struct UI_Common_Popup_C_BP_CloseAnim final
{
public:
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(UI_Common_Popup_C_BP_CloseAnim) == 0x000001, "Wrong alignment on UI_Common_Popup_C_BP_CloseAnim");
static_assert(sizeof(UI_Common_Popup_C_BP_CloseAnim) == 0x000010, "Wrong size on UI_Common_Popup_C_BP_CloseAnim");
static_assert(offsetof(UI_Common_Popup_C_BP_CloseAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'UI_Common_Popup_C_BP_CloseAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function UI_Common_Popup.UI_Common_Popup_C.ExecuteUbergraph_UI_Common_Popup
// 0x0010 (0x0010 - 0x0000)
struct UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup) == 0x000004, "Wrong alignment on UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup");
static_assert(sizeof(UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup) == 0x000010, "Wrong size on UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup");
static_assert(offsetof(UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup, EntryPoint) == 0x000000, "Member 'UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup, Temp_bool_Variable) == 0x000004, "Member 'UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup, Temp_byte_Variable) == 0x000005, "Member 'UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup, Temp_byte_Variable_1) == 0x000006, "Member 'UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup, Temp_bool_Variable_1) == 0x000007, "Member 'UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup, Temp_byte_Variable_2) == 0x000008, "Member 'UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup, Temp_byte_Variable_3) == 0x000009, "Member 'UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup, K2Node_Event_IsDesignTime) == 0x00000A, "Member 'UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup, K2Node_Select_Default) == 0x00000B, "Member 'UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup, K2Node_Select_Default_1) == 0x00000C, "Member 'UI_Common_Popup_C_ExecuteUbergraph_UI_Common_Popup::K2Node_Select_Default_1' has a wrong offset!");

// Function UI_Common_Popup.UI_Common_Popup_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_Common_Popup_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Common_Popup_C_PreConstruct) == 0x000001, "Wrong alignment on UI_Common_Popup_C_PreConstruct");
static_assert(sizeof(UI_Common_Popup_C_PreConstruct) == 0x000001, "Wrong size on UI_Common_Popup_C_PreConstruct");
static_assert(offsetof(UI_Common_Popup_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_Common_Popup_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

