#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Common_Popup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Common_Popup.UI_Common_Popup_C
// 0x159DE128 (0x159DF000 - 0x0ED8)
class alignas(0x159DF000) UUI_Common_Popup_C final : public UHTUI_PopupWindow_Base
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0ED8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock;                                         // 0x0EE0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Glow_02;                                     // 0x0EE8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Glow_01;                                     // 0x0EF0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Bg_OutLine;                                  // 0x0EF8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Bg_95;                                       // 0x0F00(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Bg;                                          // 0x0F08(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_84;                                          // 0x0F10(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0F18(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   PopupTitle;                                        // 0x0F20(0x0010)(Edit, BlueprintVisible)
	bool                                          PopupTitle_Visible;                                // 0x0F30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Close_Button;                                  // 0x0F31(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_CloseAnim();
	void Construct();
	void ExecuteUbergraph_UI_Common_Popup(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Common_Popup_C">();
	}
	static class UUI_Common_Popup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Common_Popup_C>();
	}
};
static_assert(alignof(UUI_Common_Popup_C) == 0x159DF000, "Wrong alignment on UUI_Common_Popup_C");
static_assert(sizeof(UUI_Common_Popup_C) == 0x159DF000, "Wrong size on UUI_Common_Popup_C");
static_assert(offsetof(UUI_Common_Popup_C, UberGraphFrame) == 0x000ED8, "Member 'UUI_Common_Popup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Common_Popup_C, TextBlock) == 0x000EE0, "Member 'UUI_Common_Popup_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UUI_Common_Popup_C, Image_Glow_02) == 0x000EE8, "Member 'UUI_Common_Popup_C::Image_Glow_02' has a wrong offset!");
static_assert(offsetof(UUI_Common_Popup_C, Image_Glow_01) == 0x000EF0, "Member 'UUI_Common_Popup_C::Image_Glow_01' has a wrong offset!");
static_assert(offsetof(UUI_Common_Popup_C, Image_Bg_OutLine) == 0x000EF8, "Member 'UUI_Common_Popup_C::Image_Bg_OutLine' has a wrong offset!");
static_assert(offsetof(UUI_Common_Popup_C, Image_Bg_95) == 0x000F00, "Member 'UUI_Common_Popup_C::Image_Bg_95' has a wrong offset!");
static_assert(offsetof(UUI_Common_Popup_C, Image_Bg) == 0x000F08, "Member 'UUI_Common_Popup_C::Image_Bg' has a wrong offset!");
static_assert(offsetof(UUI_Common_Popup_C, Image_84) == 0x000F10, "Member 'UUI_Common_Popup_C::Image_84' has a wrong offset!");
static_assert(offsetof(UUI_Common_Popup_C, Image) == 0x000F18, "Member 'UUI_Common_Popup_C::Image' has a wrong offset!");
static_assert(offsetof(UUI_Common_Popup_C, PopupTitle) == 0x000F20, "Member 'UUI_Common_Popup_C::PopupTitle' has a wrong offset!");
static_assert(offsetof(UUI_Common_Popup_C, PopupTitle_Visible) == 0x000F30, "Member 'UUI_Common_Popup_C::PopupTitle_Visible' has a wrong offset!");
static_assert(offsetof(UUI_Common_Popup_C, Use_Close_Button) == 0x000F31, "Member 'UUI_Common_Popup_C::Use_Close_Button' has a wrong offset!");

}

