#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIExtension

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum UIExtension.EUIExtensionAction
// NumValues: 0x0003
enum class EUIExtensionAction : uint8
{
	Added                                    = 0,
	Removed                                  = 1,
	EUIExtensionAction_MAX                   = 2,
};

// Enum UIExtension.EUIExtensionPointMatch
// NumValues: 0x0003
enum class EUIExtensionPointMatch : uint8
{
	ExactMatch                               = 0,
	PartialMatch                             = 1,
	EUIExtensionPointMatch_MAX               = 2,
};

// ScriptStruct UIExtension.UIExtensionPointHandle
// 0x0018 (0x0018 - 0x0000)
struct FUIExtensionPointHandle final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FUIExtensionPointHandle) == 0x000001, "Wrong alignment on FUIExtensionPointHandle");
static_assert(sizeof(FUIExtensionPointHandle) == 0x000018, "Wrong size on FUIExtensionPointHandle");

// ScriptStruct UIExtension.UIExtensionHandle
// 0x0018 (0x0018 - 0x0000)
struct FUIExtensionHandle final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FUIExtensionHandle) == 0x000001, "Wrong alignment on FUIExtensionHandle");
static_assert(sizeof(FUIExtensionHandle) == 0x000018, "Wrong size on FUIExtensionHandle");

// ScriptStruct UIExtension.UIExtensionRequest
// 0x0080 (0x0080 - 0x0000)
struct FUIExtensionRequest final
{
public:
	struct FUIExtensionHandle                     ExtensionHandle;                                   // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ExtensionPointTag;                                 // 0x0018(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Data;                                              // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInstancedStruct                       ExtraData;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SoftObj;                                           // 0x0040(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextObject;                                     // 0x0060(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasCallback;                                       // 0x0068(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x17];                                      // 0x0069(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FUIExtensionRequest) == 0x000008, "Wrong alignment on FUIExtensionRequest");
static_assert(sizeof(FUIExtensionRequest) == 0x000080, "Wrong size on FUIExtensionRequest");
static_assert(offsetof(FUIExtensionRequest, ExtensionHandle) == 0x000000, "Member 'FUIExtensionRequest::ExtensionHandle' has a wrong offset!");
static_assert(offsetof(FUIExtensionRequest, ExtensionPointTag) == 0x000018, "Member 'FUIExtensionRequest::ExtensionPointTag' has a wrong offset!");
static_assert(offsetof(FUIExtensionRequest, Priority) == 0x000020, "Member 'FUIExtensionRequest::Priority' has a wrong offset!");
static_assert(offsetof(FUIExtensionRequest, Data) == 0x000028, "Member 'FUIExtensionRequest::Data' has a wrong offset!");
static_assert(offsetof(FUIExtensionRequest, ExtraData) == 0x000030, "Member 'FUIExtensionRequest::ExtraData' has a wrong offset!");
static_assert(offsetof(FUIExtensionRequest, SoftObj) == 0x000040, "Member 'FUIExtensionRequest::SoftObj' has a wrong offset!");
static_assert(offsetof(FUIExtensionRequest, ContextObject) == 0x000060, "Member 'FUIExtensionRequest::ContextObject' has a wrong offset!");
static_assert(offsetof(FUIExtensionRequest, HasCallback) == 0x000068, "Member 'FUIExtensionRequest::HasCallback' has a wrong offset!");

// ScriptStruct UIExtension.UIExtensionExtraBase
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FUIExtensionExtraBase
{
};
#pragma pack(pop)
static_assert(alignof(FUIExtensionExtraBase) == 0x000001, "Wrong alignment on FUIExtensionExtraBase");
static_assert(sizeof(FUIExtensionExtraBase) == 0x000001, "Wrong size on FUIExtensionExtraBase");

// ScriptStruct UIExtension.UIExtensionExtraCommon
// 0x0008 (0x0008 - 0x0000)
struct FUIExtensionExtraCommon final : public FUIExtensionExtraBase
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FUIExtensionExtraCommon) == 0x000004, "Wrong alignment on FUIExtensionExtraCommon");
static_assert(sizeof(FUIExtensionExtraCommon) == 0x000008, "Wrong size on FUIExtensionExtraCommon");
static_assert(offsetof(FUIExtensionExtraCommon, ID) == 0x000000, "Member 'FUIExtensionExtraCommon::ID' has a wrong offset!");

}

