#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UINavigation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "UINavigation_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UINavigation.NavigationWidgetBase.ContainsAnyTagByDefaultTags
// 0x0058 (0x0058 - 0x0000)
struct NavigationWidgetBase_ContainsAnyTagByDefaultTags final
{
public:
	TSet<class FName>                             SubTags;                                           // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NavigationWidgetBase_ContainsAnyTagByDefaultTags) == 0x000008, "Wrong alignment on NavigationWidgetBase_ContainsAnyTagByDefaultTags");
static_assert(sizeof(NavigationWidgetBase_ContainsAnyTagByDefaultTags) == 0x000058, "Wrong size on NavigationWidgetBase_ContainsAnyTagByDefaultTags");
static_assert(offsetof(NavigationWidgetBase_ContainsAnyTagByDefaultTags, SubTags) == 0x000000, "Member 'NavigationWidgetBase_ContainsAnyTagByDefaultTags::SubTags' has a wrong offset!");
static_assert(offsetof(NavigationWidgetBase_ContainsAnyTagByDefaultTags, ReturnValue) == 0x000050, "Member 'NavigationWidgetBase_ContainsAnyTagByDefaultTags::ReturnValue' has a wrong offset!");

// Function UINavigation.NavigationWidgetBase.ContainsTag
// 0x0014 (0x0014 - 0x0000)
struct NavigationWidgetBase_ContainsTag final
{
public:
	class FName                                   MainTag;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SubTag;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NavigationWidgetBase_ContainsTag) == 0x000004, "Wrong alignment on NavigationWidgetBase_ContainsTag");
static_assert(sizeof(NavigationWidgetBase_ContainsTag) == 0x000014, "Wrong size on NavigationWidgetBase_ContainsTag");
static_assert(offsetof(NavigationWidgetBase_ContainsTag, MainTag) == 0x000000, "Member 'NavigationWidgetBase_ContainsTag::MainTag' has a wrong offset!");
static_assert(offsetof(NavigationWidgetBase_ContainsTag, SubTag) == 0x000008, "Member 'NavigationWidgetBase_ContainsTag::SubTag' has a wrong offset!");
static_assert(offsetof(NavigationWidgetBase_ContainsTag, ReturnValue) == 0x000010, "Member 'NavigationWidgetBase_ContainsTag::ReturnValue' has a wrong offset!");

// Function UINavigation.NavigationWidgetBase.ContainsTagByDefaultTag
// 0x000C (0x000C - 0x0000)
struct NavigationWidgetBase_ContainsTagByDefaultTag final
{
public:
	class FName                                   SubTag;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NavigationWidgetBase_ContainsTagByDefaultTag) == 0x000004, "Wrong alignment on NavigationWidgetBase_ContainsTagByDefaultTag");
static_assert(sizeof(NavigationWidgetBase_ContainsTagByDefaultTag) == 0x00000C, "Wrong size on NavigationWidgetBase_ContainsTagByDefaultTag");
static_assert(offsetof(NavigationWidgetBase_ContainsTagByDefaultTag, SubTag) == 0x000000, "Member 'NavigationWidgetBase_ContainsTagByDefaultTag::SubTag' has a wrong offset!");
static_assert(offsetof(NavigationWidgetBase_ContainsTagByDefaultTag, ReturnValue) == 0x000008, "Member 'NavigationWidgetBase_ContainsTagByDefaultTag::ReturnValue' has a wrong offset!");

// Function UINavigation.NavigationWidgetBase.ContainsTagByNavigationTag
// 0x000C (0x000C - 0x0000)
struct NavigationWidgetBase_ContainsTagByNavigationTag final
{
public:
	class FName                                   SubTag;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NavigationWidgetBase_ContainsTagByNavigationTag) == 0x000004, "Wrong alignment on NavigationWidgetBase_ContainsTagByNavigationTag");
static_assert(sizeof(NavigationWidgetBase_ContainsTagByNavigationTag) == 0x00000C, "Wrong size on NavigationWidgetBase_ContainsTagByNavigationTag");
static_assert(offsetof(NavigationWidgetBase_ContainsTagByNavigationTag, SubTag) == 0x000000, "Member 'NavigationWidgetBase_ContainsTagByNavigationTag::SubTag' has a wrong offset!");
static_assert(offsetof(NavigationWidgetBase_ContainsTagByNavigationTag, ReturnValue) == 0x000008, "Member 'NavigationWidgetBase_ContainsTagByNavigationTag::ReturnValue' has a wrong offset!");

// Function UINavigation.NavigationWidgetBase.ContainsTags
// 0x0060 (0x0060 - 0x0000)
struct NavigationWidgetBase_ContainsTags final
{
public:
	class FName                                   MainTag;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             SubTags;                                           // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NavigationWidgetBase_ContainsTags) == 0x000008, "Wrong alignment on NavigationWidgetBase_ContainsTags");
static_assert(sizeof(NavigationWidgetBase_ContainsTags) == 0x000060, "Wrong size on NavigationWidgetBase_ContainsTags");
static_assert(offsetof(NavigationWidgetBase_ContainsTags, MainTag) == 0x000000, "Member 'NavigationWidgetBase_ContainsTags::MainTag' has a wrong offset!");
static_assert(offsetof(NavigationWidgetBase_ContainsTags, SubTags) == 0x000008, "Member 'NavigationWidgetBase_ContainsTags::SubTags' has a wrong offset!");
static_assert(offsetof(NavigationWidgetBase_ContainsTags, ReturnValue) == 0x000058, "Member 'NavigationWidgetBase_ContainsTags::ReturnValue' has a wrong offset!");

// Function UINavigation.NavigationWidgetBase.GetAbsolutePosition
// 0x0010 (0x0010 - 0x0000)
struct NavigationWidgetBase_GetAbsolutePosition final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NavigationWidgetBase_GetAbsolutePosition) == 0x000001, "Wrong alignment on NavigationWidgetBase_GetAbsolutePosition");
static_assert(sizeof(NavigationWidgetBase_GetAbsolutePosition) == 0x000010, "Wrong size on NavigationWidgetBase_GetAbsolutePosition");
static_assert(offsetof(NavigationWidgetBase_GetAbsolutePosition, ReturnValue) == 0x000000, "Member 'NavigationWidgetBase_GetAbsolutePosition::ReturnValue' has a wrong offset!");

// Function UINavigation.NavigationWidgetBase.GetDrawSize
// 0x0010 (0x0010 - 0x0000)
struct NavigationWidgetBase_GetDrawSize final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NavigationWidgetBase_GetDrawSize) == 0x000001, "Wrong alignment on NavigationWidgetBase_GetDrawSize");
static_assert(sizeof(NavigationWidgetBase_GetDrawSize) == 0x000010, "Wrong size on NavigationWidgetBase_GetDrawSize");
static_assert(offsetof(NavigationWidgetBase_GetDrawSize, ReturnValue) == 0x000000, "Member 'NavigationWidgetBase_GetDrawSize::ReturnValue' has a wrong offset!");

// Function UINavigation.NavigationWidgetBase.GetLocalSize
// 0x0010 (0x0010 - 0x0000)
struct NavigationWidgetBase_GetLocalSize final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NavigationWidgetBase_GetLocalSize) == 0x000001, "Wrong alignment on NavigationWidgetBase_GetLocalSize");
static_assert(sizeof(NavigationWidgetBase_GetLocalSize) == 0x000010, "Wrong size on NavigationWidgetBase_GetLocalSize");
static_assert(offsetof(NavigationWidgetBase_GetLocalSize, ReturnValue) == 0x000000, "Member 'NavigationWidgetBase_GetLocalSize::ReturnValue' has a wrong offset!");

// Function UINavigation.NavigationWidgetBase.GetTouchPosition
// 0x0010 (0x0010 - 0x0000)
struct NavigationWidgetBase_GetTouchPosition final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NavigationWidgetBase_GetTouchPosition) == 0x000001, "Wrong alignment on NavigationWidgetBase_GetTouchPosition");
static_assert(sizeof(NavigationWidgetBase_GetTouchPosition) == 0x000010, "Wrong size on NavigationWidgetBase_GetTouchPosition");
static_assert(offsetof(NavigationWidgetBase_GetTouchPosition, ReturnValue) == 0x000000, "Member 'NavigationWidgetBase_GetTouchPosition::ReturnValue' has a wrong offset!");

// Function UINavigation.NavigationWidgetBase.GetWidgetCenterPosition
// 0x0018 (0x0018 - 0x0000)
struct NavigationWidgetBase_GetWidgetCenterPosition final
{
public:
	const class UWidget*                          InWidget;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NavigationWidgetBase_GetWidgetCenterPosition) == 0x000008, "Wrong alignment on NavigationWidgetBase_GetWidgetCenterPosition");
static_assert(sizeof(NavigationWidgetBase_GetWidgetCenterPosition) == 0x000018, "Wrong size on NavigationWidgetBase_GetWidgetCenterPosition");
static_assert(offsetof(NavigationWidgetBase_GetWidgetCenterPosition, InWidget) == 0x000000, "Member 'NavigationWidgetBase_GetWidgetCenterPosition::InWidget' has a wrong offset!");
static_assert(offsetof(NavigationWidgetBase_GetWidgetCenterPosition, ReturnValue) == 0x000008, "Member 'NavigationWidgetBase_GetWidgetCenterPosition::ReturnValue' has a wrong offset!");

// Function UINavigation.NavigationWidgetBase.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct NavigationWidgetBase_IsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NavigationWidgetBase_IsEnabled) == 0x000001, "Wrong alignment on NavigationWidgetBase_IsEnabled");
static_assert(sizeof(NavigationWidgetBase_IsEnabled) == 0x000001, "Wrong size on NavigationWidgetBase_IsEnabled");
static_assert(offsetof(NavigationWidgetBase_IsEnabled, ReturnValue) == 0x000000, "Member 'NavigationWidgetBase_IsEnabled::ReturnValue' has a wrong offset!");

// Function UINavigation.NavigationWidgetBase.IsVisibleRecursive
// 0x0001 (0x0001 - 0x0000)
struct NavigationWidgetBase_IsVisibleRecursive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NavigationWidgetBase_IsVisibleRecursive) == 0x000001, "Wrong alignment on NavigationWidgetBase_IsVisibleRecursive");
static_assert(sizeof(NavigationWidgetBase_IsVisibleRecursive) == 0x000001, "Wrong size on NavigationWidgetBase_IsVisibleRecursive");
static_assert(offsetof(NavigationWidgetBase_IsVisibleRecursive, ReturnValue) == 0x000000, "Member 'NavigationWidgetBase_IsVisibleRecursive::ReturnValue' has a wrong offset!");

// Function UINavigation.NavigationWidgetBase.IsWidgetReachable
// 0x0010 (0x0010 - 0x0000)
struct NavigationWidgetBase_IsWidgetReachable final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NavigationWidgetBase_IsWidgetReachable) == 0x000008, "Wrong alignment on NavigationWidgetBase_IsWidgetReachable");
static_assert(sizeof(NavigationWidgetBase_IsWidgetReachable) == 0x000010, "Wrong size on NavigationWidgetBase_IsWidgetReachable");
static_assert(offsetof(NavigationWidgetBase_IsWidgetReachable, InWidget) == 0x000000, "Member 'NavigationWidgetBase_IsWidgetReachable::InWidget' has a wrong offset!");
static_assert(offsetof(NavigationWidgetBase_IsWidgetReachable, ReturnValue) == 0x000008, "Member 'NavigationWidgetBase_IsWidgetReachable::ReturnValue' has a wrong offset!");

// Function UINavigation.NavigationWidgetBase.GetOwnerViewportWidget
// 0x0008 (0x0008 - 0x0000)
struct NavigationWidgetBase_GetOwnerViewportWidget final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NavigationWidgetBase_GetOwnerViewportWidget) == 0x000008, "Wrong alignment on NavigationWidgetBase_GetOwnerViewportWidget");
static_assert(sizeof(NavigationWidgetBase_GetOwnerViewportWidget) == 0x000008, "Wrong size on NavigationWidgetBase_GetOwnerViewportWidget");
static_assert(offsetof(NavigationWidgetBase_GetOwnerViewportWidget, ReturnValue) == 0x000000, "Member 'NavigationWidgetBase_GetOwnerViewportWidget::ReturnValue' has a wrong offset!");

// Function UINavigation.NavigationWidgetBase.GetWidgetGeneratedUserWidget
// 0x0010 (0x0010 - 0x0000)
struct NavigationWidgetBase_GetWidgetGeneratedUserWidget final
{
public:
	const class UWidget*                          InWidget;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NavigationWidgetBase_GetWidgetGeneratedUserWidget) == 0x000008, "Wrong alignment on NavigationWidgetBase_GetWidgetGeneratedUserWidget");
static_assert(sizeof(NavigationWidgetBase_GetWidgetGeneratedUserWidget) == 0x000010, "Wrong size on NavigationWidgetBase_GetWidgetGeneratedUserWidget");
static_assert(offsetof(NavigationWidgetBase_GetWidgetGeneratedUserWidget, InWidget) == 0x000000, "Member 'NavigationWidgetBase_GetWidgetGeneratedUserWidget::InWidget' has a wrong offset!");
static_assert(offsetof(NavigationWidgetBase_GetWidgetGeneratedUserWidget, ReturnValue) == 0x000008, "Member 'NavigationWidgetBase_GetWidgetGeneratedUserWidget::ReturnValue' has a wrong offset!");

// Function UINavigation.CategorySwitcherWidget.SelectCategory
// 0x0004 (0x0004 - 0x0000)
struct CategorySwitcherWidget_SelectCategory final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CategorySwitcherWidget_SelectCategory) == 0x000004, "Wrong alignment on CategorySwitcherWidget_SelectCategory");
static_assert(sizeof(CategorySwitcherWidget_SelectCategory) == 0x000004, "Wrong size on CategorySwitcherWidget_SelectCategory");
static_assert(offsetof(CategorySwitcherWidget_SelectCategory, Index_0) == 0x000000, "Member 'CategorySwitcherWidget_SelectCategory::Index_0' has a wrong offset!");

// Function UINavigation.CategorySwitcherWidget.SelectCategoryFromKey
// 0x0020 (0x0020 - 0x0000)
struct CategorySwitcherWidget_SelectCategoryFromKey final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CategorySwitcherWidget_SelectCategoryFromKey) == 0x000001, "Wrong alignment on CategorySwitcherWidget_SelectCategoryFromKey");
static_assert(sizeof(CategorySwitcherWidget_SelectCategoryFromKey) == 0x000020, "Wrong size on CategorySwitcherWidget_SelectCategoryFromKey");
static_assert(offsetof(CategorySwitcherWidget_SelectCategoryFromKey, Key) == 0x000000, "Member 'CategorySwitcherWidget_SelectCategoryFromKey::Key' has a wrong offset!");
static_assert(offsetof(CategorySwitcherWidget_SelectCategoryFromKey, InputEvent) == 0x000018, "Member 'CategorySwitcherWidget_SelectCategoryFromKey::InputEvent' has a wrong offset!");
static_assert(offsetof(CategorySwitcherWidget_SelectCategoryFromKey, ReturnValue) == 0x000019, "Member 'CategorySwitcherWidget_SelectCategoryFromKey::ReturnValue' has a wrong offset!");

// Function UINavigation.CategorySwitcherWidget.SetActivateCategoryIndex
// 0x0004 (0x0004 - 0x0000)
struct CategorySwitcherWidget_SetActivateCategoryIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CategorySwitcherWidget_SetActivateCategoryIndex) == 0x000004, "Wrong alignment on CategorySwitcherWidget_SetActivateCategoryIndex");
static_assert(sizeof(CategorySwitcherWidget_SetActivateCategoryIndex) == 0x000004, "Wrong size on CategorySwitcherWidget_SetActivateCategoryIndex");
static_assert(offsetof(CategorySwitcherWidget_SetActivateCategoryIndex, Index_0) == 0x000000, "Member 'CategorySwitcherWidget_SetActivateCategoryIndex::Index_0' has a wrong offset!");

// Function UINavigation.CategorySwitcherWidget.GetActivatedCategoryIndex
// 0x0004 (0x0004 - 0x0000)
struct CategorySwitcherWidget_GetActivatedCategoryIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CategorySwitcherWidget_GetActivatedCategoryIndex) == 0x000004, "Wrong alignment on CategorySwitcherWidget_GetActivatedCategoryIndex");
static_assert(sizeof(CategorySwitcherWidget_GetActivatedCategoryIndex) == 0x000004, "Wrong size on CategorySwitcherWidget_GetActivatedCategoryIndex");
static_assert(offsetof(CategorySwitcherWidget_GetActivatedCategoryIndex, ReturnValue) == 0x000000, "Member 'CategorySwitcherWidget_GetActivatedCategoryIndex::ReturnValue' has a wrong offset!");

// Function UINavigation.KeysActionWidget.GetUserWidgetChildFromName
// 0x0018 (0x0018 - 0x0000)
struct KeysActionWidget_GetUserWidgetChildFromName final
{
public:
	class UUserWidget*                            InUserWidget;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InWidgetName;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KeysActionWidget_GetUserWidgetChildFromName) == 0x000008, "Wrong alignment on KeysActionWidget_GetUserWidgetChildFromName");
static_assert(sizeof(KeysActionWidget_GetUserWidgetChildFromName) == 0x000018, "Wrong size on KeysActionWidget_GetUserWidgetChildFromName");
static_assert(offsetof(KeysActionWidget_GetUserWidgetChildFromName, InUserWidget) == 0x000000, "Member 'KeysActionWidget_GetUserWidgetChildFromName::InUserWidget' has a wrong offset!");
static_assert(offsetof(KeysActionWidget_GetUserWidgetChildFromName, InWidgetName) == 0x000008, "Member 'KeysActionWidget_GetUserWidgetChildFromName::InWidgetName' has a wrong offset!");
static_assert(offsetof(KeysActionWidget_GetUserWidgetChildFromName, ReturnValue) == 0x000010, "Member 'KeysActionWidget_GetUserWidgetChildFromName::ReturnValue' has a wrong offset!");

// Function UINavigation.KeysActionWidget.HasKeyAction
// 0x0020 (0x0020 - 0x0000)
struct KeysActionWidget_HasKeyAction final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(KeysActionWidget_HasKeyAction) == 0x000001, "Wrong alignment on KeysActionWidget_HasKeyAction");
static_assert(sizeof(KeysActionWidget_HasKeyAction) == 0x000020, "Wrong size on KeysActionWidget_HasKeyAction");
static_assert(offsetof(KeysActionWidget_HasKeyAction, Key) == 0x000000, "Member 'KeysActionWidget_HasKeyAction::Key' has a wrong offset!");
static_assert(offsetof(KeysActionWidget_HasKeyAction, ReturnValue) == 0x000018, "Member 'KeysActionWidget_HasKeyAction::ReturnValue' has a wrong offset!");

// Function UINavigation.KeysActionWidget.IsGamepadKeyAction
// 0x0001 (0x0001 - 0x0000)
struct KeysActionWidget_IsGamepadKeyAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KeysActionWidget_IsGamepadKeyAction) == 0x000001, "Wrong alignment on KeysActionWidget_IsGamepadKeyAction");
static_assert(sizeof(KeysActionWidget_IsGamepadKeyAction) == 0x000001, "Wrong size on KeysActionWidget_IsGamepadKeyAction");
static_assert(offsetof(KeysActionWidget_IsGamepadKeyAction, ReturnValue) == 0x000000, "Member 'KeysActionWidget_IsGamepadKeyAction::ReturnValue' has a wrong offset!");

// Function UINavigation.KeysActionWidget.IsKeyboardKeyAction
// 0x0001 (0x0001 - 0x0000)
struct KeysActionWidget_IsKeyboardKeyAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KeysActionWidget_IsKeyboardKeyAction) == 0x000001, "Wrong alignment on KeysActionWidget_IsKeyboardKeyAction");
static_assert(sizeof(KeysActionWidget_IsKeyboardKeyAction) == 0x000001, "Wrong size on KeysActionWidget_IsKeyboardKeyAction");
static_assert(offsetof(KeysActionWidget_IsKeyboardKeyAction, ReturnValue) == 0x000000, "Member 'KeysActionWidget_IsKeyboardKeyAction::ReturnValue' has a wrong offset!");

// Function UINavigation.KeysActionWidget.IsPressed
// 0x0001 (0x0001 - 0x0000)
struct KeysActionWidget_IsPressed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KeysActionWidget_IsPressed) == 0x000001, "Wrong alignment on KeysActionWidget_IsPressed");
static_assert(sizeof(KeysActionWidget_IsPressed) == 0x000001, "Wrong size on KeysActionWidget_IsPressed");
static_assert(offsetof(KeysActionWidget_IsPressed, ReturnValue) == 0x000000, "Member 'KeysActionWidget_IsPressed::ReturnValue' has a wrong offset!");

// Function UINavigation.KeysActionWidget.IsReleased
// 0x0001 (0x0001 - 0x0000)
struct KeysActionWidget_IsReleased final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KeysActionWidget_IsReleased) == 0x000001, "Wrong alignment on KeysActionWidget_IsReleased");
static_assert(sizeof(KeysActionWidget_IsReleased) == 0x000001, "Wrong size on KeysActionWidget_IsReleased");
static_assert(offsetof(KeysActionWidget_IsReleased, ReturnValue) == 0x000000, "Member 'KeysActionWidget_IsReleased::ReturnValue' has a wrong offset!");

// Function UINavigation.KeysActionWidget.SetGamepadKeyVisibility
// 0x0001 (0x0001 - 0x0000)
struct KeysActionWidget_SetGamepadKeyVisibility final
{
public:
	bool                                          NewVisibility;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KeysActionWidget_SetGamepadKeyVisibility) == 0x000001, "Wrong alignment on KeysActionWidget_SetGamepadKeyVisibility");
static_assert(sizeof(KeysActionWidget_SetGamepadKeyVisibility) == 0x000001, "Wrong size on KeysActionWidget_SetGamepadKeyVisibility");
static_assert(offsetof(KeysActionWidget_SetGamepadKeyVisibility, NewVisibility) == 0x000000, "Member 'KeysActionWidget_SetGamepadKeyVisibility::NewVisibility' has a wrong offset!");

// Function UINavigation.KeysActionWidget.SetKeyStates
// 0x0001 (0x0001 - 0x0000)
struct KeysActionWidget_SetKeyStates final
{
public:
	EInputEvent                                   InputEvent;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KeysActionWidget_SetKeyStates) == 0x000001, "Wrong alignment on KeysActionWidget_SetKeyStates");
static_assert(sizeof(KeysActionWidget_SetKeyStates) == 0x000001, "Wrong size on KeysActionWidget_SetKeyStates");
static_assert(offsetof(KeysActionWidget_SetKeyStates, InputEvent) == 0x000000, "Member 'KeysActionWidget_SetKeyStates::InputEvent' has a wrong offset!");

// Function UINavigation.KeysActionWidget.SetPCKeyVisibility
// 0x0001 (0x0001 - 0x0000)
struct KeysActionWidget_SetPCKeyVisibility final
{
public:
	bool                                          NewVisibility;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KeysActionWidget_SetPCKeyVisibility) == 0x000001, "Wrong alignment on KeysActionWidget_SetPCKeyVisibility");
static_assert(sizeof(KeysActionWidget_SetPCKeyVisibility) == 0x000001, "Wrong size on KeysActionWidget_SetPCKeyVisibility");
static_assert(offsetof(KeysActionWidget_SetPCKeyVisibility, NewVisibility) == 0x000000, "Member 'KeysActionWidget_SetPCKeyVisibility::NewVisibility' has a wrong offset!");

// Function UINavigation.KeysActionWidget.SetTouchVisibility
// 0x0001 (0x0001 - 0x0000)
struct KeysActionWidget_SetTouchVisibility final
{
public:
	bool                                          NewVisibility;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KeysActionWidget_SetTouchVisibility) == 0x000001, "Wrong alignment on KeysActionWidget_SetTouchVisibility");
static_assert(sizeof(KeysActionWidget_SetTouchVisibility) == 0x000001, "Wrong size on KeysActionWidget_SetTouchVisibility");
static_assert(offsetof(KeysActionWidget_SetTouchVisibility, NewVisibility) == 0x000000, "Member 'KeysActionWidget_SetTouchVisibility::NewVisibility' has a wrong offset!");

// Function UINavigation.KeysActionWidget.GetNextGroupName
// 0x0008 (0x0008 - 0x0000)
struct KeysActionWidget_GetNextGroupName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KeysActionWidget_GetNextGroupName) == 0x000004, "Wrong alignment on KeysActionWidget_GetNextGroupName");
static_assert(sizeof(KeysActionWidget_GetNextGroupName) == 0x000008, "Wrong size on KeysActionWidget_GetNextGroupName");
static_assert(offsetof(KeysActionWidget_GetNextGroupName, ReturnValue) == 0x000000, "Member 'KeysActionWidget_GetNextGroupName::ReturnValue' has a wrong offset!");

// Function UINavigation.KeysActionWidget.IsGamepadInputTypeCurrently
// 0x0001 (0x0001 - 0x0000)
struct KeysActionWidget_IsGamepadInputTypeCurrently final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KeysActionWidget_IsGamepadInputTypeCurrently) == 0x000001, "Wrong alignment on KeysActionWidget_IsGamepadInputTypeCurrently");
static_assert(sizeof(KeysActionWidget_IsGamepadInputTypeCurrently) == 0x000001, "Wrong size on KeysActionWidget_IsGamepadInputTypeCurrently");
static_assert(offsetof(KeysActionWidget_IsGamepadInputTypeCurrently, ReturnValue) == 0x000000, "Member 'KeysActionWidget_IsGamepadInputTypeCurrently::ReturnValue' has a wrong offset!");

// Function UINavigation.KeysActionWidget.IsKeyboardInputTypeCurrently
// 0x0001 (0x0001 - 0x0000)
struct KeysActionWidget_IsKeyboardInputTypeCurrently final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(KeysActionWidget_IsKeyboardInputTypeCurrently) == 0x000001, "Wrong alignment on KeysActionWidget_IsKeyboardInputTypeCurrently");
static_assert(sizeof(KeysActionWidget_IsKeyboardInputTypeCurrently) == 0x000001, "Wrong size on KeysActionWidget_IsKeyboardInputTypeCurrently");
static_assert(offsetof(KeysActionWidget_IsKeyboardInputTypeCurrently, ReturnValue) == 0x000000, "Member 'KeysActionWidget_IsKeyboardInputTypeCurrently::ReturnValue' has a wrong offset!");

// Function UINavigation.NavigationProcessorWidget.BP_GetWidgetFromName
// 0x0018 (0x0018 - 0x0000)
struct NavigationProcessorWidget_BP_GetWidgetFromName final
{
public:
	class UUserWidget*                            InUserWidget;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   WidgetName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NavigationProcessorWidget_BP_GetWidgetFromName) == 0x000008, "Wrong alignment on NavigationProcessorWidget_BP_GetWidgetFromName");
static_assert(sizeof(NavigationProcessorWidget_BP_GetWidgetFromName) == 0x000018, "Wrong size on NavigationProcessorWidget_BP_GetWidgetFromName");
static_assert(offsetof(NavigationProcessorWidget_BP_GetWidgetFromName, InUserWidget) == 0x000000, "Member 'NavigationProcessorWidget_BP_GetWidgetFromName::InUserWidget' has a wrong offset!");
static_assert(offsetof(NavigationProcessorWidget_BP_GetWidgetFromName, WidgetName) == 0x000008, "Member 'NavigationProcessorWidget_BP_GetWidgetFromName::WidgetName' has a wrong offset!");
static_assert(offsetof(NavigationProcessorWidget_BP_GetWidgetFromName, ReturnValue) == 0x000010, "Member 'NavigationProcessorWidget_BP_GetWidgetFromName::ReturnValue' has a wrong offset!");

// Function UINavigation.NavigationProcessorWidget.BP_HandleInputKey
// 0x0020 (0x0020 - 0x0000)
struct NavigationProcessorWidget_BP_HandleInputKey final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NavigationProcessorWidget_BP_HandleInputKey) == 0x000001, "Wrong alignment on NavigationProcessorWidget_BP_HandleInputKey");
static_assert(sizeof(NavigationProcessorWidget_BP_HandleInputKey) == 0x000020, "Wrong size on NavigationProcessorWidget_BP_HandleInputKey");
static_assert(offsetof(NavigationProcessorWidget_BP_HandleInputKey, Key) == 0x000000, "Member 'NavigationProcessorWidget_BP_HandleInputKey::Key' has a wrong offset!");
static_assert(offsetof(NavigationProcessorWidget_BP_HandleInputKey, InputEvent) == 0x000018, "Member 'NavigationProcessorWidget_BP_HandleInputKey::InputEvent' has a wrong offset!");
static_assert(offsetof(NavigationProcessorWidget_BP_HandleInputKey, ReturnValue) == 0x000019, "Member 'NavigationProcessorWidget_BP_HandleInputKey::ReturnValue' has a wrong offset!");

// Function UINavigation.NavigationProcessorWidget.GetEntryWidgetFromItem
// 0x0018 (0x0018 - 0x0000)
struct NavigationProcessorWidget_GetEntryWidgetFromItem final
{
public:
	const class UListView*                        InListView;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          InItem;                                            // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NavigationProcessorWidget_GetEntryWidgetFromItem) == 0x000008, "Wrong alignment on NavigationProcessorWidget_GetEntryWidgetFromItem");
static_assert(sizeof(NavigationProcessorWidget_GetEntryWidgetFromItem) == 0x000018, "Wrong size on NavigationProcessorWidget_GetEntryWidgetFromItem");
static_assert(offsetof(NavigationProcessorWidget_GetEntryWidgetFromItem, InListView) == 0x000000, "Member 'NavigationProcessorWidget_GetEntryWidgetFromItem::InListView' has a wrong offset!");
static_assert(offsetof(NavigationProcessorWidget_GetEntryWidgetFromItem, InItem) == 0x000008, "Member 'NavigationProcessorWidget_GetEntryWidgetFromItem::InItem' has a wrong offset!");
static_assert(offsetof(NavigationProcessorWidget_GetEntryWidgetFromItem, ReturnValue) == 0x000010, "Member 'NavigationProcessorWidget_GetEntryWidgetFromItem::ReturnValue' has a wrong offset!");

// Function UINavigation.NavigationProcessorWidget.GetOwnerUserWidget
// 0x0010 (0x0010 - 0x0000)
struct NavigationProcessorWidget_GetOwnerUserWidget final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NavigationProcessorWidget_GetOwnerUserWidget) == 0x000008, "Wrong alignment on NavigationProcessorWidget_GetOwnerUserWidget");
static_assert(sizeof(NavigationProcessorWidget_GetOwnerUserWidget) == 0x000010, "Wrong size on NavigationProcessorWidget_GetOwnerUserWidget");
static_assert(offsetof(NavigationProcessorWidget_GetOwnerUserWidget, InWidget) == 0x000000, "Member 'NavigationProcessorWidget_GetOwnerUserWidget::InWidget' has a wrong offset!");
static_assert(offsetof(NavigationProcessorWidget_GetOwnerUserWidget, ReturnValue) == 0x000008, "Member 'NavigationProcessorWidget_GetOwnerUserWidget::ReturnValue' has a wrong offset!");

// Function UINavigation.NavigationProcessorWidget.GetOwnerViewportWidget
// 0x0008 (0x0008 - 0x0000)
struct NavigationProcessorWidget_GetOwnerViewportWidget final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NavigationProcessorWidget_GetOwnerViewportWidget) == 0x000008, "Wrong alignment on NavigationProcessorWidget_GetOwnerViewportWidget");
static_assert(sizeof(NavigationProcessorWidget_GetOwnerViewportWidget) == 0x000008, "Wrong size on NavigationProcessorWidget_GetOwnerViewportWidget");
static_assert(offsetof(NavigationProcessorWidget_GetOwnerViewportWidget, ReturnValue) == 0x000000, "Member 'NavigationProcessorWidget_GetOwnerViewportWidget::ReturnValue' has a wrong offset!");

// Function UINavigation.UINavigationSubsystem.Get
// 0x0010 (0x0010 - 0x0000)
struct UINavigationSubsystem_Get final
{
public:
	const class ULocalPlayer*                     LocalPlayer;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUINavigationSubsystem*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UINavigationSubsystem_Get) == 0x000008, "Wrong alignment on UINavigationSubsystem_Get");
static_assert(sizeof(UINavigationSubsystem_Get) == 0x000010, "Wrong size on UINavigationSubsystem_Get");
static_assert(offsetof(UINavigationSubsystem_Get, LocalPlayer) == 0x000000, "Member 'UINavigationSubsystem_Get::LocalPlayer' has a wrong offset!");
static_assert(offsetof(UINavigationSubsystem_Get, ReturnValue) == 0x000008, "Member 'UINavigationSubsystem_Get::ReturnValue' has a wrong offset!");

// Function UINavigation.UINavigationSubsystem.AssignedEnterButton
// 0x0001 (0x0001 - 0x0000)
struct UINavigationSubsystem_AssignedEnterButton final
{
public:
	bool                                          bAssigned;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UINavigationSubsystem_AssignedEnterButton) == 0x000001, "Wrong alignment on UINavigationSubsystem_AssignedEnterButton");
static_assert(sizeof(UINavigationSubsystem_AssignedEnterButton) == 0x000001, "Wrong size on UINavigationSubsystem_AssignedEnterButton");
static_assert(offsetof(UINavigationSubsystem_AssignedEnterButton, bAssigned) == 0x000000, "Member 'UINavigationSubsystem_AssignedEnterButton::bAssigned' has a wrong offset!");

// Function UINavigation.UINavigationSubsystem.BackFocus
// 0x0001 (0x0001 - 0x0000)
struct UINavigationSubsystem_BackFocus final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UINavigationSubsystem_BackFocus) == 0x000001, "Wrong alignment on UINavigationSubsystem_BackFocus");
static_assert(sizeof(UINavigationSubsystem_BackFocus) == 0x000001, "Wrong size on UINavigationSubsystem_BackFocus");
static_assert(offsetof(UINavigationSubsystem_BackFocus, ReturnValue) == 0x000000, "Member 'UINavigationSubsystem_BackFocus::ReturnValue' has a wrong offset!");

// Function UINavigation.UINavigationSubsystem.BuildCommandMenus
// 0x0030 (0x0030 - 0x0000)
struct UINavigationSubsystem_BuildCommandMenus final
{
public:
	TSoftClassPtr<class UClass>                   CommandMenusWidget;                                // 0x0000(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            ReturnValue;                                       // 0x0028(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UINavigationSubsystem_BuildCommandMenus) == 0x000008, "Wrong alignment on UINavigationSubsystem_BuildCommandMenus");
static_assert(sizeof(UINavigationSubsystem_BuildCommandMenus) == 0x000030, "Wrong size on UINavigationSubsystem_BuildCommandMenus");
static_assert(offsetof(UINavigationSubsystem_BuildCommandMenus, CommandMenusWidget) == 0x000000, "Member 'UINavigationSubsystem_BuildCommandMenus::CommandMenusWidget' has a wrong offset!");
static_assert(offsetof(UINavigationSubsystem_BuildCommandMenus, ReturnValue) == 0x000028, "Member 'UINavigationSubsystem_BuildCommandMenus::ReturnValue' has a wrong offset!");

// Function UINavigation.UINavigationSubsystem.DisableKeysActionFromTag
// 0x0008 (0x0008 - 0x0000)
struct UINavigationSubsystem_DisableKeysActionFromTag final
{
public:
	class FName                                   InTagName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UINavigationSubsystem_DisableKeysActionFromTag) == 0x000004, "Wrong alignment on UINavigationSubsystem_DisableKeysActionFromTag");
static_assert(sizeof(UINavigationSubsystem_DisableKeysActionFromTag) == 0x000008, "Wrong size on UINavigationSubsystem_DisableKeysActionFromTag");
static_assert(offsetof(UINavigationSubsystem_DisableKeysActionFromTag, InTagName) == 0x000000, "Member 'UINavigationSubsystem_DisableKeysActionFromTag::InTagName' has a wrong offset!");

// Function UINavigation.UINavigationSubsystem.EnableEvaluateWindowsMouseCursor
// 0x0001 (0x0001 - 0x0000)
struct UINavigationSubsystem_EnableEvaluateWindowsMouseCursor final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UINavigationSubsystem_EnableEvaluateWindowsMouseCursor) == 0x000001, "Wrong alignment on UINavigationSubsystem_EnableEvaluateWindowsMouseCursor");
static_assert(sizeof(UINavigationSubsystem_EnableEvaluateWindowsMouseCursor) == 0x000001, "Wrong size on UINavigationSubsystem_EnableEvaluateWindowsMouseCursor");
static_assert(offsetof(UINavigationSubsystem_EnableEvaluateWindowsMouseCursor, bEnable) == 0x000000, "Member 'UINavigationSubsystem_EnableEvaluateWindowsMouseCursor::bEnable' has a wrong offset!");

// Function UINavigation.UINavigationSubsystem.EnableKeysActionFromTag
// 0x0008 (0x0008 - 0x0000)
struct UINavigationSubsystem_EnableKeysActionFromTag final
{
public:
	class FName                                   InTagName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UINavigationSubsystem_EnableKeysActionFromTag) == 0x000004, "Wrong alignment on UINavigationSubsystem_EnableKeysActionFromTag");
static_assert(sizeof(UINavigationSubsystem_EnableKeysActionFromTag) == 0x000008, "Wrong size on UINavigationSubsystem_EnableKeysActionFromTag");
static_assert(offsetof(UINavigationSubsystem_EnableKeysActionFromTag, InTagName) == 0x000000, "Member 'UINavigationSubsystem_EnableKeysActionFromTag::InTagName' has a wrong offset!");

// Function UINavigation.UINavigationSubsystem.ExitCurrentGroup
// 0x0001 (0x0001 - 0x0000)
struct UINavigationSubsystem_ExitCurrentGroup final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UINavigationSubsystem_ExitCurrentGroup) == 0x000001, "Wrong alignment on UINavigationSubsystem_ExitCurrentGroup");
static_assert(sizeof(UINavigationSubsystem_ExitCurrentGroup) == 0x000001, "Wrong size on UINavigationSubsystem_ExitCurrentGroup");
static_assert(offsetof(UINavigationSubsystem_ExitCurrentGroup, ReturnValue) == 0x000000, "Member 'UINavigationSubsystem_ExitCurrentGroup::ReturnValue' has a wrong offset!");

// Function UINavigation.UINavigationSubsystem.ExitGroup
// 0x000C (0x000C - 0x0000)
struct UINavigationSubsystem_ExitGroup final
{
public:
	class FName                                   NextGroupName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UINavigationSubsystem_ExitGroup) == 0x000004, "Wrong alignment on UINavigationSubsystem_ExitGroup");
static_assert(sizeof(UINavigationSubsystem_ExitGroup) == 0x00000C, "Wrong size on UINavigationSubsystem_ExitGroup");
static_assert(offsetof(UINavigationSubsystem_ExitGroup, NextGroupName) == 0x000000, "Member 'UINavigationSubsystem_ExitGroup::NextGroupName' has a wrong offset!");
static_assert(offsetof(UINavigationSubsystem_ExitGroup, ReturnValue) == 0x000008, "Member 'UINavigationSubsystem_ExitGroup::ReturnValue' has a wrong offset!");

// Function UINavigation.UINavigationSubsystem.GetCursorMoveMethod
// 0x0001 (0x0001 - 0x0000)
struct UINavigationSubsystem_GetCursorMoveMethod final
{
public:
	EGamepadCursorMoveMethod                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UINavigationSubsystem_GetCursorMoveMethod) == 0x000001, "Wrong alignment on UINavigationSubsystem_GetCursorMoveMethod");
static_assert(sizeof(UINavigationSubsystem_GetCursorMoveMethod) == 0x000001, "Wrong size on UINavigationSubsystem_GetCursorMoveMethod");
static_assert(offsetof(UINavigationSubsystem_GetCursorMoveMethod, ReturnValue) == 0x000000, "Member 'UINavigationSubsystem_GetCursorMoveMethod::ReturnValue' has a wrong offset!");

// Function UINavigation.UINavigationSubsystem.GetCursorMoveMode
// 0x0001 (0x0001 - 0x0000)
struct UINavigationSubsystem_GetCursorMoveMode final
{
public:
	EGamepadCursorMoveMode                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UINavigationSubsystem_GetCursorMoveMode) == 0x000001, "Wrong alignment on UINavigationSubsystem_GetCursorMoveMode");
static_assert(sizeof(UINavigationSubsystem_GetCursorMoveMode) == 0x000001, "Wrong size on UINavigationSubsystem_GetCursorMoveMode");
static_assert(offsetof(UINavigationSubsystem_GetCursorMoveMode, ReturnValue) == 0x000000, "Member 'UINavigationSubsystem_GetCursorMoveMode::ReturnValue' has a wrong offset!");

// Function UINavigation.UINavigationSubsystem.GetCursorSensitivity
// 0x0004 (0x0004 - 0x0000)
struct UINavigationSubsystem_GetCursorSensitivity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UINavigationSubsystem_GetCursorSensitivity) == 0x000004, "Wrong alignment on UINavigationSubsystem_GetCursorSensitivity");
static_assert(sizeof(UINavigationSubsystem_GetCursorSensitivity) == 0x000004, "Wrong size on UINavigationSubsystem_GetCursorSensitivity");
static_assert(offsetof(UINavigationSubsystem_GetCursorSensitivity, ReturnValue) == 0x000000, "Member 'UINavigationSubsystem_GetCursorSensitivity::ReturnValue' has a wrong offset!");

// Function UINavigation.UINavigationSubsystem.GetCursorSpeed
// 0x0020 (0x0020 - 0x0000)
struct UINavigationSubsystem_GetCursorSpeed final
{
public:
	struct FVector2D                              AxisValue;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UINavigationSubsystem_GetCursorSpeed) == 0x000001, "Wrong alignment on UINavigationSubsystem_GetCursorSpeed");
static_assert(sizeof(UINavigationSubsystem_GetCursorSpeed) == 0x000020, "Wrong size on UINavigationSubsystem_GetCursorSpeed");
static_assert(offsetof(UINavigationSubsystem_GetCursorSpeed, AxisValue) == 0x000000, "Member 'UINavigationSubsystem_GetCursorSpeed::AxisValue' has a wrong offset!");
static_assert(offsetof(UINavigationSubsystem_GetCursorSpeed, ReturnValue) == 0x000010, "Member 'UINavigationSubsystem_GetCursorSpeed::ReturnValue' has a wrong offset!");

// Function UINavigation.UINavigationSubsystem.GetInputKeyTimeDown
// 0x0020 (0x0020 - 0x0000)
struct UINavigationSubsystem_GetInputKeyTimeDown final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UINavigationSubsystem_GetInputKeyTimeDown) == 0x000004, "Wrong alignment on UINavigationSubsystem_GetInputKeyTimeDown");
static_assert(sizeof(UINavigationSubsystem_GetInputKeyTimeDown) == 0x000020, "Wrong size on UINavigationSubsystem_GetInputKeyTimeDown");
static_assert(offsetof(UINavigationSubsystem_GetInputKeyTimeDown, Key) == 0x000000, "Member 'UINavigationSubsystem_GetInputKeyTimeDown::Key' has a wrong offset!");
static_assert(offsetof(UINavigationSubsystem_GetInputKeyTimeDown, ReturnValue) == 0x000018, "Member 'UINavigationSubsystem_GetInputKeyTimeDown::ReturnValue' has a wrong offset!");

// Function UINavigation.UINavigationSubsystem.GetKeysAction
// 0x0010 (0x0010 - 0x0000)
struct UINavigationSubsystem_GetKeysAction final
{
public:
	class FName                                   WidgetName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UKeysActionWidget*                      ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UINavigationSubsystem_GetKeysAction) == 0x000008, "Wrong alignment on UINavigationSubsystem_GetKeysAction");
static_assert(sizeof(UINavigationSubsystem_GetKeysAction) == 0x000010, "Wrong size on UINavigationSubsystem_GetKeysAction");
static_assert(offsetof(UINavigationSubsystem_GetKeysAction, WidgetName) == 0x000000, "Member 'UINavigationSubsystem_GetKeysAction::WidgetName' has a wrong offset!");
static_assert(offsetof(UINavigationSubsystem_GetKeysAction, ReturnValue) == 0x000008, "Member 'UINavigationSubsystem_GetKeysAction::ReturnValue' has a wrong offset!");

// Function UINavigation.UINavigationSubsystem.GetTopViewportWidget
// 0x0008 (0x0008 - 0x0000)
struct UINavigationSubsystem_GetTopViewportWidget final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UINavigationSubsystem_GetTopViewportWidget) == 0x000008, "Wrong alignment on UINavigationSubsystem_GetTopViewportWidget");
static_assert(sizeof(UINavigationSubsystem_GetTopViewportWidget) == 0x000008, "Wrong size on UINavigationSubsystem_GetTopViewportWidget");
static_assert(offsetof(UINavigationSubsystem_GetTopViewportWidget, ReturnValue) == 0x000000, "Member 'UINavigationSubsystem_GetTopViewportWidget::ReturnValue' has a wrong offset!");

// Function UINavigation.UINavigationSubsystem.GetUINavigationWidget
// 0x0010 (0x0010 - 0x0000)
struct UINavigationSubsystem_GetUINavigationWidget final
{
public:
	class FName                                   WidgetName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUINavigationWidget*                    ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UINavigationSubsystem_GetUINavigationWidget) == 0x000008, "Wrong alignment on UINavigationSubsystem_GetUINavigationWidget");
static_assert(sizeof(UINavigationSubsystem_GetUINavigationWidget) == 0x000010, "Wrong size on UINavigationSubsystem_GetUINavigationWidget");
static_assert(offsetof(UINavigationSubsystem_GetUINavigationWidget, WidgetName) == 0x000000, "Member 'UINavigationSubsystem_GetUINavigationWidget::WidgetName' has a wrong offset!");
static_assert(offsetof(UINavigationSubsystem_GetUINavigationWidget, ReturnValue) == 0x000008, "Member 'UINavigationSubsystem_GetUINavigationWidget::ReturnValue' has a wrong offset!");

// Function UINavigation.UINavigationSubsystem.IsKeyDown
// 0x0020 (0x0020 - 0x0000)
struct UINavigationSubsystem_IsKeyDown final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
