#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UINavigation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UINavigation_structs.hpp"
#include "UMG_classes.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// Class UINavigation.NavigationWidgetBase
// 0x00E0 (0x0248 - 0x0168)
class UNavigationWidgetBase : public UWidget
{
public:
	uint8                                         Pad_168[0x88];                                     // 0x0168(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FWidgetTags>         Tags;                                              // 0x01F0(0x0050)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_240[0x8];                                      // 0x0240(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool ContainsAnyTagByDefaultTags(const TSet<class FName>& SubTags);
	bool ContainsTag(class FName MainTag, class FName SubTag);
	bool ContainsTagByDefaultTag(class FName SubTag);
	bool ContainsTagByNavigationTag(class FName SubTag);
	bool ContainsTags(class FName MainTag, TSet<class FName>* SubTags);
	void Disable();
	void Enable();
	struct FVector2D GetAbsolutePosition();
	struct FVector2D GetDrawSize();
	struct FVector2D GetLocalSize();
	struct FVector2D GetTouchPosition();
	struct FVector2D GetWidgetCenterPosition(const class UWidget* InWidget);
	bool IsEnabled();
	bool IsVisibleRecursive();
	bool IsWidgetReachable(class UWidget* InWidget);

	class UUserWidget* GetOwnerViewportWidget() const;
	class UUserWidget* GetWidgetGeneratedUserWidget(const class UWidget* InWidget) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NavigationWidgetBase">();
	}
	static class UNavigationWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNavigationWidgetBase>();
	}
};
static_assert(alignof(UNavigationWidgetBase) == 0x000008, "Wrong alignment on UNavigationWidgetBase");
static_assert(sizeof(UNavigationWidgetBase) == 0x000248, "Wrong size on UNavigationWidgetBase");
static_assert(offsetof(UNavigationWidgetBase, Tags) == 0x0001F0, "Member 'UNavigationWidgetBase::Tags' has a wrong offset!");

// Class UINavigation.CategorySwitcherWidget
// 0x0018 (0x0260 - 0x0248)
class UCategorySwitcherWidget final : public UNavigationWidgetBase
{
public:
	class FName                                   CategoryContainerName;                             // 0x0248(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EUINavigationCategoryKey                      CategoryKey;                                       // 0x0250(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_251[0xF];                                      // 0x0251(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SelectCategory(int32 Index_0);
	bool SelectCategoryFromKey(const struct FKey& Key, EInputEvent InputEvent);
	void SetActivateCategoryIndex(int32 Index_0);

	int32 GetActivatedCategoryIndex() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CategorySwitcherWidget">();
	}
	static class UCategorySwitcherWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCategorySwitcherWidget>();
	}
};
static_assert(alignof(UCategorySwitcherWidget) == 0x000008, "Wrong alignment on UCategorySwitcherWidget");
static_assert(sizeof(UCategorySwitcherWidget) == 0x000260, "Wrong size on UCategorySwitcherWidget");
static_assert(offsetof(UCategorySwitcherWidget, CategoryContainerName) == 0x000248, "Member 'UCategorySwitcherWidget::CategoryContainerName' has a wrong offset!");
static_assert(offsetof(UCategorySwitcherWidget, CategoryKey) == 0x000250, "Member 'UCategorySwitcherWidget::CategoryKey' has a wrong offset!");

// Class UINavigation.KeysActionWidget
// 0x0208 (0x0450 - 0x0248)
class UKeysActionWidget : public UNavigationWidgetBase
{
public:
	uint8                                         Pad_248[0x8];                                      // 0x0248(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EKeysActionInputEvent                         KeysActionInputEvent;                              // 0x0250(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableKeyIcon;                                    // 0x0251(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_252[0xBE];                                     // 0x0252(0x00BE)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   WidgetNameToClick;                                 // 0x0310(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableAlways;                                     // 0x0318(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableAnyOpacity;                                 // 0x0319(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31A[0x6];                                      // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   GamepadKey;                                        // 0x0320(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCustomSize;                                       // 0x0338(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CustomSize;                                        // 0x0340(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsHoldKey;                                        // 0x0350(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoClickedOnly;                                    // 0x0351(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_352[0x2];                                      // 0x0352(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HoldDuration;                                      // 0x0354(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsNavigateNextGroup;                              // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NextGroupName;                                     // 0x035C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExitCurrentGroup;                                 // 0x0364(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FName>                             GroupsName;                                        // 0x0368(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B8[0x8];                                      // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnClickedDelegate;                                 // 0x03C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D0[0x8];                                      // 0x03D0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   PCKey;                                             // 0x03D8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMinorLanguageKeyboard;                            // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3F1[0x1F];                                     // 0x03F1(0x001F)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                GamepadContent;                                    // 0x0410(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                KeyboardContent;                                   // 0x0418(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                TouchContent;                                      // 0x0420(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_428[0x28];                                     // 0x0428(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UWidget* GetUserWidgetChildFromName(class UUserWidget* InUserWidget, class FName InWidgetName);
	bool HasKeyAction(const struct FKey& Key);
	bool IsGamepadKeyAction();
	bool IsKeyboardKeyAction();
	bool IsPressed();
	bool IsReleased();
	void Rebuild();
	void ResetToInvalid();
	void SetGamepadKeyVisibility(bool NewVisibility);
	void SetKeyStates(EInputEvent InputEvent);
	void SetPCKeyVisibility(bool NewVisibility);
	void SetTouchVisibility(bool NewVisibility);

	class FName GetNextGroupName() const;
	bool IsGamepadInputTypeCurrently() const;
	bool IsKeyboardInputTypeCurrently() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KeysActionWidget">();
	}
	static class UKeysActionWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKeysActionWidget>();
	}
};
static_assert(alignof(UKeysActionWidget) == 0x000008, "Wrong alignment on UKeysActionWidget");
static_assert(sizeof(UKeysActionWidget) == 0x000450, "Wrong size on UKeysActionWidget");
static_assert(offsetof(UKeysActionWidget, KeysActionInputEvent) == 0x000250, "Member 'UKeysActionWidget::KeysActionInputEvent' has a wrong offset!");
static_assert(offsetof(UKeysActionWidget, bEnableKeyIcon) == 0x000251, "Member 'UKeysActionWidget::bEnableKeyIcon' has a wrong offset!");
static_assert(offsetof(UKeysActionWidget, WidgetNameToClick) == 0x000310, "Member 'UKeysActionWidget::WidgetNameToClick' has a wrong offset!");
static_assert(offsetof(UKeysActionWidget, bEnableAlways) == 0x000318, "Member 'UKeysActionWidget::bEnableAlways' has a wrong offset!");
static_assert(offsetof(UKeysActionWidget, bEnableAnyOpacity) == 0x000319, "Member 'UKeysActionWidget::bEnableAnyOpacity' has a wrong offset!");
static_assert(offsetof(UKeysActionWidget, GamepadKey) == 0x000320, "Member 'UKeysActionWidget::GamepadKey' has a wrong offset!");
static_assert(offsetof(UKeysActionWidget, bCustomSize) == 0x000338, "Member 'UKeysActionWidget::bCustomSize' has a wrong offset!");
static_assert(offsetof(UKeysActionWidget, CustomSize) == 0x000340, "Member 'UKeysActionWidget::CustomSize' has a wrong offset!");
static_assert(offsetof(UKeysActionWidget, bIsHoldKey) == 0x000350, "Member 'UKeysActionWidget::bIsHoldKey' has a wrong offset!");
static_assert(offsetof(UKeysActionWidget, bDoClickedOnly) == 0x000351, "Member 'UKeysActionWidget::bDoClickedOnly' has a wrong offset!");
static_assert(offsetof(UKeysActionWidget, HoldDuration) == 0x000354, "Member 'UKeysActionWidget::HoldDuration' has a wrong offset!");
static_assert(offsetof(UKeysActionWidget, bIsNavigateNextGroup) == 0x000358, "Member 'UKeysActionWidget::bIsNavigateNextGroup' has a wrong offset!");
static_assert(offsetof(UKeysActionWidget, NextGroupName) == 0x00035C, "Member 'UKeysActionWidget::NextGroupName' has a wrong offset!");
static_assert(offsetof(UKeysActionWidget, bExitCurrentGroup) == 0x000364, "Member 'UKeysActionWidget::bExitCurrentGroup' has a wrong offset!");
static_assert(offsetof(UKeysActionWidget, GroupsName) == 0x000368, "Member 'UKeysActionWidget::GroupsName' has a wrong offset!");
static_assert(offsetof(UKeysActionWidget, OnClickedDelegate) == 0x0003C0, "Member 'UKeysActionWidget::OnClickedDelegate' has a wrong offset!");
static_assert(offsetof(UKeysActionWidget, PCKey) == 0x0003D8, "Member 'UKeysActionWidget::PCKey' has a wrong offset!");
static_assert(offsetof(UKeysActionWidget, bMinorLanguageKeyboard) == 0x0003F0, "Member 'UKeysActionWidget::bMinorLanguageKeyboard' has a wrong offset!");
static_assert(offsetof(UKeysActionWidget, GamepadContent) == 0x000410, "Member 'UKeysActionWidget::GamepadContent' has a wrong offset!");
static_assert(offsetof(UKeysActionWidget, KeyboardContent) == 0x000418, "Member 'UKeysActionWidget::KeyboardContent' has a wrong offset!");
static_assert(offsetof(UKeysActionWidget, TouchContent) == 0x000420, "Member 'UKeysActionWidget::TouchContent' has a wrong offset!");

// Class UINavigation.NavigationComponent
// 0x0030 (0x0280 - 0x0250)
class UNavigationComponent final : public USceneComponent
{
public:
	TMulticastInlineDelegate<void()>              ReceiveFocus;                                      // 0x0250(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              LostFocus;                                         // 0x0260(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFocusBacked;                                     // 0x0270(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NavigationComponent">();
	}
	static class UNavigationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNavigationComponent>();
	}
};
static_assert(alignof(UNavigationComponent) == 0x000008, "Wrong alignment on UNavigationComponent");
static_assert(sizeof(UNavigationComponent) == 0x000280, "Wrong size on UNavigationComponent");
static_assert(offsetof(UNavigationComponent, ReceiveFocus) == 0x000250, "Member 'UNavigationComponent::ReceiveFocus' has a wrong offset!");
static_assert(offsetof(UNavigationComponent, LostFocus) == 0x000260, "Member 'UNavigationComponent::LostFocus' has a wrong offset!");
static_assert(offsetof(UNavigationComponent, OnFocusBacked) == 0x000270, "Member 'UNavigationComponent::OnFocusBacked' has a wrong offset!");

// Class UINavigation.NavigationProcessorWidget
// 0x0028 (0x0368 - 0x0340)
class UNavigationProcessorWidget : public UUserWidget
{
public:
	uint8                                         Pad_340[0x18];                                     // 0x0340(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bBindWidgetFocusDelegate;                          // 0x0358(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBindWidgetSelectedDelegate;                       // 0x0359(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_35A[0xE];                                      // 0x035A(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UWidget* BP_GetWidgetFromName(class UUserWidget* InUserWidget, class FName WidgetName);
	bool BP_HandleInputKey(const struct FKey& Key, EInputEvent InputEvent);
	class UUserWidget* GetEntryWidgetFromItem(const class UListView* InListView, const class UObject* InItem);
	class UUserWidget* GetOwnerUserWidget(class UWidget* InWidget);
	class UUserWidget* GetOwnerViewportWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NavigationProcessorWidget">();
	}
	static class UNavigationProcessorWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNavigationProcessorWidget>();
	}
};
static_assert(alignof(UNavigationProcessorWidget) == 0x000008, "Wrong alignment on UNavigationProcessorWidget");
static_assert(sizeof(UNavigationProcessorWidget) == 0x000368, "Wrong size on UNavigationProcessorWidget");
static_assert(offsetof(UNavigationProcessorWidget, bBindWidgetFocusDelegate) == 0x000358, "Member 'UNavigationProcessorWidget::bBindWidgetFocusDelegate' has a wrong offset!");
static_assert(offsetof(UNavigationProcessorWidget, bBindWidgetSelectedDelegate) == 0x000359, "Member 'UNavigationProcessorWidget::bBindWidgetSelectedDelegate' has a wrong offset!");

// Class UINavigation.ScrollerProcessorWidget
// 0x0020 (0x0268 - 0x0248)
class UScrollerProcessorWidget : public UNavigationWidgetBase
{
public:
	TArray<class FName>                           ScrollContainersName;                              // 0x0248(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         ScrollRate;                                        // 0x0258(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReverse;                                          // 0x025C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProcessSimultaneously;                            // 0x025D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReverseDirection;                                 // 0x025E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25F[0x9];                                      // 0x025F(0x0009)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ScrollerProcessorWidget">();
	}
	static class UScrollerProcessorWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScrollerProcessorWidget>();
	}
};
static_assert(alignof(UScrollerProcessorWidget) == 0x000008, "Wrong alignment on UScrollerProcessorWidget");
static_assert(sizeof(UScrollerProcessorWidget) == 0x000268, "Wrong size on UScrollerProcessorWidget");
static_assert(offsetof(UScrollerProcessorWidget, ScrollContainersName) == 0x000248, "Member 'UScrollerProcessorWidget::ScrollContainersName' has a wrong offset!");
static_assert(offsetof(UScrollerProcessorWidget, ScrollRate) == 0x000258, "Member 'UScrollerProcessorWidget::ScrollRate' has a wrong offset!");
static_assert(offsetof(UScrollerProcessorWidget, bReverse) == 0x00025C, "Member 'UScrollerProcessorWidget::bReverse' has a wrong offset!");
static_assert(offsetof(UScrollerProcessorWidget, bProcessSimultaneously) == 0x00025D, "Member 'UScrollerProcessorWidget::bProcessSimultaneously' has a wrong offset!");
static_assert(offsetof(UScrollerProcessorWidget, bReverseDirection) == 0x00025E, "Member 'UScrollerProcessorWidget::bReverseDirection' has a wrong offset!");

// Class UINavigation.SliderEditorWidget
// 0x0018 (0x0260 - 0x0248)
class USliderEditorWidget : public UNavigationWidgetBase
{
public:
	class FName                                   SliderName;                                        // 0x0248(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepSize;                                          // 0x0250(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepMultiplier;                                    // 0x0254(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInverse;                                          // 0x0258(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SliderEditorWidget">();
	}
	static class USliderEditorWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<USliderEditorWidget>();
	}
};
static_assert(alignof(USliderEditorWidget) == 0x000008, "Wrong alignment on USliderEditorWidget");
static_assert(sizeof(USliderEditorWidget) == 0x000260, "Wrong size on USliderEditorWidget");
static_assert(offsetof(USliderEditorWidget, SliderName) == 0x000248, "Member 'USliderEditorWidget::SliderName' has a wrong offset!");
static_assert(offsetof(USliderEditorWidget, StepSize) == 0x000250, "Member 'USliderEditorWidget::StepSize' has a wrong offset!");
static_assert(offsetof(USliderEditorWidget, StepMultiplier) == 0x000254, "Member 'USliderEditorWidget::StepMultiplier' has a wrong offset!");
static_assert(offsetof(USliderEditorWidget, bInverse) == 0x000258, "Member 'USliderEditorWidget::bInverse' has a wrong offset!");

// Class UINavigation.UINavigationInterface
// 0x0000 (0x0000 - 0x0000)
class IUINavigationInterface final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UINavigationInterface">();
	}
	static class IUINavigationInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IUINavigationInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IUINavigationInterface) == 0x000001, "Wrong alignment on IUINavigationInterface");
static_assert(sizeof(IUINavigationInterface) == 0x000001, "Wrong size on IUINavigationInterface");

// Class UINavigation.UINavigationSubsystem
// 0x03C8 (0x03F8 - 0x0030)
class UUINavigationSubsystem : public ULocalPlayerSubsystem
{
public:
	uint8                                         Pad_30[0x368];                                     // 0x0030(0x0368)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            CF_CursorSpeed;                                    // 0x0398(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A0[0x58];                                     // 0x03A0(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UUINavigationSubsystem* Get(const class ULocalPlayer* LocalPlayer);

	void AssignedEnterButton(bool bAssigned);
	bool BackFocus();
	class UUserWidget* BuildCommandMenus(TSoftClassPtr<class UClass> CommandMenusWidget);
	void ClearCursorRequireKeys();
	void ClearGroups();
	void DisableKeysActionFromTag(class FName InTagName);
	void EnableEvaluateWindowsMouseCursor(bool bEnable);
	void EnableKeysActionFromTag(class FName InTagName);
	bool ExitCurrentGroup();
	bool ExitGroup(class FName NextGroupName);
	EGamepadCursorMoveMethod GetCursorMoveMethod();
	EGamepadCursorMoveMode GetCursorMoveMode();
	float GetCursorSensitivity();
	struct FVector2D GetCursorSpeed(const struct FVector2D& AxisValue);
	float GetInputKeyTimeDown(const struct FKey& Key);
	class UKeysActionWidget* GetKeysAction(class FName WidgetName);
	class UUserWidget* GetTopViewportWidget();
	class UUINavigationWidget* GetUINavigationWidget(class FName WidgetName);
	void HideCursor();
	bool IsKeyDown(const struct FKey& Key);
	bool IsKeysActionEnabledByTag(class FName InTagName);
	bool IsKeysActionVisibleByTag(class FName InTagName);
	bool IsNavigationEnabled();
	bool IsNavigationWidgetEnabled();
	bool IsOverInteractableWidgets(const struct FVector2D& position);
	bool IsTopViewportWidget(class UUserWidget* InUserWidget);
	void NavigateToWidget(class UUINavigationWidget* InNavigationWidget, bool bNavigateOnAnyInputType, bool bPlayFocusedSound);
	void PushViewportWidget(class UUserWidget* InUserWidget);
	bool ReleaseCommandMenus();
	void RemoveViewportWidget(class UUserWidget* InUserWidget);
	bool RequestNavigateToNextGroup(class FName NextGroupName, class UUserWidget* OwnerViewportWidget);
	void ResetCursorRequireKeys();
	void ResetScrollContentWidget();
	void SetCursorMoveMethod(EGamepadCursorMoveMethod MoveMethod);
	void SetCursorMoveMode(EGamepadCursorMoveMode MoveMode);
	void SetCursorSensitivity(float Sensitivity);
	void SetCursorSlowDown(float Value);
	void SetNavigationEnable(bool bEnableNavigation);
	void SetNavigationWidgetEnable(bool bEnableNavigation);
	void ShowCursor();
	void ShowOrHideCursor();
	void SimulateTouched(const struct FVector2D& TouchLocation);
	void SimulateTouchEnded(const struct FVector2D& TouchLocation);
	void SimulateTouchMoved(const struct FVector2D& TouchLocation);
	void SimulateTouchStarted(const struct FVector2D& TouchLocation);

	int32 GetControllerType() const;
	bool IsCursorVisible() const;
	bool IsGamepadInputType() const;
	bool IsKeyboardEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UINavigationSubsystem">();
	}
	static class UUINavigationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUINavigationSubsystem>();
	}
};
static_assert(alignof(UUINavigationSubsystem) == 0x000008, "Wrong alignment on UUINavigationSubsystem");
static_assert(sizeof(UUINavigationSubsystem) == 0x0003F8, "Wrong size on UUINavigationSubsystem");
static_assert(offsetof(UUINavigationSubsystem, CF_CursorSpeed) == 0x000398, "Member 'UUINavigationSubsystem::CF_CursorSpeed' has a wrong offset!");

// Class UINavigation.UINavigationDataAsset
// 0x0060 (0x0090 - 0x0030)
class UUINavigationDataAsset final : public UDataAsset
{
public:
	bool                                          bEnableKeyboard;                                   // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlaySoundOnNavigated;                             // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DurationToSwitchGamepadTab;                        // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DurationToNavigation;                              // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, TSoftObjectPtr<class UDataTable>> DataTables;                                  // 0x0040(0x0050)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UINavigationDataAsset">();
	}
	static class UUINavigationDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUINavigationDataAsset>();
	}
};
static_assert(alignof(UUINavigationDataAsset) == 0x000008, "Wrong alignment on UUINavigationDataAsset");
static_assert(sizeof(UUINavigationDataAsset) == 0x000090, "Wrong size on UUINavigationDataAsset");
static_assert(offsetof(UUINavigationDataAsset, bEnableKeyboard) == 0x000030, "Member 'UUINavigationDataAsset::bEnableKeyboard' has a wrong offset!");
static_assert(offsetof(UUINavigationDataAsset, bPlaySoundOnNavigated) == 0x000031, "Member 'UUINavigationDataAsset::bPlaySoundOnNavigated' has a wrong offset!");
static_assert(offsetof(UUINavigationDataAsset, DurationToSwitchGamepadTab) == 0x000034, "Member 'UUINavigationDataAsset::DurationToSwitchGamepadTab' has a wrong offset!");
static_assert(offsetof(UUINavigationDataAsset, DurationToNavigation) == 0x000038, "Member 'UUINavigationDataAsset::DurationToNavigation' has a wrong offset!");
static_assert(offsetof(UUINavigationDataAsset, DataTables) == 0x000040, "Member 'UUINavigationDataAsset::DataTables' has a wrong offset!");

// Class UINavigation.UINavigationWidget
// 0x0218 (0x0460 - 0x0248)
class UUINavigationWidget : public UNavigationWidgetBase
{
public:
	uint8                                         Pad_248[0x8];                                      // 0x0248(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              ReceiveFocus;                                      // 0x0250(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              LostFocus;                                         // 0x0260(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFocusBacked;                                     // 0x0270(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TDelegate<void()>                             FocusBrushDelegate;                                // 0x0280(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_290[0x10];                                     // 0x0290(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            FocusedBrush;                                      // 0x02A0(0x00B0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FName                                   WidgetNameToClick;                                 // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FocusedOnCreated;                                  // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_359[0x1];                                      // 0x0359(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          SelectOnFocused;                                   // 0x035A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35B[0x1];                                      // 0x035B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsDraggable;                                      // 0x035C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35D[0x1];                                      // 0x035D(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsOnRadioBoxPressedorReleased;                    // 0x035E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlaySoundOnFocused;                               // 0x035F(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SoundName;                                         // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUINavigatedScrollParams               ScrollParams;                                      // 0x0368(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	EUINavigationWidgetType                       FocusWidgetType;                                   // 0x0374(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SliderName;                                        // 0x0378(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SliderStepSizeMultiplier;                          // 0x0380(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepSize;                                          // 0x0384(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUINavigationSliderInputEvent                 SliderInputEvent;                                  // 0x0388(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         CustomFocusWidgetType;                             // 0x0389(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38A[0x2];                                      // 0x038A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TradeWeight;                                       // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsIgnoreVisibleRecursivet;                        // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLoopable;                                       // 0x0391(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSequentialProcessed;                            // 0x0392(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsIgnored;                                        // 0x0393(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCheckXY;                                        // 0x0394(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          blostFocusWhenNavFailed;                           // 0x0395(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSupportSimulateTouch;                             // 0x0396(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoClickedOnly;                                    // 0x0397(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bScrollIntoViewOnNavigated;                        // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableOtherContainerOnNavigation;                 // 0x0399(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLostFocusOnReleased;                              // 0x039A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39B[0x19];                                     // 0x039B(0x0019)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                RectOffset;                                        // 0x03B4(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C4[0x1];                                      // 0x03C4(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAttempScrollView;                                 // 0x03C5(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnbaleTabNavigation;                              // 0x03C6(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInPaginationScrollBox;                            // 0x03C7(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C8[0x98];                                     // 0x03C8(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UWidget* GetUserWidgetChildFromName(class UUserWidget* InUserWidget, class FName InWidgetName);
	void OnEntryReleased();
	void OnEntrySet();
	void OnLostFocus();
	void OnReceiveFocus();
	void OnSelected();
	void SetEnableFocus(bool bEnableFocus);
	void SetFocusBrush(const struct FSlateBrush& InBrush);
	void SetNavigationIgnoreVisibleRecursivet(bool bInIgnoreVisibleRecursivet);
	void SetNavigationIsIgnored(bool bInIsIgnored);
	void SetRectOffset(const struct FMargin& InRectOffset);

	uint8 GetCustomFocusWidgetType() const;
	EUINavigationWidgetType GetNavigationWidgetType() const;
	int32 GetStaticNavigationIndex_Down() const;
	int32 GetStaticNavigationIndex_Left() const;
	int32 GetStaticNavigationIndex_Right() const;
	int32 GetStaticNavigationIndex_Self() const;
	int32 GetStaticNavigationIndex_Up() const;
	bool HasFocus() const;
	bool IsStaticNavigationAutoCalculateLeftOrRight() const;
