#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ultra_Dynamic_Sky

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Cloud Coverage Target Mapping
// 0x0068 (0x0068 - 0x0000)
struct Ultra_Dynamic_Sky_C_Cloud_Coverage_Target_Mapping final
{
public:
	struct FVector                                Mapping;                                           // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_Vector2DToVector_Z_ImplicitCast;     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_Cloud_Coverage_Target_Mapping) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_Cloud_Coverage_Target_Mapping");
static_assert(sizeof(Ultra_Dynamic_Sky_C_Cloud_Coverage_Target_Mapping) == 0x000068, "Wrong size on Ultra_Dynamic_Sky_C_Cloud_Coverage_Target_Mapping");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Cloud_Coverage_Target_Mapping, Mapping) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_Cloud_Coverage_Target_Mapping::Mapping' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Cloud_Coverage_Target_Mapping, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'Ultra_Dynamic_Sky_C_Cloud_Coverage_Target_Mapping::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Cloud_Coverage_Target_Mapping, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'Ultra_Dynamic_Sky_C_Cloud_Coverage_Target_Mapping::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Cloud_Coverage_Target_Mapping, CallFunc_MakeVector2D_ReturnValue) == 0x000028, "Member 'Ultra_Dynamic_Sky_C_Cloud_Coverage_Target_Mapping::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Cloud_Coverage_Target_Mapping, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000038, "Member 'Ultra_Dynamic_Sky_C_Cloud_Coverage_Target_Mapping::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Cloud_Coverage_Target_Mapping, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x000048, "Member 'Ultra_Dynamic_Sky_C_Cloud_Coverage_Target_Mapping::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Cloud_Coverage_Target_Mapping, CallFunc_Conv_Vector2DToVector_Z_ImplicitCast) == 0x000060, "Member 'Ultra_Dynamic_Sky_C_Cloud_Coverage_Target_Mapping::CallFunc_Conv_Vector2DToVector_Z_ImplicitCast' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.ExecuteUbergraph_Ultra_Dynamic_Sky
// 0x0004 (0x0004 - 0x0000)
struct Ultra_Dynamic_Sky_C_ExecuteUbergraph_Ultra_Dynamic_Sky final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_ExecuteUbergraph_Ultra_Dynamic_Sky) == 0x000004, "Wrong alignment on Ultra_Dynamic_Sky_C_ExecuteUbergraph_Ultra_Dynamic_Sky");
static_assert(sizeof(Ultra_Dynamic_Sky_C_ExecuteUbergraph_Ultra_Dynamic_Sky) == 0x000004, "Wrong size on Ultra_Dynamic_Sky_C_ExecuteUbergraph_Ultra_Dynamic_Sky");
static_assert(offsetof(Ultra_Dynamic_Sky_C_ExecuteUbergraph_Ultra_Dynamic_Sky, EntryPoint) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_ExecuteUbergraph_Ultra_Dynamic_Sky::EntryPoint' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Notify of Removed Cloud Paint Container
// 0x0008 (0x0008 - 0x0000)
struct Ultra_Dynamic_Sky_C_Notify_of_Removed_Cloud_Paint_Container final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_Notify_of_Removed_Cloud_Paint_Container) == 0x000001, "Wrong alignment on Ultra_Dynamic_Sky_C_Notify_of_Removed_Cloud_Paint_Container");
static_assert(sizeof(Ultra_Dynamic_Sky_C_Notify_of_Removed_Cloud_Paint_Container) == 0x000008, "Wrong size on Ultra_Dynamic_Sky_C_Notify_of_Removed_Cloud_Paint_Container");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Notify_of_Removed_Cloud_Paint_Container, CallFunc_K2_SetTimer_ReturnValue) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_Notify_of_Removed_Cloud_Paint_Container::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Update Painted Cloud Coverage Target
// 0x0160 (0x0160 - 0x0000)
struct Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target final
{
public:
	class AUDS_Cloud_Paint_Container_C*           Cloud_Paint_Container;                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TMap<struct FIntPoint, class UTexture*>       Loaded_Cell_Textures;                              // 0x0008(0x0050)(Edit, BlueprintVisible)
	struct FIntPoint                              Current_Cell;                                      // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Y_Cell_Max;                                        // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Y_Cell_Min;                                        // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         X_Cell_Max;                                        // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         X_Cell_Min;                                        // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Lower_Right_Corner;                                // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FIntPoint>                      Cells_Used;                                        // 0x0080(0x0010)(Edit, BlueprintVisible)
	class UCanvas*                                Draw_Canvas;                                       // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x00C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AUDS_Cloud_Paint_Container_C*           CallFunc_GetActorOfClass_ReturnValue;              // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_IsNotEmpty_ReturnValue;               // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB[0x5];                                       // 0x00DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EE[0x2];                                       // 0x00EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_SnappedToGrid_ReturnValue;         // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_SnappedToGrid_InGridSize_ImplicitCast; // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target");
static_assert(sizeof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target) == 0x000160, "Wrong size on Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, Cloud_Paint_Container) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::Cloud_Paint_Container' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, Loaded_Cell_Textures) == 0x000008, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::Loaded_Cell_Textures' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, Current_Cell) == 0x000058, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::Current_Cell' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, Y_Cell_Max) == 0x000060, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::Y_Cell_Max' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, Y_Cell_Min) == 0x000064, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::Y_Cell_Min' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, X_Cell_Max) == 0x000068, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::X_Cell_Max' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, X_Cell_Min) == 0x00006C, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::X_Cell_Min' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, Lower_Right_Corner) == 0x000070, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::Lower_Right_Corner' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, Cells_Used) == 0x000080, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::Cells_Used' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, Draw_Canvas) == 0x000090, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::Draw_Canvas' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000098, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x0000A0, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, Temp_int_Variable) == 0x0000A8, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_Add_IntInt_ReturnValue) == 0x0000B8, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, Temp_bool_Variable) == 0x0000BC, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_IsValid_ReturnValue) == 0x0000BD, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000BE, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_Not_PreBool_ReturnValue) == 0x0000BF, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_BooleanAND_ReturnValue) == 0x0000C0, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_K2_SetTimer_ReturnValue) == 0x0000C8, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_GetActorOfClass_ReturnValue) == 0x0000D0, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_IsValid_ReturnValue_1) == 0x0000D8, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_Map_IsNotEmpty_ReturnValue) == 0x0000D9, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_Map_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_BooleanOR_ReturnValue) == 0x0000DA, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_Array_Length_ReturnValue) == 0x0000E8, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_Less_IntInt_ReturnValue) == 0x0000EC, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_IsValid_ReturnValue_2) == 0x0000ED, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x0000F0, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, K2Node_Select_Default) == 0x000100, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x000110, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x000118, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_Vector_SnappedToGrid_ReturnValue) == 0x000130, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_Vector_SnappedToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x000148, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target, CallFunc_Vector_SnappedToGrid_InGridSize_ImplicitCast) == 0x000158, "Member 'Ultra_Dynamic_Sky_C_Update_Painted_Cloud_Coverage_Target::CallFunc_Vector_SnappedToGrid_InGridSize_ImplicitCast' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.World Space to Drawn Target Pixel Space
// 0x00A8 (0x00A8 - 0x0000)
struct Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space final
{
public:
	struct FVector2D                              In;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Out;                                               // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cloud_Coverage_Target_Mapping_Mapping;    // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DVector2D_ReturnValue;      // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space");
static_assert(sizeof(Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space) == 0x0000A8, "Wrong size on Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space");
static_assert(offsetof(Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space, In) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space::In' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space, Out) == 0x000010, "Member 'Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space::Out' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space, CallFunc_Cloud_Coverage_Target_Mapping_Mapping) == 0x000020, "Member 'Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space::CallFunc_Cloud_Coverage_Target_Mapping_Mapping' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000038, "Member 'Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000048, "Member 'Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000050, "Member 'Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space, CallFunc_MakeVector2D_ReturnValue) == 0x000060, "Member 'Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000070, "Member 'Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space, CallFunc_MakeVector2D_ReturnValue_1) == 0x000078, "Member 'Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space, CallFunc_Divide_Vector2DVector2D_ReturnValue) == 0x000088, "Member 'Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space::CallFunc_Divide_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000098, "Member 'Ultra_Dynamic_Sky_C_World_Space_to_Drawn_Target_Pixel_Space::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");

}

