#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ultra_Dynamic_Weather

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UDS_and_UDW_State_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UDS_DLWE_Mode_structs.hpp"
#include "HTGame_structs.hpp"
#include "UDS_TemperatureType_structs.hpp"
#include "UDS_Weather_Display_Names_structs.hpp"
#include "UDS_Project_Mode_structs.hpp"
#include "UDW_CachedProperties_structs.hpp"


namespace SDK::Params
{

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.Add Weather Override Volume to Array
// 0x0010 (0x0010 - 0x0000)
struct Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array final
{
public:
	class AWeather_Override_Volume_C*             Weather_Override_Volume;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array");
static_assert(sizeof(Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array) == 0x000010, "Wrong size on Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array, Weather_Override_Volume) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array::Weather_Override_Volume' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array, CallFunc_Array_Add_ReturnValue) == 0x000008, "Member 'Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array, CallFunc_Array_Contains_ReturnValue) == 0x00000C, "Member 'Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array, CallFunc_Not_PreBool_ReturnValue) == 0x00000D, "Member 'Ultra_Dynamic_Weather_C_Add_Weather_Override_Volume_to_Array::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C. Local Weather
// 0x00A0 (0x00A0 - 0x0000)
struct Ultra_Dynamic_Weather_C__Local_Weather final
{
public:
	class UUDS_Weather_Settings_C*                Target_State_Object;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Test_Location;                                     // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Above_Clouds;                                      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Affecting_Local_Weather;                           // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Previous_Material_Wet;                             // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Previous_Material_Snow;                            // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Previous_Weather_Intensity;                        // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Snow_0;                                            // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Previous_Wind_Intensity;                           // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Previous_Cloud_Coverage;                           // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Distance_from_Spline_Center;                       // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeather_Override_Volume_C*             Current_Volume;                                    // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        Current_Volume_Alpha;                              // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Inserted;                                          // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Priorities;                                        // 0x0080(0x0010)(Edit, BlueprintVisible)
	TArray<class AWeather_Override_Volume_C*>     Filtered_List_of_Volumes;                          // 0x0090(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
};
static_assert(alignof(Ultra_Dynamic_Weather_C__Local_Weather) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_C__Local_Weather");
static_assert(sizeof(Ultra_Dynamic_Weather_C__Local_Weather) == 0x0000A0, "Wrong size on Ultra_Dynamic_Weather_C__Local_Weather");
static_assert(offsetof(Ultra_Dynamic_Weather_C__Local_Weather, Target_State_Object) == 0x000000, "Member 'Ultra_Dynamic_Weather_C__Local_Weather::Target_State_Object' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C__Local_Weather, Test_Location) == 0x000008, "Member 'Ultra_Dynamic_Weather_C__Local_Weather::Test_Location' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C__Local_Weather, Above_Clouds) == 0x000020, "Member 'Ultra_Dynamic_Weather_C__Local_Weather::Above_Clouds' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C__Local_Weather, Affecting_Local_Weather) == 0x000028, "Member 'Ultra_Dynamic_Weather_C__Local_Weather::Affecting_Local_Weather' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C__Local_Weather, Previous_Material_Wet) == 0x000030, "Member 'Ultra_Dynamic_Weather_C__Local_Weather::Previous_Material_Wet' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C__Local_Weather, Previous_Material_Snow) == 0x000038, "Member 'Ultra_Dynamic_Weather_C__Local_Weather::Previous_Material_Snow' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C__Local_Weather, Previous_Weather_Intensity) == 0x000040, "Member 'Ultra_Dynamic_Weather_C__Local_Weather::Previous_Weather_Intensity' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C__Local_Weather, Snow_0) == 0x000048, "Member 'Ultra_Dynamic_Weather_C__Local_Weather::Snow_0' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C__Local_Weather, Previous_Wind_Intensity) == 0x000050, "Member 'Ultra_Dynamic_Weather_C__Local_Weather::Previous_Wind_Intensity' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C__Local_Weather, Previous_Cloud_Coverage) == 0x000058, "Member 'Ultra_Dynamic_Weather_C__Local_Weather::Previous_Cloud_Coverage' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C__Local_Weather, Distance_from_Spline_Center) == 0x000060, "Member 'Ultra_Dynamic_Weather_C__Local_Weather::Distance_from_Spline_Center' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C__Local_Weather, Current_Volume) == 0x000068, "Member 'Ultra_Dynamic_Weather_C__Local_Weather::Current_Volume' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C__Local_Weather, Current_Volume_Alpha) == 0x000070, "Member 'Ultra_Dynamic_Weather_C__Local_Weather::Current_Volume_Alpha' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C__Local_Weather, Inserted) == 0x000078, "Member 'Ultra_Dynamic_Weather_C__Local_Weather::Inserted' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C__Local_Weather, Priorities) == 0x000080, "Member 'Ultra_Dynamic_Weather_C__Local_Weather::Priorities' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C__Local_Weather, Filtered_List_of_Volumes) == 0x000090, "Member 'Ultra_Dynamic_Weather_C__Local_Weather::Filtered_List_of_Volumes' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.Apply Interior Temperature with Occlusion
// 0x0028 (0x0028 - 0x0000)
struct Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion final
{
public:
	double                                        Temp;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Occlusion;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Out;                                               // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion");
static_assert(sizeof(Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion) == 0x000028, "Wrong size on Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion, Temp) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion::Temp' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion, Occlusion) == 0x000008, "Member 'Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion::Occlusion' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion, Out) == 0x000010, "Member 'Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion::Out' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion, CallFunc_Lerp_ReturnValue) == 0x000020, "Member 'Ultra_Dynamic_Weather_C_Apply_Interior_Temperature_with_Occlusion::CallFunc_Lerp_ReturnValue' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.Apply Max to Material Effects
// 0x0058 (0x0058 - 0x0000)
struct Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects final
{
public:
	class UHottaPrimaryDataAsset*                 Weather_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Snow_Coverage;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Wetness;                                           // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Dust_0;                                            // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue_2;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast_1;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast_2;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects");
static_assert(sizeof(Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects) == 0x000058, "Wrong size on Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects, Weather_0) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects::Weather_0' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects, Snow_Coverage) == 0x000008, "Member 'Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects::Snow_Coverage' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects, Wetness) == 0x000010, "Member 'Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects::Wetness' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects, Dust_0) == 0x000018, "Member 'Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects::Dust_0' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects, CallFunc_MapRangeClamped_ReturnValue) == 0x000028, "Member 'Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000030, "Member 'Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects, CallFunc_MapRangeClamped_ReturnValue_2) == 0x000038, "Member 'Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000040, "Member 'Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects, CallFunc_MapRangeClamped_Value_ImplicitCast_1) == 0x000048, "Member 'Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects::CallFunc_MapRangeClamped_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects, CallFunc_MapRangeClamped_Value_ImplicitCast_2) == 0x000050, "Member 'Ultra_Dynamic_Weather_C_Apply_Max_to_Material_Effects::CallFunc_MapRangeClamped_Value_ImplicitCast_2' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.Apply State
// 0x0178 (0x0178 - 0x0000)
struct Ultra_Dynamic_Weather_C_Apply_State final
{
public:
	struct FUDS_and_UDW_State                     State;                                             // 0x0000(0x0178)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_Apply_State) == 0x000001, "Wrong alignment on Ultra_Dynamic_Weather_C_Apply_State");
static_assert(sizeof(Ultra_Dynamic_Weather_C_Apply_State) == 0x000178, "Wrong size on Ultra_Dynamic_Weather_C_Apply_State");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Apply_State, State) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_Apply_State::State' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.BP_OnDrawSingleWeatherMaskBox
// 0x0008 (0x0008 - 0x0000)
struct Ultra_Dynamic_Weather_C_BP_OnDrawSingleWeatherMaskBox final
{
public:
	class AWeatherMaskBox*                        WeatherMaskBox;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_BP_OnDrawSingleWeatherMaskBox) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_C_BP_OnDrawSingleWeatherMaskBox");
static_assert(sizeof(Ultra_Dynamic_Weather_C_BP_OnDrawSingleWeatherMaskBox) == 0x000008, "Wrong size on Ultra_Dynamic_Weather_C_BP_OnDrawSingleWeatherMaskBox");
static_assert(offsetof(Ultra_Dynamic_Weather_C_BP_OnDrawSingleWeatherMaskBox, WeatherMaskBox) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_BP_OnDrawSingleWeatherMaskBox::WeatherMaskBox' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.BP_OnReportRemovalofDrawingActor
// 0x0008 (0x0008 - 0x0000)
struct Ultra_Dynamic_Weather_C_BP_OnReportRemovalofDrawingActor final
{
public:
	class AActor*                                 Obj;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_BP_OnReportRemovalofDrawingActor) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_C_BP_OnReportRemovalofDrawingActor");
static_assert(sizeof(Ultra_Dynamic_Weather_C_BP_OnReportRemovalofDrawingActor) == 0x000008, "Wrong size on Ultra_Dynamic_Weather_C_BP_OnReportRemovalofDrawingActor");
static_assert(offsetof(Ultra_Dynamic_Weather_C_BP_OnReportRemovalofDrawingActor, Obj) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_BP_OnReportRemovalofDrawingActor::Obj' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.BP_UpdateLandRippleEvent
// 0x0020 (0x0020 - 0x0000)
struct Ultra_Dynamic_Weather_C_BP_UpdateLandRippleEvent final
{
public:
	struct FVector                                Pos;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         strength;                                          // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_BP_UpdateLandRippleEvent) == 0x000004, "Wrong alignment on Ultra_Dynamic_Weather_C_BP_UpdateLandRippleEvent");
static_assert(sizeof(Ultra_Dynamic_Weather_C_BP_UpdateLandRippleEvent) == 0x000020, "Wrong size on Ultra_Dynamic_Weather_C_BP_UpdateLandRippleEvent");
static_assert(offsetof(Ultra_Dynamic_Weather_C_BP_UpdateLandRippleEvent, Pos) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_BP_UpdateLandRippleEvent::Pos' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_BP_UpdateLandRippleEvent, Size) == 0x000018, "Member 'Ultra_Dynamic_Weather_C_BP_UpdateLandRippleEvent::Size' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_BP_UpdateLandRippleEvent, strength) == 0x00001C, "Member 'Ultra_Dynamic_Weather_C_BP_UpdateLandRippleEvent::strength' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.BP_UpdateSandDlweEvent
// 0x0024 (0x0024 - 0x0000)
struct Ultra_Dynamic_Weather_C_BP_UpdateSandDlweEvent final
{
public:
	struct FVector                                Pos;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         strength;                                          // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Random;                                            // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_BP_UpdateSandDlweEvent) == 0x000004, "Wrong alignment on Ultra_Dynamic_Weather_C_BP_UpdateSandDlweEvent");
static_assert(sizeof(Ultra_Dynamic_Weather_C_BP_UpdateSandDlweEvent) == 0x000024, "Wrong size on Ultra_Dynamic_Weather_C_BP_UpdateSandDlweEvent");
static_assert(offsetof(Ultra_Dynamic_Weather_C_BP_UpdateSandDlweEvent, Pos) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_BP_UpdateSandDlweEvent::Pos' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_BP_UpdateSandDlweEvent, Size) == 0x000018, "Member 'Ultra_Dynamic_Weather_C_BP_UpdateSandDlweEvent::Size' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_BP_UpdateSandDlweEvent, strength) == 0x00001C, "Member 'Ultra_Dynamic_Weather_C_BP_UpdateSandDlweEvent::strength' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_BP_UpdateSandDlweEvent, Random) == 0x000020, "Member 'Ultra_Dynamic_Weather_C_BP_UpdateSandDlweEvent::Random' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.BP_UpdateWaterRippleEvent
// 0x0020 (0x0020 - 0x0000)
struct Ultra_Dynamic_Weather_C_BP_UpdateWaterRippleEvent final
{
public:
	struct FVector                                Pos;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Size;                                              // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         strength;                                          // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_BP_UpdateWaterRippleEvent) == 0x000004, "Wrong alignment on Ultra_Dynamic_Weather_C_BP_UpdateWaterRippleEvent");
static_assert(sizeof(Ultra_Dynamic_Weather_C_BP_UpdateWaterRippleEvent) == 0x000020, "Wrong size on Ultra_Dynamic_Weather_C_BP_UpdateWaterRippleEvent");
static_assert(offsetof(Ultra_Dynamic_Weather_C_BP_UpdateWaterRippleEvent, Pos) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_BP_UpdateWaterRippleEvent::Pos' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_BP_UpdateWaterRippleEvent, Size) == 0x000018, "Member 'Ultra_Dynamic_Weather_C_BP_UpdateWaterRippleEvent::Size' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_BP_UpdateWaterRippleEvent, strength) == 0x00001C, "Member 'Ultra_Dynamic_Weather_C_BP_UpdateWaterRippleEvent::strength' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.Cache Properties
// 0x0178 (0x0178 - 0x0000)
struct Ultra_Dynamic_Weather_C_Cache_Properties final
{
public:
	double                                        Base_Wind_Volume;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Cached_Material_Snow_Coverage_Change;              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_7;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRenderingMaterialQualityLevel_ReturnValue; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue_1;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Scale_Cache_Period_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_PPWF_Velocity_ReturnValue;                // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRenderingMaterialQualityLevel_ReturnValue_1; // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue_2;                 // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue_3;                 // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SafeDivide_A_ImplicitCast;                // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1; // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2; // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_3; // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_4; // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_5; // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_6; // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_7; // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_8; // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_9; // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_10; // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SafeDivide_A_ImplicitCast_1;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_11; // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_Cache_Properties) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_C_Cache_Properties");
static_assert(sizeof(Ultra_Dynamic_Weather_C_Cache_Properties) == 0x000178, "Wrong size on Ultra_Dynamic_Weather_C_Cache_Properties");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, Base_Wind_Volume) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::Base_Wind_Volume' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, Cached_Material_Snow_Coverage_Change) == 0x000008, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::Cached_Material_Snow_Coverage_Change' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, Temp_int_Variable) == 0x000010, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, Temp_real_Variable) == 0x000018, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, Temp_real_Variable_1) == 0x000020, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, Temp_real_Variable_2) == 0x000028, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, Temp_real_Variable_3) == 0x000030, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, Temp_real_Variable_4) == 0x000038, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, Temp_real_Variable_5) == 0x000040, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, Temp_real_Variable_6) == 0x000048, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, Temp_real_Variable_7) == 0x000050, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_GetRenderingMaterialQualityLevel_ReturnValue) == 0x000058, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_GetRenderingMaterialQualityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_SafeDivide_ReturnValue) == 0x000060, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_SafeDivide_ReturnValue_1) == 0x000068, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_SafeDivide_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_Scale_Cache_Period_ReturnValue) == 0x000070, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_Scale_Cache_Period_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_PPWF_Velocity_ReturnValue) == 0x000078, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_PPWF_Velocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_Add_VectorVector_ReturnValue) == 0x000090, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, Temp_int_Variable_1) == 0x0000A8, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, K2Node_Select_Default) == 0x0000B0, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_GetRenderingMaterialQualityLevel_ReturnValue_1) == 0x0000C0, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_GetRenderingMaterialQualityLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000C8, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, K2Node_Select_Default_1) == 0x0000D0, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000D8, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0000E0, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000E8, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0000F0, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x0000F8, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000100, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000108, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_SafeDivide_ReturnValue_2) == 0x000110, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_SafeDivide_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_SafeDivide_ReturnValue_3) == 0x000118, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_SafeDivide_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000120, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_BooleanAND_ReturnValue) == 0x000128, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_SafeDivide_A_ImplicitCast) == 0x000130, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_SafeDivide_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x000138, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1) == 0x00013C, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2) == 0x000140, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_3) == 0x000144, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_4) == 0x000148, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_5) == 0x00014C, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_6) == 0x000150, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_7) == 0x000154, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_8) == 0x000158, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_8' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_9) == 0x00015C, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_9' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_10) == 0x000160, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_10' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_SafeDivide_A_ImplicitCast_1) == 0x000168, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_SafeDivide_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cache_Properties, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_11) == 0x000170, "Member 'Ultra_Dynamic_Weather_C_Cache_Properties::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast_11' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.Cached Wind RotationEx
// 0x0030 (0x0030 - 0x0000)
struct Ultra_Dynamic_Weather_C_Cached_Wind_RotationEx final
{
public:
	struct FRotator                               Rot;                                               // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_Cached_Wind_RotationEx) == 0x000001, "Wrong alignment on Ultra_Dynamic_Weather_C_Cached_Wind_RotationEx");
static_assert(sizeof(Ultra_Dynamic_Weather_C_Cached_Wind_RotationEx) == 0x000030, "Wrong size on Ultra_Dynamic_Weather_C_Cached_Wind_RotationEx");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cached_Wind_RotationEx, Rot) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_Cached_Wind_RotationEx::Rot' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Cached_Wind_RotationEx, CallFunc_MakeRotator_ReturnValue) == 0x000018, "Member 'Ultra_Dynamic_Weather_C_Cached_Wind_RotationEx::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");

// Function Ultra_Dynamic_Weather.Ultra_Dynamic_Weather_C.Check for DLWE Recenter
// 0x00E8 (0x00E8 - 0x0000)
struct Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter final
{
public:
	bool                                          CallFunc_Does_DLWE_Need_Recentering_Needs_X_Axis_Recenter; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Does_DLWE_Need_Recentering_Needs_Y_Axis_Recenter; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Does_DLWE_Need_Recentering_Needs_X_Axis_Recenter_1; // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Does_DLWE_Need_Recentering_Needs_Y_Axis_Recenter_1; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Does_DLWE_Need_Recentering_Needs_X_Axis_Recenter_2; // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Does_DLWE_Need_Recentering_Needs_Y_Axis_Recenter_2; // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter) == 0x000008, "Wrong alignment on Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter");
static_assert(sizeof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter) == 0x0000E8, "Wrong size on Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter, CallFunc_Does_DLWE_Need_Recentering_Needs_X_Axis_Recenter) == 0x000000, "Member 'Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter::CallFunc_Does_DLWE_Need_Recentering_Needs_X_Axis_Recenter' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter, CallFunc_Does_DLWE_Need_Recentering_Needs_Y_Axis_Recenter) == 0x000001, "Member 'Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter::CallFunc_Does_DLWE_Need_Recentering_Needs_Y_Axis_Recenter' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter, CallFunc_Does_DLWE_Need_Recentering_Needs_X_Axis_Recenter_1) == 0x000002, "Member 'Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter::CallFunc_Does_DLWE_Need_Recentering_Needs_X_Axis_Recenter_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter, CallFunc_Does_DLWE_Need_Recentering_Needs_Y_Axis_Recenter_1) == 0x000003, "Member 'Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter::CallFunc_Does_DLWE_Need_Recentering_Needs_Y_Axis_Recenter_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter, CallFunc_Does_DLWE_Need_Recentering_Needs_X_Axis_Recenter_2) == 0x000005, "Member 'Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter::CallFunc_Does_DLWE_Need_Recentering_Needs_X_Axis_Recenter_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter, CallFunc_Does_DLWE_Need_Recentering_Needs_Y_Axis_Recenter_2) == 0x000006, "Member 'Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter::CallFunc_Does_DLWE_Need_Recentering_Needs_Y_Axis_Recenter_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000007, "Member 'Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter, CallFunc_BreakVector_X) == 0x000010, "Member 'Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter, CallFunc_BreakVector_Y) == 0x000018, "Member 'Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter, CallFunc_BreakVector_Z) == 0x000020, "Member 'Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter, CallFunc_BreakVector_X_1) == 0x000028, "Member 'Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter, CallFunc_BreakVector_Y_1) == 0x000030, "Member 'Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter, CallFunc_BreakVector_Z_1) == 0x000038, "Member 'Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter, CallFunc_BreakVector_X_2) == 0x000040, "Member 'Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter, CallFunc_BreakVector_Y_2) == 0x000048, "Member 'Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter, CallFunc_BreakVector_Z_2) == 0x000050, "Member 'Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter, CallFunc_BreakVector_X_3) == 0x000058, "Member 'Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter, CallFunc_BreakVector_Y_3) == 0x000060, "Member 'Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter, CallFunc_BreakVector_Z_3) == 0x000068, "Member 'Ultra_Dynamic_Weather_C_Check_for_DLWE_Recenter::CallFunc_BreakVector_Z_3' has a wrong offset!");
