#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Updater_P

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Updater_P.Updater_P_C
// 0x39BD9528 (0x39BD9800 - 0x02D8)
class alignas(0x39BD9800) AUpdater_P_C final : public AHTLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ASpotLight*                             SpotLight_0_ExecuteUbergraph_Updater_P_RefProperty; // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASpotLight*                             SpotLight_1_ExecuteUbergraph_Updater_P_RefProperty; // 0x02E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASpotLight*                             SpotLight_2_ExecuteUbergraph_Updater_P_RefProperty; // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASpotLight*                             SpotLight_3_ExecuteUbergraph_Updater_P_RefProperty; // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASpotLight*                             SpotLight_4_ExecuteUbergraph_Updater_P_RefProperty; // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASpotLight*                             SpotLight_9_ExecuteUbergraph_Updater_P_RefProperty; // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ASpotLight*                             SpotLight_8_ExecuteUbergraph_Updater_P_RefProperty; // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Updater_P(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Updater_P_C">();
	}
	static class AUpdater_P_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUpdater_P_C>();
	}
};
static_assert(alignof(AUpdater_P_C) == 0x39BD9800, "Wrong alignment on AUpdater_P_C");
static_assert(sizeof(AUpdater_P_C) == 0x39BD9800, "Wrong size on AUpdater_P_C");
static_assert(offsetof(AUpdater_P_C, UberGraphFrame) == 0x0002D8, "Member 'AUpdater_P_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AUpdater_P_C, SpotLight_0_ExecuteUbergraph_Updater_P_RefProperty) == 0x0002E0, "Member 'AUpdater_P_C::SpotLight_0_ExecuteUbergraph_Updater_P_RefProperty' has a wrong offset!");
static_assert(offsetof(AUpdater_P_C, SpotLight_1_ExecuteUbergraph_Updater_P_RefProperty) == 0x0002E8, "Member 'AUpdater_P_C::SpotLight_1_ExecuteUbergraph_Updater_P_RefProperty' has a wrong offset!");
static_assert(offsetof(AUpdater_P_C, SpotLight_2_ExecuteUbergraph_Updater_P_RefProperty) == 0x0002F0, "Member 'AUpdater_P_C::SpotLight_2_ExecuteUbergraph_Updater_P_RefProperty' has a wrong offset!");
static_assert(offsetof(AUpdater_P_C, SpotLight_3_ExecuteUbergraph_Updater_P_RefProperty) == 0x0002F8, "Member 'AUpdater_P_C::SpotLight_3_ExecuteUbergraph_Updater_P_RefProperty' has a wrong offset!");
static_assert(offsetof(AUpdater_P_C, SpotLight_4_ExecuteUbergraph_Updater_P_RefProperty) == 0x000300, "Member 'AUpdater_P_C::SpotLight_4_ExecuteUbergraph_Updater_P_RefProperty' has a wrong offset!");
static_assert(offsetof(AUpdater_P_C, SpotLight_9_ExecuteUbergraph_Updater_P_RefProperty) == 0x000308, "Member 'AUpdater_P_C::SpotLight_9_ExecuteUbergraph_Updater_P_RefProperty' has a wrong offset!");
static_assert(offsetof(AUpdater_P_C, SpotLight_8_ExecuteUbergraph_Updater_P_RefProperty) == 0x000310, "Member 'AUpdater_P_C::SpotLight_8_ExecuteUbergraph_Updater_P_RefProperty' has a wrong offset!");

}

