#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BoundActionButton_CloseWhite

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function W_BoundActionButton_CloseWhite.W_BoundActionButton_CloseWhite_C.Event Input Method Changed
// 0x0001 (0x0001 - 0x0000)
struct W_BoundActionButton_CloseWhite_C_Event_Input_Method_Changed final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BoundActionButton_CloseWhite_C_Event_Input_Method_Changed) == 0x000001, "Wrong alignment on W_BoundActionButton_CloseWhite_C_Event_Input_Method_Changed");
static_assert(sizeof(W_BoundActionButton_CloseWhite_C_Event_Input_Method_Changed) == 0x000001, "Wrong size on W_BoundActionButton_CloseWhite_C_Event_Input_Method_Changed");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_Event_Input_Method_Changed, bNewInputType) == 0x000000, "Member 'W_BoundActionButton_CloseWhite_C_Event_Input_Method_Changed::bNewInputType' has a wrong offset!");

// Function W_BoundActionButton_CloseWhite.W_BoundActionButton_CloseWhite_C.ExecuteUbergraph_W_BoundActionButton_CloseWhite
// 0x0070 (0x0070 - 0x0000)
struct W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_1;          // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue_1;     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite) == 0x000008, "Wrong alignment on W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite");
static_assert(sizeof(W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite) == 0x000070, "Wrong size on W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite, EntryPoint) == 0x000000, "Member 'W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000010, "Member 'W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000028, "Member 'W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000030, "Member 'W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite, K2Node_CustomEvent_bNewInputType) == 0x000038, "Member 'W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite, K2Node_Event_IsDesignTime) == 0x000039, "Member 'W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000050, "Member 'W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite, CallFunc_GetDynamicFontMaterial_ReturnValue_1) == 0x000058, "Member 'W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite::CallFunc_GetDynamicFontMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000060, "Member 'W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite, CallFunc_GetCurrentInputType_ReturnValue) == 0x000068, "Member 'W_BoundActionButton_CloseWhite_C_ExecuteUbergraph_W_BoundActionButton_CloseWhite::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");

// Function W_BoundActionButton_CloseWhite.W_BoundActionButton_CloseWhite_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_BoundActionButton_CloseWhite_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_BoundActionButton_CloseWhite_C_PreConstruct) == 0x000001, "Wrong alignment on W_BoundActionButton_CloseWhite_C_PreConstruct");
static_assert(sizeof(W_BoundActionButton_CloseWhite_C_PreConstruct) == 0x000001, "Wrong size on W_BoundActionButton_CloseWhite_C_PreConstruct");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_BoundActionButton_CloseWhite_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_BoundActionButton_CloseWhite.W_BoundActionButton_CloseWhite_C.ResetMaterials
// 0x0020 (0x0020 - 0x0000)
struct W_BoundActionButton_CloseWhite_C_ResetMaterials final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(W_BoundActionButton_CloseWhite_C_ResetMaterials) == 0x000008, "Wrong alignment on W_BoundActionButton_CloseWhite_C_ResetMaterials");
static_assert(sizeof(W_BoundActionButton_CloseWhite_C_ResetMaterials) == 0x000020, "Wrong size on W_BoundActionButton_CloseWhite_C_ResetMaterials");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_ResetMaterials, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'W_BoundActionButton_CloseWhite_C_ResetMaterials::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_ResetMaterials, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000008, "Member 'W_BoundActionButton_CloseWhite_C_ResetMaterials::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_ResetMaterials, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'W_BoundActionButton_CloseWhite_C_ResetMaterials::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function W_BoundActionButton_CloseWhite.W_BoundActionButton_CloseWhite_C.UpdateSyleOnInputMethod
// 0x00C0 (0x00C0 - 0x0000)
struct W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod final
{
public:
	ECommonInputType                              InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushDrawType                           Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushDrawType                           Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateBrushDrawType                           K2Node_Select_Default_1;                           // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0010(0x00B0)()
};
static_assert(alignof(W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod) == 0x000001, "Wrong alignment on W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod");
static_assert(sizeof(W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod) == 0x0000C0, "Wrong size on W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod, InputType) == 0x000000, "Member 'W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod::InputType' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod, Temp_bool_Variable) == 0x000001, "Member 'W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod, Temp_byte_Variable) == 0x000002, "Member 'W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod, Temp_byte_Variable_1) == 0x000003, "Member 'W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod, Temp_byte_Variable_2) == 0x000004, "Member 'W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod, Temp_bool_Variable_1) == 0x000005, "Member 'W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod, Temp_bool_Variable_2) == 0x000006, "Member 'W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod, Temp_bool_Variable_3) == 0x000007, "Member 'W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod, Temp_bool_Variable_4) == 0x000008, "Member 'W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod, K2Node_Select_Default) == 0x000009, "Member 'W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod, K2Node_Select_Default_1) == 0x00000A, "Member 'W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod, K2Node_MakeStruct_SlateBrush) == 0x000010, "Member 'W_BoundActionButton_CloseWhite_C_UpdateSyleOnInputMethod::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

}

