#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_HTButton_Menu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_HTButton_Menu.W_HTButton_Menu_C.BP_GetNormalPhoto
// 0x0018 (0x0018 - 0x0000)
struct W_HTButton_Menu_C_BP_GetNormalPhoto final
{
public:
	class UTexture2D*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetBrushResourceAsTexture2D_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetBrushResourceAsTexture2D_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HTButton_Menu_C_BP_GetNormalPhoto) == 0x000008, "Wrong alignment on W_HTButton_Menu_C_BP_GetNormalPhoto");
static_assert(sizeof(W_HTButton_Menu_C_BP_GetNormalPhoto) == 0x000018, "Wrong size on W_HTButton_Menu_C_BP_GetNormalPhoto");
static_assert(offsetof(W_HTButton_Menu_C_BP_GetNormalPhoto, ReturnValue) == 0x000000, "Member 'W_HTButton_Menu_C_BP_GetNormalPhoto::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_BP_GetNormalPhoto, CallFunc_GetBrushResourceAsTexture2D_ReturnValue) == 0x000008, "Member 'W_HTButton_Menu_C_BP_GetNormalPhoto::CallFunc_GetBrushResourceAsTexture2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_BP_GetNormalPhoto, CallFunc_GetBrushResourceAsTexture2D_ReturnValue_1) == 0x000010, "Member 'W_HTButton_Menu_C_BP_GetNormalPhoto::CallFunc_GetBrushResourceAsTexture2D_ReturnValue_1' has a wrong offset!");

// Function W_HTButton_Menu.W_HTButton_Menu_C.BP_SetNormalImage
// 0x00B0 (0x00B0 - 0x0000)
struct W_HTButton_Menu_C_BP_SetNormalImage final
{
public:
	struct FSlateBrush                            Img;                                               // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_HTButton_Menu_C_BP_SetNormalImage) == 0x000001, "Wrong alignment on W_HTButton_Menu_C_BP_SetNormalImage");
static_assert(sizeof(W_HTButton_Menu_C_BP_SetNormalImage) == 0x0000B0, "Wrong size on W_HTButton_Menu_C_BP_SetNormalImage");
static_assert(offsetof(W_HTButton_Menu_C_BP_SetNormalImage, Img) == 0x000000, "Member 'W_HTButton_Menu_C_BP_SetNormalImage::Img' has a wrong offset!");

// Function W_HTButton_Menu.W_HTButton_Menu_C.BP_SetNormalImageByTexture2D
// 0x0008 (0x0008 - 0x0000)
struct W_HTButton_Menu_C_BP_SetNormalImageByTexture2D final
{
public:
	class UTexture2D*                             normalImg;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HTButton_Menu_C_BP_SetNormalImageByTexture2D) == 0x000008, "Wrong alignment on W_HTButton_Menu_C_BP_SetNormalImageByTexture2D");
static_assert(sizeof(W_HTButton_Menu_C_BP_SetNormalImageByTexture2D) == 0x000008, "Wrong size on W_HTButton_Menu_C_BP_SetNormalImageByTexture2D");
static_assert(offsetof(W_HTButton_Menu_C_BP_SetNormalImageByTexture2D, normalImg) == 0x000000, "Member 'W_HTButton_Menu_C_BP_SetNormalImageByTexture2D::normalImg' has a wrong offset!");

// Function W_HTButton_Menu.W_HTButton_Menu_C.ExecuteUbergraph_W_HTButton_Menu
// 0x0108 (0x0108 - 0x0000)
struct W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue_1;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_InText;                               // 0x0028(0x0010)(ConstParm)
	class UTexture2D*                             K2Node_Event_normalImg;                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_Event_Img;                                  // 0x0040(0x00B0)(ConstParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimation_ReturnValue;                // 0x00F4(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_HasFocus_ReturnValue;                     // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu) == 0x000008, "Wrong alignment on W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu");
static_assert(sizeof(W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu) == 0x000108, "Wrong size on W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu");
static_assert(offsetof(W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu, EntryPoint) == 0x000000, "Member 'W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000010, "Member 'W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu, CallFunc_GetDynamicFontMaterial_ReturnValue_1) == 0x000018, "Member 'W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu::CallFunc_GetDynamicFontMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000020, "Member 'W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu, K2Node_Event_InText) == 0x000028, "Member 'W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu::K2Node_Event_InText' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu, K2Node_Event_normalImg) == 0x000038, "Member 'W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu::K2Node_Event_normalImg' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu, K2Node_Event_Img) == 0x000040, "Member 'W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu::K2Node_Event_Img' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu, K2Node_Event_IsDesignTime) == 0x0000F0, "Member 'W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu, CallFunc_PlayAnimation_ReturnValue) == 0x0000F4, "Member 'W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu, CallFunc_HasFocus_ReturnValue) == 0x000104, "Member 'W_HTButton_Menu_C_ExecuteUbergraph_W_HTButton_Menu::CallFunc_HasFocus_ReturnValue' has a wrong offset!");

// Function W_HTButton_Menu.W_HTButton_Menu_C.GetPressProgress
// 0x0008 (0x0008 - 0x0000)
struct W_HTButton_Menu_C_GetPressProgress final
{
public:
	double                                        Progress;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HTButton_Menu_C_GetPressProgress) == 0x000008, "Wrong alignment on W_HTButton_Menu_C_GetPressProgress");
static_assert(sizeof(W_HTButton_Menu_C_GetPressProgress) == 0x000008, "Wrong size on W_HTButton_Menu_C_GetPressProgress");
static_assert(offsetof(W_HTButton_Menu_C_GetPressProgress, Progress) == 0x000000, "Member 'W_HTButton_Menu_C_GetPressProgress::Progress' has a wrong offset!");

// Function W_HTButton_Menu.W_HTButton_Menu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_HTButton_Menu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HTButton_Menu_C_PreConstruct) == 0x000001, "Wrong alignment on W_HTButton_Menu_C_PreConstruct");
static_assert(sizeof(W_HTButton_Menu_C_PreConstruct) == 0x000001, "Wrong size on W_HTButton_Menu_C_PreConstruct");
static_assert(offsetof(W_HTButton_Menu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_HTButton_Menu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_HTButton_Menu.W_HTButton_Menu_C.ResetMaterials
// 0x0018 (0x0018 - 0x0000)
struct W_HTButton_Menu_C_ResetMaterials final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HTButton_Menu_C_ResetMaterials) == 0x000008, "Wrong alignment on W_HTButton_Menu_C_ResetMaterials");
static_assert(sizeof(W_HTButton_Menu_C_ResetMaterials) == 0x000018, "Wrong size on W_HTButton_Menu_C_ResetMaterials");
static_assert(offsetof(W_HTButton_Menu_C_ResetMaterials, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000000, "Member 'W_HTButton_Menu_C_ResetMaterials::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_ResetMaterials, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'W_HTButton_Menu_C_ResetMaterials::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_ResetMaterials, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'W_HTButton_Menu_C_ResetMaterials::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_ResetMaterials, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'W_HTButton_Menu_C_ResetMaterials::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function W_HTButton_Menu.W_HTButton_Menu_C.SetBrush
// 0x0178 (0x0178 - 0x0000)
struct W_HTButton_Menu_C_SetBrush final
{
public:
	struct FSlateBrush                            InBrush;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FSlateBrush                            CurBrush;                                          // 0x00B0(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UMaterialInterface*                     CallFunc_GetBrushResourceAsMaterial_ReturnValue;   // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetBrushResourceAsTexture2D_ReturnValue;  // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HTButton_Menu_C_SetBrush) == 0x000008, "Wrong alignment on W_HTButton_Menu_C_SetBrush");
static_assert(sizeof(W_HTButton_Menu_C_SetBrush) == 0x000178, "Wrong size on W_HTButton_Menu_C_SetBrush");
static_assert(offsetof(W_HTButton_Menu_C_SetBrush, InBrush) == 0x000000, "Member 'W_HTButton_Menu_C_SetBrush::InBrush' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_SetBrush, CurBrush) == 0x0000B0, "Member 'W_HTButton_Menu_C_SetBrush::CurBrush' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_SetBrush, CallFunc_GetBrushResourceAsMaterial_ReturnValue) == 0x000160, "Member 'W_HTButton_Menu_C_SetBrush::CallFunc_GetBrushResourceAsMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_SetBrush, CallFunc_GetBrushResourceAsTexture2D_ReturnValue) == 0x000168, "Member 'W_HTButton_Menu_C_SetBrush::CallFunc_GetBrushResourceAsTexture2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_SetBrush, CallFunc_IsValid_ReturnValue) == 0x000170, "Member 'W_HTButton_Menu_C_SetBrush::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_SetBrush, CallFunc_IsValid_ReturnValue_1) == 0x000171, "Member 'W_HTButton_Menu_C_SetBrush::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function W_HTButton_Menu.W_HTButton_Menu_C.UpdateButtonStyles
// 0x00C8 (0x00C8 - 0x0000)
struct W_HTButton_Menu_C_UpdateButtonStyles final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetSwitcherSlot*                    CallFunc_SlotAsWidgetSwitcherSlot_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x0068(0x0038)(NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_MakeStruct_Bottom_ImplicitCast;             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Top_ImplicitCast;                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Right_ImplicitCast;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Left_ImplicitCast_1;             // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_Right_ImplicitCast_1;            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MakeVector2D_X_ImplicitCast;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HTButton_Menu_C_UpdateButtonStyles) == 0x000008, "Wrong alignment on W_HTButton_Menu_C_UpdateButtonStyles");
static_assert(sizeof(W_HTButton_Menu_C_UpdateButtonStyles) == 0x0000C8, "Wrong size on W_HTButton_Menu_C_UpdateButtonStyles");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, Temp_bool_Variable) == 0x000000, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, Temp_byte_Variable) == 0x000001, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, Temp_byte_Variable_1) == 0x000002, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, Temp_bool_Variable_1) == 0x000003, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, Temp_byte_Variable_2) == 0x000004, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, Temp_byte_Variable_3) == 0x000005, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, Temp_real_Variable) == 0x000008, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, Temp_real_Variable_1) == 0x00000C, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, Temp_bool_Variable_2) == 0x000010, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, CallFunc_IsValid_ReturnValue_1) == 0x000012, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, CallFunc_SlotAsWidgetSwitcherSlot_ReturnValue) == 0x000018, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::CallFunc_SlotAsWidgetSwitcherSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, K2Node_MakeStruct_Margin) == 0x000020, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, K2Node_MakeStruct_Margin_1) == 0x000030, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, CallFunc_IsValid_ReturnValue_2) == 0x000040, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, K2Node_Select_Default) == 0x000044, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000048, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, CallFunc_MakeVector2D_ReturnValue) == 0x000050, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, CallFunc_IsValid_ReturnValue_3) == 0x000060, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, K2Node_MakeStruct_WidgetTransform) == 0x000068, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, K2Node_Select_Default_1) == 0x0000A0, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, K2Node_Select_Default_2) == 0x0000A1, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, K2Node_MakeStruct_Bottom_ImplicitCast) == 0x0000A4, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::K2Node_MakeStruct_Bottom_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, K2Node_MakeStruct_Top_ImplicitCast) == 0x0000A8, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::K2Node_MakeStruct_Top_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, K2Node_MakeStruct_Left_ImplicitCast) == 0x0000AC, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::K2Node_MakeStruct_Left_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, K2Node_MakeStruct_Right_ImplicitCast) == 0x0000B0, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::K2Node_MakeStruct_Right_ImplicitCast' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, K2Node_MakeStruct_Left_ImplicitCast_1) == 0x0000B4, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::K2Node_MakeStruct_Left_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, K2Node_MakeStruct_Right_ImplicitCast_1) == 0x0000B8, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::K2Node_MakeStruct_Right_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonStyles, CallFunc_MakeVector2D_X_ImplicitCast) == 0x0000C0, "Member 'W_HTButton_Menu_C_UpdateButtonStyles::CallFunc_MakeVector2D_X_ImplicitCast' has a wrong offset!");

// Function W_HTButton_Menu.W_HTButton_Menu_C.UpdateButtonText
// 0x0010 (0x0010 - 0x0000)
struct W_HTButton_Menu_C_UpdateButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_HTButton_Menu_C_UpdateButtonText) == 0x000008, "Wrong alignment on W_HTButton_Menu_C_UpdateButtonText");
static_assert(sizeof(W_HTButton_Menu_C_UpdateButtonText) == 0x000010, "Wrong size on W_HTButton_Menu_C_UpdateButtonText");
static_assert(offsetof(W_HTButton_Menu_C_UpdateButtonText, InText) == 0x000000, "Member 'W_HTButton_Menu_C_UpdateButtonText::InText' has a wrong offset!");

}

