#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_HTButton_Skill_M

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_HTButton_Skill_M.W_HTButton_Skill_M_C.BP_GetNormalPhoto
// 0x0018 (0x0018 - 0x0000)
struct W_HTButton_Skill_M_C_BP_GetNormalPhoto final
{
public:
	class UTexture2D*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetBrushResourceAsTexture2D_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetBrushResourceAsTexture2D_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HTButton_Skill_M_C_BP_GetNormalPhoto) == 0x000008, "Wrong alignment on W_HTButton_Skill_M_C_BP_GetNormalPhoto");
static_assert(sizeof(W_HTButton_Skill_M_C_BP_GetNormalPhoto) == 0x000018, "Wrong size on W_HTButton_Skill_M_C_BP_GetNormalPhoto");
static_assert(offsetof(W_HTButton_Skill_M_C_BP_GetNormalPhoto, ReturnValue) == 0x000000, "Member 'W_HTButton_Skill_M_C_BP_GetNormalPhoto::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Skill_M_C_BP_GetNormalPhoto, CallFunc_GetBrushResourceAsTexture2D_ReturnValue) == 0x000008, "Member 'W_HTButton_Skill_M_C_BP_GetNormalPhoto::CallFunc_GetBrushResourceAsTexture2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Skill_M_C_BP_GetNormalPhoto, CallFunc_GetBrushResourceAsTexture2D_ReturnValue_1) == 0x000010, "Member 'W_HTButton_Skill_M_C_BP_GetNormalPhoto::CallFunc_GetBrushResourceAsTexture2D_ReturnValue_1' has a wrong offset!");

// Function W_HTButton_Skill_M.W_HTButton_Skill_M_C.BP_SetNormalImage
// 0x00B0 (0x00B0 - 0x0000)
struct W_HTButton_Skill_M_C_BP_SetNormalImage final
{
public:
	struct FSlateBrush                            Img;                                               // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_HTButton_Skill_M_C_BP_SetNormalImage) == 0x000001, "Wrong alignment on W_HTButton_Skill_M_C_BP_SetNormalImage");
static_assert(sizeof(W_HTButton_Skill_M_C_BP_SetNormalImage) == 0x0000B0, "Wrong size on W_HTButton_Skill_M_C_BP_SetNormalImage");
static_assert(offsetof(W_HTButton_Skill_M_C_BP_SetNormalImage, Img) == 0x000000, "Member 'W_HTButton_Skill_M_C_BP_SetNormalImage::Img' has a wrong offset!");

// Function W_HTButton_Skill_M.W_HTButton_Skill_M_C.BP_SetNormalImageByTexture2D
// 0x0008 (0x0008 - 0x0000)
struct W_HTButton_Skill_M_C_BP_SetNormalImageByTexture2D final
{
public:
	class UTexture2D*                             normalImg;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HTButton_Skill_M_C_BP_SetNormalImageByTexture2D) == 0x000008, "Wrong alignment on W_HTButton_Skill_M_C_BP_SetNormalImageByTexture2D");
static_assert(sizeof(W_HTButton_Skill_M_C_BP_SetNormalImageByTexture2D) == 0x000008, "Wrong size on W_HTButton_Skill_M_C_BP_SetNormalImageByTexture2D");
static_assert(offsetof(W_HTButton_Skill_M_C_BP_SetNormalImageByTexture2D, normalImg) == 0x000000, "Member 'W_HTButton_Skill_M_C_BP_SetNormalImageByTexture2D::normalImg' has a wrong offset!");

// Function W_HTButton_Skill_M.W_HTButton_Skill_M_C.ExecuteUbergraph_W_HTButton_Skill_M
// 0x0108 (0x0108 - 0x0000)
struct W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0018(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Event_normalImg;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_Event_Img;                                  // 0x0050(0x00B0)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M) == 0x000008, "Wrong alignment on W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M");
static_assert(sizeof(W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M) == 0x000108, "Wrong size on W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M");
static_assert(offsetof(W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M, EntryPoint) == 0x000000, "Member 'W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M, K2Node_Event_IsDesignTime) == 0x000004, "Member 'W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000018, "Member 'W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000030, "Member 'W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000038, "Member 'W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M, K2Node_Event_normalImg) == 0x000040, "Member 'W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M::K2Node_Event_normalImg' has a wrong offset!");
static_assert(offsetof(W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M, K2Node_Event_Img) == 0x000050, "Member 'W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M::K2Node_Event_Img' has a wrong offset!");
static_assert(offsetof(W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M, CallFunc_IsValid_ReturnValue_2) == 0x000100, "Member 'W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M, CallFunc_IsValid_ReturnValue_3) == 0x000101, "Member 'W_HTButton_Skill_M_C_ExecuteUbergraph_W_HTButton_Skill_M::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function W_HTButton_Skill_M.W_HTButton_Skill_M_C.GetPressProgress
// 0x0008 (0x0008 - 0x0000)
struct W_HTButton_Skill_M_C_GetPressProgress final
{
public:
	double                                        Progress;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HTButton_Skill_M_C_GetPressProgress) == 0x000008, "Wrong alignment on W_HTButton_Skill_M_C_GetPressProgress");
static_assert(sizeof(W_HTButton_Skill_M_C_GetPressProgress) == 0x000008, "Wrong size on W_HTButton_Skill_M_C_GetPressProgress");
static_assert(offsetof(W_HTButton_Skill_M_C_GetPressProgress, Progress) == 0x000000, "Member 'W_HTButton_Skill_M_C_GetPressProgress::Progress' has a wrong offset!");

// Function W_HTButton_Skill_M.W_HTButton_Skill_M_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_HTButton_Skill_M_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HTButton_Skill_M_C_PreConstruct) == 0x000001, "Wrong alignment on W_HTButton_Skill_M_C_PreConstruct");
static_assert(sizeof(W_HTButton_Skill_M_C_PreConstruct) == 0x000001, "Wrong size on W_HTButton_Skill_M_C_PreConstruct");
static_assert(offsetof(W_HTButton_Skill_M_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_HTButton_Skill_M_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_HTButton_Skill_M.W_HTButton_Skill_M_C.SetBrush
// 0x0178 (0x0178 - 0x0000)
struct W_HTButton_Skill_M_C_SetBrush final
{
public:
	struct FSlateBrush                            InBrush;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FSlateBrush                            CurBrush;                                          // 0x00B0(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UMaterialInterface*                     CallFunc_GetBrushResourceAsMaterial_ReturnValue;   // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetBrushResourceAsTexture2D_ReturnValue;  // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HTButton_Skill_M_C_SetBrush) == 0x000008, "Wrong alignment on W_HTButton_Skill_M_C_SetBrush");
static_assert(sizeof(W_HTButton_Skill_M_C_SetBrush) == 0x000178, "Wrong size on W_HTButton_Skill_M_C_SetBrush");
static_assert(offsetof(W_HTButton_Skill_M_C_SetBrush, InBrush) == 0x000000, "Member 'W_HTButton_Skill_M_C_SetBrush::InBrush' has a wrong offset!");
static_assert(offsetof(W_HTButton_Skill_M_C_SetBrush, CurBrush) == 0x0000B0, "Member 'W_HTButton_Skill_M_C_SetBrush::CurBrush' has a wrong offset!");
static_assert(offsetof(W_HTButton_Skill_M_C_SetBrush, CallFunc_GetBrushResourceAsMaterial_ReturnValue) == 0x000160, "Member 'W_HTButton_Skill_M_C_SetBrush::CallFunc_GetBrushResourceAsMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Skill_M_C_SetBrush, CallFunc_GetBrushResourceAsTexture2D_ReturnValue) == 0x000168, "Member 'W_HTButton_Skill_M_C_SetBrush::CallFunc_GetBrushResourceAsTexture2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Skill_M_C_SetBrush, CallFunc_IsValid_ReturnValue) == 0x000170, "Member 'W_HTButton_Skill_M_C_SetBrush::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_HTButton_Skill_M_C_SetBrush, CallFunc_IsValid_ReturnValue_1) == 0x000171, "Member 'W_HTButton_Skill_M_C_SetBrush::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function W_HTButton_Skill_M.W_HTButton_Skill_M_C.UpdateButtonStyles
// 0x0001 (0x0001 - 0x0000)
struct W_HTButton_Skill_M_C_UpdateButtonStyles final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_HTButton_Skill_M_C_UpdateButtonStyles) == 0x000001, "Wrong alignment on W_HTButton_Skill_M_C_UpdateButtonStyles");
static_assert(sizeof(W_HTButton_Skill_M_C_UpdateButtonStyles) == 0x000001, "Wrong size on W_HTButton_Skill_M_C_UpdateButtonStyles");
static_assert(offsetof(W_HTButton_Skill_M_C_UpdateButtonStyles, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'W_HTButton_Skill_M_C_UpdateButtonStyles::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

