#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_GamepadTipsHolder

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WB_GamepadTipsHolder.WB_GamepadTipsHolder_C.ExecuteUbergraph_WB_GamepadTipsHolder
// 0x0054 (0x0054 - 0x0000)
struct WB_GamepadTipsHolder_C_ExecuteUbergraph_WB_GamepadTipsHolder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x0008(0x0038)(NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetAnimationHandle                 CallFunc_PlayAnimationForward_ReturnValue;         // 0x0044(0x0010)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WB_GamepadTipsHolder_C_ExecuteUbergraph_WB_GamepadTipsHolder) == 0x000004, "Wrong alignment on WB_GamepadTipsHolder_C_ExecuteUbergraph_WB_GamepadTipsHolder");
static_assert(sizeof(WB_GamepadTipsHolder_C_ExecuteUbergraph_WB_GamepadTipsHolder) == 0x000054, "Wrong size on WB_GamepadTipsHolder_C_ExecuteUbergraph_WB_GamepadTipsHolder");
static_assert(offsetof(WB_GamepadTipsHolder_C_ExecuteUbergraph_WB_GamepadTipsHolder, EntryPoint) == 0x000000, "Member 'WB_GamepadTipsHolder_C_ExecuteUbergraph_WB_GamepadTipsHolder::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_GamepadTipsHolder_C_ExecuteUbergraph_WB_GamepadTipsHolder, CallFunc_IsMobilePlatform_ReturnValue) == 0x000004, "Member 'WB_GamepadTipsHolder_C_ExecuteUbergraph_WB_GamepadTipsHolder::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GamepadTipsHolder_C_ExecuteUbergraph_WB_GamepadTipsHolder, K2Node_MakeStruct_WidgetTransform) == 0x000008, "Member 'WB_GamepadTipsHolder_C_ExecuteUbergraph_WB_GamepadTipsHolder::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");
static_assert(offsetof(WB_GamepadTipsHolder_C_ExecuteUbergraph_WB_GamepadTipsHolder, K2Node_Event_IsDesignTime) == 0x000040, "Member 'WB_GamepadTipsHolder_C_ExecuteUbergraph_WB_GamepadTipsHolder::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_GamepadTipsHolder_C_ExecuteUbergraph_WB_GamepadTipsHolder, CallFunc_PlayAnimationForward_ReturnValue) == 0x000044, "Member 'WB_GamepadTipsHolder_C_ExecuteUbergraph_WB_GamepadTipsHolder::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WB_GamepadTipsHolder.WB_GamepadTipsHolder_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_GamepadTipsHolder_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_GamepadTipsHolder_C_PreConstruct) == 0x000001, "Wrong alignment on WB_GamepadTipsHolder_C_PreConstruct");
static_assert(sizeof(WB_GamepadTipsHolder_C_PreConstruct) == 0x000001, "Wrong size on WB_GamepadTipsHolder_C_PreConstruct");
static_assert(offsetof(WB_GamepadTipsHolder_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_GamepadTipsHolder_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

