#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_GamepadKeysTips

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_GamepadKeysTips.WB_GamepadKeysTips_C
// 0x159DE8E8 (0x159DF000 - 0x0718)
class alignas(0x159DF000) UWB_GamepadKeysTips_C final : public UHTUI_GamepadKeysTips
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0718(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               SizeBox_0;                                         // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBackground;                                   // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       OpenAnim;                                          // 0x0730(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CloseAnim;                                         // 0x0738(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnKeysTipsRegenerated();
	void BP_OnTipsActivated();
	void BP_OnTipsDeactivated();
	void ExecuteUbergraph_WB_GamepadKeysTips(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_GamepadKeysTips_C">();
	}
	static class UWB_GamepadKeysTips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_GamepadKeysTips_C>();
	}
};
static_assert(alignof(UWB_GamepadKeysTips_C) == 0x159DF000, "Wrong alignment on UWB_GamepadKeysTips_C");
static_assert(sizeof(UWB_GamepadKeysTips_C) == 0x159DF000, "Wrong size on UWB_GamepadKeysTips_C");
static_assert(offsetof(UWB_GamepadKeysTips_C, UberGraphFrame) == 0x000718, "Member 'UWB_GamepadKeysTips_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_GamepadKeysTips_C, SizeBox_0) == 0x000720, "Member 'UWB_GamepadKeysTips_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UWB_GamepadKeysTips_C, ImageBackground) == 0x000728, "Member 'UWB_GamepadKeysTips_C::ImageBackground' has a wrong offset!");
static_assert(offsetof(UWB_GamepadKeysTips_C, OpenAnim) == 0x000730, "Member 'UWB_GamepadKeysTips_C::OpenAnim' has a wrong offset!");
static_assert(offsetof(UWB_GamepadKeysTips_C, CloseAnim) == 0x000738, "Member 'UWB_GamepadKeysTips_C::CloseAnim' has a wrong offset!");

}

