#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weather_Mask_Projection_Box

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UDS_DLWE_Mode_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Weather_Mask_Projection_Box.Weather_Mask_Projection_Box_C
// 0x39BD94B0 (0x39BD9800 - 0x0350)
class alignas(0x39BD9800) AWeather_Mask_Projection_Box_C final : public AWeatherMaskBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Root;                                              // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 Depth_Render_Target;                               // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        _Rain;                                             // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Mask_Wetness;                                      // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Blur_Radius;                                       // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                              Center_Location;                                   // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Max_Distance;                                      // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Capture_Pixel_Size;                                // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Exclude_Actors_from_Occlusion;                     // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn)
	double                                        Top_Height;                                        // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseOpcityMask;                                     // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OpcityMaskScale;                                   // 0x03D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Brush_Scale_OpcityMask;                            // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              OpcityMaskBrush_Location;                          // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Brush_MID_OpcityMask;                              // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          EffectMask;                                        // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OpenDebug;                                         // 0x0419(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void ConstructionInit();
	void ExecuteUbergraph_Weather_Mask_Projection_Box(int32 EntryPoint);
	void Force_Update();
	void GetBoxBottomHeight(double* BottomHeight_0);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Recycle_Render_Target();
	void ResetBox();
	void Test_Point_Occlusion(const struct FVector& Location, EUDS_DLWE_Mode Mode, bool* In_Volume, double* Occlusion);
	void Update_Capture();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Weather_Mask_Projection_Box_C">();
	}
	static class AWeather_Mask_Projection_Box_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeather_Mask_Projection_Box_C>();
	}
};
static_assert(alignof(AWeather_Mask_Projection_Box_C) == 0x39BD9800, "Wrong alignment on AWeather_Mask_Projection_Box_C");
static_assert(sizeof(AWeather_Mask_Projection_Box_C) == 0x39BD9800, "Wrong size on AWeather_Mask_Projection_Box_C");
static_assert(offsetof(AWeather_Mask_Projection_Box_C, UberGraphFrame) == 0x000350, "Member 'AWeather_Mask_Projection_Box_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWeather_Mask_Projection_Box_C, Billboard) == 0x000358, "Member 'AWeather_Mask_Projection_Box_C::Billboard' has a wrong offset!");
static_assert(offsetof(AWeather_Mask_Projection_Box_C, Box) == 0x000360, "Member 'AWeather_Mask_Projection_Box_C::Box' has a wrong offset!");
static_assert(offsetof(AWeather_Mask_Projection_Box_C, SceneCaptureComponent2D) == 0x000368, "Member 'AWeather_Mask_Projection_Box_C::SceneCaptureComponent2D' has a wrong offset!");
static_assert(offsetof(AWeather_Mask_Projection_Box_C, Root) == 0x000370, "Member 'AWeather_Mask_Projection_Box_C::Root' has a wrong offset!");
static_assert(offsetof(AWeather_Mask_Projection_Box_C, Depth_Render_Target) == 0x000378, "Member 'AWeather_Mask_Projection_Box_C::Depth_Render_Target' has a wrong offset!");
static_assert(offsetof(AWeather_Mask_Projection_Box_C, _Rain) == 0x000380, "Member 'AWeather_Mask_Projection_Box_C::_Rain' has a wrong offset!");
static_assert(offsetof(AWeather_Mask_Projection_Box_C, Mask_Wetness) == 0x000388, "Member 'AWeather_Mask_Projection_Box_C::Mask_Wetness' has a wrong offset!");
static_assert(offsetof(AWeather_Mask_Projection_Box_C, Blur_Radius) == 0x000390, "Member 'AWeather_Mask_Projection_Box_C::Blur_Radius' has a wrong offset!");
static_assert(offsetof(AWeather_Mask_Projection_Box_C, Center_Location) == 0x000398, "Member 'AWeather_Mask_Projection_Box_C::Center_Location' has a wrong offset!");
static_assert(offsetof(AWeather_Mask_Projection_Box_C, Max_Distance) == 0x0003A8, "Member 'AWeather_Mask_Projection_Box_C::Max_Distance' has a wrong offset!");
static_assert(offsetof(AWeather_Mask_Projection_Box_C, Capture_Pixel_Size) == 0x0003B0, "Member 'AWeather_Mask_Projection_Box_C::Capture_Pixel_Size' has a wrong offset!");
static_assert(offsetof(AWeather_Mask_Projection_Box_C, Exclude_Actors_from_Occlusion) == 0x0003B8, "Member 'AWeather_Mask_Projection_Box_C::Exclude_Actors_from_Occlusion' has a wrong offset!");
static_assert(offsetof(AWeather_Mask_Projection_Box_C, Top_Height) == 0x0003C8, "Member 'AWeather_Mask_Projection_Box_C::Top_Height' has a wrong offset!");
static_assert(offsetof(AWeather_Mask_Projection_Box_C, UseOpcityMask) == 0x0003D0, "Member 'AWeather_Mask_Projection_Box_C::UseOpcityMask' has a wrong offset!");
static_assert(offsetof(AWeather_Mask_Projection_Box_C, OpcityMaskScale) == 0x0003D8, "Member 'AWeather_Mask_Projection_Box_C::OpcityMaskScale' has a wrong offset!");
static_assert(offsetof(AWeather_Mask_Projection_Box_C, Brush_Scale_OpcityMask) == 0x0003F0, "Member 'AWeather_Mask_Projection_Box_C::Brush_Scale_OpcityMask' has a wrong offset!");
static_assert(offsetof(AWeather_Mask_Projection_Box_C, OpcityMaskBrush_Location) == 0x000400, "Member 'AWeather_Mask_Projection_Box_C::OpcityMaskBrush_Location' has a wrong offset!");
static_assert(offsetof(AWeather_Mask_Projection_Box_C, Brush_MID_OpcityMask) == 0x000410, "Member 'AWeather_Mask_Projection_Box_C::Brush_MID_OpcityMask' has a wrong offset!");
static_assert(offsetof(AWeather_Mask_Projection_Box_C, EffectMask) == 0x000418, "Member 'AWeather_Mask_Projection_Box_C::EffectMask' has a wrong offset!");
static_assert(offsetof(AWeather_Mask_Projection_Box_C, OpenDebug) == 0x000419, "Member 'AWeather_Mask_Projection_Box_C::OpenDebug' has a wrong offset!");

}

