#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weather_Mask_Projection_Box

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UDS_DLWE_Mode_structs.hpp"


namespace SDK::Params
{

// Function Weather_Mask_Projection_Box.Weather_Mask_Projection_Box_C.BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0128 (0x0128 - 0x0000)
struct Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0108)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000128, "Wrong size on Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Weather_Mask_Projection_Box.Weather_Mask_Projection_Box_C.BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Weather_Mask_Projection_Box_C_BndEvt__Weather_Mask_Projection_Box_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function Weather_Mask_Projection_Box.Weather_Mask_Projection_Box_C.ConstructionInit
// 0x05A8 (0x05A8 - 0x0000)
struct Weather_Mask_Projection_Box_C_ConstructionInit final
{
public:
	class AUltraDynamicWeatherBase*               CallFunc_GetWeatherActor_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AUltraDynamicWeatherBase*               CallFunc_GetWeatherActor_ReturnValue_1;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetAbsMax2D_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Hypotenuse_ReturnValue;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AUltraDynamicWeatherBase*               CallFunc_GetWeatherActor_ReturnValue_2;            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetBoxBottomHeight_bottomHeight;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue_1;            // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue_1;       // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue_1;  // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x0240(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0280(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue_2;            // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_4;      // 0x02A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_2;                            // 0x02C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_5;      // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_3;                            // 0x0300(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x0310(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0328(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0340(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetRotated2D_ReturnValue;                 // 0x0350(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0370(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0388(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_2;      // 0x03A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x03C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x03D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_3;      // 0x03F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0400(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0418(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0438(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0460(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0480(0x0108)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_589[0x3];                                      // 0x0589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x058C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0590(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0594(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_OrthoWidth_ImplicitCast;        // 0x0598(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x059C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x05A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Weather_Mask_Projection_Box_C_ConstructionInit) == 0x000008, "Wrong alignment on Weather_Mask_Projection_Box_C_ConstructionInit");
static_assert(sizeof(Weather_Mask_Projection_Box_C_ConstructionInit) == 0x0005A8, "Wrong size on Weather_Mask_Projection_Box_C_ConstructionInit");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_GetWeatherActor_ReturnValue) == 0x000000, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_GetWeatherActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_GetWeatherActor_ReturnValue_1) == 0x000008, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_GetWeatherActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_BreakVector2D_X) == 0x000018, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_BreakVector2D_Y) == 0x000020, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_BreakVector2D_X_1) == 0x000028, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_BreakVector2D_Y_1) == 0x000030, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000038, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_GetAbsMax2D_ReturnValue) == 0x000048, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_GetAbsMax2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x000050, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000060, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Hypotenuse_ReturnValue) == 0x000068, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Hypotenuse_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_GetWeatherActor_ReturnValue_2) == 0x000070, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_GetWeatherActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000080, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Not_PreBool_ReturnValue_1) == 0x000088, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, Temp_int_Variable) == 0x00008C, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000090, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_GetBoxBottomHeight_bottomHeight) == 0x000098, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_GetBoxBottomHeight_bottomHeight' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, K2Node_SwitchEnum_CmpSuccess) == 0x0000A0, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_MakeVector_ReturnValue) == 0x0000A8, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_GetActorScale3D_ReturnValue) == 0x0000C0, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000D8, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Add_VectorVector_ReturnValue) == 0x0000F0, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_BreakVector_X) == 0x000108, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_BreakVector_Y) == 0x000110, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_BreakVector_Z) == 0x000118, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000120, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_MakeVector_ReturnValue_1) == 0x000128, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_MakeVector_ReturnValue_2) == 0x000140, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000158, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_GetActorScale3D_ReturnValue_1) == 0x000170, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_GetActorScale3D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000188, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000198, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0001B0, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x0001C8, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x0001E0, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Divide_Vector2DFloat_ReturnValue_1) == 0x0001F8, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Divide_Vector2DFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x000208, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Subtract_Vector2DVector2D_ReturnValue_1) == 0x000220, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Subtract_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000230, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, Temp_struct_Variable) == 0x000240, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_BreakVector_X_1) == 0x000250, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_BreakVector_Y_1) == 0x000258, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_BreakVector_Z_1) == 0x000260, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_MakeVector_ReturnValue_3) == 0x000268, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, Temp_struct_Variable_1) == 0x000280, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_GetActorScale3D_ReturnValue_2) == 0x000290, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_GetActorScale3D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Multiply_VectorVector_ReturnValue_4) == 0x0002A8, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Multiply_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, Temp_struct_Variable_2) == 0x0002C0, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0002D0, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Multiply_VectorVector_ReturnValue_5) == 0x0002E8, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Multiply_VectorVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, Temp_struct_Variable_3) == 0x000300, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x000310, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, Temp_int_Variable_1) == 0x000320, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000324, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, K2Node_Select_Default) == 0x000328, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Not_PreBool_ReturnValue_2) == 0x000338, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000340, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_GetRotated2D_ReturnValue) == 0x000350, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_GetRotated2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x000360, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_SafeDivide_ReturnValue) == 0x000368, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000370, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000388, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Conv_VectorToVector2D_ReturnValue_2) == 0x0003A0, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Conv_VectorToVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_BreakRotator_Roll) == 0x0003B0, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_BreakRotator_Pitch) == 0x0003B4, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_BreakRotator_Yaw) == 0x0003B8, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x0003C0, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Array_Add_ReturnValue) == 0x0003D0, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0003D8, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_Conv_VectorToVector2D_ReturnValue_3) == 0x0003F0, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_Conv_VectorToVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000400, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000418, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_BreakVector_X_2) == 0x000420, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_BreakVector_Y_2) == 0x000428, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_BreakVector_Z_2) == 0x000430, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x000438, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_BreakRotator_Roll_1) == 0x000450, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_BreakRotator_Pitch_1) == 0x000454, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_BreakRotator_Yaw_1) == 0x000458, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_MakeRotator_ReturnValue) == 0x000460, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000478, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000480, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_IsValid_ReturnValue_2) == 0x000588, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x00058C, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000590, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x000594, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, K2Node_VariableSet_OrthoWidth_ImplicitCast) == 0x000598, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::K2Node_VariableSet_OrthoWidth_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x00059C, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_SetScalarParameterValue_Value_ImplicitCast_4) == 0x0005A0, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_SetScalarParameterValue_Value_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ConstructionInit, CallFunc_SetScalarParameterValue_Value_ImplicitCast_5) == 0x0005A4, "Member 'Weather_Mask_Projection_Box_C_ConstructionInit::CallFunc_SetScalarParameterValue_Value_ImplicitCast_5' has a wrong offset!");

// Function Weather_Mask_Projection_Box.Weather_Mask_Projection_Box_C.ExecuteUbergraph_Weather_Mask_Projection_Box
// 0x01D8 (0x01D8 - 0x0000)
struct Weather_Mask_Projection_Box_C_ExecuteUbergraph_Weather_Mask_Projection_Box final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EEndPlayReason>                        K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0040(0x0108)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AUltraDynamicWeatherBase*               CallFunc_GetWeatherActor_ReturnValue;              // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AUltraDynamicWeatherBase*               CallFunc_GetWeatherActor_ReturnValue_1;            // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AUltraDynamicWeatherBase*               CallFunc_GetWeatherActor_ReturnValue_2;            // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AUltraDynamicWeatherBase*               CallFunc_GetWeatherActor_ReturnValue_3;            // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AUltraDynamicWeatherBase*               CallFunc_GetWeatherActor_ReturnValue_4;            // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AUltraDynamicWeatherBase*               CallFunc_GetWeatherActor_ReturnValue_5;            // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AUltraDynamicWeatherBase*               CallFunc_GetWeatherActor_ReturnValue_6;            // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AUltraDynamicWeatherBase*               CallFunc_GetWeatherActor_ReturnValue_7;            // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AUltraDynamicWeatherBase*               CallFunc_GetWeatherActor_ReturnValue_8;            // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Weather_Mask_Projection_Box_C_ExecuteUbergraph_Weather_Mask_Projection_Box) == 0x000008, "Wrong alignment on Weather_Mask_Projection_Box_C_ExecuteUbergraph_Weather_Mask_Projection_Box");
static_assert(sizeof(Weather_Mask_Projection_Box_C_ExecuteUbergraph_Weather_Mask_Projection_Box) == 0x0001D8, "Wrong size on Weather_Mask_Projection_Box_C_ExecuteUbergraph_Weather_Mask_Projection_Box");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ExecuteUbergraph_Weather_Mask_Projection_Box, EntryPoint) == 0x000000, "Member 'Weather_Mask_Projection_Box_C_ExecuteUbergraph_Weather_Mask_Projection_Box::EntryPoint' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ExecuteUbergraph_Weather_Mask_Projection_Box, K2Node_Event_EndPlayReason) == 0x000004, "Member 'Weather_Mask_Projection_Box_C_ExecuteUbergraph_Weather_Mask_Projection_Box::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ExecuteUbergraph_Weather_Mask_Projection_Box, K2Node_MakeArray_Array) == 0x000008, "Member 'Weather_Mask_Projection_Box_C_ExecuteUbergraph_Weather_Mask_Projection_Box::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Weather_Mask_Projection_Box_C_ExecuteUbergraph_Weather_Mask_Projection_Box, CallFunc_Array_Contains_ReturnValue) == 0x000018, "Member 'Weather_Mask_Projection_Box_C_ExecuteUbergraph_Weather_Mask_Projection_Box::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
