#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WwisePackaging

#include "Basic.hpp"

#include "WwisePackagingRuntime_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class WwisePackaging.WwiseAssetLibrary
// 0x0040 (0x0068 - 0x0028)
class UWwiseAssetLibrary final : public UWwiseFilterableAssetLibrary
{
public:
	bool                                          bAutoLoad;                                         // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3F];                                      // 0x0029(0x003F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void LoadData();
	void UnloadData(bool bAsync);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WwiseAssetLibrary">();
	}
	static class UWwiseAssetLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwiseAssetLibrary>();
	}
};
static_assert(alignof(UWwiseAssetLibrary) == 0x000008, "Wrong alignment on UWwiseAssetLibrary");
static_assert(sizeof(UWwiseAssetLibrary) == 0x000068, "Wrong size on UWwiseAssetLibrary");
static_assert(offsetof(UWwiseAssetLibrary, bAutoLoad) == 0x000028, "Member 'UWwiseAssetLibrary::bAutoLoad' has a wrong offset!");

// Class WwisePackaging.WwisePackagingSettings
// 0x0028 (0x0050 - 0x0028)
class UWwisePackagingSettings final : public UObject
{
public:
	bool                                          bPackageAsBulkData;                                // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UWwiseAssetLibrary>> AssetLibraries;                                 // 0x0030(0x0010)(Edit, ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UWwiseAssetLibrary*>             AssetLibrariesKeepAlive;                           // 0x0040(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WwisePackagingSettings">();
	}
	static class UWwisePackagingSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwisePackagingSettings>();
	}
};
static_assert(alignof(UWwisePackagingSettings) == 0x000008, "Wrong alignment on UWwisePackagingSettings");
static_assert(sizeof(UWwisePackagingSettings) == 0x000050, "Wrong size on UWwisePackagingSettings");
static_assert(offsetof(UWwisePackagingSettings, bPackageAsBulkData) == 0x000028, "Member 'UWwisePackagingSettings::bPackageAsBulkData' has a wrong offset!");
static_assert(offsetof(UWwisePackagingSettings, AssetLibraries) == 0x000030, "Member 'UWwisePackagingSettings::AssetLibraries' has a wrong offset!");
static_assert(offsetof(UWwisePackagingSettings, AssetLibrariesKeepAlive) == 0x000040, "Member 'UWwisePackagingSettings::AssetLibrariesKeepAlive' has a wrong offset!");

}

