#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WwisePackagingRuntime

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class WwisePackagingRuntime.WwiseAssetLibraryFilter
// 0x0000 (0x0028 - 0x0028)
class UWwiseAssetLibraryFilter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WwiseAssetLibraryFilter">();
	}
	static class UWwiseAssetLibraryFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwiseAssetLibraryFilter>();
	}
};
static_assert(alignof(UWwiseAssetLibraryFilter) == 0x000008, "Wrong alignment on UWwiseAssetLibraryFilter");
static_assert(sizeof(UWwiseAssetLibraryFilter) == 0x000028, "Wrong size on UWwiseAssetLibraryFilter");

// Class WwisePackagingRuntime.WwiseFilterableAssetLibrary
// 0x0000 (0x0028 - 0x0028)
class UWwiseFilterableAssetLibrary : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WwiseFilterableAssetLibrary">();
	}
	static class UWwiseFilterableAssetLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwiseFilterableAssetLibrary>();
	}
};
static_assert(alignof(UWwiseFilterableAssetLibrary) == 0x000008, "Wrong alignment on UWwiseFilterableAssetLibrary");
static_assert(sizeof(UWwiseFilterableAssetLibrary) == 0x000028, "Wrong size on UWwiseFilterableAssetLibrary");

// Class WwisePackagingRuntime.WwiseSharedAssetLibraryFilter
// 0x0000 (0x0028 - 0x0028)
class UWwiseSharedAssetLibraryFilter final : public UWwiseFilterableAssetLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WwiseSharedAssetLibraryFilter">();
	}
	static class UWwiseSharedAssetLibraryFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwiseSharedAssetLibraryFilter>();
	}
};
static_assert(alignof(UWwiseSharedAssetLibraryFilter) == 0x000008, "Wrong alignment on UWwiseSharedAssetLibraryFilter");
static_assert(sizeof(UWwiseSharedAssetLibraryFilter) == 0x000028, "Wrong size on UWwiseSharedAssetLibraryFilter");

}

