#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WwisePackagingRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum WwisePackagingRuntime.EWwiseAssetLibraryRefType
// NumValues: 0x0006
enum class EWwiseAssetLibraryRefType : uint32
{
	Unknown                                  = 0,
	InitBank                                 = 1,
	SoundBank                                = 2,
	Media                                    = 3,
	ExternalSource                           = 4,
	EWwiseAssetLibraryRefType_MAX            = 5,
};

// ScriptStruct WwisePackagingRuntime.WwiseAssetLibraryRef
// 0x0030 (0x0030 - 0x0000)
struct FWwiseAssetLibraryRef final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EWwiseAssetLibraryRefType                     Type;                                              // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x000C(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ID;                                                // 0x001C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0020(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LanguageId;                                        // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SoundBankId;                                       // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FWwiseAssetLibraryRef) == 0x000004, "Wrong alignment on FWwiseAssetLibraryRef");
static_assert(sizeof(FWwiseAssetLibraryRef) == 0x000030, "Wrong size on FWwiseAssetLibraryRef");
static_assert(offsetof(FWwiseAssetLibraryRef, Type) == 0x000008, "Member 'FWwiseAssetLibraryRef::Type' has a wrong offset!");
static_assert(offsetof(FWwiseAssetLibraryRef, Guid) == 0x00000C, "Member 'FWwiseAssetLibraryRef::Guid' has a wrong offset!");
static_assert(offsetof(FWwiseAssetLibraryRef, ID) == 0x00001C, "Member 'FWwiseAssetLibraryRef::ID' has a wrong offset!");
static_assert(offsetof(FWwiseAssetLibraryRef, Name) == 0x000020, "Member 'FWwiseAssetLibraryRef::Name' has a wrong offset!");
static_assert(offsetof(FWwiseAssetLibraryRef, LanguageId) == 0x000028, "Member 'FWwiseAssetLibraryRef::LanguageId' has a wrong offset!");
static_assert(offsetof(FWwiseAssetLibraryRef, SoundBankId) == 0x00002C, "Member 'FWwiseAssetLibraryRef::SoundBankId' has a wrong offset!");

// ScriptStruct WwisePackagingRuntime.WwiseAssetLibraryInfo
// 0x0008 (0x0008 - 0x0000)
struct FWwiseAssetLibraryInfo final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FWwiseAssetLibraryInfo) == 0x000001, "Wrong alignment on FWwiseAssetLibraryInfo");
static_assert(sizeof(FWwiseAssetLibraryInfo) == 0x000008, "Wrong size on FWwiseAssetLibraryInfo");

}

